{
  "head": {
    "counts": {
      "questionCount": 1056,
      "resultCount": 1056
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The SEAI yesterday published their Energy in Ireland 2025 Report which sets out, in detail, a breakdown of Ireland’s energy usage in 2024. Of particular note, 2024 saw Ireland record our highest renewable energy share on record, with 16.1% of our overall energy consumption being met by renewable sources.  Figures from 2024 show the importance of continuing to develop our onshore and offshore renewable electricity capabilities. 2024 saw renewable electricity meet 41.3% of our electricity demand, up from 40.4% in 2023.  Ireland currently has over 7.7 gigawatts of renewable generation capacity. Onshore wind is the largest contributor to this, with 5 gigawatts of wind generation capacity, and over 2 gigawatts of solar PV installed. Hydro, biomass, and other small sources also contribute.  The Programme for Government 2025 reaffirmed Ireland’s targets of 80% of electricity demand to be met by renewable energy sources in the near term.  Two cross-Government taskforces, the Accelerating Renewable Electricity Taskforce for onshore renewables and the Offshore Wind Delivery Taskforce, continue to coordinate effective policies designed to deliver an accelerated and increased level of renewable generation capacity and related infrastructure, including strengthening the electricity grid and increasing electricity storage.  The inclusion of Regional Renewable Electricity Capacity Allocations in the revised National Planning Framework, earlier this year, will facilitate the accelerated roll-out and delivery of onshore wind and solar development. Alignment of regional strategies and local plans is now critical to maintaining progress in delivering a secure, affordable and renewable electricity supply to homes and businesses across the country. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 109. Deputy James O'Connor asked the Minister for Climate, Energy and the Environment the amount of Ireland’s energy that is now being generated by renewable sources; and if he will make a statement on the matter. [73268/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_144",
          "debateSectionId": "dbsect_144",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_109",
        "questionNumber": 109
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The main income supports to family carers provided by my Department are Carer’s Allowance, Carer’s Benefit, Domiciliary Care Allowance and the Carer’s Support Grant. Spending on these payments is estimated at over €2.2 billion in 2026.  Carer's Benefit is available to people who leave the workforce or reduce their working hours to care for a child or an adult in need of full-time care and attention. It is payable for a period of two years for each care recipient and may be claimed over separate periods up to a total of two years.  A person may qualify for Carer’s Benefit if they meet the PRSI and other conditions of the scheme and have been engaged in full-time employment for at least eight weeks in the previous 26 weeks.  Full-time employment in this context is defined as engaged insurable employment for at least 16 hours per week or 32 hours per fortnight. This condition does not need to be satisfied on a second or subsequent claim where a person was in receipt of Carer's Benefit within the previous 26 weeks.  The legislation governing Carer’s Benefit outlines the circumstances by which a carer on leave from employment may satisfy the conditions of engagement in full-time employment as an employed contributor. Specifically, the condition is deemed to have been satisfied where the person was on adoptive leave, health and safety leave, maternity leave, parental leave, parent’s leave or paternity leave, having been engaged in remunerative full-time employment as an employed contributor for 8 weeks, whether consecutive or not, within the relevant period. The person to whom the Deputy refers in the details provided was on sick leave prior to their application for Carer's Benefit and periods of sick leave are not covered by these provisions.  Where a full-time carer is not eligible for Carer’s Benefit, they may apply for the means-tested Carer’s Allowance. It should be noted that significant improvements have been made to the means test for Carer’s Allowance which will result in more carers qualifying for Carer’s Allowance. I would encourage anyone who is unsure if they meet the criteria to apply for these payments, including the person to whom the Deputy refers.  In July the weekly income disregards for Carer’s Allowance increased from €450 to €625 for a single person, and from €900 to €1,250 for carers with a spouse or partner. As part of Budget 2026 I announced that from next July, the weekly income disregards will be increased from €625 to €1,000 for a single person, and from €1,250 to €2,000 for carers with a spouse, partner or co-habitant.  These improvements mean that, for example, a carer in a two-adult household with an income of approximately €110,000 will still retain their full Carers payment and even with an income of €138,000 will retain a partial payment.  These are the largest ever increases in the Carer’s Allowance income disregard and will mean that even people with what are relatively high incomes will qualify for a carer’s payment for the first time.  In addition, the Carer's Support Grant is available to full-time family carers whether or not they are in receipt of another carer payment from my Department. It is neither means tested nor based on a person's social insurance contribution record. The grant is paid annually in June. It currently stands at €2,000 in respect of each care recipient.  I trust that this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 646. Deputy James O'Connor asked the Minister for Social Protection if he will investigate the criteria applied to applications for carer's benefit (details supplied); and if he will make a statement on the matter. [71817/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_507",
          "debateSectionId": "dbsect_507",
          "showAs": "Care Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_507.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_646",
        "questionNumber": 646
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 23. Deputy James O'Connor asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure plan will accelerate the delivery of critical infrastructure in Cork; and if he will make a statement on the matter. [70368/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_23",
        "questionNumber": 23
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  My priority is to support the delivery of Government objectives on Housing, Climate, and Digital transformation by ensuring that tertiary education and training pathways support Ireland’s skills base to adapt to the profound changes driven by global megatrends.  The Government has invested significantly to grow apprenticeship opportunities for learners across the country, including in new and emerging sectors and occupations.  I’m pleased to say that in the recent Budget the Government secured a major investment of €79 million for apprenticeship delivery. This brings the total current apprenticeship budget to over €410 million, more than double what it was in 2020 when my Department was established.  In 2020, there were 54 national apprenticeship programmes. Today, that number has grown to 78, offering qualifications on the National Framework of Qualifications from Level 5 right up to Level 10.  All new apprenticeships since 2016 are consortia-led. That means they are developed by employer-led groups and regularly reviewed to ensure that programmes respond to changing workforce needs. This approach keeps apprenticeships flexible and adaptable to new occupations. We now have programmes from emerging sectors such as Digital Marketing, Wind Turbine Maintenance, and Advanced Manufacturing Engineering.  Most recently, in October, I launched the Level 8 Accounting Technologist apprenticeship alongside the Taoiseach, the Tánaiste, Minister Lawless, and the Minister for the Economy in Northern Ireland. This is the first apprenticeship developed on an all-island basis, and it was designed specifically to respond to the impact of digitisation on the accounting profession.  Additionally, the Advanced Manufacturing Training Centre of Excellence under Louth Meath Education and Training Board provides training on advanced equipment and processes as well as specific skills programmes in Robotics, Collaborative Robotics, and Advanced Construction Technology. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 207. Deputy James O'Connor asked the Minister for Further and Higher Education, Research, Innovation and Science to provide an update on the expansion of apprenticeship and skills programmes in 2025, particularly in new and emerging sectors such as digital health, green technologies and advanced manufacturing. [67775/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_224",
          "debateSectionId": "dbsect_224",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_224.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_207",
        "questionNumber": 207
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  Impact 2030, Ireland’s national research and innovation strategy, launched in May 2022. With two years remaining in the current EU Research and Innovation Framework programme, Ireland is on track to meet or exceed the €1.5 billion target that was established in Impact 2030.  The first two Talent and Innovation attachés have been appointed under Global Citizens 2030, Ireland’s Talent and Innovation Strategy, and are placed in Irish Consulates in Boston and San Francisco to support connectivity between the US regions and higher education and research organisations in Ireland. It is intended that six attachés will be appointed by 2030.  In relation to developments in access to international research infrastructure, Ireland joined CERN as an Associate Member State on 22 October 2025 and Irish students, researchers and enterprise now have access to CERN opportunities. A National Advisory Committee to support and maximise the opportunities provided by Ireland's Associate Membership is being established. The group will include representatives from industry, education and research and will consider how to strategically maximise engagement with CERN. A National CERN Stakeholder Forum will also be established for businesses, researchers and institutions to keep up to date with the latest developments and to provide insight and feedback on existing supports and potential future measures.  Earlier this year I signed the European Quantum Pact, which represents a significant step forward in Ireland’s commitment to advancing quantum research and innovation. Officers from my Department are engaging in the relevant EU activities.  In support of its developing strategy, Taighde Éireann - Research Ireland is currently developing a new International Strategy, with a multi-faceted action plan involving business development and fostering new collaborative partnerships, the promotion of Ireland and Irish research, and deepening engagement within the European Research Area and with the European Centres of Excellence. In 2025, Research Ireland continued to build on Ireland’s success in securing funding from International and EU research programmes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 230. Deputy James O'Connor asked the Minister for Further and Higher Education, Research, Innovation and Science to outline Ireland's progress in international research collaboration during 2025, including developments on CERN and the EU Quantum Pact.  [67776/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_242",
          "debateSectionId": "dbsect_242",
          "showAs": "Research and Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_230",
        "questionNumber": 230
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 20. Deputy James O'Connor asked the Taoiseach when the Cabinet committee on infrastructure will meet next. [67601/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_20",
        "questionNumber": 20
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  This Government is committed to supporting Small and Medium Enterprises (SMEs) across Ireland, recognising the important role SMEs play in the Irish economy.  Budget 2026 contains tax relief measures amounting to over €1 billion in supports to businesses and entrepreneurs. It is not possible to give an overall estimate for the value of measures and reliefs of benefit to SMEs as these supports are broad based and not SME specific but are available and applicable to the SME sector.  Budget 2026 included:  • A reduction in the VAT rate on food and catering businesses and for hairdressing services from 13.5 percent to 9 percent. 99% of businesses operating in these sectors are SMEs.  • An increase in the rate of the R&D corporation tax credit to 35 percent and in the first-year payment threshold amount from €75,000 to €87,500. This change in threshold will be of particular benefit to companies carrying on smaller R&D projects.  • An increase in the Revised Entrepreneur Relief lifetime limit from €1 million to €1.5 million for disposals made from the 1st of January 2026, supporting entrepreneurs including those in the SME sector.  • A new exemption from the 1% Stamp Duty on acquisitions of shares in Irish registered companies, available for companies with a market capitalisation with a threshold of €1 billion.  My colleague Minster Burke also announced a number of measures on the expenditure side designed to support enterprise.  This Government remains committed to supporting the SME sector. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 12. Deputy James O'Connor asked the Tánaiste and Minister for Finance the estimated value of tax reliefs and changes being provided to SMEs in Budget 2026; and if he will make a statement on the matter. [64517/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_35",
          "debateSectionId": "dbsect_35",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_35.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_12",
        "questionNumber": 12
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Since becoming Minister for Rural and Community Development and the Gaeltacht, I have prioritised investment in community infrastructure and community centres in particular.  As part of Budget 2026, I was delighted to announce increased funding for the programmes that are delivering on this priority. This includes an increase in the annual budget for the Community Centre Investment Fund by €3 million, from €17 million in 2025 to €20 million in 2026.  The Community Centre Investment Fund was introduced in 2022 and to date some €110 million has been allocated for the enhancement and refurbishment of existing community centres and for the construction of new centres where such a need has been identified.  County Cork has been allocated over €10.7 million for 189 projects under the fund.  I was delighted to visit Cork last Saturday where I turned the sod for construction to commence on a new community centre in Rylane. This was allocated over €1.8 million in funding from my department under the 2023 new build measure.  In addition to the centre in Rylane, eleven other new build projects have been approved across the country with total  funding of over €30 million.  I am committed to delivering further iterations of the Community Centre Investment Fund in line with the commitment in the Programme for Government for this to become a permanent rolling fund. I expect the next iteration of the fund to be rolled out next year.  It should be noted that my Department also supports community facilities through a range of other funding streams including the CLÁR programme, LEADER and the Town and Village Renewal Scheme. I would encourage organisations to check my department’s website for information on all of these different funding opportunities. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 8. Deputy James O'Connor asked the Minister for Rural and Community Development and the Gaeltacht the grants and schemes available from his Department to support community centres. [68332/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_53",
          "debateSectionId": "dbsect_53",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_8",
        "questionNumber": 8
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department provides funding for community centres and community infrastructure across a wide range of schemes. The CLÁR programme, the LEADER programme and the Town and Village Renewal Scheme are providing vital funding to community groups across the country, including for upgrades and other enhancements aimed at making these places more accessible to all of the community.  Indeed the CLÁR programme not only supports building upgrades for wheelchair users, it also provides funding for community groups to purchase vehicles that can be used to transport people with mobility issues to vital services and supports.  The Community Centre Investment Fund, in particular, is making our community centres more resilient, sustainable and accessible spaces.  Since 2022, some €110 million has been allocated for the upgrade and refurbishment of over 1600 existing community centres and the construction of 12 new community centres. The introduction of wheelchair-accessible toilets, lifts, ramps, and automatic doors has opened these facilities to more people with disabilities, older adults, parents with young children, and others with mobility challenges.  Accessibility has also been strengthened through wheelchair-accessible fire escapes, door hold-openers, and upgraded toilet facilities.  I am committed to delivering further iterations of this scheme and delivering further accessibility improvements in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. A decision in relation to the timing of further iterations and the measures to be included will be made in the context of the management of ongoing commitments under the fund.  I would encourage organisations to check my department’s website for information on the Community Centre Investment Fund and all of the other community funding opportunities. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 23. Deputy James O'Connor asked the Minister for Rural and Community Development and the Gaeltacht if his Department provides support to community centres to improve the wheelchair accessibility of their premises; and if he will make a statement on the matter. [68331/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_60",
          "debateSectionId": "dbsect_60",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_60.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_23",
        "questionNumber": 23
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The State is currently accommodating almost 33,000 people in nearly 320 International Protection Accommodation Service (IPAS) centres around the country, over 9,500 of whom are children.  The IPAS system is managed as a unified, national system, and as such the Department does not collate reports or analyses of inspections and compliance by county or by a particular area within a county.  All accommodation centres are subject to routine inspections and compliance checks during the lifetime of the contract, either by Department officials, HIQA, or through IPAS-commissioned inspections. These inspections are fully transparent and published online regularly.  Reports of IPAS inspections are available online on gov.ie and numbers of inspections have increased significantly since 2023.  www.gov.ie/en/international-protection-accommodation-services-ipas/publications/ipas-inspection-reports/ .  In 2025 to date, there have been 372 inspections completed by the International Protection Procurement Service (IPPS), covering 341 separate properties.  202 of these inspections have been carried out by IPPS and 170 by an independent inspector. The inspection carried out by the independent inspector have covered 153 separate properties.  Where any centre has areas of partial or non-compliance identified during an inspection,?a bespoke Compliance Plan is agreed and outlined in the inspection report, noting the specific and time-bound measures which will be taken in order to ensure full compliance with the National Standards.  As we respond to changing trends, and work toward a more stable and sustainable accommodation system in this sector, accommodation is being developed and delivered through a range of channels, with a focus on developing more State-owned accommodation.  The Department continues to appraise the portfolio of existing accommodation with a view to consolidation where possible, along with better governance and compliance, and increased frequency of inspections of properties.  In 2025, 22 have been notified of termination by the Department and details of each contractual process are treated as confidential and commercially sensitive.  Reasons for termination can include non-compliance with contractual terms or with regulatory requirements such as building and fire regulations or planning matters.  While commissioning emergency commercial accommodation will continue to be necessary in the short to medium term, it is being contracted on a short-term basis, which enables the State to decommission this capacity with agility as contracts expire or demand fluctuates. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 105. Deputy James O'Connor asked the Minister for Justice, Home Affairs and Migration if his Department has undertaken a review of IPAS accommodation in east Cork; and if he will make a statement on the matter. [68334/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_128",
          "debateSectionId": "dbsect_128",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_128.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_105",
        "questionNumber": 105
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Government is committed to the principle that everyone, wherever they live in Ireland, should feel safe and be safe. Building safe and secure communities across the country by investing in An Garda Síochána is a top priority for this Government. I want every part of the country to be a safe space for people to live and work in.  Anti-social behaviour is a broad term often used to describe a range of actions and behaviours that violate social norms in specific contexts. I am conscious of the very damaging impact on the quality of life it can have in our communities.  The Government is committed to tackling the scourge of anti-social behaviour and crime to build safer streets and stronger communities through a number of ongoing measures, including:  • Getting more Gardaí on our streets through increased recruitment;  • The introduction of Local Community Safety Partnerships around the country, to develop tailored Community Safety Plans for every area;  • Continued expansion of youth justice and youth diversion measures;  • New laws which criminalise the grooming of children into a life of crime;  • The deployment of body-worn cameras, with nationwide roll-out to follow the current pilot project;  • Proposing solutions to public order and anti-social behaviour through the Local Leadership Programme which brings together local stakeholders in a structured manner;  • Over €4 million allocated to 42 projects through the Community Safety Fund, which re-invests the proceeds of crime into local safety projects.  A number of actions are also contained in the Programme for Government to reduce instances of anti-social behaviour. These include a commitment to enact legislation to combat anti-social behaviour through enhanced use of Anti-Social Behaviour Warnings and Anti-Social Behaviour Orders. Work to progress these commitments has commenced.  Local Community Safety Partnerships (LCSP) represent a significant step towards a more collaborative, responsive, and locally driven model of public safety. They will bring together a broad range of relevant stakeholders to address community safety issues in their area which will include residents, local councillors, community representatives business and education representatives, and a range of public services including the HSE, Tusla, An Garda Síochána and the local authority. A core part of their work will be to draft a Community Safety Plan tailored to the community's needs.  The Policing, Security and Community Safety Act 2024, which I commenced on Wednesday 2 April, provides for the establishment of Local Community Safety Partnerships within each local authority area. The regulations for these Safety Partnerships came into operation on Monday 30 June.  36 Partnerships are in the process of being established in local authority areas across the country.  A number of administrative steps need to be undertaken to facilitate the establishment of a Local Community Safety Partnership in a given area, including nomination of proposed members by local authorities and statutory bodies, and the appointment of all members by myself as Minister.  Over 20 Partnerships have had members appointed, with a significant number of LCSPs already holding their first meetings. I expect to approve membership of the remaining Partnerships in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 120. Deputy James O'Connor asked the Minister for Justice, Home Affairs and Migration for an update on his work to tackle anti-social behaviour in communities. [68333/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_144",
          "debateSectionId": "dbsect_144",
          "showAs": "Crime Prevention",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_120",
        "questionNumber": 120
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 13 to 23, inclusive, together.  Regulation, and the extent of any regulatory or administrative burden, has recently become a greater focus at European Union level and nationally as a means to further enhance competitiveness. At a European level, both simplification and implementation are important Commission priorities. The Commission is striving to simplify and lighten the administrative burden of European Union regulations to ensure they are proportionate, stable, coherent and technologically neutral.  Likewise, our national regulatory framework is a central focus for the Government as we strive to support competitiveness at a time of international economic uncertainty. In line with the programme for Government, we published an action plan on competitiveness and productivity on 10 September this year. The action plan includes actions across government to ensure the development of a more effective regulatory system which will support economic growth.  These actions reflect priority areas where targeted public policy intervention can have the greatest impact. These include a red-tape challenge to reduce regulation for SMEs; the application of the SME test by Government Departments to all measures, in particular policy initiatives where it is proposed to increase costs on small businesses; expediting the Environmental (Miscellaneous Provisions) Bill; commencing reforms, as we have done, under the Planning and Development Act 2024 to enhance delivery of infrastructure; and implementing the outstanding recommendations from the review of the administration of civil justice review group report.  Increased regulatory burden has also been identified as a barrier to infrastructure development and delivery. The Minister, Deputy Chambers, supported by the work of the accelerating infrastructure task force, this morning, with Government colleagues including me, the Tánaiste and the Minister of State, Deputy Harkin, published a plan which will include extensive regulatory reforms aimed at accelerating the delivery of critical infrastructure.  Today's plan provides the blueprint to reduce complexity and blockages in the system and deliver infrastructure with urgency. The changes we are initiating today are vital if we are to maintain our competitive position in an ever uncertain world. They are also necessary to support our citizens with top class public services, job security, access to housing and all other facilities necessary to enjoy the stability and good quality of life we are all entitled to expect.  The actions are ambitious but achievable, and delivering them will require commitment and co-operation across a broad and diverse range of stakeholders, from political, legal and public sectors, industry and society as a whole. We have established a cost-of-business advisory forum where business owners and representative bodies can speak directly to decision-makers about the real-world impact of regulations, fees and operational challenges. The work of that forum is under way. The Minister, Deputy McEntee, is working on the simplification omnibus packages put forward by the European Commission in a range of policy areas, most recently the Commission's digital simplification omnibus package, which was published last month.  My Department will play a co-ordinating role across these different regulatory reform initiatives, as outlined in the action plan on competitiveness and productivity, including the establishment of a central economic regulators' forum, and we will work with the Minister for Enterprise, Tourism and Employment and other Government colleagues on that agenda. \n Deputy Tony McCormack  I thank the Taoiseach for his response. I acknowledge the significant work he, the Minister, Deputy Chambers, and their two Departments are doing on infrastructure reform, particularly the steps being taken to modernise planning, reduce delays and ensure major projects move forward. Infrastructure reform is vital, but businesses and especially SMEs are also calling for a more streamlined regulatory environment. These firms consistently cite overlapping rules, slow approvals and heavy administrative demands as major obstacles to growth. Building on the work already happening on infrastructure, will the Taoiseach update the House on what specific measures his Department is pursuing to simplify compliance for SMEs, reduce unnecessary paperwork and make it easier for businesses to operate and expand? How will these reforms help to lower costs for employers and the taxpayer by making the system more efficient overall? \n Deputy Albert Dolan  It is vital that when we speak about regulatory reform, we talk about the administrative operations of existing systems in the function of the State. I will specifically reflect on the Sustainable Energy Authority of Ireland, SEAI, and the roll-out of grants. We are about to have a debate in this Chamber on energy costs. One thing that is vital is that the best way the Government can help to reduce energy costs in homes is to retrofit them for the future so that they simply do not need as much energy. That is the number one way to reduce the cost and it facilitates homes to be more efficient and takes pressure off the grid. The Government needs to do something to accelerate the rate at which homes can be retrofitted by the SEAI. For many constituents in my constituency, it is taking too long to get through the process of approval of the grant to construction. \n Deputy Ruairí Ó Murchú  We all accept there are huge issues with bureaucracy and red tape in planning. We should have seen simplification and streamlining. Conversations about this are occurring across Europe, but we know about the home-grown issues. It is an issue I have brought up previously, even within the planning systems involving State authorities. For example, Louth County Council is involved in the Ardee Education Together National School build and a particular issue has arisen. We do not have enough agility in the system. Multiple requests have gone in stating that there are not enough parking spaces. There are 21 spaces, including three disability spaces. There are only two set-down spaces for minibuses and there is a need for five as there are five autism spectrum disorder, ASD, classes and there is not even room for a full-size 52-seater bus to turn. There are 21 spaces for staff and there is a need for something closer to 40. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruairí Ó Murchú  It is possible to get this work done at this time, but if the works continue as planned, the problem will still need to be fixed but it could take more than €100,000, so we need something to be done. \n Deputy Darren O'Rourke  I raise the regulation of social media companies in the online space, particularly as it relates to children. The criticism that has been levelled at Coimisiún na Meán's online safety code is that an earlier draft had a recommendation that social media companies turn off recommender systems and it has been removed. Recommender systems profile people who are using apps and then drive them down often hateful and dangerous rabbit holes. It is not healthy for them or society. Will this be looked at? \n Deputy Ruth Coppinger  I raise regulatory reform of immigration and particularly family reunification. It is now being made much harder for many essential workers to be unified with their families, in particular migrant healthcare assistants who were brought over here on a visa programme and are working in private nursing homes. Last week on RTÉ radio, the Minister for justice was asked by the presenter whether these people are not entitled to a normal family life. They are caring for our older people and we have to show we care for them. The Minister's reply was that no one is forcing them to come here. That is absolutely heartless, shows zero empathy and is also completely counterproductive because many of them are nurses. They could go to other countries, but they have come to Ireland and are working below their grades or qualifications, giving huge added value to the nursing homes. I urge the Taoiseach to have a heart. We had a briefing here a few years ago, which Deputy Michael Healy-Rae attended because he knew the value of those healthcare assistants in nursing homes. These are essential workers and they will go elsewhere. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruth Coppinger  Please entitle them to have a normal family life. These mothers should not be separated from their kids. \n Deputy Paul Murphy  The programme for Government says the Government will move responsibility for the Multi-Unit Developments, MUD, Acts to the Department of housing from the Department of justice and establish a unit in the Housing Agency to regulate owners' management companies, OMCs, to ensure effective governance. That is important work that needs to happen. The problem is that it is not happening currently, but it has been agreed. Effectively what is holding it up is that, as a result of the Mulcreevy judgment, the primary legislation needs to be changed. At the moment, the MUD Act refers to the Minister for justice and not the Minister for housing. A simple amendment is needed to change the reference to the Minister for housing. Until that happens, all this work of regulatory oversight of OMCs and so on is simply not taking place. There was a meeting of the housing committee to discuss these issues. It invited various officials from the Department of housing and was told they could not come yet because their line Minister is not yet responsible for this. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Paul Murphy  The Housing Agency has not been allocated funding for doing any regulatory work as a result. This needs urgent action. \n Deputy Liam Quaide  There was a health committee session last week on the regulation of counselling and psychotherapy. In standards it has published, CORU has adopted a position that is entirely at odds with the main representative groups of those disciplines, which will reduce supervision requirements and remove mandatory personal therapy for trainees. These changes, if implemented, will degrade professional standards and undermine patient safety. CORU is showing a remarkable level of intransigence on these fundamentals of safe practice. Practitioners and representative bodies have warned that the proposals could also jeopardise recognition and mobility across the EU for counsellors and psychotherapists. We must protect high-quality training, preserve public confidence and ensure regulation strengthens, not weakens, these services.  I am not expressing some fringe opinion. The health committee was unanimous in supporting the counselling and psychotherapy representative groups and the session included some strong and insightful contributions from the Taoiseach's party colleagues, including Senator Costello. Will the Government immediately pause the CORU process, bring representative bodies and practitioners into full consultation and commit to reforms that prioritise client safety and high professional standards? \n Deputy Rose Conway-Walsh  I will talk about the regulation of quarries. The Taoiseach knows the price we have paid in this country and the price that families affected by the defective concrete blocks scandal have paid due to a lack of regulation.  Many of the homeowners I have spoken to in Mayo are not satisfied with the current regulations of quarries and in particular, that geologists are not examining the aggregate within the quarries that are being used to build homes now. I ask the Taoiseach to have a look at this area to see what can be done in that regard. It can be easily fixed by engaging and employing geologists to do the job and to make sure that people have confidence in the materials that are coming out of quarries. \n Deputy Richard Boyd Barrett  The Taxi Regulation Act 2013 clearly gives the Minister the power to impose regulations around the activities of dispatch companies. Today, for the third time in two weeks, taxi drivers in Dublin are protesting. There is a widespread protest against this across the country by taxi drivers over the behaviour of Uber, a multimillion euro company, that is trying to undermine the livelihood of nearly 20,000 taxi drivers by introducing a fixed fare system. This will undermine the regulated fare structure and therefore the livelihoods of taxi drivers and ultimately the industry itself. In the long run, as is clear from Uber's behaviour elsewhere in the world, it will not benefit the customer. Once the company gets hold of a market, fares and charges go up and the livelihoods of taxi drivers get smashed. Will the Taoiseach ask the Minister for Transport to impose such regulations to prevent Uber destroying the industry and livelihoods of taxi drivers around this fixed fare system and enforce the taxi regulation and meter stuff? \n The Taoiseach  Deputy McCormack raised infrastructure reform, particularly for small to medium-sized businesses. Some of the measures we have taken in respect of deferring the alignment of the minimum wage with the national living wage will help to avoid the escalation of costs because the SME sector has borne the brunt of a lot of additional costs over the past five years. There is no doubt the reduction in VAT on hospitality will help a lot of SMEs in the hospitality sector and hairdressing as well. The number of sick days leave is going to be quickly expanded. We have expanded it to three days. The cumulative cost of everything has been fairly excessive. The Small Business Forum is there to try to balance imposition on small business as well as the cost.  The other issue is the sequential approach to planning and regulations as opposed to a concurrent approach whereby instead of waiting for the planning to be done, agencies do the procurement. Instead of waiting for environmental assessments, doing them all in parallel would speed up a lot of activity. In many instances, we are constantly looking at the avoidance of increased cost for SMEs and trying to slow down the increased costs that have come their way. It is interesting the rate of youth employment has crept up in the past six to nine months. I believe that is related to costs on SMEs.  Deputy Dolan is correct that retrofitting is the most effective way to reduce costs. Between 2019 and September 2025, the Government provided over €1.5 billion in support to homeowners for over 228,000 upgrades, including 30,000 fully funded retrofits under the warmer homes scheme. It is estimated that if a deep retrofit is done, it can save a household up to €1,100 per year in energy costs. I get the Deputy's point that the administration of it needs to be faster. There is also resource demand in respect of it as well with some people not being able to afford to do retrofits because of the cost.  On Deputy Ó Murchú's issue, I do not have the specifics on Ardee Educate Together National School. I do not know what the interaction with the county council is, but in any event----- \n Deputy Ruairí Ó Murchú  The refusal to change----- \n The Taoiseach  They should sort it out. A school is an important facility. The county council should be facilitative in the building of a school. \n Deputy Ruairí Ó Murchú  It is not just the council. \n The Taoiseach  Deputy O'Rourke raised regulation online. We have now established the regulatory framework governing online. There is ongoing review in respect of it. Children must be protected. That has to be the optimal.  Deputy Coppinger raised healthcare assistants and family reunification. We have significant reunification in Ireland under our migration system, in particular when people leave direct provision who have residency. The Minister will bring forward legislation in respect of this and these are issues we can discuss in greater detail at that stage.  On Deputy Murphy's point, I will talk to the Ministers responsible. There has to be proper regulation of management companies. There are fundamental rights involved in terms of those complexes. I will pursue that with the Minister and see where we are in terms of amendment to primary legislation.  Deputy Quaide raised the issue of counselling and psychotherapy. On qualification frameworks and regulators generally, we want more therapists, but they have to be highly qualified. Public health is number one and the protection of the consumer. In some instances, they can be quite protectionist as well. The judgment called for regulators and I would like CORU to get the judgment right in terms of not having the bar so high that there are only highly qualified, and others are not. That is not just in terms of therapy and counselling; that is in terms of teaching and a range of other issues.  Deputy Conway-Walsh raised the regulation of quarries. I will talk to the Minister involved in that. We can overregulate too but I take the Deputy's point about the quality of aggregate and quality of the product. There are existing systems to deal with that. The SEAI is there. There are various regulatory bodies to deal with the quality of materials, but I will talk to the Minister in respect of that. New bodies were set up after the defective blocks scheme.  Deputy Boyd Barrett raised taxi regulation. I will talk to the Minister about the issues that the Deputy raised. There is a balance between consumers, those availing of taxis and the regulation of same. We had regulation a long time ago; it did not work. There was always an imbalance between supply and demand. I will look at this and will talk to the Minister for Transport in respect of it. He is fully aware of it. \n An Ceann Comhairle  We have a delegation of students visiting from Ukraine as our part of our EPAS programme hosted by Maynooth Post Primary School. They are most welcome. We had their president here yesterday, which we enjoyed immensely. ",
        "questionType": "oral",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 19. Deputy James O'Connor asked the Taoiseach his Department's plans to co-ordinate a range of actions aimed at regulatory reform. [65261/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Regulatory Reform",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_19",
        "questionNumber": 19
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Conna Castle is a significant heritage site under the ownership and management of the Office of Public Works. It is a five-storey 16th-century tower house located in East Cork, which has seen ongoing conservation investment by the OPW over a number of years.  I am pleased to confirm that the Office of Public Works is currently making arrangements to have a key held locally that can be made available for visitors. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 183. Deputy James O'Connor asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation when a facility in County Cork (details supplied) will be reopened to the public; and if he will make a statement on the matter. [67587/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the management of the public healthcare estate, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 568. Deputy James O'Connor asked the Minister for Health the reasons a facility (details supplied) has not reopened; if there are any building issues; when the facility will be allowed to reopen; and if she will make a statement on the matter. [67613/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_505",
          "debateSectionId": "dbsect_505",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_505.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_568",
        "questionNumber": 568
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 57 and 61 together.  I propose to take the questions put by Deputies McCormack and O'Connor on the Government Trade Forum together.  Since its establishment in February, the Forum has become an important strategic vehicle for engagement with key stakeholders on trade issues, including across Government, business organisations, trade unions and other representative groups.  Discussions at the trade forum have helped shape the national, multifaceted response to the trade challenges facing the country and the business sector.  The Government Trade Forum has also focused on the opportunities to further build on Ireland’s strong trade performance, considering the entirety of Ireland’s trading relationships, including for example opportunities arising from EU trade agreements, and consideration of how best to advance Ireland’s economic interests with our largest bilateral trading partners.  The Forum has met on nine occasions and has already shown its value, playing an important role in the Government’s response to emerging trade developments and opportunities. It has also enabled dialogue and information-exchange, through engaging with businesses from strategically important sectors of the economy, including pharmaceuticals, med-tech, semiconductors, aviation, agrifood and international financial services. The minutes of each Forum meeting are published and available online on ireland.ie.  In addition to addressing ongoing trade issues, the Forum takes a longer term-strategic view on trade issues. The Forum’s work programme is guided by a Work Plan for 2025, which is also available at ireland.ie. My Department is currently preparing a Work Plan for 2026 for consideration by the Forum members. A key focus for next year will be monitoring implementation of the Action Plan on Market Diversification, published by Government in August, which includes a range of actions by Government Departments and State agencies, with the objective of supporting businesses in their market diversification ambitions. I would propose that we will also continue with the high-level sectoral engagements.  I very much look forward to taking on the role as Chair in my capacity as Minister with responsibility for trade policy and I plan to convene a meeting of the Forum in the coming weeks and confirm dates for a series of further meetings for 2026. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_84.xml"
            }
          },
          "debateSectionId": "dbsect_84",
          "showAs": "Official Engagements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_84"
        },
        "questionNumber": 61,
        "date": "2025-11-27",
        "showAs": " 61. Deputy James O'Connor asked the Minister for Foreign Affairs and Trade if she will report on the work of the Government trade forum; and if she will make a statement on the matter. [66429/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_61"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 15 and 81 together.  Since the shift in US trade policy earlier this year, the global trading environment has fundamentally changed. As a small open economy, we are particularly vulnerable to these external developments.  That is why since earlier this year, in his previous role as Minister for Foreign Affairs and Trade, the Tánaiste engaged intensively on an ongoing basis with Commissioner Maroš Šefèovic, with whom he had an excellent working relationship. As we navigated the fast-paced developments of recent months, at every opportunity the Tánaiste advocated to Commissioner Šefèovic for Irish interests and sensitivities. He also consistently made the case for a negotiation approach with the US that was calm and measured.  In my new role I will continue with this approach. I will do everything I can to impress upon the Commissioner how vital international trade is to the Irish economy and continue to highlight to him the importance of sectors such as pharma and medtech, not just for Ireland, but for Europe as a whole.  I will also engage actively with my fellow EU trade ministers both bilaterally and through my attendance at the Foreign Affairs Council on Trade, or FAC (Trade).  Indeed, just last Monday I met with Commissioner Šefcovic and my European trade minister counterparts at the FAC (Trade) in Brussels. We discussed the key trade issues of the day, including continuing to work towards concluding trade deals with new partners such as India; the challenges in respect of EU-China relations; and the ongoing implementation of the EU-US Joint Statement.  Following the meeting there was a working lunch which was also attended by US Commerce Secretary Howard Lutnick and US Trade Representative Ambassador Jamieson Greer. I used the opportunity to highlight the need for the EU and the US to work together towards a new transatlantic trade and investment relationship based on mutual respect, shared values and common goals. I also highlighted the priority the Government attaches to extending exemptions under the EU-US Joint Statement to additional areas including spirits and med tech. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_49.xml"
            }
          },
          "debateSectionId": "dbsect_49",
          "showAs": "Official Engagements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_49"
        },
        "questionNumber": 81,
        "date": "2025-11-27",
        "showAs": " 81. Deputy James O'Connor asked the Minister for Foreign Affairs and Trade the engagement she is planning with fellow trade ministers internationally; and if she will make a statement on the matter. [66428/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_81"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 112, 117, 133 and 144 together.  Since early November, there have been four outbreaks of highly pathogenic avian influenza (HPAI) caused by the H5N1 virus in turkey flocks in counties Carlow, Meath, Monaghan, and Laois.  My Department has been implementing disease control and eradication measures in line with the EU Animal Health Law provisions and national legislation. This includes the placing of 3km radius protection zones and 10km radius surveillance zones around each holding where an outbreak has occurred, and implementing surveillance and disease control measures within these zones.  Prior to this, an outbreak of HPAI occurred in a confined establishment in Cork in October, following which that establishment was closed while disease control measures were implemented in line with the legislation.  The H5N1 virus has been circulating in wild birds throughout the country during 2025, creating a serious and ongoing risk of infection to poultry and captive bird flocks.  I introduced mandatory biosecurity measures on 1st November and a housing order on 10th November for all poultry and captive bird owners, with similar measures being undertaken in Northern Ireland. My Department also meets regularly with poultry stakeholders to keep them appraised of this developing situation, with the most recent meeting taking place on 20th November.  The Animal Health and Welfare Act (2013) provides that compensation to owners of animals may be payable if a cull of those animals is directed by my Department in the event of a HPAI outbreak.  The compensation may relate to the animal that is culled, or to an animal product, animal feed or similar item that is destroyed in relation to the outbreak. The compensation may not exceed the open market value of the animal or item. Compensation is payable only to the owner of the animals or items affected.  Strong biosecurity remains our most effective tool for preventing the spread of this disease. All poultry and captive bird keepers should remain vigilant of any signs of the disease and to report any suspicion to their local Regional Veterinary Office without delay.  My Department issues regular updates on the avian influenza situation in Ireland and publishes guidance on the Government Website at www.gov.ie/birdflu ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_111.xml"
            }
          },
          "debateSectionId": "dbsect_111",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_111"
        },
        "questionNumber": 117,
        "date": "2025-11-27",
        "showAs": " 117. Deputy James O'Connor asked the Minister for Agriculture, Food and the Marine the current status of the bird flu crisis across the island; and if he will make a statement on the matter. [66743/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_117"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 124, 132, 156, 160 and 177 together.  At the EU Nitrates Committee meeting last December, my Department advised that in accordance with the Nitrates Directive, Ireland is seeking permission to continue applying in excess of 170 kg of livestock manure Nitrogen per hectare from 2026 subject to a set of conditions that will ensure that application is scientifically justified and will continue to contribute to the achievement of the Nitrates Directive’s objectives.  Since last December Ireland has made a number of presentations to the EU Nitrates Committee and there has been very significant engagement at a European level.  The Environmental Protection Agency or EPA presented on Irish water quality at the Nitrates Committee meeting in March.  In June my Department presented on Irish agriculture in a European context, the justification for our derogation, and the changes introduced during Ireland’s current Nitrates Action Programme or NAP.  At the September meeting of the Committee my Department, along with the Department of Housing, Local Government and Heritage, presented on the background to Ireland’s next NAP and our derogation request, as well as proposed measures that are now under public consultation regarding the next NAP.  All these presentations were well received by the Committee.  In June, the Commission wrote to Ireland regarding the need to demonstrate compliance with the Habitats Directive in addition to the need to meet the objectives set under the Water Framework Directive. This change has significant implications. The Government has engaged significantly with the Commission and stakeholders in response.  As part of this, I recently welcomed Commissioner Roswall to Ireland where she witnessed our unique grass-based system and the on-going work across the agrifood sector to reduce its impact on water quality. The visit included a very positive visit to a derogation farm in Kildare. The Commissioner also met farm organisations, eNGO’s, Oireachtas members, MEP’s and officials.  Engagement is on-going with the intention of securing the necessary qualified majority vote on Ireland’s derogation at the Nitrates Committee.  A qualified majority vote requires at least 15 Member States, representing at least 65% of the EU population to support a proposal brought forward by the Commission.  The priority for this government is both to retain the nitrates derogation and to improve water quality. I remain confident regarding achievement of these twin objectives. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_123.xml"
            }
          },
          "debateSectionId": "dbsect_123",
          "showAs": "Nitrates Usage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_123"
        },
        "questionNumber": 124,
        "date": "2025-11-27",
        "showAs": " 124. Deputy James O'Connor asked the Minister for Agriculture, Food and the Marine his views on the Derogation with the EU; his views on whether it will stay at current levels; and if he will make a statement on the matter. [66744/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_124"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 10. Deputy James O'Connor asked the Minister for Housing, Local Government and Heritage to outline his plans to draw up planning guidelines for solar farms for local authorities; to outline the discussions his Department has held with other Departments; if his Department have considered the EU's RED III directive within its plans; and if he will make a statement on the matter.  [65840/25] ",
        "debateSection": {
          "showAs": "Renewable Energy Generation",
          "debateSectionId": "dbsect_38",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_38",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_38.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 10,
        "answerText": " Deputy James O'Connor  This is an important question. On behalf of the people of Cork East, I want to ask about the position regarding the publication of solar guidelines. There has been an explosion in the number of solar projects across Cork East as a constituency, as well as in Deputy O'Sullivan's constituency of Cork North-Central and other parts of the country where developments have occurred, often at very large scale from 500 to 600 acres up to 2,000 acres. Could the Minister please give my constituents some clarity on this urgent matter? \n Deputy James Browne  I propose to take Questions Nos. 10, 92 and 120 together.  I thank Deputy O'Connor for this important question on planning guidelines for solar farms for local authorities. The section of the programme for Government on securing Ireland's future reaffirms Ireland's ambitious targets of 8 GW of solar capacity connected to the grid by 2030, to assist with meeting the requirement of 80% of electricity demand supplied by renewables. Solar energy is a growing source of electricity, with approximately 2.1 GW of solar power capacity currently installed in Ireland. However, further solar capacity is required for Ireland to meet its domestic and international targets. For this reason, my Department is preparing a new national planning statement on solar energy under the new Planning and Development Act 2024. My Department has begun an initial scoping process to identify the component factors relevant to the preparation of the national planning statement for solar energy development, including any appropriate environmental assessment and public consultation requirements and other relevant European obligations such as the renewable energy directive, RED III, which will determine the timeframe for publication of said guidelines.  The scoping process remains at an early stage, but I am satisfied that the existing and evolving planning system, supported by Government policy more generally, provides a sufficiently robust policy and legislative framework to facilitate the roll-out of solar energy development in a sustainable manner and to assist with meeting our renewable electricity requirements while balancing the perspectives of local communities and their needs and allowing for public and stakeholder engagement. In the interim, there are currently no specific planning guidelines in place in respect of solar energy development. Proposals for individual solar energy developments are subject to the statutory requirements of the Planning and Development Act 2000, as amended, and the Planning and Development Act 2024, as amended, in the same manner as other proposed developments, with planning applications made to the relevant local planning authority or An Coimisiún Pleanála on appeal. \n Deputy James O'Connor  I thank the Minister. I acknowledge that he has provided a response. As a TD, I have no issue with the need for renewable energy and the decarbonisation of our economy but when it comes in the form of using thousands of acres of land in highly commercial agricultural areas - the Cork East constituency has some of the best land in the country - that represents one issue, and the second issue is the scale of these developments. Other countries have pursued very smart strategies such as using the top of commercial and school premises and factories or non-agricultural lands to pursue these developments, but Ireland has a mismatch in terms of policy.  Development is happening in areas where, ultimately, it is not the best use of that land or ground. Does the Minister see the point I am raising? In the east Cork area and other parts of the country, as other Deputies have raised, this is not happening in a prudent or productive way for the agricultural economy and n terms of the impact it is having on residents, given the size and scale of these developments. As I said, they potentially are upwards of 1,000 acres and in one case I am aware of, up to a maximum of 2,000 acres, which is larger than the Phoenix Park. \n Deputy James Browne  I certainly hear the Deputy's concerns. Any proposals forthcoming from the Government will be subject to public consultation and consultation with stakeholders, very much including the agricultural community and rural villages. However, in the absence of national planning statements, it falls back to the first principles of planning law, including the relevant Acts, but also the county development plans as set out by the 31 local authorities. At a local level, the city or county development plan sets out where solar energy development is accessible. The making of the city or county development plan is a reserved function of the local authority members. In terms of the setting out of the county development plan by Cork County Council, it is in the council's remit to assess, decide and set out where solar energy can go. Councillors being able to make that decision, effective at the closest point to local people, is an important power. \n Deputy Pádraig O'Sullivan  On the Minister's last point, we have approached Cork County Council collectively at a local level and it is saying that without national guidelines, it will not amend its development plan in terms of governing regulations around the erection of solar farms. There is a bit of a chicken-and-egg situation here. The council is saying it will not implement anything about solar development in its development plan. The Minister is saying this evening that it is up to the council to incorporate that into its development plan. The council has already told us locally it is not open to amending it without direction nationally.  I support the point made by Deputy O'Connor. On some of the land he is talking about, with which I share a border, somebody could build a solar farm 100, 200 or 300 acres in size but would struggle to get planning permission for a one-off house or agricultural shed. It is that stark in terms of the development that can and cannot happen there. At this stage, we need to be genuine with people. In the absence of regulation and guidelines, we must stop fooling people. I welcome that there will a scoping exercise but it sounds like it will take an awfully long time. We need to implement guidelines urgently. \n Deputy James O'Connor  It will take more to deter us than a few cheap shots in op-eds in the Irish Examiner criticising me and others for having the courage to come in here and raise these matters. Deputy O'Sullivan is right that we need the guidelines. Local authorities need those guidelines and they need leadership from the Government. A message must go back to the custodians of the status quo who have let this matter carry on for so long, despite its being raised at parliamentary party level and ministerial level before the general election and again now, that we need answers. It seems to me we have been left in the lurch, unable to give constituents answers because we do not have those guidelines. There is a game of pass the parcel between the Department and local government when both need to come together to understand that the scale of development happening in areas such as my own in the Cork East constituency, and the rapid nature of those developments, requires urgent attention for reasons ranging from flooding to the large-scale size of the developments. As Deputy O'Sullivan rightly said, if someone wants to build a house on those lands, the planning process is far more tedious than it is when seeking to swallow up hundreds of acres for the development of these facilities. \n Deputy James Browne  On the question of smaller extensions, etc., we are working on a very extensive suite of planning exemptions. I very much recognise that people should have more power to deliver and work on their own local property without having to seek planning permission. That is why we are introducing those exemptions. It is very much not a case of passing the parcel. The reality is that county development plans are decided at a local level. We must be very careful how we proceed in terms of any national planning statement. It cannot be one size fits all. Local authorities and local councillors know what is best for their local areas.  I very much believe in local government, which is why I set up the local government task force to give more power back to local councillors. Any national planning statement, when it is announced, cannot and will not take a one-size-fits-all approach. What is good for Cork East would be very different from what is good for north Wicklow and different again from what works for Donegal. No matter what the planning statement says, there will always be a significant amount of power left to the local authority to decide what to do with the land. There is no reason for any local authority to be waiting for a national planning statement. The law, as it is, says it is up to local authorities to decide what to do with their land in their own county areas under their own county development plans. That is their local power. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_10",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 120. Deputy James O'Connor asked the Minister for Housing, Local Government and Heritage if his Department has considered drawing up planning guidelines for solar farms; if he will outline the stages in this process; and if he will make a statement on the matter.  [65841/25] ",
        "debateSection": {
          "showAs": "Renewable Energy Generation",
          "debateSectionId": "dbsect_38",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_38",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_38.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 120,
        "answerText": " Deputy James O'Connor  This is an important question. On behalf of the people of Cork East, I want to ask about the position regarding the publication of solar guidelines. There has been an explosion in the number of solar projects across Cork East as a constituency, as well as in Deputy O'Sullivan's constituency of Cork North-Central and other parts of the country where developments have occurred, often at very large scale from 500 to 600 acres up to 2,000 acres. Could the Minister please give my constituents some clarity on this urgent matter? \n Deputy James Browne  I propose to take Questions Nos. 10, 92 and 120 together.  I thank Deputy O'Connor for this important question on planning guidelines for solar farms for local authorities. The section of the programme for Government on securing Ireland's future reaffirms Ireland's ambitious targets of 8 GW of solar capacity connected to the grid by 2030, to assist with meeting the requirement of 80% of electricity demand supplied by renewables. Solar energy is a growing source of electricity, with approximately 2.1 GW of solar power capacity currently installed in Ireland. However, further solar capacity is required for Ireland to meet its domestic and international targets. For this reason, my Department is preparing a new national planning statement on solar energy under the new Planning and Development Act 2024. My Department has begun an initial scoping process to identify the component factors relevant to the preparation of the national planning statement for solar energy development, including any appropriate environmental assessment and public consultation requirements and other relevant European obligations such as the renewable energy directive, RED III, which will determine the timeframe for publication of said guidelines.  The scoping process remains at an early stage, but I am satisfied that the existing and evolving planning system, supported by Government policy more generally, provides a sufficiently robust policy and legislative framework to facilitate the roll-out of solar energy development in a sustainable manner and to assist with meeting our renewable electricity requirements while balancing the perspectives of local communities and their needs and allowing for public and stakeholder engagement. In the interim, there are currently no specific planning guidelines in place in respect of solar energy development. Proposals for individual solar energy developments are subject to the statutory requirements of the Planning and Development Act 2000, as amended, and the Planning and Development Act 2024, as amended, in the same manner as other proposed developments, with planning applications made to the relevant local planning authority or An Coimisiún Pleanála on appeal. \n Deputy James O'Connor  I thank the Minister. I acknowledge that he has provided a response. As a TD, I have no issue with the need for renewable energy and the decarbonisation of our economy but when it comes in the form of using thousands of acres of land in highly commercial agricultural areas - the Cork East constituency has some of the best land in the country - that represents one issue, and the second issue is the scale of these developments. Other countries have pursued very smart strategies such as using the top of commercial and school premises and factories or non-agricultural lands to pursue these developments, but Ireland has a mismatch in terms of policy.  Development is happening in areas where, ultimately, it is not the best use of that land or ground. Does the Minister see the point I am raising? In the east Cork area and other parts of the country, as other Deputies have raised, this is not happening in a prudent or productive way for the agricultural economy and n terms of the impact it is having on residents, given the size and scale of these developments. As I said, they potentially are upwards of 1,000 acres and in one case I am aware of, up to a maximum of 2,000 acres, which is larger than the Phoenix Park. \n Deputy James Browne  I certainly hear the Deputy's concerns. Any proposals forthcoming from the Government will be subject to public consultation and consultation with stakeholders, very much including the agricultural community and rural villages. However, in the absence of national planning statements, it falls back to the first principles of planning law, including the relevant Acts, but also the county development plans as set out by the 31 local authorities. At a local level, the city or county development plan sets out where solar energy development is accessible. The making of the city or county development plan is a reserved function of the local authority members. In terms of the setting out of the county development plan by Cork County Council, it is in the council's remit to assess, decide and set out where solar energy can go. Councillors being able to make that decision, effective at the closest point to local people, is an important power. \n Deputy Pádraig O'Sullivan  On the Minister's last point, we have approached Cork County Council collectively at a local level and it is saying that without national guidelines, it will not amend its development plan in terms of governing regulations around the erection of solar farms. There is a bit of a chicken-and-egg situation here. The council is saying it will not implement anything about solar development in its development plan. The Minister is saying this evening that it is up to the council to incorporate that into its development plan. The council has already told us locally it is not open to amending it without direction nationally.  I support the point made by Deputy O'Connor. On some of the land he is talking about, with which I share a border, somebody could build a solar farm 100, 200 or 300 acres in size but would struggle to get planning permission for a one-off house or agricultural shed. It is that stark in terms of the development that can and cannot happen there. At this stage, we need to be genuine with people. In the absence of regulation and guidelines, we must stop fooling people. I welcome that there will a scoping exercise but it sounds like it will take an awfully long time. We need to implement guidelines urgently. \n Deputy James O'Connor  It will take more to deter us than a few cheap shots in op-eds in the Irish Examiner criticising me and others for having the courage to come in here and raise these matters. Deputy O'Sullivan is right that we need the guidelines. Local authorities need those guidelines and they need leadership from the Government. A message must go back to the custodians of the status quo who have let this matter carry on for so long, despite its being raised at parliamentary party level and ministerial level before the general election and again now, that we need answers. It seems to me we have been left in the lurch, unable to give constituents answers because we do not have those guidelines. There is a game of pass the parcel between the Department and local government when both need to come together to understand that the scale of development happening in areas such as my own in the Cork East constituency, and the rapid nature of those developments, requires urgent attention for reasons ranging from flooding to the large-scale size of the developments. As Deputy O'Sullivan rightly said, if someone wants to build a house on those lands, the planning process is far more tedious than it is when seeking to swallow up hundreds of acres for the development of these facilities. \n Deputy James Browne  On the question of smaller extensions, etc., we are working on a very extensive suite of planning exemptions. I very much recognise that people should have more power to deliver and work on their own local property without having to seek planning permission. That is why we are introducing those exemptions. It is very much not a case of passing the parcel. The reality is that county development plans are decided at a local level. We must be very careful how we proceed in terms of any national planning statement. It cannot be one size fits all. Local authorities and local councillors know what is best for their local areas.  I very much believe in local government, which is why I set up the local government task force to give more power back to local councillors. Any national planning statement, when it is announced, cannot and will not take a one-size-fits-all approach. What is good for Cork East would be very different from what is good for north Wicklow and different again from what works for Donegal. No matter what the planning statement says, there will always be a significant amount of power left to the local authority to decide what to do with the land. There is no reason for any local authority to be waiting for a national planning statement. The law, as it is, says it is up to local authorities to decide what to do with their land in their own county areas under their own county development plans. That is their local power. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_120",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 360. Deputy James O'Connor asked the Minister for Education and Youth for an update on school transport for a student with special educational needs (details supplied); and if she will make a statement on the matter. [65304/25] ",
        "debateSection": {
          "showAs": "School Transport",
          "debateSectionId": "dbsect_355",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_355",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_355.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 360,
        "answerText": " Minister of State at the Department of Education and Youth  Bus Éireann is responsible for the planning and timetabling of school transport routes on behalf of my Department, including routes under the scheme for pupils with Special Educational Needs.  I am pleased to advise that the Department has given sanction to Bus Éireann to establish a new service to cater for the pupil referred to by the Deputy. Bus Éireann will now tender the service in line with procurement guidelines. The local office will contact the parent of the child in question directly when the service is ready to commence. The parent can avail of an interim special transport grant while they are waiting for the service, the parent has been provided with information relating to the grant. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_360",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 546. Deputy James O'Connor asked the Minister for Housing, Local Government and Heritage if his Department has considered guidelines for industrial-type solar farms; to outline the planning legislation for solar farms; if his Department has discussed the same guidelines with the Department for Agriculture, Food and the Marine in relation to the EU Land Use Policy; and if he will make a statement on the matter. [60442/25] ",
        "debateSection": {
          "showAs": "Solar Energy Guidelines",
          "debateSectionId": "dbsect_460",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_460",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_460.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 546,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 496 and 546 together.  The Programme for Government 2025 – Securing Ireland’s Future reaffirms Ireland’s ambitious targets of 8 GW of solar capacity connected to the grid by 2030, to assist with meeting the requirement of 80% of electricity demand supplied by renewables. Solar energy is a growing source of electricity with circa 2.1 GW of solar power capacity currently installed in Ireland, however further solar capacity is required for Ireland to meet its domestic and international targets.  For this reason, my Department will prepare a new National Planning Statement on Solar Energy under the new Planning and Development Act 2024. My Department has begun an initial scoping process to identify the component factors relevant to the preparation of the National Planning Statement for solar energy development, including any appropriate environmental assessment and public consultation requirements and other relevant European obligations such as the Renewable Energy Directive (RED III), which will determine the timeframe for publication of said guidelines.  This scoping process remains at an early stage but I am satisfied that the existing and evolving planning system, supported by Government policy more generally, provides a sufficiently robust policy and legislative framework to facilitate the rollout of solar energy development in a sustainable manner and to assist with meeting our renewable electricity requirements while balancing the perspectives of local communities and allowing for public and stakeholder engagement.  In the interim, there are currently no specific planning guidelines in place in respect of solar energy development. Proposals for individual solar energy developments are subject to the statutory requirements of the Planning and Development Act 2000, as amended, and the Planning and Development Act 2024, as amended, in the same manner as other proposed developments, with planning applications made to the relevant local planning authority, or An Coimisiún Pleanála on appeal.  The Programme for Government also committed to a Land Use Review to ensure that optimal land use options inform all relevant Government decisions. The second phase of the Land Use Review, which is currently underway, will seek to identify the key demands on land (both public and private) to inform policies for land use across key government objectives, improving socioeconomic, climate, biodiversity, water, and air quality outcomes. The Department of Climate, Energy and the Environment and the Department of Agriculture, Food and the Marine are working towards the conclusion of the second stage of the review. Any National Planning Statement on solar energy development will take into careful consideration any finding of the Land Use Review. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_546",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 709. Deputy James O'Connor asked the Minister for Agriculture, Food and the Marine if there is a delay in the payment of compensation to farmers who have reactors; if so, for the length of time; when payment will be made, if this has been communicated to farmers; and if he will make a statement on the matter. [65460/25] ",
        "debateSection": {
          "showAs": "Agriculture Supports",
          "debateSectionId": "dbsect_632",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_632",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_632.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 709,
        "answerText": " Minister for Agriculture, Food and the Marine  The continued increase in bTB disease levels in recent years has resulted in significant additional work in the administration of the bTB programme for the Department. There has recently been an increase in the volume of bTB compensation payments that resulted in a temporary backlog in payments. This backlog has now been cleared and outstanding compensation payments are issuing to Herdowners this week.  We need to decrease bTB disease levels to ensure that the impact this disease has on farm families both financially and emotionally is lessened.  On 9th September I published the “Bovine TB Action Plan, Addressing Bovine TB in Ireland”  There are 5 measures in the Plan which are underpinned by 30 actions:  • Support herds free of bTB to remain free  • Reduce the impact of wildlife on the spread of bTB  • Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  • Help farmers improve all areas of on-farm biosecurity  • Reduce the impact of known high-risk animals in spreading bTB  The foundation of these measures has been scientific research, evidence and veterinary expertise.  These measures must be layered into the new bTB programme to tackle the current high disease levels and address the three main causes of bTB outbreak which are cattle to cattle transmission, residual infection in the herd and transmission from wildlife.”  By addressing bTB disease levels in Ireland through the implementation of the actions in this plan we will be able to tackle this disease in a meaningful manner and better protect farm families in Ireland from this disease. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_709",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 710. Deputy James O'Connor asked the Minister for Agriculture, Food and the Marine the number of farmers who have submitted applications for TB reactor compensation; the number that are still under consideration; those refused; those accepted, the time frame of those waiting for payment 0- 3 weeks, 3-6 weeks, 6-9 weeks, 9-12 weeks, 12 + weeks, by county, in tabular form; and if he will make a statement on the matter. [65461/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_633",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_633",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_633.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 710,
        "answerText": " Minister for Agriculture, Food and the Marine  Ireland’s TB Eradication Programme has a comprehensive compensation regime in place for herd-owners who are affected by bovine TB.  The On Farm Market Valuation Scheme (OFMV) is the principal compensation measure available to Herd-owners whose herds are affected by a bovine TB breakdown in their herd. The Scheme aims to compensate farmers up to the open market value of an animal as if they were not affected by disease, subject to ceilings.  The Income Supplement Scheme is a targeted scheme which assists farmers who lose 9.5% or more of their herd to disease due to a single TB breakdown. Income supplement is only payable in cases where the 9.5% threshold is met in one continuous restriction period and where Depopulation is not deemed an appropriate measure.  The Hardship Grant is a targeted scheme aimed at assisting eligible herd-owners who retain and feed animals during prolonged periods of restriction as a result of a TB breakdown. The scheme runs each year for herds restricted between November 1st and April 30th.  Depopulation Grant is paid for each animal removed in the depopulation measure and for those herds that are partial or fully depopulated on foot of a veterinary decision made on analysis of the overall TB disease situation within a herd.  All OFMV payments are based on reactors disclosed. If a herdowner has reactors, they are paid for those reactors subject to compliance with the terms and conditions for payment as provided in my Department's TB Compensation Arrangements, Information Booklet for Herdowners which is issued to all herdowners at the time of a bTB breakdown. For Income Supplement and Hardship payments there is no application required, Regional offices assess eligibility for all herds in breakdown and herds that meet the conditions of the scheme are paid automatically.  Recently my Department has experienced increase in volume of bTB Compensation payments resulting in a temporary backlog of payments, which is reflected below.  In the table below, total number of Compensation payments made under the TB Eradication Programme this year to 20/11/2025, based on my Department's Animal Health Computer System (AHCS) figures.      County      No of Applications*      Paid Within 3 Weeks      Paid Within 3 - 8 Weeks      Paid Within 8 - 13 Weeks      Paid Over 13 Weeks       Carlow Rvo    126    64    44    15    3      Cavan Rvo    884    709    138    32    5      Clare Rvo    987    801    164    7    15      Cork North Rvo    1527    928    519    42    38      Cork South Rvo    1862    1084    713    50    15      Donegal Rvo    620    452    155    12    1      Dublin Rvo    132    99    33    0    0      Galway Rvo    1567    941    561    53    12      Kerry Rvo    1665    1037    539    80    9      Kildare Rvo    245    188    52    3    2      Kilkenny Rvo    725    526    124    44    31      Laois Rvo    582    488    90    2    2      Leitrim Rvo    592    350    195    31    16      Limerick Rvo    674    603    66    3    2      Longford Rvo    668    474    173    11    10      Louth Rvo    243    202    33    7    1      Mayo Rvo    810    464    292    29    25      Meath Rvo    1328    1062    218    22    26      Monaghan Rvo    950    809    128    8    5      Offaly Rvo    615    520    76    9    10      Roscommon Rvo    422    308    106    7    1      Sligo Rvo    564    375    146    14    29      Tipperary North Rvo    852    751    84    10    7      Tipperary South Rvo    708    580    112    13    3      Waterford Rvo    506    215    234    29    28      Westmeath Rvo    590    496    83    5    6      Wexford Rvo    382    249    98    21    14      Wicklow East Rvo    431    274    106    32    19      Wicklow West Rvo    404    353    46    5    0       Total      21661      15402      5328      596      335        *includes multiple payments across all schemes made to any single herd in the calendar year. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_710",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_73",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_73",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_73.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 36. Deputy James O'Connor asked the Minister for Culture, Communications and Sport the timeline for the next round of the Community Sport Facilities Fund; if the review for the previous round is completed; and if he will make a statement on the matter. [64585/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_36",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  I propose to take Questions Nos. 36, 40, 46 and 51 together.  My Department operates two capital funding programmes for sport, namely the Community Sports Facilities Fund (CSFF) and the Large Scale Sport Infrastructure Fund (LSSIF). Sporting organisations can apply directly for CSFF funding. Applications for LSSIF funding must be made through either a National Governing Body (NGB) of Sport or a Local Authority.  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the CSFF, representing the largest-ever investment in sports facilities in communities across Ireland.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken.  I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next CSFF round will particularly target areas and sports that have been under-invested in over the years.  In 2024, the second round of LSSIF received an unprecedented demand for funding. On 4 November 2024, grants totalling €173 million were awarded to 35 projects. As a result of the significant demand, a range of valid applications did not receive an LSSIF allocation at the initial allocation stage.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF, 2018 and 2024, and this process will inform any decisions regarding the timing of a future round. No decisions have yet been made regarding the next round of LSSIF. ",
        "questionNumber": 36,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_95",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_95",
          "showAs": "Departmental Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_95.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 64. Deputy James O'Connor asked the Minister for Culture, Communications and Sport if he will outline the funding from Budget 2026 for local and community radio stations across the country; and if he will make a statement on the matter. [64586/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_64",
        "answerText": " Minister for Culture, Communications and Sport  Local and community radio stations play a vital role in providing valuable public service content to the Irish public, contributing to a diversity and a plurality of voices in the media sector.  The Programme for Government acknowledges that local and national independent broadcasters perform a vital public service and deserve to have this recognised.  €16m in Exchequer funding was secured in Budget 2026 for the continuation and enhancement of the Media Fund Schemes. This comprises €6m for the Local Democracy and Courts Reporting Schemes and €4m for the Digital Transformation Scheme. Local and community radio is eligible to receive funding from all of these schemes. I also secured €5m for the News Reporting Scheme, which includes €3m of ring-fenced funding for the commercial radio sector.  Furthermore, I was successful in achieving €1m for the development of a Community Media Scheme. This reflects the invaluable role that community media plays in community engagement, cohesion, and in the promotion of social inclusion in communities across the State.  Coimisiún na Meán are progressing a body of research into current community media supports. This research, when complete, will inform future policy decisions taken including in relation to the design and implementation of the Community Media Scheme. The research will also look at ways to ensure community media are well positioned to access schemes on a more even playing field with larger media counterparts.  In addition to the €16m for the Media Fund Schemes, funding of €1.465m was secured for the Sound and Vision Scheme, which provides ongoing vital support to local and community radio and which will be added to the estimated €14m that the Scheme is likely to receive through the TV licence fee.  The suite of Schemes now in operation under the Media Fund cater to all parts of the media sector, including supporting the provision of high-quality public interest journalism through the Local Democracy, Courts Reporting and News Reporting Scheme along with supporting the ability of the sector to invest in digital skills and development through the Digital Transformation Scheme.  As Minister, I understand the important role that local and community radio plays in our society. The supports provided, and in particular the new dedicated Community Media Scheme, will ensure the continued provision of essential support for local and community radio nationwide. ",
        "questionNumber": 64,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_161",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_161",
          "showAs": "Healthcare Infrastructure Provision",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_161.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 142. Deputy James O'Connor asked the Minister for Health the status of the 60-bed community nursing unit for Youghal project; and if she will make a statement on the matter. [64583/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_142",
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter ",
        "questionNumber": 142,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_164",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_164",
          "showAs": "Ambulance Service",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_164.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 145. Deputy James O'Connor asked the Minister for Health the status of the ambulance training base centre for Youghal project; and if she will make a statement on the matter. [64584/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_145",
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionNumber": 145,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 93,
        "showAs": " 93. Deputy James O'Connor asked the Minister for Transport if he will take urgent action on the lack of train carriages available for morning services from Midleton train station to Kent Station during rush hour; if his Department is aware of the volume of passengers who take those morning commuter trips each weekday morning; if his Department will ensure that extra carriages are added to this route expeditiously; and if he will make a statement on the matter. [63496/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_93",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_50",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_50",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport  As is occurring across the wider railway network, Cork train services, such as the Midleton to Kent line, are experiencing record demand, especially during weekdays, with commuters availing of peak journey times to connect with work, school, and other destinations. In fact, passenger numbers are now over 1 million journeys on average each weekday across the entire on the Transport For Ireland network.  Following the recent increase in service frequency, from hourly to half-hourly on the Cobh and Midleton lines, along with additional services on the Mallow commuter line, all available capacity is being utilised each day. As a result, there is currently no spare capacity to add further carriages to peak-time services. While the trains are busy, they are designed to safely accommodate full loading at the busiest times, though Iarnród Éireann appreciate this can be uncomfortable for passengers.  The Cork Area Commuter Rail Programme, which represents the largest investment in the rail network in Cork undertaken by the State, is being delivered on a phased basis. Phase 1 of the Programme consists of a signalling upgrade, construction of a through-platform at Kent Station, which opened in April, and double-tracking from Glounthaune to Midleton. This phase has received EU Funding under the National Recovery and Resilience Plan and is scheduled to be completed next year.  Phase 2 of the programme plans for the electrification of the Cork commuter rail network and the delivery of up to eight new stations, as well as the upgrade of existing stations including Mallow. In 2024, Iarnród Éireann awarded a contract to TYPSA and Roughan O’Donovan appointing them as multi-disciplinary consultants for the design of Phase 2 of the Programme.  The first public consultation on Phase 2 of the Programme concluded in July. Phase 2 will be progressed following the completion of Phase 1, subject to funding and relevant approvals.  The Programme will provide a more efficient and decarbonised transport service for the area to help facilitate population and economic growth over the coming decades, enabling a frequency of up to every 10 minutes on the Cork Rail Commuter network. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 100,
        "showAs": " 100. Deputy James O'Connor asked the Minister for Transport the status of  the appointment of a design consultant for the N25 Midleton to Youghal scheme; the timeline for the appointment if not already appointed; if his Department has outlined the importance of this project to the southern region for persons who travel from Rosslare to Cork each day; and if he will make a statement on the matter. [63495/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_100",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_57",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_57",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_57.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  I can confirm that €700,000 has been allocated for the Midleton to Youghal scheme in 2025. As with all national roads projects in the NDP, the delivery programme for the project will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply updating you as to the latest status of this project. Please advise my private office if you do not receive a reply within 10 working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 300,
        "showAs": " 300. Deputy James O'Connor asked the Minister for Transport his Department’s plans to fund Local Link services to connect local villages to towns; and if he will make a statement on the matter. [56037/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_300",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_245",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_245",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_245.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport (Deputy Jerry Buttimer)  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision.  Connecting Ireland is a major 5-year public transport initiative developed by the NTA to increase connectivity outside our major cities and towns, which commenced in mid-2022. Over 180 new and enhanced services have commenced since then, connecting 240 towns and villages to the public transport network. These services have provided connections to 61 healthcare facilities, 41 higher education facilities and 71 rail services.  Funding of €51 million was provided for Rural Regular Services in 2025 and a further €15 million was provided for new services which includes Connecting Ireland, new town services, and Bus Connects. More than 30 new and enhanced services have been implemented to date in 2025.  The 2026 Public Service Obligation funding allocation of €940 million represents a significant 43% uplift in the allocation from 2025. This reflects the Government’s commitment to ensuring that public transport services can continue to operate reliably and sustainably in the face of growing passenger demand and increased operational costs.  In addition, a further €31 million has been secured for rural transport in 2026 – a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland, to meet demand in communities that depend on these services most. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 313,
        "showAs": " 313. Deputy James O'Connor asked the Minister for Transport the status of the proposed R624 access road to connect Cobh and the Great Island to Cork following a meeting held with An Taoiseach and the Minister for Public Expenditure, National Development Plan Delivery and Reform and Minister for Transport in October 2021; and if he will make a statement on the matter. [63755/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_313",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_67",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_67",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  I propose to take Questions Nos. 110 and 313 together.  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any new road projects that seek State funding are assessed by the Department on a case-by-case basis. All projects proposed by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  In this regard, Cork County Council submitted an initial project appraisal to the Department in 2019 regarding the upgrade of the R624 Cobh Road. The project, as submitted, includes upgrading the existing N25-R624 interchange, the provision of a dual carriageway from the interchange to Marino Point, widening of Slatty Bridge, the provision of a new bridge crossing to Great Island at Belvelly and upgrading the existing R624 from Marino Point to Cobh.  The estimated cost of this scheme was more than €100 million, with possible staged implementation.  In line with Government requirements Cork County Council also produced a Strategic Assessment Report (SAR) for the Great Island Connectivity Scheme and a draft was forwarded to the Department in November 2022.  Since then, both the Public Spending Code and the Department’s Transport Appraisal Framework (TAF) guidance have been updated - the Department liaised with the Council regarding new requirements under the new infrastructure Guidelines and the TAF including the preparation of a Project Outline Document (POD) and business case incorporating the work already undertaken at the SAR stage.  The Council submitted the POD to the Department in March 2024. Following the submission of the POD, the Council commenced work on developing a brief for the appointment of consultants to deliver the scheme through options assessment, design and planning, starting with the commencement of a Preliminary Business Case. The Council submitted the brief for appointment of consultants in December 2024 to the Department for review. The Council hopes to appoint a consultant in late 2025 once the brief has been finalised.  An allocation of €350,000 was made to Cork County Council as part of the 2025 Regional and Local Roads Grants to assist in the development of the Preliminary Business Case. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 485,
        "showAs": " 485. Deputy James O'Connor asked the Minister for Education and Youth if she will consider a request to establish a special class within a school (details supplied); and if she will make a statement on the matter. [63554/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_485",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_405",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_405",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth  Budget 2026 has provided funding for 3,000 new special educational places within our education system and the National Council for Special Education (NCSE) is currently examining where this provision is best placed for the 2026/27 school year.  In order to ensure new special classes can open as quickly as possible the NCSE prioritise working with medium and larger primary schools who do not already have a special class and have available accommodation to accommodate new special class. This approach maximises the use of existing space which can be reconfigured efficiently while also ensuring that new provision continues to be established. It also increases the number of schools with special classes providing parents with greater choice and reducing the distances that some children are travelling to access a special class place.  However, as in other years where schools have no available accommodation, particularly at post-primary level and there is known demand in a local area, my department will continue to provide additional classroom accommodation to provide necessary places.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The earlier date will allow for earlier sanctioning of classes for the 2026/27 school year, and it is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  The NCSE will have a clear picture of the local demand for special class places for the 2026/27 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline also, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Balanced regional development remains a Government priority. My Department and its agencies contribute to this agenda in several ways, including through nine Regional Enterprise Plans (REPs). These are bottom-up plans developed and led by regional stakeholders, which focus on collaborative initiatives to strengthen the enterprise ecosystem in each region.  My Department oversees implementation of the REPs at the national level. The most recent meeting of the REP National Oversight Group took place in June 2025 where implementation across all REPs was discussed. The next meeting of the REP National Oversight Group will take place on 26 November.  Each of the nine REPs is led by a Steering Committee which includes representatives from the enterprise agencies, local authorities, Regional Assemblies, higher education institutes and industry, who work collaboratively to drive implementation of the REP. Each REP includes actions under a number of strategic objectives relevant to each region.  As mentioned in responses to previous parliamentary questions, in consultation with stakeholders, the current plans were extended for one year to the end of 2025 to allow for further implementation of current objectives and actions, as well as consideration of the future of the REPs.  The Programme for Government commits to publishing and resourcing new Regional Enterprise Plans and ensuring detailed consultation with all relevant stakeholders. My Department is working to deliver on this commitment.  In Q1 2025, my Department appointed Indecon to conduct an independent review of the Regional Enterprise Plan initiative and the final report has been delivered. The report findings are being examined by my Department, and consideration is being given to the next steps, to learn from the current plans and improve our future approach. Once we have decided on how best to take things forward, we will be communicating to all relevant stakeholders.  Work is also underway on a new regional enterprise policy statement which will map out the regional enterprise policy landscape and facilitate better alignment of the REPs with the activities of other regional stakeholders.  Following publication of the policy statement in 2026, I expect the formal consultation process for the development of the next set of Regional Enterprise Plans to get underway, with the aim of publishing new plans in 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_49",
        "debateSection": {
          "debateSectionId": "dbsect_81",
          "showAs": "Enterprise Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_81",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_81.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 49,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 49. Deputy James O'Connor asked the Minister for Enterprise, Tourism and Employment when a new Southwest Regional Enterprise Plan will be brought forward; and if he will make a statement on the matter. [62274/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  My Department’s Statement of Strategy for 2025-2028 was published on 17th October 2025. It sets out a path to drive competitiveness, sustainability and prosperity over the next three years.  The new strategy comprises six cross-cutting goals aimed at strengthening Ireland’s position as a leading location to work, do business and visit. It places a strong emphasis on innovation, digitalisation, decarbonisation and infrastructure, while also recognising the vital role of tourism as a key economic driver. It was developed further to extensive consultations to seek the views of staff, stakeholders, other departments, State bodies and the general public on the direction, priorities and goals for the Department over the coming years.  The ambitions of the Programme for Government are integral to this strategy, with an objective to ensure that Ireland continues to build on its strengths, as an open economy with strong tourism, trade and foreign direct investment, a vibrant innovation ecosystem, and a resilient labour market.  My Department, its Offices and Agencies will work collaboratively with colleagues across Government, business, employer and worker representatives, other stakeholders and at EU and international level to achieve our strategic goals. Our progress will be reported through my Department’s Annual Report, the Public Sector Performance report, as part of our indicators under the Revised Estimates Volume and through our Data Dashboard which can be accessed on our website [ www.enterprise.gov.ie ]. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_51",
        "debateSection": {
          "debateSectionId": "dbsect_83",
          "showAs": "Departmental Strategies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_83",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_83.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 51,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 51. Deputy James O'Connor asked the Minister for Enterprise, Tourism and Employment if he will report on his Department’s new Statement of Strategy; and if he will make a statement on the matter. [62275/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " An Leas-Cheann Comhairle  Deputy Pádraig O'Sullivan is taking this question on behalf of Deputy O'Connor. \n Deputy Dara Calleary  I thank Deputies O'Sullivan and O'Connor for the question. The programme for Government contains the commitment to abolish the means test for carers over the life of the Government. Budget 2026 increases the earnings disregard for carer's allowance by €375 to €1,000 per week for a single person and by €750 to €2,000 per week for a couple from July 2026. These are the largest ever increases in the carer's income disregards. They are evidence of my commitment and determination to deliver on the programme for Government commitment. Since 2022 the disregards will have increased cumulatively by €667.50 per week for a single person and €1,335 per week for a couple.  The budget 2026 measure will benefit those current recipients who are on a means-reduced rate and who will see an increase in their payment rate, and those people making new claim applications subject to a means reduced rate in 2026. On foot of the increases in the carer's allowance income disregards, a single person who provides full-time care but also does part-time work will next year be able to earn just over €54,000 and receive a full carer's payment. Similarly in a couple household, a person who is providing full-time care and where their partner might earn approximately €108,000 per annum will receive a full carer's payment.  There are wider implications of departing from a means-tested approach and for this reason the income disregard is being abolished in a measured way over a number of budgets in line with the programme for Government commitment. Given that the scheme is demand led, and given also that it is likely that many people who are above the means threshold will have not previously applied for carer's allowance owing to this, it is difficult to estimate potential inflow from these measures. However, as with other schemes, the number of payments to be made under the scheme is not budget capped and the Department will closely monitor the inflow into the scheme to assess any change in trends. Data on take up will be published in all of our quarterly statistical releases. \n Deputy Pádraig O'Sullivan  In budget 2026, recognition was given, as the Minister just outlined, to the massive contribution that family carers made in Irish society. Progress has been made, albeit not as quickly as some may have liked. Nonetheless, I know that more needs to be done. I have listened to the Minister intently this morning and over recent months. I welcome the fact that the Minister has reiterated here once again that his ambition is still to end the means test for carers in the lifetime of the Government.  Will the Minister outline further his plans for income disregards for carer's allowance? I know he said it would be difficult to forecast it, given the variables he is dealing with, but I ask him to outline his approach and how he intends on doing it in this staged fashion. Will it be in four equal parts over the four years? Will it be a lot more complex than that? He has probably already indicated that it will be. I will revert to the question and ask whether the Minister has any estimate on the number of people who have benefited from the specific measure introduced in budget 2026. \n Deputy Dara Calleary  The context of the commitment in the programme for Government is to do it in a progressive manner as part of the annual budget process. We are still finalising budget 2026 in terms of passing the Bill and we have not given a huge focus to 2027 yet. In terms of abolishing the carer's allowance, the Department has estimated a cost of approximately €600 million. This is based on administrative data. It is derived from the number of people on a reduced rate payment due to means, the number on a half-rate payment perhaps due to an overlap with another social welfare payment, and those who are in receipt of the non-means tested carer's support grant. This cost, however, could stretch to a potential €3 billion per annum if everybody who self-declared as a carer in census 2022 were to qualify. This latter figure is a very high-level estimate but it gives a sense of the range. This gives a sense of the implications of departing from a means-tested approach. That is why we will be abolishing it in a measured way over a number of budgets. This year's increase of 60% gives a sense of my ambition and determination in that regard. I certainly will be pursuing further increases. To give a little bit of leeway, we must also bear in mind that we have to look after those who are on existing carer's payments to ensure they get support as well. \n Deputy Pádraig O'Sullivan  I know it might not be popular to say it with some people inside here, but the €600 million VAT exemption given to hospitality might have been better devoted to this area in the budget.  To finish, I want to highlight a particular concern I have about people providing full-time care to more than one person in their homes. Will the Minister please outline how we are going to help these people in particular, as I believe they are a cohort under the most pressure? Will the Minister update us on plans to introduce a pay-related carer's benefit for individuals who have to give up work suddenly in order to provide full-time care for their loved ones? \n Deputy Dara Calleary  I will revert to the Deputy on the first point regarding multiple people in a home. With regard to pay-related carer's benefit, and as Deputy O'Sullivan knows, we introduced a pay-related jobseeker's benefit earlier this year. I am waiting to do a full 12-month evaluation of the impact of this scheme. It will give me guidance on introducing it for carers and for parental leave.  Once again, I emphasise my determination to abolish the means test. The income disregards we increased this year mean that people who have never before engaged with the Department of Social Protection will have the opportunity to receive a full carer's payment. That is why it is challenging to estimate the number of people who will be involved. An income of more than €108,000 for a two-adult household is substantial and it will now get a social protection payment. The same carer with an income of €138,000 will retain a partial payment. We are determined to get rid of this means test and to ensure proper supports are given to those on the payment. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_79",
        "debateSection": {
          "debateSectionId": "dbsect_27",
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_27",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_27.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 79,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 79. Deputy James O'Connor asked the Minister for Social Protection the number of persons who will gain from the changes in the means test for the carer’s allowance announced in budget 2026; and if he will make a statement on the matter. [62283/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  I am very conscious of the need to target support to those people who most require help with their energy costs.  Therefore, as part of Budget 2026 I was pleased to announce that I had secured funding for an increase in the weekly rate and a number of expansion measures in relation to the Fuel Allowance scheme.  In recognition of the importance of helping low paid working families, I announced the extension of the Fuel Allowance payment to Working Family Payment recipients.  This will benefit over 43,000 families and is a significant measure in tackling child poverty.  This will be implemented from March 2026 and backdated to January 2026.  This measure honours commitments made in the 2025 Programme for Government to expand the eligibility for the Fuel Allowance to families in receipt of the Working Family Payment.  Budget 2026 allows those who leave their disability payment to take up employment to continue to receive their Fuel Allowance for five years after exiting their payment.  I trust that this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_118",
        "debateSection": {
          "debateSectionId": "dbsect_139",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_139",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_139.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 118,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 118. Deputy James O'Connor asked the Minister for Social Protection the number of persons that will benefit from the changes in the qualifying criteria for the fuel allowance announced in Budget 2026; and if he will make a statement on the matter. [62282/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed improving outcomes for disabled people.  Budget 2026 contains significant measures to support disabled people. These measures include:  • a €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January;  • Christmas bonus - double payment to all persons getting a long-term disability payment to be paid in December 2025;  • the highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12;  • a €20 increase in the rate of Domiciliary Care Allowance;  • a €5 increase in the Fuel Allowance, bringing it to €38 per week from January 2026;  • people moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years. The Back to Work Family Dividend is also being extended to this group, where they have children;  • extending the Wage Subsidy Scheme to people who acquire a disability while in employment and increasing its rates from April;  • increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026;  • the income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  The Budget 2026 allocation of €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, represents another significant investment to ensure people with disabilities receive the right support, at the right time, in the right place.  This is the first of this Government’s five Budgets. We are at the start of a five-year programme for Government and not everything can be done in year one. In the Programme for Government, we have committed to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment.  We know that addressing the cost of disability is not a question of income support alone. The delivery of and access to services are also key. We need all of the Departments and agencies of Government to work together to address the issue in a comprehensive way.  The recently published National Human Rights Strategy for Disabled People 2025-2030 takes a whole-of-Government approach and includes a commitment to establish a Strategic Focus Network on the Cost of Disability, led by my Department.  The work of this network, which will include people with disabilities and their advocates, will inform the approach we will be taking in delivering on this Programme for Government commitment.  Officials in my Department have started to have meetings with stakeholder groups with a view to bringing a proposal to Government in the first half of next year. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_350",
        "debateSection": {
          "debateSectionId": "dbsect_339",
          "showAs": "Departmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_339",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_339.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 350,
        "by": {
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 350. Deputy James O'Connor asked the Minister for Social Protection the provisions in Budget 2026 to address the cost of disability. [61904/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Since 2017, the Department has offered Sustainability Funding to community ELC/SAC services in crisis. In 2018, a Sustainability Funding policy was formalised, and a framework was created which coupled this Sustainability Funding with on-the-ground case management assistance. The purpose of the supports within this framework were to provide emergency funding to community services where a need for funding was identified while also ensuring that the case management performed at a service level identified and resolved underlying issues that may have caused the initial crisis.  Through Case Management supports, the Department will assist providers with interpreting aspects of their business model including analysis of staff ratios and cash flow, as well as more specialised advice and support appropriate to individual circumstances. Sustainability funding will enhance Core Funding by providing supports to services who are in most in need of financial assistance ensuring the delivery of high-quality early learning and childcare.  The sustainability fund for service providers is a support mechanism introduced to ensure the stability and viability of early learning and childcare services for those participating in the Core Funding model. The fund is accessed through a collaborative process involving the service, their local City/County Childcare Committee (CCC), and Pobal, who assess financial eligibility and need.  Once a service engages with their local CCC they will be able to avail of sustainability supports through the case management process.  As part of the Case Management process, City or County Childcare Committees (CCC) assist services with issues and difficulties that arise. This support can take the form of assisting services with interpreting analysis of staff ratios and cash flow, financial support, as well as more specialised advice and support appropriate to individual circumstances.  I would encourage any service experiencing financial difficulty and who would like support to contact their CCC to access case management supports. Contact details for the CCCs can be found at [ City and County Childcare Committees ]. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_102.xml"
            }
          },
          "debateSectionId": "dbsect_102",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_102"
        },
        "questionNumber": 142,
        "date": "2025-11-12",
        "showAs": " 142. Deputy James O'Connor asked the Minister for Children, Disability and Equality the supports available to childcare providers in Core Funding who may require additional financial support. [61905/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_142"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Renewable Transport Fuel Policy 2025-2027 sets out a pathway to incentivise supply of renewable fuel in transport, including HVO, to meet Climate Action Plan and EU Renewable Energy Directive targets. This is achieved through the Renewable Transport Fuel Obligation (RTFO), an obligation on fuel suppliers to ensure a minimum proportion of renewable fuel in all road transport petroleum products supplied in Ireland, i.e. it does not distinguish between operation of public or private vehicles.  Renewable transport fuel, including HVO, used in transport which fulfils EU criteria for sustainability and greenhouse gas emissions reduction is eligible for RTFO certificates and can be counted against the obligation. The Climate Action Plan target is for a 20% physical blend of biofuel in diesel supply by 2030.  Corresponding to an RTFO rate of 21% by energy in 2024, a physical blend of approximately 10% biofuel in diesel supplied to road transport was achieved, of which approximately 7% was FAME biodiesel and 3% was HVO blended in diesel. It is expected that further increases in the RTFO rate projected to 2030 under the Policy will see a physical blend in the region of 13% HVO in diesel supplied in the State.  Sustainable renewable transport fuels such as HVO provide immediate climate-change mitigation utilising the existing vehicle fleet and will remain an important transition measure in transport decarbonisation in the coming years as the shift to electrification and further increases in public transport and active travel are fully realised. Ireland’s policy on renewable fuels will continue to promote future supply of sustainable advanced biofuels and renewable fuels of non-biological origin.  The National Oil Reserves Agency (NORA) is responsible for administration of the RTFO and the award of RTFO certificates for each megajoule of renewable fuel supply. The NORA also advises the Minister on RTF policy. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_238.xml"
            }
          },
          "debateSectionId": "dbsect_238",
          "showAs": "Motor Fuels",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_238"
        },
        "questionNumber": 291,
        "date": "2025-11-12",
        "showAs": " 291. Deputy James O'Connor asked the Minister for Transport his Department’s policy around the use of hydrotreated vegetable oil in public and private vehicles; and if he will make a statement on the matter. [61342/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_291"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department can confirm that it owns a 1.9 acre site across the road from the main campus referred to by the deputy. The potential future use of this piece of land is being considered by this department in the context of educational requirements in the area.  Once my department has fully determined the requirements in this area we will be in a position to confirm the plans for this land. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_483.xml"
            }
          },
          "debateSectionId": "dbsect_483",
          "showAs": "Site Acquisitions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_483"
        },
        "questionNumber": 560,
        "date": "2025-11-12",
        "showAs": " 560. Deputy James O'Connor asked the Minister for Education and Youth he will outline his Department’s plans for a site north of a school (details supplied); and if she will make a statement on the matter. [62151/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_560"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_63",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_53",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_53",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 63. Deputy James O'Connor asked the Tánaiste and Minister for Defence the allocation he secured for Permanent Defence Force pay in budget 2026; and if he will make a statement on the matter. [60482/25] ",
        "questionNumber": 63,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 21, 63 and 65 together.  A record €1.5 billion was allocated in Defence funding in Budget 2026.This is an increase of €145 million (11%) in the Defence group allocation compared to 2025 which represents an increase of €383 million (35%) to the Defence Vote Group since 2022.  A significant current spending allocation of €873 million for Vote 36 Defence includes funding for the recruitment of a net 400 additional Permanent Defence Forces members.  This significant level of funding will also enable further progress on the transformation of the Defence Forces as identified and recommended by the Commission on the Defence Forces and the Independent Review Group.  Within Vote 36 Defence, the pay allocation for Permanent Defence Force (PDF) in 2026 is €485 million, an increase of €16 million over the 2025 allocation.  The overall pay funding for the PDF in 2026 will provide for the costs of:  • a prevailing strength of 7,700  • a net increase of 400 additional personnel  • all carryover impacts of the existing Public Service Pay Agreement, including the scheduled increases of 1% from February 2026 and the final 1% from June 2026  There has been significant improvements in Defence Forces pay in recent years. At present recruit pay, on completion of training (which takes approximately 24 weeks), starts at:  • €41,880 in Year 1 -  • €43,304 in Year 2 -  • €44,618 in Year 3 -  Equally, for the Officer cohort, a school leaver Cadet, on commissioning, is now paid over €45,000, which is a second lieutenant position.  As such, in the last 6 years a cadet's pay, on commissioning, has increased by over €14,900 in 6 years, or by 49%. Furthermore, after 2 years they are promoted to lieutenant and their pay rises to just over €51,000.  Where a graduate joins the pay rate on commissioning begins at over €51,000. These rates all include pensionable military service allowance, which is an allowance that is paid to all ranks up to and including the rank of Colonel, for the unpredictable nature of the work encountered by the Defence Forces.  Regarding the pay and conditions of members of the Defence Forces, it is important to point out that in addition to basic pay and military service allowance, certain positions in the Defence Forces also attract specialist and technical pay. Additionally there is scope for further income from duty allowances for specific duties carried, out on an ongoing basis, as well as the possibility of earning a tax-free duty allowance, starting at €15,000, for a 6 month overseas deployment.  The changes to Patrol Duty Allowance for Naval Service personnel which came into effect on 1 January 2024 resulted in the Patrol Duty Allowance being doubled after ten days at sea. This provides greater clarity on the overall incentive package available to members of, and potential recruits to, the Naval Service.  Key changes introduced to broader conditions include extension of private medical care to all personnel; increases to mandatory retirement ages and recruitment ages, and earlier this year, the removal of the blanket exemption from the Organisation of the Working Time Act. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_65",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_53",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_53",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 65. Deputy James O'Connor asked the Tánaiste and Minister for Defence the changes for Defence Forces pay under budget 2026; and if he will make a statement on the matter. [60483/25] ",
        "questionNumber": 65,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 21, 63 and 65 together.  A record €1.5 billion was allocated in Defence funding in Budget 2026.This is an increase of €145 million (11%) in the Defence group allocation compared to 2025 which represents an increase of €383 million (35%) to the Defence Vote Group since 2022.  A significant current spending allocation of €873 million for Vote 36 Defence includes funding for the recruitment of a net 400 additional Permanent Defence Forces members.  This significant level of funding will also enable further progress on the transformation of the Defence Forces as identified and recommended by the Commission on the Defence Forces and the Independent Review Group.  Within Vote 36 Defence, the pay allocation for Permanent Defence Force (PDF) in 2026 is €485 million, an increase of €16 million over the 2025 allocation.  The overall pay funding for the PDF in 2026 will provide for the costs of:  • a prevailing strength of 7,700  • a net increase of 400 additional personnel  • all carryover impacts of the existing Public Service Pay Agreement, including the scheduled increases of 1% from February 2026 and the final 1% from June 2026  There has been significant improvements in Defence Forces pay in recent years. At present recruit pay, on completion of training (which takes approximately 24 weeks), starts at:  • €41,880 in Year 1 -  • €43,304 in Year 2 -  • €44,618 in Year 3 -  Equally, for the Officer cohort, a school leaver Cadet, on commissioning, is now paid over €45,000, which is a second lieutenant position.  As such, in the last 6 years a cadet's pay, on commissioning, has increased by over €14,900 in 6 years, or by 49%. Furthermore, after 2 years they are promoted to lieutenant and their pay rises to just over €51,000.  Where a graduate joins the pay rate on commissioning begins at over €51,000. These rates all include pensionable military service allowance, which is an allowance that is paid to all ranks up to and including the rank of Colonel, for the unpredictable nature of the work encountered by the Defence Forces.  Regarding the pay and conditions of members of the Defence Forces, it is important to point out that in addition to basic pay and military service allowance, certain positions in the Defence Forces also attract specialist and technical pay. Additionally there is scope for further income from duty allowances for specific duties carried, out on an ongoing basis, as well as the possibility of earning a tax-free duty allowance, starting at €15,000, for a 6 month overseas deployment.  The changes to Patrol Duty Allowance for Naval Service personnel which came into effect on 1 January 2024 resulted in the Patrol Duty Allowance being doubled after ten days at sea. This provides greater clarity on the overall incentive package available to members of, and potential recruits to, the Naval Service.  Key changes introduced to broader conditions include extension of private medical care to all personnel; increases to mandatory retirement ages and recruitment ages, and earlier this year, the removal of the blanket exemption from the Organisation of the Working Time Act. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_134",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_135",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_135",
          "showAs": "Solar Energy Guidelines",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_135.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 134. Deputy James O'Connor asked the Minister for Climate, Energy and the Environment if his Department has considered a policy around installing solar panels on all State buildings around the country; the status regarding the creation of this policy; and if he will make a statement on the matter. [60443/25] ",
        "questionNumber": 134,
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 131 and 134 together.  There is currently a range of measures in place to support the rollout of solar panels on public buildings. The Non-Domestic Micro-generation Scheme provides capital grants for non-domestic applicants, including public buildings, for solar PV installations up to 1000kW, primarily for self-consumption, with grant levels up to a maximum of €162,600 available. This scheme is administered by the Sustainable Energy Authority of Ireland (SEAI).  Solar PV is also supported as one of a range of measures under the SEAI's Community Energy Grant Scheme as part of the Government's National Retrofit Programme. This scheme supports cross-sectoral and community-oriented partnership approaches that deliver energy savings to a range of building types, including public, commercial and community buildings. In addition, over 2,000 schools have installed free solar PV systems under the Schools Photovoltaic Programme. The overall number of Government-owned buildings which have been retrofitted with solar panels is not collected by my Department. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_231",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "James O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_213",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_213",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "showAs": " 231. Deputy James O'Connor asked the Minister for Education and Youth further to Parliamentary Question No. 236 of 22 May 2025, if a matter will be reviewed taking further details into account (details supplied); and if she will make a statement on the matter. [60607/25] ",
        "questionNumber": 231,
        "answerText": " Minister for Education and Youth  The criteria required to have incremental credit awarded to qualified Special Needs Assistants (SNA) is set out in Circular 0139/2006 and was agreed with the unions representing the Special Needs Assistants, School Management Representatives, the Department of Public Expenditure and Reform, and the Department of Education.  To qualify for an award of incremental credit an SNA and their prior work experience being claimed must satisfy the eligibility criteria set out in the relevant circular. An award of incremental credit cannot be made where the eligibility criteria are not satisfied.  Regarding the SNA to which you refer, the relevant unit in the department will review the matter and consider the additional information that was provided to the department. The applicant will be informed directly of the outcome of this review. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 85,
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  I can confirm that €700,000 has been allocated for the N25 Midleton to Youghal scheme in 2025. As with all national roads projects in the NDP, the delivery programme for the project will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_114",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_114",
          "showAs": "Road Projects",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_114.xml"
            }
          }
        },
        "showAs": " 85. Deputy James O'Connor asked the Minister for Transport the status of a project in County Cork (details supplied); and if he will make a statement on the matter. [60448/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_85"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 86,
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. There has a significant amount of investment in the Midleton to Youghal Greenway to date by my Department with an investment in excess of €20,000,000.  In line with Section 32 (2) of the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. Investment in Greenway and National Roads Active Travel projects is also subject to the requirements of the Infrastructure Guidelines and necessary statutory approvals.  Noting the above position, I have referred your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_115",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_115",
          "showAs": "Greenways Provision",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_115.xml"
            }
          }
        },
        "showAs": " 86. Deputy James O'Connor asked the Minister for Transport the status of a project in County Cork (details supplied); and if he will make a statement on the matter. [60449/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_86"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 87,
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The maintenance, renewal and operation of the rail network, including the development of a business case for a rail line between Midleton and Youghal, is a matter for Iarnród Éireann (IÉ) in the first instance.  Noting IÉ's responsibility in relation to the rail network and stations on the network, I have referred the Deputy's question to IÉ for a more detailed reply on the specific issue raised. Please contact my private office if you do not receive a reply within 10 days. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_116",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_116",
          "showAs": "Rail Network",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_116.xml"
            }
          }
        },
        "showAs": " 87. Deputy James O'Connor asked the Minister for Transport if a business case has been created for a project (details supplied) as per infrastructure guidelines; the projected cost of the project; and if he will make a statement on the matter. [60450/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_87"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 96,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 38 and 96 together.  The launch in 2018 of the Flood Risk Management Plans trebled, to some 100, the number of flood relief schemes at design and construction. There remains some 50 schemes, referred to as Tranche II, yet to commence work on their design, due to constraints of professional engineering services and skills in Ireland. However, the Government is committed to funding these projects through the €1.3bn available under the National Development Plan for flood relief measures.  Cork County Council is currently leading the delivery of six flood relief schemes, including Midleton, with nine Tranche II schemes, including Castlemartyr, Youghal and Rathcormac to be delivered within the lifetime of the National Development Plan to protect the people of Midleton and East Cork from their flood risk. The Office of Public Works, (OPW), is funding nine staff in Cork County Council to support the delivery of this programme of schemes, and other schemes across the county including in Mogeely and Killeagh. Four of these staff are working full time on the Midleton Flood Relief Scheme.  The OPW is piloting a new delivery model in Counties Donegal and Kilkenny to inform delivery of future Tranche 2 schemes nationally. Ultimately, the Pilot will inform the delivery model to be applied for the future tranche of schemes and in doing so, will be relevant to all schemes nationwide.  The Midleton Flood Relief Scheme, which will protect up to 750 properties is currently estimated to be submitted to An Coimisiún Pleanála under the Planning and Development Acts in Q2 2026 and is anticipated to reach substantial completion in 2031.  Cork County Council is engaging with landowners, whose lands have been identified as needed for the scheme. Work is ongoing on environmental surveys and assessments which are required to inform the Environmental Impact Assessment Report. Cork County Council, in June 2025, submitted the Marine Area Consent Application to the Maritime Area Regulatory Authority (MARA).  Many interim measures have been introduced across Midleton and East Cork following Storm Babet in October 2023, including river cleaning.  A part 8 planning application for advance works at Tir Cluain, to protect up to 135 properties has been published by Cork County Council and is available to the public online and at the Planning Department, Cork County Hall and at Cork County Council East Cork Municipal District Offices at Midleton Lodge and Mall House, Youghal with submissions/observations to be made before 4pm on 11th November 2025. A public information evening on these planned works took place on 23rd October 2025. Subject to a successful planning application construction works are planned to commence in late summer/early autumn 2026.  In October 2024, the OPW approved €5.8m in funding for Cork County Council to make Individual Property Protection (IPP) available free of charge to some 725 homes and businesses in Midleton and across East Cork who were impacted by Storm Babet in October 2023. This forms part of the Council’s emergency response plans for these areas. The scheme requires some 2,000 flood barriers and a significant number of these need civil works to have them installed. The Council is continuing to procure flood gates and civil works contractors to deliver the scale of this programme as quickly as possible. Cork County Council and the OPW are keeping the delivery of this IPP scheme under review.  A quarterly update by Cork County Council on the Midleton Flood Relief Scheme and the Individual Property Protection scheme was presented at the Midleton Flood Committee meeting on 9th October 2025 and the next update is scheduled for 22nd January 2026. This Committee consists of local elected representatives, members of the business community and the wider community.  The Minor Flood Mitigation Works and Coastal Protection Scheme (Minor Works Scheme) was introduced by the OPW in 2009. The purpose of this scheme is to provide funding to Local Authorities to undertake short-term measures in the form of minor flood mitigation works to address localised fluvial flooding and coastal protection problems within their administrative area. The scheme applies, where a flood defence solution can be readily identified and achieved within a relatively short timeframe, whilst all works must comply with relevant regulatory frameworks.  Following the devastating flooding caused by Storm Babet in October 2023, some €321,000 has been approved for the communities of East Cork under the Minor Works Scheme, as set out under:      Funding Approved      Date      Location      Description of the works       €81,844    July 2024    Castlemartyr    Flood mitigation measures      €73,125    September 2024    Killeagh    River cleaning      €116,235    August 2025    Mogeely    Study to explore possibility of flood mitigation measures in catchment upstream of Mogeely      €49,899    September 2025    Rathcormac    River maintenance       €321,103      Total               ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_72",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_72",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_72.xml"
            }
          }
        },
        "showAs": " 96. Deputy James O'Connor asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of a flood project (details supplied); and if he will make a statement on the matter. [60451/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_96"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-O'Connor.D.2020-02-08",
          "showAs": "James O'Connor",
          "memberCode": "James-O'Connor.D.2020-02-08"
        },
        "questionNumber": 115,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  Under the terms of the scheme, the availability of concessionary transport varies from year to year based on the capacity on the buses running on all the various routes and the number of eligible children accommodated on each route.  The number of mainstream school transport tickets that have issued to pupils in Cork for the current school year is now over 19,500, consisting of over 6,000 primary pupils and 13,500 post primary pupils.  The information requested by the Deputy is not available at this time. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_143",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_143",
          "showAs": "School Transport",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_143.xml"
            }
          }
        },
        "showAs": " 115. Deputy James O'Connor asked the Minister for Education and Youth the number of school children who do not currently have a ticket for school transport in both primary and post-primary in County Cork; his Department’s plans to rectify the situation in the coming weeks; and if she will make a statement on the matter. [60452/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_115"
      }
    }
  ]
}