{
  "head": {
    "counts": {
      "questionCount": 3085,
      "resultCount": 3085
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Emer Higgins  As Minister for State with special responsibility for disabilities, I am committed to delivering a step-change in supports and services for people with disabilities and their families, ensuring they are enabled to live full lives of their own choosing and on an equitable basis with everyone else in society. The Department has been working closely with the HSE to deliver on this ambition and improve disability services for all who use them.  The Deputy will be aware that services are provided on the basis of need and funding is provided now through the regional health areas, RHAs. The Deputy has asked about the improvements being made to disability services in Kerry, which falls within the HSE South West RHA. As part of a broader programme of work, the HSE, with the support of the Department, has progressed a range of service improvements in the Kerry area. As previously stated, the programme for Government includes a commitment to the continued expansion of all types of respite services, building on additional investment and progress over the past few years. The HSE South West disability service operates separate children and adult regional respite forums. Each forum manages the referral and respite service provision for the population of the region to ensure equitable access to respite services, consistent with each person's assessed need and preference. Service provider representatives and HSE South West disability service personnel comprise the membership of the regional respite forum. The HSE South West disability services provide a range of respite models for children and adults and these include: residential overnight respite centres, after-school clubs for children and young people, in-home support, outreach support and holiday breaks for adults. These options ensure that respite is provided in the manner which best meets the needs of the people and their families and carers.  RHA HSE South West, which extends to the Cork and Kerry areas, provided 17,181 respite overnights in 2024, 2,833 day-only respite sessions and supported 760 people with a disability. Kerry residential respite services for children aged between 6 and 18 years of age are delivered by St. John of God Services. There are two residential respite houses, one in north Kerry and one in south Kerry. Each house has four respite beds and operates seven days per week, with planned closures this equates to approximately 2,800 respite beds for children. \n Deputy Pa Daly  I thank the Minister of State for her reply. I remember attending a meeting in Listowel last year when the services in north Kerry were closed. It turned out that they were reopened but there were such levels of stress and anxiety among the families and the service users who were used to attending the service, which was just outside Listowel, the north Kerry service the Minister of State mentioned. Will the Minister of State guarantee to expand those services because it is a county where, for example, we have only have two early school intervention classes in the whole of the county whereas County Cork has 22 of them and there are three in the town of Mallow alone? The early services are not there and they need to be expanded. I will come back to it in a few minutes but the NCSE letters that have been sent out are a matter of grave concern also. \n Deputy Emer Higgins  Just to advise the Deputy that our Department and the HSE are currently auditing respite services to have better visibility and to be able to plan better and make decisions based on the need. It is our intention to increase both overnight and day respite next year throughout the country. That will be part if the HSE's national services statement and national services plan and we will be making the decisions on that based on the level of current provision and the level of identified need in an area. I hope that is of benefit to the Deputy in terms of his own county. \n Deputy Pa Daly  The NCSE recently said it is saying it is no longer in a position to issue letters of eligibility for ASD classes in schools and special schools because it issued a deadline on 1 October and it is using that as an excuse to tell parents they are not getting places and to contact the school for any additional supports. Clearly, it is not appropriate to issue a final deadline like that. There is huge stress and anxiety among the parents. We heard earlier about the judicial review and there are legal challenges available to some of those parents where they are not getting the services they require. Will the Department give more flexibility so that people can access the proper services in a timely manner? \n Deputy Emer Higgins  Just to clarify, the NCSE is under the remit of the Department of education rather than our Department. I know this is something the Minister of State with responsibility for special education and the Minister for education are looking at.  Together with the NCSE, they had set a date of 1 October for applications. That was to be able to give the parents better clarity, better security and early decision-making ahead of the coming academic year. I appreciate that there are parents who may have been in a position to provide information after this date. That is something I have raised directly with the Minister of State with responsibility for special education. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 12. Deputy Pa Daly asked the Minister for Children, Disability and Equality the measures she is taking to improve disability services in Kerry. [72874/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_10",
          "debateSectionId": "dbsect_10",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_10.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_12",
        "questionNumber": 12
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Shaping the Future sets out the next steps in delivery of the key commitments in the Programme for Government to improve affordability, quality, and access.  It sets out Phase 1 actions, which will be carried out in 2026 using existing policy tools and which will build on recent progress.  Phase 2 will include a road map on how to achieve the Programme for Government commitment of reducing parental fees to a maximum of €200 per month over the lifetime of this Government.  The National Childcare Scheme (NCS) provides financial support to help parents reduce the cost of early learning and childcare in the form of a subsidy paid directly to the provider. Subsidies are available for children between 24 weeks and 15 years of age at a minimum rate of 2.14 per hour, available for up to 45 weekly hours. Depending on the family’s income, there are additional income assessed subsidies available. All Tusla registered providers are eligible to offer the National Childcare Scheme and avail of the supports the subsidy provides.  This year to date (up until the end of November), there were 8,545 children with an NCS claim in Kerry, a 10% increase on last year.  Next year, the numbers of children benefitting from this Scheme is set to rise. Moreoever, Shaping the Future committed to adjustments to the NCS income assessed subsidy next year. From September 2026, the NCS income thresholds and multiple child deductions (MCD) will be increased. These changes will align improve the affordability of early learning and childcare for up to 47,000 children from lower-income families.  An evaluation of the NCS is due to start in early 2026. This evaluation will review how the Scheme has performed to date and identify any potential enhancements that could be made to better support families with their early learning and childcare costs and will be a key input to Phase 2 of Shaping the Future .  As well as the NCS, the Early Childhood Care and Education (ECCE) Programme will support over 105,000 children to access pre-school education without charge next year. 70% of parents on low-income reported that they would not be able to send their children to preschool without this programme.  2026 actions on affordability in Shaping the Future will also support a further reduction in fees paid by parents who face some of the highest fees in the country by lowering the maximum fees that Core Funding Partner Services can charge. Services with fees below that fee cap will maintain a fee freeze.  €20.6 million has been secured in Budget 2026 to support providers in adhering to these Core Funding fee management conditions in 2026. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 33. Deputy Pa Daly asked the Minister for Children, Disability and Equality the measures she is taking to reduce childcare costs in Kerry. [72875/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_75",
          "debateSectionId": "dbsect_75",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_75.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_33",
        "questionNumber": 33
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Pa Daly  Before we start, it is no disrespect to the Ministers of State but is the senior Minister ever going to turn up? I presume there is a good reason for his absence. \n Deputy Timmy Dooley  My understanding is that he has been away all week in Strasbourg. He has been involved in issues relating to the Irish Presidency. \n Deputy Pa Daly  Tá sé tuirseach traochta. \n Deputy Timmy Dooley  He feels he is well covered by the presence of two Ministers of State to represent him. I hope the Deputy will understand and appreciate this. We will bring back the Deputy's good wishes and concern for him. \n Deputy Pa Daly  There seems to be a pattern but anyway.  Irish households are being ripped off in their energy bills. Even the Taoiseach has acknowledged it. Last week at the joint committee, we were told that price gouging cannot be ruled out.  The ESRI called for a fresh inquiry into our sky-high energy prices. We introduced legislation a few years ago to stop this, but we were ignored, and since then there are record numbers in arrears, price hikes across the board and vital supports such as energy credits withdrawn and ripped away. If even the Government is admitting that price gouging is taking place, why not do something about it, and stop the profiteering before taking away all the energy credits? \n Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  I propose to take Questions Nos. 100 and 101 together.  I know Deputy Daly is interested in this matter. He has raised it in the House on a few occasions, so he has a good track record on it. As he is aware, the electricity and gas retail markets in Ireland operate within an EU regulatory regime wherein these markets are commercial and liberalised. The Commission for Regulation of Utilities, CRU, ended its regulation of retail prices in the electricity market in 2011, and in the gas market in 2014. Price setting by electricity suppliers is, therefore, a commercial matter for the companies concerned. Obviously the CRU remains vigilant and observant of how the market works. Retail prices are influenced by several factors, including wholesale energy prices, system operation costs and supplier hedging. The latest data from Eurostat show that, in nominal terms, Ireland ranked fifth for electricity prices and eighth for household gas prices among European countries in the first half of 2025. When adjusting for purchasing power parity, Ireland is mid-table in terms of energy affordability, with the 12th highest electricity and gas prices among European countries.  Regarding hedging, suppliers in Ireland were shown to have taken a prudent approach to hedging, which had the benefit of protecting final customers from the worst effects of the wholesale price crisis. Conversely, hedging limits the ability of suppliers to reduce prices immediately in line with wholesale price shifts. We saw at the time of the Putin invasion of Ukraine that the gas markets had very significant spikes in wholesale prices, yet our energy users here did not see those spikes in cost because of hedging. Of course, when prices on the markets come down, we do not see the consequential reduction as quickly. The International Energy Agency, IEA, has observed that Irish retail prices have not adjusted at a comparable pace to the decline in wholesale prices, with the energy component of retail prices remaining up to three times that of the wholesale price. Again, that can be factored, to some extent, by the hedging position of the companies concerned.  While the CRU has found no evidence of market failure or windfall profits in the retail sector in its market monitoring role, the IEA findings underline the importance of progressing the programme for Government commitment to \"commission an independent review into the speed and level of passthrough from wholesale prices to retail prices\". The Minister, Deputy O'Brien, is on public record about this but, if not, we will put it on the record now. He has written to the CRU to request that it commences this independent review, building on the work of previous CRU investigations by reviewing the competitiveness of Irish retail energy markets, examining supplier costs, including hedging and pricing practices, and providing comparative price analysis with other EU member states. That body of work was identified as part of the programme for Government and the CRU has now been tasked by the Minister to carry out the work. From an Irish perspective, that will give some level of insight into whether there are practices that could be defined as the Deputy mentioned. It will also assess whether measures are warranted to enhance market responsiveness to wholesale price changes, and make recommendations to ensure that the benefits of lower wholesale prices are felt by consumers. This report will inform the work of the national energy affordability task force.  In addition, the Department is transposing the new electricity market design directive 2024. This directive requires regulators to ensure that suppliers implement appropriate hedging strategies to reduce the risk of supply failure. \n Deputy Pa Daly  I thank the Minister of State for the reply. I agree to some extent with him that it is a commercial issue. Obviously all the energy companies have a responsibility to their shareholders not only to have the same amount of profit but to have an increased amount the following year and the year after that.  I agree with the Minister of State that hedging is an issue. The Government can see that prices do not come down as quickly as they go up. He said that energy costs in Ireland are the 12th highest in Europe, but when other factors are stripped away we have some of the highest prices in Europe. As the Minister of State knows, household bills have doubled over the last five years. Nearly €2,000 extra is now paid by households compared to five years ago. These prices are not inevitable. They are not normal. Ireland is an outlier in this. The latest report from the International Energy Agency highlighted the gap between Ireland's wholesale prices and retail prices as being the largest in the world. We are paying a price for energy that is three times what it costs to produce. What is the Minister of State going to do to address it? \n Deputy Timmy Dooley  As we said, it is of very serious concern to the Government that the energy component of retail prices in Ireland is significantly above the wholesale cost. The IEA renewables report notes that the gap is widening across the countries studied since the start of the energy crisis. Of course that is concerning. The gap is particularly large in Ireland with the energy component of retail prices up to three times that of the wholesale cost. The CRU has carried out extensive monitoring of the Irish retail energy market in recent years and has found no evidence of market failure. Market failure is one thing, yet there is obviously something that is distorting that. That is why the Minister has asked the CRU to carry out that investigation which was identified and factored into the programme for Government. I am hopeful that when that piece of work is done it will shine a light on the issue. It may not be a case of market failure but perhaps there is a lack of competition; I do not know. It is worrying that the gap is widening and it clearly requires a thorough analysis of the facts to establish what exactly is happening. Then it is a matter of an appropriate Government response within the confines of the free market that exists and how the Government might be able to act to ensure domestic and business consumers are able to purchase energy at rates that are comparable. At the end of the day, it puts pressure on every aspect of society if the energy market is not functioning to the extent that we want. It hits us from a competitiveness point of view. If the Deputy has had an opportunity to read the Draghi report, he will know it is about competitiveness in terms of where we are at both a European and a domestic level. \n Deputy Pa Daly  It certainly is not market failure for the energy companies because they are making huge profits. We have called since 2023 for a dedicated hedging monitoring unit so that the regulator can oversee and regulate hedging because the energy companies need to be held to account and to justify the increase in prices. The regulator must also treat energy as a public good. In the coming months, we are going to see an extra €1 tacked onto bills to invest in the grid. Price review 6 also has worrying price increases coming down the tracks. There will be more price increases for the renewable heat obligation, as well as the carbon tax, which the Minister of State's colleagues and supporters in government, the Healy-Rae brothers, opposed vehemently while in opposition, and now are flag bearers for the carbon tax since the last budget. What is the Minister of State going to do to protect households from the rising costs and to address the unfairness in how the costs are structured and levied? \n Deputy Timmy Dooley  The old adage of all politics being local is alive and well for the Christmas season in Kerry. The Government understands the importance of a functioning energy market. It is the role of the CRU to manage that. The Minister has sought that piece of work to be done and it will inform any decisions that have to be taken thereafter.  It is easy to say - although I am not accusing Deputy Daly alone of this - that we are heaping on additional charges for no reason. The carbon tax or carbon charge, from the time it was introduced, was a very clear indication by Government of the direction of travel for fossil fuels. It was about encouraging societies to move away the harmful impacts of fossil fuels. It gave certainty to the market place that if energy users continued to use fossil fuels as they were, the charges would increase over time. What I was clear on, from the perspective of the Opposition at the time, was that the Government would put in place a methodology to ensure that the taxes or charges collected would be ringfenced and used for what was referred to as a hypothecation fund. The funds would be used to assist those in greatest need and those who were challenged by the tax. \n Deputy Réada Cronin  That is not what happened. \n Deputy Timmy Dooley  I know some Deputies will have a different view but that is very much what has happened with that funding. It was not about raising a tax or an additional charge for the sake of it. It was about attempting to change behaviour and then utilising the moneys collected to assist those facing challenges in moving away from fossil fuels. That is working, of that there is no doubt. \n Deputy Réada Cronin  No, it is not. \n Deputy Timmy Dooley  Deputy Daly talked about the additional charge under PR6 that will go into upgrading the grid. That is really important. That work has to be done. We have significant constraints on our electricity grid at the moment that need to be addressed. Unfortunately, that has to be paid for and that is why the CRU monitors all of these charges. Companies do not have a free-for-all in terms of what they charge. It is monitored by the CRU and is provided for in PR6. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 100. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment the measures he is taking to enhance the power of the regulator to increase transparency in relation to the retail price of energy here; the steps he is taking to investigate and prevent price gouging, as the Taoiseach alleged is taking place (details supplied); and if he will make a statement on the matter. [72871/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_18",
          "debateSectionId": "dbsect_18",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_18.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_100",
        "questionNumber": 100
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Pa Daly  Ireland is wasting over €400 million every year on surplus energy. The programme for Government says that legislation could be enacted to divert surplus renewable energy to homes that are in fuel poverty. The amount being wasted has jumped from over €250 million in 2023. I ask the Minister of State to outline a timeline for the delivery of the diversion of wasted energy to the households that need it the most. \n Deputy Timmy Dooley  As the Deputy knows, imperfections and dispatch down are a major challenge facing the electricity system. Obviously, dispatch down is brought about by constraints on the grid and the challenges of getting the electricity from the point of generation to where there is a demand and a need. If the grid is not capable of carrying the electricity at a particular time, energy generators are required to effectively stop generating so that there is not more complexity on the grid. This complex issue can only be addressed by taking a systematic and multifaceted approach, requiring investment in grid, storage and demand flexibility. We are already taking steps to invest in this critical energy infrastructure and, for example, PR6 will enable the delivery of over 500 capital network projects supporting the integration of increasing volumes of renewable energy and helping to reduce the amount of wasted energy in the first instance.  In July the Government committed to investing €3.5 billion of national development plan, NDP, funding in EirGrid and ESB Networks in order to ensure that the PR6 infrastructure programme can be delivered. That level of investment by the State in ESB Networks and EirGrid provides those companies with capacity to leverage against significant further borrowing that will ensure we will see a very significant upgrade of our networks. Legislation providing the legal mechanism necessary for the investment of €1.5 billion of this funding into ESB Networks has now passed all Stages and was signed into law by the President last month. Further legislation in relation to the investment in EirGrid will be progressed next year.  Last year the Department published the electricity storage policy framework for Ireland which supported the procurement of 500 MW of demand flexibility products by ESB Networks and 500 MW of long-duration electricity storage by EirGrid to meet specific network needs. Work is already under way to ensure the timely delivery of those projects. \n Deputy Pa Daly  I thank the Minister of State for the reply. As I said earlier, the figure for wasted energy was €250 million in 2023 but it is now almost half a billion euro. At the same time, hundreds of thousands of households are in debt and energy poverty has reached record levels. Approximately €1.3 million worth of energy has gone down the drain today. This would have heated 390 million water tanks but that 1.2 GW of power was lost forever. EnergyCloud has a model to divert this waste into a public good. It has a concept and case studies show that it would make a real difference to people's lives. The Government is making a political choice not to pursue this model. The Minister, nuair a thagainn sé ar ais, should at least acknowledge that the Government supports EnergyCloud. Then the necessary data can be prepared over the next six months in order to make progress and hit the ground running. \n Deputy Timmy Dooley  As the Deputy knows, the generation of electricity is one thing but the transmission of it is another. Oftentimes electricity is generated at locations where there is not demand for it and it has to be transmitted through the various different networks that exist. It is not as simple as taking it from one location to another because of the constraints that I talked about earlier. Of course, officials in the Department and the SEAI have met with representatives of EnergyCloud on a number of occasions. As I understand it, the approach taken to date by EnergyCloud has been to focus on approved housing body, AHB, and local authority homes. This has had the benefit of facilitating an aggregated and area-based approach. This is not something that can just be done in isolation.  The national energy affordability task force, following the publication of its first report, is now entering a new phase in its work. The task force is examining a range of matters, including the programme for Government commitment to explore whether legislation could be enacted to divert surplus renewable energy, that would otherwise be wasted, to homes in fuel poverty. \n Deputy Pa Daly  The reality is that there are difficulties with our grid, which is very constrained. Investment in the grid must take place, which the Minister of State mentioned in response to the previous question. However, the cost of that should not be borne by ordinary householders but by the State and by larger energy consumers. A big part of the problem is that data centres are taking up almost one third of Ireland's energy. The surge in energy demand from data centres has already led to housing not being delivered. One such example was in Portlaoise, where multiple families were told they could not move into their homes because an energy connection simply was not available. Similarly, investments that were intended for housing have, instead, been diverted to data centres because there is a first-come, first-served approach. That has to change. The energy regulator must be given the power to deal with that and to prioritise major grid infrastructure for major housing developments as opposed to giving all of our extra renewable energy directly to data centres. Will the Government commit today to moving away from the first-come, first-served model for grid connections and ensure that they are prioritised on a need basis? \n Deputy Timmy Dooley  I will be answering a question from Deputy Paul Murphy shortly on data centres but suffice to say that in the view of the Government data centres are a really important component of our growing economy and of the future in relation to the technological investment that we get here. Ireland has always been attractive to foreign direct investment which has been a bedrock of our industrial, economic and employment policy. There is little doubt that in recent years the focus has shifted from the pharmaceutical and medtech sectors, although both are still really fundamental drivers of our economy, and a new wave of investment is coming in data storage and the high-tech sector. Behind that, data centres are required. Efforts are often made by some in this House to suggest that this is some kind of folly but data centres today are what the advance factories were in the 1970s and 1980s.  They drive the economy, our education system, our hospitals and our banking system. Effectively, they are a repository for the information that sits behind the way we live our lives now. This is not just something we can just cast aside, bury our heads in the sand and say we should ignore it. We need to be mindful of that. If data centres do not end up in Ireland, they will end up somewhere else and we will lose out in the long term. However, I accept that we have to manage this matter. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 102. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment if he will report on the commitment in the programme for Government to “explore if legislation could be enacted to divert surplus renewable energy, that would otherwise be wasted, to homes in fuel poverty”; the progress that has been made on this; and if he will make a statement on the matter.  [72872/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_19",
          "debateSectionId": "dbsect_19",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_19.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_102",
        "questionNumber": 102
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  Deputy Farrell will take Question No. 110 on behalf of Deputy Pa Daly. \n Deputy Alan Dillon  The Government has taken steps with immediate and medium-term impact to improve the resilience of critical energy networks. In February 2025, the Minister, Deputy O'Brien, asked ESB Networks to prepare a winter resilience plan to enhance the grid in the most vulnerable locations following Storm Éowyn. That plan was updated in October.  Core work undertaken includes remedial work to the network; work with Coillte and the Department of Agriculture, Food and the Marine to identify segments of the network that are at the highest future risk; replenishing emergency stock, spare parts and materials; increasing staffing levels and available contractor resources; and establishing formal mutual aid arrangements for extreme weather events. ESB Networks is also increasing the number of access officers who engage with landowners on forestry works. We are preparing legislation to enhance ESB Networks' powers to manage vegetation and the Government approved heads of a Bill in July. Work on advancing that legislation continues as a matter of priority.  While those measures will have crucial short-term impacts, for the long term, significant investment in the electricity grid will support overall resilience. On Tuesday, 16 December 2025, the CRU published price review 6, PR6, which sanctions investment in the grid up to 2030. The CRU has proposed approval of an investment of up to €18.9 billion, with a €13.8 billion baseline investment guaranteed. Under the 2024 national adaptation framework, a new suite of sectoral adaptation plans across 13 key sectors, including electricity and gas networks, were recently approved and published by the Government. The national electricity and gas sectoral plans align with the aim of the critical entities resilience directive, to enhance the future resilience of the energy grid to the long-term impacts of climate change. \n Deputy Mairéad Farrell  Last night, thousands of households across Connemara were without power again. There was a storm and lightning. No one is going to blame the Government for lightening or a storm by any stretch of the imagination. However, we have a situation where every two weeks I get a text from someone who lives in Connemara to tell me the electricity has gone out again. Over the summer months, it is every month. Therefore, we clearly have an issue specific to the Connemara area.  The Minister of State mentioned Storm Éowyn and it was horrific, but equally Storms Bert and Darragh had serious implications for electricity and telecommunications in the Connemara area. We need a clear action plan from the Government now to deal with these crises as they are happening. Unfortunately, it does not seem like the work was done since last December and January to alleviate these pressures. \n Deputy Alan Dillon  I thank the Deputy for raising her concerns on behalf of her constituents in Connemara. That is why we published PR6 this week, which is one of the largest investments in the history of the State. More than 500 capital projects will be delivered as part of the programme and, as I said earlier, we are placing resilience at the centre of this policy to ensure we can deal with energy emergencies and severe weather events. That is why we established the national emergency co-ordination group, chaired by the Department of housing and a co-ordinated with a national response. That certainly aligns with energy actions.  As I said earlier, we have introduced a number of operational measures and we need to continue to work with ESB Networks and EirGrid to build resilience into our network. We also approved heads of a Bill in July for the ESB Networks' statutory corridor powers because we have had difficulties in the past accessing major works.  That is certainly something we will prioritise into 2026. \n Deputy Mairéad Farrell  To be very clear here, I welcome any investment that helps this situation. However, we need to be clear that there is a need for long-term investment because of so many decades of underinvestment in the basic infrastructure in Connemara. That is why we have poles that are pushed over on their sides and cables still on the ground. We also need to look at what can be done immediately to alleviate this situation. It does not make sense for areas to have power outages every two weeks. When there is a power outage or a bad storm, it impacts them for weeks. That does not make sense. The Minister of State cannot control the weather - I am not saying he can - but he can control how we respond to this. It is a year on from Storm Éowyn. I said very clearly at that time that while the Government could not have predicted it to be the way it was, urgent action was needed to ensure we do not leave ourselves as vulnerable again. I urge the Minister of State to take immediate action now, as well as having a long-term plan to alleviate these concerns. \n Deputy Alan Dillon  We hear the Deputy loud and clear on this side of the House. I acknowledge the tremendous work of all the operators and workers within ESB Networks who have gone above and beyond. We saw that during Storm Éowyn when they reassured us that they were working day and night to get supply back to many households. That is why the Government has responded. We have allocated over €1.5 billion to ESB Networks. That was approved through the national development plan and legislated for last month. That will, in one sense, lower finance costs for ESB Networks. It will support the delivery at pace. We want to see that in west Galway, Mayo and all across the country. We want to ensure we have limited impact across the network when we have severe weather events. We will continue that investment over the next number of years. As I said earlier, unprecedented investment in our energy grid will support resilience and ensure we can get connections to those 300,000 homes we want delivered by 2030. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 110. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment the steps he is taking to make critical energy infrastructure more resilient to extreme weather events; and if he will make a statement on the matter. [72818/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_27",
          "debateSectionId": "dbsect_27",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_27.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_110",
        "questionNumber": 110
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Réada Cronin  Has the Minister of State conducted an analysis of the impact of the introduction of the carbon border adjustment mechanism, CBAM, on the price of energy? \n Deputy Alan Dillon  CBAM is an instrument implemented by the European Union to address the risk of carbon leakage. The EU's ambition is to become climate neutral by 2050. CBAM will aim to ensure that imported goods are subject to a carbon price equivalent to the carbon price of domestic production in the EU. CBAM affects the electricity sector by putting a price on emissions associated with electricity produced in countries outside the EU and imported into the EU. It aims to encourage sustainable practices and reduce carbon footprint. For electricity importers, compliance with CBAM initially involves reporting direct emissions associated with electricity production as an imported good from third countries on a quarterly basis, relying on supplier information.  The simplification package that was published in February and adopted in October permits the European Commission to more accurately reflect the carbon price paid, including for imports from Britain, which Ireland welcomes. CBAM is currently evolving at a rapid pace. The week ending 12 December saw voting taking place on some of the implementing regulations and acts, and other votes are to follow in the days and weeks ahead. At this time, until the exact details are clear, any estimation regarding the cost of CBAM in relation to electricity imports is likely to be inaccurate. Overall, CBAM provides an opportunity for the electricity sector to embrace sustainability and contribute to environmental protection by positioning businesses as socially responsible and environmentally conscious players in the market. \n Deputy Réada Cronin  I thank the Minister of State for his reply. It is really important that this analysis is conducted. We import 70% of our energy. The EU average is 58%, so we are importing a lot more than normal countries. We are also importing more energy from Britain. The introduction of the CBAM will affect the prices that households, consumers and families are paying. The Government said that energy emissions will fall by up to 68% between 2026 and 2030 when compared with 2018, but that figure is misleading because we are relying more and more on imported energy. We do not know where that energy is produced so we cannot pretend the emissions have disappeared. It is a bit of a distortion. For the families who might be listening in, this is not about climate targets; it is about energy bills. Will the Minister of State tell us clearly whether CBAM will push up energy prices? If he cannot answer that question for me today, will he commit to doing an analysis on how CBAM will affect prices for struggling households? \n An Leas-Cheann Comhairle  Deputy Brennan has a question. \n Deputy Brian Brennan  I am just coming in on sustainability. I really feel the key to this is the warmer homes scheme. It is an excellent scheme that is being operated at the moment by the SEAI. Will the Minister of State update me on efforts being made to reduce waiting times for people who have applied for the warmer homes scheme because this will be a key part of reducing the amount of energy consumed and meeting our targets? \n Deputy Alan Dillon  They are two different topics but I will answer the first one. \n An Leas-Cheann Comhairle  I thought Deputy Brennan was coming in on this question. \n Deputy Réada Cronin  He has chanced his arm. \n Deputy Alan Dillon  Yes. I thank the Leas-Cheann Comhairle. \n An Leas-Cheann Comhairle  He has cleverly used his time. \n Deputy Alan Dillon  On the first question, it is not accurate at this time to talk about increased energy prices. CBAM is still in a transitional phase. We are working very closely with the European Commission on adopting a simplification package - this arose in October - to clarify how we will be reporting and how carbon prices will be aligned. Until the Act is implemented or finalised early next year, any cost estimates would be speculative and misleading. We have a number of engagements with the European Commission. It is working very closely with the UK on how we carry carbon costs and how they are aligned to the EU emissions trading system price. We are very much focused on encouraging cleaner generation globally.  Deputy Brennan mentioned the excellent warmer homes scheme, which is supporting those who are finding it difficult to maintain rising energy bills. The scheme has one of the largest budgets into 2026, of over €230 million. It has been successful in that it has delivered over 7,700 grants to date. We are ramping up the number of contractors who can support the delivery of these warmer homes. We know how important it is to those who are waiting and who need these upgrades as quickly as possible. \n Deputy Réada Cronin  I want to talk about price review 6. Households in Ireland are paying much higher prices - some of the highest prices in Europe - and more and more families are falling into energy poverty and falling behind on their bills. Under price review 6, households and small businesses will be asked to pay even more while the large data centres will be paying less. Household charges could rise by 28% while data centres, which use the most energy, will see their energy prices reduced by 20%. It is just not fair. It is actually egregious. At the same time that energy credits have been taken away from people who are struggling, energy companies that are making huge profits are getting a reduction. One way to ease this pressure would be to change the PSO levy and the network charges so that data centres pay their fair share. Will the Minister of State commit to a restructure of the PSO levy? Will he show that he is full of the Christmas spirit, as I was when I shared my question? \n Deputy Alan Dillon  With regard to the Government's commitment, in recent weeks we have seen huge announcements about investment in our electricity and energy system. It is unprecedented and akin to rural electrification. Over €18.6 billion is being invested to reinforce our grid through a number of capital projects. Over 500 capital projects will be delivered right across the country.  We are very much focused on ensuring we can connect the over 300,000 new homes that we have committed to out to 2030, and on continuing to support enterprise and industry. We have heads of Bill for the private wires legislation coming before the House. That will go through committee and both Houses in 2026. It will certainly act as a catalyst for private investors to invest in electricity generation that can support many industries right across the country. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 113. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment if he has conducted an analysis on the introduction of CBAM on the price of energy; and if he will make a statement on the matter. [72821/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_28",
          "debateSectionId": "dbsect_28",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_28.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_113",
        "questionNumber": 113
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The commitments in the Programme for Government are framing the work underway by my Department in continued delivery and development of the Sustainable Energy Authority of Ireland's (SEAI) residential and community energy upgrade schemes.  The Climate Action Plan sets out actions and measures to be taken to achieve sectoral emissions ceilings for the residential sector. These measures include the retrofit of existing homes and installation of heat pumps to support the achievement of the required emissions reductions.  The most recent SEAI data show that emissions from the residential sector are likely to remain within their sectoral ceiling in the first carbon budget period (to end 2025).  The SEAI has a number of schemes in place to support homeowners to upgrade their properties, thereby allowing homeowners to choose the best home upgrade option to suit their particular needs. These include a number of part-funded schemes and the fully-funded Warmer Homes scheme.  Between 2019 and November 2025, the SEAI residential and community retrofit schemes have provided over €1.6 billion of support to homeowners across the country. This expenditure has resulted in 239,118 home energy upgrades, including over 81,200 BER B2 upgrades and 32,800 fully funded upgrades under the Warmer Homes Scheme.  Budget 2026 has provided record funding of €558 million for the SEAI residential and community energy upgrade schemes next year. This is an increase of €89 million on the Budget 2025 allocation. This funding is expected to be further supplemented with additional monies, such as an allocation from the European Regional Development Fund, which will provide for an increase in the allocation for the Warmer Home Scheme. These allocations will be published as part of the Revised Estimates Volume.  The Programme for Government commits to ramping up the achievement of retrofit targets through continued delivery of the SEAI residential and community energy upgrade schemes, including revising and improving the provision of grants and financing models for homeowners who wish to retrofit, enhancing energy efficiency and reducing costs; as well as the supporting group retrofitting projects and area-based approaches to retrofitting.  Increasing the uptake of energy efficiency upgrades and measures among homeowners is a key priority for my Department and as such, my officials, in partnership with their colleagues in the SEAI, continue to work to deliver in line with the National Retrofit Plan and Programme for Government commitments. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 130. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment if he will report on the commitment in the Programme for Government to “revise and improve the provision of grants and financing models for homeowners who wish to retrofit, enhancing energy efficiency and reducing costs” and to “ensure all grants and schemes are accessible to older people in our community”; the progress made following the first year of Government; and if he will make a statement on the matter. [72819/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_161",
          "debateSectionId": "dbsect_161",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_130",
        "questionNumber": 130
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  In advance of the recent auction to procure 900 MW of ORE at the Tonn Nua site in the South Coast DMAP, my Department collected through procurement or from surveys, geophysical, geotechnical and metocean data to examine site conditions in support of the auction process.  The publication of these datasets contributed to the success of that auction by informing and de-risking the process for potential bidders, by evaluating the suitability of the site for ORE development and identifying potential challenges to that development.  Similar surveying work will take place at the Lí Bán site in 2026 and a surveying programme to 2030 is being developed by officials in my Department to conduct these works at other sites earmarked for ORE development.  The report which is referred to, the Offshore Wind Technical Resource Assessment, was published by my Department in May of this year and can be accessed on gov.ie  The Technical Assessment [ ]puts forward several recommendations regarding Ireland’s approach to offshore wind development, including fixed and floating turbines, supply chain management and cross-border co-operation, which includes interconnection projects.  It is important to clarify that this Technical Assessment's quoted figures of a potential to develop 3-18 gigawatts of offshore wind energy is additional to the 3.8 gigawatts anticipated from the phase one projects and the approximately 4.5 gigawatts expected to be developed in the South Coast DMAP areas. The sum total of these figures, at around 26 gigawatts , far outstrips our 2040 targets as well as foreseeable energy demand. Finally, the figure also does not include any floating wind, our potential for which is estimated by that same Technical Assessment at over 90 gigawatts. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 147. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment the impact the suitability of Ireland’s waters will have on the development of offshore wind in Ireland (details supplied) and on reaching our climate targets; if he will outline the recommendations of a report he recently received on the matter (details supplied); and if he will make a statement on the matter. [72820/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_177",
          "debateSectionId": "dbsect_177",
          "showAs": "Offshore Renewable Energy Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_147",
        "questionNumber": 147
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 153, 163 and 166 together.  In recent years, Government introduced a suite of measures to help households and businesses deal with higher energy costs. This included the provision of electricity credits to households worth €1,500 over four credit schemes, with a total cost of €3.3 billion. These universal credits were always envisaged as temporary, emergency measures because, while necessary at the time, they are not fiscally sustainable nor do they address the structural drivers of high energy costs.  The National Energy Affordability Taskforce was established in June of this year to identify, assess and implement measures that will enhance energy affordability for households and businesses. The first report of the taskforce, which was published last month, set out measures for consideration as part of the Budget 2026 process. Many of these options were reflected in Budget decisions. Examples of targeted Budget measures aimed at improving energy affordability include:  • the Fuel Allowance increasing by €5 per week to €38, supporting over 450,000 households who most require Government assistance to meet their energy costs;  • to directly support working families, the Fuel Allowance has been extended to recipients of the Working Family Payment. This will benefit over 43,000 families;  • from September 2026, those who move from Disability Allowance or Blind Pension to employment will be able to retain the Fuel Allowance for five years; and  • record funding of €558 million is being allocated for Sustainable Energy Authority of Ireland residential and community energy upgrade schemes (including the solar PV scheme) in 2026. This allocation will support the highest ever budget for the Warmer Homes Scheme, which is targeted at households in energy poverty.  In addition, the VAT reduction (from 13.5% to 9%) on electricity and gas bills has been extended to the end of 2030, saving households up to €100 per year.  It is important to note that the Department of Social Protection can also provide support through the Additional Needs Payment to help households meet expenses, including those who face difficulties with fuel bills. There are also a range of CRU customer protections are in place, including disconnection moratoria.  The National Energy Affordability Taskforce is now preparing an engagement and consultation process to inform the development of an action plan to be published mid-2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 163. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment the information he received from his officials regarding the impact of the withdrawal of energy credits on the number of people living in arrears; his reasoning for withdrawing the credits in this context; the steps he is taking to reduce the number of people in arrears; and if he will make a statement on the matter. [72817/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_183",
          "debateSectionId": "dbsect_183",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_183.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_163",
        "questionNumber": 163
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The European Central Bank is responsible for monetary policy and the setting of official interest rates. Its main lending rate is currently 2.15%.  While changes in the level of official interest rates will feed through to the wider economy, it does not have a uniform impact on the level of retail interest rates. In a market economy the determination of retail and business lending rates is a commercial matter for individual creditors.  The most recent Central Bank data shows the weighted average interest rate on new mortgages was 3.56% in October. Although this is above the euro area average of 3.33%, it is almost half a percent lower than the same time last year.  While the weighted average new mortgage rate exceeded the euro average by 23 basis points in October of this year, it can be noted that this differential has narrowed over the course of the past twelve months from 51 basis points in October 2024.  The Government, in Budget 2026, maintained the mortgage interest tax credit at the current level for a further year and at a reduced level of relief for the subsequent year. This relief helps to offset the impact of the rising cost of living by providing Mortgage Interest Tax Relief for homeowners with an outstanding mortgage balance on their primary dwelling house of between €80,000 and €500,000 as of 31 December 2022. This Relief was extended in Budget 2025 and Budget 2026.  The Central Bank, through its regulatory framework, offers protection for consumers and requires that all regulated entities, including banks, retail credit firms and credit servicing firms, are transparent and fair in all their dealings with borrowers.  The revised and strengthened Consumer Protection Code will come into effect next March and will set out enhanced disclosure requirements on mortgage switching options and the impact of incentives on the overall cost of credit of a mortgage.  The banking industry has adopted an aligned industry-wide set of initial eligibility criteria to facilitate switching mortgages from a non-bank to a bank and it has introduced a website, called 'it's in your interest', to assist the mortgage switching process. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 182. Deputy Pa Daly asked the Tánaiste and Minister for Finance if he is aware Irish homeowners are paying some of the highest interest rates in the EU despite ECB rates being 2% since June 2025; and if he will make a statement on the matter. [72579/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_197",
          "debateSectionId": "dbsect_197",
          "showAs": "Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_197.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Firstly, I would like to address the Deputy by saying that I am aware of the latest report from the Irish Fiscal Advisory Council (IFAC) and the Climate Change Advisory Council (CCAC) highlighting the potential compliance cost implications of climate change and emissions reductions targets for Ireland. I can assure the Deputy that similar analysis is being undertaken across Government in this area, and my officials are engaged with other Departments on this work. It must be acknowledged however that there is considerable uncertainty around the emissions figures and therefore cost estimates are speculative at this stage.  Secondly, the main objective of Government policy has been, and continues to be, achieving compliance with our targets through reducing emissions and increasing renewable energy generation. The agreed Programme for Government restates our determination that Ireland, together with our EU partners, will play its full part in tackling climate change. The Environmental Protection Agency (EPA) has shown that emissions reductions are being made with Ireland’s greenhouse gas emissions decreasing for the last three years. However, we in Government also acknowledge that there is an imperative to go further taking climate action faster and at scale, particularly over the next five years.  To this extent, our contingency plan is clearly stated across the many iterations of our Climate Action Plans. The Climate Action Plan 2025 (CAP25) provides a roadmap for halving Ireland’s emissions by 2030 and reaching net zero by no later than 2050, as committed to in the Climate Action and Low Carbon Development (Amendment) Act 2021. The Government has been delivering by improving our electricity system, through investing in renewables sources of energy, by increasing public transport as well as the electric vehicle (EV) share of passenger cars, by ensuring over half-a-million people insulate their homes with technologies like heat pumps and district heating, and by supporting nature restoration, to name but a few measures.  Finally, as Deputy will be aware, Government is committed to a carbon tax regime that is progressive with revenue raised from increases in the carbon tax since 2020 being allocated for expenditure on climate action and the just transition. The additional revenue raised by increasing the carbon tax is ring-fenced and used to enable transitional changes, to encourage the greening of agriculture, and to provide targeted social welfare and other measures to prevent energy poverty. For your information, more than €1 billion of carbon tax revenue was allocated as part of Budget 2026 to climate action measures, including sustainable farming and protection of the most energy-insecure in society. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 217. Deputy Pa Daly asked the Tánaiste and Minister for Finance the contingency plans which exist for the potential €26 billion in fines Ireland could face if climate targets are missed; if he has met with the Minister for the Environment; Climate and Communications or the Taoiseach to address this; and if he will make a statement on the matter. [72580/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_231",
          "debateSectionId": "dbsect_231",
          "showAs": "Climate Action Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_217",
        "questionNumber": 217
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The latest available Commission for Regulation of Utilities (CRU) arrears data (September 2025) shows that there are currently 297,313 customers in electricity arrears. This is a 3.4% decrease from the August figure of 307,862. For those in arrears more than 90 days, 187,307 electricity customers were in arrears in September 2025, a slight decrease of 0.7% from August 2025 which was 188,618.  There are many variables, including those related to changing energy costs, the wider health of the economy, and seasonal variation in energy consumption, which may influence arrears levels. Analysis presented in the interim report of the National Energy Affordability Taskforce suggests that while the distribution of electricity credits in recent years directly reduced arrears levels upon application, they did not impact longer-terms trends in the level of domestic energy bill arrears.  Government has reduced the level of electricity credits on a gradual basis across successive schemes, in recognition that they were always intended to be a temporary, emergency measure and were not fiscally sustainable in the longer-term.  The CRU is currently reviewing its market monitoring framework through which retail market data is collected and reported upon. The review aims to provide more granular information to gain a better understanding of the numbers of customers who may be in energy distress and in need of support with their debt. This analysis will inform the work of the National Energy Affordability Taskforce, which will include the development of targeted measures to assist households most vulnerable to energy cost pressures. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 289. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment if he anticipates arrears will increase following the withdrawal of energy credits. [73655/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_295",
          "debateSectionId": "dbsect_295",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_295.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_289",
        "questionNumber": 289
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 141, 143 and 290 together.  The Climate Action Plan sets out policies, measures and actions to be taken to achieve sectoral emissions ceilings for the residential sector. These measures include the retrofit of existing homes and installation of heat pumps to support the achievement of the required emissions reductions.  The National Retrofit Plan sets out the Government’s approach to delivering on these targets. The plan itself is built on four key pillars of demand, supply, financing and governance, with actions and initiatives flowing from each.  A range of measures has been introduced under the National Retrofit Plan across recent years to support continued growth, including simplifying application processes, expanding eligibility, prioritising worst performing homes, expanding deep retrofits, growing the numbers of One Stop Shops, as well as progressing projects piloting new supports.  The measures introduced are translating into delivery. SEAI data show that in the ten years since 2015 almost 274,000 home energy upgrades were supported and, of these, almost 60,500 were to a BER B2 or better energy efficiency rating, representing sustained and significant increases each year. This is despite the significant interruption across most of 2020 and 2021 due to the COVID-19 pandemic. Regarding 2025, data from SEAI to end November show the number of home energy upgrades at 52,416 of which 23,304 were to a BER rating of B2 or higher.  Budget 2026 announced a record Exchequer funding allocation of €558 million from the carbon tax for SEAI residential and community energy upgrades, including the Solar PV Scheme. This is an €89 million increase on last year’s carbon tax allocation and means that more funding than ever will be available to make homes warmer, healthier and less expensive to heat.  Increasing the uptake of energy efficiency measures among homeowners continues to be a key priority for my Department working in partnership with the SEAI. Further policies and measures will be introduced on an annual basis to support the achievement of our retrofit and heat pump targets.  The most recently published statistics for SEAI residential and community energy retrofit programmes by scheme, county, measure type, and more can be found on the SEAI website at: www.seai.ie/grants/home-energy-grants/home-upgrades ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 290. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment to provide a breakdown, per county, of the number of households that have participated in the Government's retrofitting scheme broken down by programme in each of the years 2020 to 2025; and if he will make a statement on the matter. [73656/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_290",
        "questionNumber": 290
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  One of the primary roles of my Department is to support the realisation of Ireland’s long-term objective of creating a climate-neutral, sustainable, and economically prosperous Ireland, by collaboratively delivering policies and programmes to empower people, communities, and businesses to continue the transition to a better quality of life for current and future generations. The timely delivery of enabling infrastructure is central to achieving this objective. Investment in electricity networks, renewable energy generation, storage, interconnection and supporting systems is essential not only to meet Ireland’s climate targets, but also to underpin energy security, reduce exposure to volatile international fossil fuel markets, and deliver long-term cost benefits for consumers, both households and businesses.  The actions set out in the Accelerating Infrastructure Report and Action Plan recognise that infrastructure delivery is not an end in itself, but a critical enabler of wider economic, environmental and social outcomes. For my Department, this means ensuring that infrastructure planning, regulation and delivery frameworks are fit for purpose, proportionate and capable of responding to the pace of change required by the energy and climate transitions. It also means supporting our agencies to operate effectively and independently within their statutory roles, while fostering public acceptance, citizen engagement, coherence and coordination across the system as a whole. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 299. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment to outline how the Government’s new proposals regarding critical infrastructure will impact on infrastructural projects under his remit; and if he will make a statement on the matter. [73783/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_302",
          "debateSectionId": "dbsect_302",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_302.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_299",
        "questionNumber": 299
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Government policy is supportive of the expansion of district heating and recognises the contribution it can make to Ireland’s energy and climate goals. The District Heating Steering Group Report, which contains a suite of recommendations for the development of district heating in Ireland was approved by Government in 2023. A District Heating Working Group has been convened to oversee implementation of the Steering Group recommendations.  To date, there is a single district heating project operational in Tallaght which was developed by South Dublin County Council. The project was supported through the Climate Action Fund (CAF). Phase 2 of this project is now being planned and evaluated by South Dublin County Council. In addition, Dublin City Council is leading the development of the Dublin District Heating Project.  The Sustainable Energy Authority of Ireland (SEAI), through Pathfinder, have enabled funding support for Local Authorities conducting feasibility studies for district heating projects. The Government also approved the allocation of €5 million from the CAF to support pre-construction development costs for efficient district heating projects in Ireland. The expression of interest for this fund launched in November 2025. Support for the pre-construction costs is being used to bridge the gap for district heating projects until significant capital funding is in place.  Under the National Development Plan, for the period 2026 to 2030, up to €100 million has been allocated to support the development of district heating networks. This level of funding demonstrates the Government’s ongoing commitment to district heating as a core component of Ireland’s decarbonisation strategy.  In addition, the SEAI are leading on work to feed into the overall Long-term Strategy for District Heating. This includes development of a National Level Assessment and a comprehensive advisory project, being conducted in partnership with the European Investment Bank's InvestEU Advisory Hub. In tandem, my Department is working on the Heat (Networks and Miscellaneous Provisions) Bill to introduce a regulatory framework for district heating. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 300. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment to provide an update on the progress on district heating; the funding available; the funding that has been drawn down; and if he will make a statement on the matter. [73796/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_303",
          "debateSectionId": "dbsect_303",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_303.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_300",
        "questionNumber": 300
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 301 and 302 together.  The Home Energy Upgrade Loan Scheme (HEULS), which launched in April 2024, is intended to play a crucial role in helping homeowners invest in energy upgrades to make their homes warmer, healthier and more comfortable, with lower emissions and lower bills. It was developed by my Department, in conjunction with the Department of Finance, the Strategic Banking Corporation of Ireland (SBCI), the Sustainable Energy Authority of Ireland (SEAI) and the European Investment Bank Group.  The scheme is available nationwide and homeowners can borrow from €5,000 to €75,000 on an unsecured basis for a term of up to 10 years at significantly lower interest rates to those currently on the market. Rates start from as low as 2.99% with price varying depending on the finance provider. PTSB was the first lender to join in April 2024, with AIB and Bank of Ireland joining in June 2024. In 2025, the group of participating lenders has been expanded to include Avant Money (in partnership with An Post) and seven credit unions from the Irish League of Credit Unions.  At the end of September 2025, there were 776 loans drawn to a value of €38,258,801 since the scheme launched. The SBCI provide a regional breakdown of loan uptake on a quarterly basis. The Deputy may wish to note that as uptake figures in certain counties mean that it could be possible to identify individual homeowners, these figures have not been disclosed. Instead, cumulative uptake figures by region are provided in the table below.  Under the scheme, once approved, loans can be drawn before works begin. Once the energy upgrades have commenced, they often take a year or more to complete, depending on how comprehensive the project is. The post-BER can only be determined once a project is complete. By 30 September 2025, 206 home energy upgrades were completed and the average BER uplifts are provided in the table below.  In line with the Programme for Government’s commitment to “ Promote the €500 million Home Energy Upgrade Loan Scheme, offering low interest loans for home energy upgrades, from €5,000 to €75,000 ”, my Department continues to work closely with the SBCI, the SEAI and the participating finance providers to increase awareness of, and demand for, the scheme and drive additional uptake in 2025 and beyond.  The Deputy may wish to note that further information and quarterly reports related to the HEULS are available here: www.gov.ie/en/department-of-climate-energy-and-the-environment/publications/home-energy-upgrade-loan-scheme/  Table 1: Cumulative drawdown figures by region      Region      Number of drawdowns to end 2024      Number of drawdowns to end Q3 2025       Border    21    115      Dublin    76    225      Mid-East    34    94      Midlands    12    26      Mid-West    27    75      South-East    19    51      South-West    49    111      West    40    79       Total      268      776        Table 2: Completions by BER uplift      Initial BER      Upgraded to A1      Upgraded to A2      Upgraded to A3      Upgraded to B1      Upgraded to B2      Grand Total by end Q3 2025       B3    19    6                25      C1    17    9    5            31      C2    11    3    5    3        22      C3    15    5    4            24      D1    5    6    6    2    5    24      D2    3    5    4    2    4    18      E1    6    4    6    1    1    18      E2    4    4    3    1    1    13      F    5    2    1            8      G    5    6    8    4        23       Grand Total      90      50      42      13      11      206       ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 301. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment to provide a breakdown of the number of households who have availed of the loan for retrofitting, broken down by county and by year, since the schemes inception, in tabular form. [73833/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_301",
        "questionNumber": 301
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 301 and 302 together.  The Home Energy Upgrade Loan Scheme (HEULS), which launched in April 2024, is intended to play a crucial role in helping homeowners invest in energy upgrades to make their homes warmer, healthier and more comfortable, with lower emissions and lower bills. It was developed by my Department, in conjunction with the Department of Finance, the Strategic Banking Corporation of Ireland (SBCI), the Sustainable Energy Authority of Ireland (SEAI) and the European Investment Bank Group.  The scheme is available nationwide and homeowners can borrow from €5,000 to €75,000 on an unsecured basis for a term of up to 10 years at significantly lower interest rates to those currently on the market. Rates start from as low as 2.99% with price varying depending on the finance provider. PTSB was the first lender to join in April 2024, with AIB and Bank of Ireland joining in June 2024. In 2025, the group of participating lenders has been expanded to include Avant Money (in partnership with An Post) and seven credit unions from the Irish League of Credit Unions.  At the end of September 2025, there were 776 loans drawn to a value of €38,258,801 since the scheme launched. The SBCI provide a regional breakdown of loan uptake on a quarterly basis. The Deputy may wish to note that as uptake figures in certain counties mean that it could be possible to identify individual homeowners, these figures have not been disclosed. Instead, cumulative uptake figures by region are provided in the table below.  Under the scheme, once approved, loans can be drawn before works begin. Once the energy upgrades have commenced, they often take a year or more to complete, depending on how comprehensive the project is. The post-BER can only be determined once a project is complete. By 30 September 2025, 206 home energy upgrades were completed and the average BER uplifts are provided in the table below.  In line with the Programme for Government’s commitment to “ Promote the €500 million Home Energy Upgrade Loan Scheme, offering low interest loans for home energy upgrades, from €5,000 to €75,000 ”, my Department continues to work closely with the SBCI, the SEAI and the participating finance providers to increase awareness of, and demand for, the scheme and drive additional uptake in 2025 and beyond.  The Deputy may wish to note that further information and quarterly reports related to the HEULS are available here: www.gov.ie/en/department-of-climate-energy-and-the-environment/publications/home-energy-upgrade-loan-scheme/  Table 1: Cumulative drawdown figures by region      Region      Number of drawdowns to end 2024      Number of drawdowns to end Q3 2025       Border    21    115      Dublin    76    225      Mid-East    34    94      Midlands    12    26      Mid-West    27    75      South-East    19    51      South-West    49    111      West    40    79       Total      268      776        Table 2: Completions by BER uplift      Initial BER      Upgraded to A1      Upgraded to A2      Upgraded to A3      Upgraded to B1      Upgraded to B2      Grand Total by end Q3 2025       B3    19    6                25      C1    17    9    5            31      C2    11    3    5    3        22      C3    15    5    4            24      D1    5    6    6    2    5    24      D2    3    5    4    2    4    18      E1    6    4    6    1    1    18      E2    4    4    3    1    1    13      F    5    2    1            8      G    5    6    8    4        23       Grand Total      90      50      42      13      11      206       ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 302. Deputy Pa Daly asked the Minister for Climate, Energy and the Environment to provide a breakdown of the pre- and post-BER rating of the households who have availed of the loan for retrofitting, in tabular form. [73834/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_302",
        "questionNumber": 302
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The National Transport Authority (NTA) is the independent transport regulator of the taxi sector, and I am not involved in the day-to-day operations of that sector.  I wrote to the NTA in November to request clarification on the regulatory position on the Uber fixed price fare for the information of taxi operators and public representatives alike. In its response to my letter, I was advised by the NTA that the charging of a fixed fare is in accordance with the applicable regulations. I have also been advised that the NTA continues to keep the regulatory model under review. Senior officials from my department met with the NTA to discuss the response on 09 December last.  I also formally requested the urgent consideration of the matter at a special meeting of the Advisory Committee on Small Public Service Vehicles, (whose role is to advise the Minister for Transport and NTA on matters relevant to SPSVs and their drivers), which took place on 11 December last.  Minutes of this meeting and the list of attendees will be published on the NTA's website here: www.nationaltransport.ie/about-us/advisory-committee-on-spsvs/advisory-committee-on-small-public-service-vehicles-meetings/ when available  The structure of the SPSV market has undoubtedly changed over the last number of years, particularly in relation to the role of dispatch operators. With this in mind, I have requested that the NTA conducts a regulatory assessment of dispatch operator licensing in Ireland in the context of ensuring that the regulatory framework for this element of the overall sector is sufficiently up to date and robust to respond to developments in the SPSV market since the enactment of the Taxi Regulation Act 2013. In addition, I have requested that all stakeholders are given the opportunity to feed into this work as soon as possible, and I intend to meet representatives of the taxi sector in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 329. Deputy Pa Daly asked the Minister for Transport the engagements he has had with the taxi industry in relation to the introduction of the fixed fare model since the six day set of disruptions was called off; the dates on which these meetings took place; who was present; and if he will make a statement on the matter. [73652/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_331",
          "debateSectionId": "dbsect_331",
          "showAs": "Taxi Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_331.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_329",
        "questionNumber": 329
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 330. Deputy Pa Daly asked the Minister for Transport the measures he is taking to address the fact the number of road deaths in 2025 has outstripped 2024; and if he will make a statement on the matter.  [73653/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_332",
          "debateSectionId": "dbsect_332",
          "showAs": "Road Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_332.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_330",
        "questionNumber": 330
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  At the outset, the Deputy should note that both I and the Government are conscious of the implications of fuel costs for all sectors of society.  As regards taxation, Ireland’s application of excise duty on fuel is governed by European Union law as set out in Directive 2003/96/EC, commonly known as the Energy Tax Directive. The Energy Tax Directive prescribes minimum excise duty rates for fuel with which all Member States must comply.  While taxation affects the final retail price of fuel, a number of factors also contribute to the final cost including energy market dynamics, wholesale pricing, individual retail pricing policy, transport costs, and exchange rate fluctuations. The best way of insulating our economy and society from fuel prices shocks is to reduce our dependence on fossil fuels.  The Government currently has incentives in place to promote investments in renewable and low-carbon energy products, such as HVO and other biofuels. Biofuels, such as Hydrotreatred Vegetable Oil (HVO), are relieved from the Carbon tax. This favourable tax treatment is intended to promote a higher level of biofuel usage and supports the Government’s commitment to incentivising more environmentally friendly alternatives to fossil fuels.  Furthermore, Carbon Tax revenues are ring-fenced for climate action and just transition measures. Analysis undertaken using SWITCH, the ESRI tax and benefit model, to simulate the impact of the carbon tax increase and the compensatory welfare package estimates that the net impact of the combined measures is progressive. Half of households are better off due to the measures part-funded by additional carbon tax funds, with households in the bottom four income deciles benefitting the most. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 331. Deputy Pa Daly asked the Minister for Transport the measures he is taking to reduce the cost of petrol and diesel; and if he will make a statement on the matter. [73654/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_333",
          "debateSectionId": "dbsect_333",
          "showAs": "Fuel Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_333.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_331",
        "questionNumber": 331
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Accelerating Infrastructure - Report and Action Plan, as well as the work of the taskforce which has been established in relation to the report and plan, fall under the remit of my colleague the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation.  The possible proposals for change within the infrastructure project delivery system are not yet clear, as the taskforce continues its work. However, when considering the delivery of any ongoing or future transport infrastructure project, and in particular those larger and strategically important ones such as Metrolink, my Department and the agencies which support those projects, continue to put in place efficient and effective resources and planning to meet the project needs. This is both against key performance indicators such as timeline and budget control, as well as overall delivery of the project in the context of its purpose, challenges and benefits.  My Department and I look forward to reviewing the outcomes and recommendations of the Accelerating Infrastructure taskforce and we will seek to integrate or align any transport infrastructure projects with any changes to strategic infrastructure delivery practices once they have taken effect.  ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 337. Deputy Pa Daly asked the Minister for Transport to outline how the Government’s new proposals regarding critical infrastructure will impact on infrastructural projects under his remit; and if he will make a statement on the matter. [73784/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_339",
          "debateSectionId": "dbsect_339",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_339.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_337",
        "questionNumber": 337
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. In line with Section 32 (2) of the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. Investment in Greenway and National Roads Active Travel projects is also subject to the requirements of the Infrastructure Guidelines and necessary statutory approvals.  Noting the above position, I have referred your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 338. Deputy Pa Daly asked the Minister for Transport to provide an update on planned greenway projects, broken down by county; their current status; when he expects each project to be completed; and if he will make a statement on the matter. [73799/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Greenways Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_338",
        "questionNumber": 338
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants. The initial selection and prioritisation of works to be funded is a matter for the local authority.  On 14th February 2025 I announced an Exchequer investment of €713 million in our regional and local roads across the State which represents an overall increase of over 8% in funding this year.  Following a mid-year review of regional and local road grant programme expenditure, local authorities were notified of an additional allocation of €10 million for their Restoration Improvement Programmes. This additional funding was welcomed by local authorities and was fully expended by year end.  As regards the funding allocated to and drawn down by each local authority for the maintenance and improvement of regional and local roads in 2025, details of the regional and local road allocations and payments to local authorities are outlined in the regional and local road allocations and payments booklets which are available on the Oireachtas Digital Library. The 2025 payments booklet will be available on the Oireachtas Digital Library shortly.  As regards 2026, regional and local road grant allocations will be finalised following the publication of the Revised Estimates Volume and will take into account the expenditure outturn on projects and programmes in the preceding year. Within the budget available, the objective is to allocate funding to eligible local authorities on as equitable a basis as possible taking the length of the road network into account. The main focus of the grants continues to be the protection and renewal of the regional and local road network.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to this.  The allocations process for national roads in 2026 is underway and allocations will be announced in the coming weeks.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 339. Deputy Pa Daly asked the Minister for Transport if he will be providing additional funding for road resurfacing in 2025, broken down by local authority; and the total allocations to each council in 2026, in tabular form. [73836/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_341",
          "debateSectionId": "dbsect_341",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_341.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_339",
        "questionNumber": 339
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy will be aware, neither I as Tánaiste and Minister for Finance nor the Central Bank of Ireland can intervene directly in the pricing or provision of insurance products. These are commercial decisions for insurers, taken in line with EU law, specifically the Solvency II Directive, which governs the operation of the Single Market for insurance.  Ireland’s reform programme has helped shield consumers from sharper premium increases experienced elsewhere. Between 2016 and 2024, motor insurance premiums increased by approximately 65 per cent in the UK and by around 20 per cent across the Eurozone. In contrast, Ireland experienced a proportional reduction of approximately 34 per cent over the same period. This reflects the impact of measures such as the Personal Injuries Guidelines, reforms to the duty of care, and legislative enhancements to the Injuries Resolution Board, all of which have reduced claims costs and improved consistency and predictability.  Nonetheless, I fully acknowledge concerns regarding motor insurance profitability and the ongoing cost of premiums for consumers. Transparency and reform remain central to the Government’s response. A key achievement in this area has been the establishment of the National Claims Information Database (NCID), operated by the Central Bank of Ireland. The NCID has significantly enhanced oversight of claims costs, income and profitability trends within the insurance market and is regarded internationally as a leading source of insurance data.  NCID data shows that the private motor insurance market, after experiencing sustained losses from 2011 onwards, returned to profitability in 2023. In 2024, the sector recorded a profit of approximately 4 per cent, compared with 8 per cent in 2023. This reduction reflects the once-off impact of capital reserve releases in earlier years, rather than a structural increase in insurer returns. When viewed over a longer timeframe, profitability in the motor insurance market has remained cyclical in nature, underscoring the importance of assessing trends across multiple years rather than focusing on individual annual results.  Having said that it is also very important that the sector ensures good value for money and treats its customers in a fair and transparent manner. The affordability, transparency and availability of insurance will continue to be prioritised by Government through the new Action Plan for Insurance Reform, published in July 2025. As part of the Action Plan, a transparency code for the insurance industry is under development. The Code will require insurers to provide simple, understandable explanations of how premiums are formed and what broader factors influence pricing.  Government remains firmly committed to achieving a fairer, more sustainable and competitive insurance market, ensuring that the benefits of these reforms are fully realised, delivering tangible improvements in cost, choice, and access for all consumers. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 377. Deputy Pa Daly asked the Tánaiste and Minister for Finance the measures to address profits in the motor insurance industry; and to decrease the cost of premiums; and if he will make a statement on the matter. [73657/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_370",
          "debateSectionId": "dbsect_370",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_370.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_377",
        "questionNumber": 377
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 362 and 379 together.  Liquid fuels used for motor or heating purposes are subject to excise duty in the form of Mineral Oil Tax (MOT). MOT comprises a carbon and a non-carbon component with the carbon component also being referred to as carbon tax. The application of carbon tax to petrol and auto-diesel was introduced in December 2009, followed by the extension of carbon tax to other liquid fuels on 1 May 2010.  Ireland’s carbon tax regime is a carbon pricing mechanism which directly links the taxation of fossil fuels to carbon dioxide (CO2) emissions: a single price is set for a tonne of CO2 and this price is then applied to each fuel type according to the level of CO2 emitted by that fuel when it is combusted. In this way, the carbon tax applying to each fuel type reflects the level of CO2 emissions that it releases.  Legislation was introduced in Finance Act 2020 to provide for annual increases in carbon tax rates up to May 2030, at which point all carbon tax rates will be based on charging €100 per tonne of CO2 emissions. Carbon tax rates on petrol and auto-diesel are legislated to increase at Budget time each October up to and including 2029, with rates on other liable fuels such as heating kerosene and marked gas oil legislated to increase each May (i.e. after the winter heating season) up to and including 2030. This means that MOT rates on petrol and auto-diesel are set to increase a further four times, and MOT rates on heating fuels are set to increase a further five times, over the remainder of the trajectory provided for in legislation.  For petrol, the MOT increases, inclusive of VAT, will total to 8.1 cents per litre over the remainder of the carbon tax trajectory. The annual increases will be 2.1 cents per litre for each of the next three years, and 1.8 cents per litre in 2029.  Inclusive of VAT the remaining four increases to MOT on auto-diesel will total to 9.6 cents per litre. The annual increases will be 2.5 cents per litre for each of the next three years and 2.1 cents per litre in 2029.  Kerosene is the most commonly used oil for home heating. Inclusive of VAT, the MOT rate increases on heating kerosene will total to 10.7 cents per litre over the remainder of the carbon tax trajectory. The annual amounts will be 2.2 cents per litre for each of the next four years and 1.9 cents per litre in 2030.  Marked gas oil is also used for heating. Inclusive of VAT the remaining five increases to MOT on marked gas oil will total to 11.2 cents per litre. The annual increases will be 2.3 cents per litre for each of the next four years and 2 cents per litre in 2030. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 379. Deputy Pa Daly asked the Tánaiste and Minister for Finance the number of times he intends to increase the cost of petrol, diesel and home heating oil until 2030; the cost to consumers of each increase; and the compounded total cost of the increase, by increase and by category. [73781/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_360",
          "debateSectionId": "dbsect_360",
          "showAs": "Fuel Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_360.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_379",
        "questionNumber": 379
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Government through implementing the Flood Risk Management Plans is protecting those properties at significant flood risk from rivers and the sea. The Government has committed to investing some €81m for the design and implementation of flood relief schemes for Co. Kerry to protect 980 properties in Tralee, Kenmare, Abbeydorney and Banna. These are in the first tranche of schemes being progressed.  The OPW is funding three staff in Kerry County Council who are working solely on the delivery of the capital programme in flood risk management.  A Public Consultation Day will be held in the coming months, for the Tralee Flood Relief Scheme, to bring all options appraised to the public for their feedback. It is programmed to submit the scheme to planning at the end of 2026. The scheme is being designed to protect 717 properties from significant flood risk.  The consultants for the Kenmare Flood Relief Scheme have carried out options assessment and identified six fluvial options and three coastal options. It is programmed to submit the scheme to planning early in 2027. The scheme is being designed to protect 235 properties from significant flood risk.  Kerry County Council is completing a wider flood risk assessment in Banna to inform how the design for a scheme for this area can be best managed. This assessment includes the channels to the north and general drainage from the Ballyheigue area. The OPW is completing a feasibility report on the Abbeydorney Flood Relief Scheme.  Through the investment of some €1.3bn in flood relief measures through the National Development Plan, the Government was able to treble, to some 100, the number of flood relief schemes at design and construction, nationally. These are referred to as Tranche 1 schemes. The progression of a second tranche of some 50 other flood relief schemes, identified by the Flood Risk Management Plans, is constrained by the availability of specialised professional engineering skills for the design of flood relief schemes. The Government is also committed to delivering flood relief schemes to protect 410 properties in Dingle, Killarney, Ballylongford, Listowel and Castleisland/Tullig in the second tranche of flood relief schemes across Kerry. The delivery of these is being informed by a pilot on a new delivery model with Kilkenny and Donegal County Councils.  While the proposed scheme in Listowel is not in the first tranche of projects to be progressed, the OPW, through Kerry County Council, is investing €2 million for advance measures in the Clieveragh area of Listowel to protect some 50 properties. These works were completed by the OPW’s own direct labour team and I was delighted to officially open the completion of these works in November 2025.  Following a flood event in Listowel in November 2024, Kerry County Council engaged consultants to provide a report on the flood event. The findings were presented to Kerry Municipal District on 30th April, 2025 and are now available to the public. Kerry County Council discussed the findings of this report with the OPW and interim measures were identified.  I recently visited Listowel and was delighted to be in a position to announce some €0.5m funding by the OPW for flood mitigation measures in Listowel Town Park and Killocrim. These works are now completed.   Minor Works   Coastal erosion and localised flooding issues are a matter, in the first instance, for each local authority to investigate and address. Local authorities can undertake these works within their own resources.  In 2009, the Office of Public Works introduced the Minor Flood Mitigation Works and Coastal Protection Scheme. The purpose of the scheme is to provide 90% funding to local authorities to undertake studies, coastal erosion or minor flood mitigation works within their administrative areas.  This Minor Works Scheme generally applies where a solution can be readily identified and achieved in a short time frame, and the costs do not exceed €750,000.  Applications under the scheme are assessed by the OPW having regard to the specific economic, technical, social and environmental criteria set for this scheme. To be approved for funding under this scheme, the benefits from the works must exceed their associated costs.  To date, nationally, the OPW has approved over €70m for over 900 unique local flood relief and coastal projects that are providing benefits to some 8,000 properties.  Since 2009, the OPW has approved some €4.2 million funding to Kerry County Council for some 40 projects. Some €2.9m of this approved funding relates to coastal erosion works and studies.  Under the Minor Works Scheme, it is the responsibility of the local authority to advance the works, once approved by the OPW. This includes all environmental assessments, planning consents, health and safety requirements and landowner agreements.  I recently announced revisions to this Minor Works Scheme, including increasing the maximum funding under the scheme to €2m. My Office is finalising the details of these revisions and I expect to announce these details shortly.   Arterial Drainage Maintenance   The OPW has statutory responsibility for and carries out a programme of Arterial Drainage Maintenance. These maintenance works relate to arterial drainage schemes completed by the OPW under the Arterial Drainage Acts 1945, with the primary purpose to improve the drainage of agricultural lands.  The OPW’s annual Arterial Drainage Maintenance Works Programme of the Feale and Maine catchments benefits 26,500 and 11,600 acres of agriculture lands respectively. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 385. Deputy Pa Daly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation his efforts to address flooding in Kerry.  [73649/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_375",
          "debateSectionId": "dbsect_375",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_375.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_385",
        "questionNumber": 385
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Local coastal erosion issues are a matter, in the first instance, for each local authority to investigate and address. The OPW is working closely with Kerry County Council (KCC) to implement a number of initiatives to tackle coastal erosion in the county.   Minor Works Scheme   The Minor Flood Mitigation Works and Coastal Protection Scheme was introduced by the Office of Public Works (OPW) in 2009. The purpose of the scheme is to provide 90% funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems. The scheme generally applies where a solution can be readily identified and achieved in a short time frame. The funding available for each scheme has recently been increased from €750,000 to €2 million.  Since 2009, OPW has approved some 40 projects and €4.2m to Kerry County Council under the Minor Works Schemes. Some €2.9m of this approved funding relates to coastal erosion works and studies.  Kerry County Council has identified areas of soft coastline such as Rossbeigh/Inch, Banna/Ballyheigue and along the Maharees peninsula as being particularly vulnerable to coastal erosion. A Minor Works application for Maherabeg has been reviewed by the OPW and a request for further information from Kerry Co. Council will be reviewed once submitted.   Coastal Change Management   The Government recognises the risks associated with climate change and that increases in sea levels and storm surges will result in increased frequency of coastal erosion. In response to these challenges, the recommendations outlined in the Report of the Interdepartmental Group on National Coastal Change Management Strategy are being implemented.  Amongst the key recommendations of the Report is the assignment of the lead coordination role to the Department of Housing, Local Government and Heritage, which is responsible for chairing an Interdepartmental Steering Group on Coastal Change Management.  The OPW has been designated by Government as the national lead coordinating body for the assessment of coastal change hazards and risks and the assessment of technical options and constraints. These assessments will build upon indicative assessment work previously undertaken by the OPW under the Irish Coastal Protection Strategy Study. These assessments will also help to develop a multi-annual programme of work to assess coastal risk nationally.  The OPW are currently working on the development of National Coastal Erosion Hazard Mapping and a Past Coastal Erosion Database to assist in identifying areas at potentially significant risk of coastal change.  The former will provide spatial mapping to identify coastal areas that may be exposed to coastal erosion in the future, the latter is a web-based platform which will allow members of the public to report coastal erosion observed in their locality.  Ballyheigue was included in the Pilot Coastal Monitoring Survey Programme (CMSP) which was a five year pilot project which ran from 2020 to 2024. Additionally the OPW completed an aerial imagery and LiDAR survey of the full Kerry coastline in 2021. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 390. Deputy Pa Daly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the measures to address coastal erosion in Kerry; and if he will make a statement on the matter. [73651/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_380",
          "debateSectionId": "dbsect_380",
          "showAs": "Coastal Erosion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_380.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_390",
        "questionNumber": 390
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I am advised by the Commissioners of Public Works (OPW) that there are currently 56 surplus vacant buildings owned by the OPW. Of these the former Garda Station at Newbliss, Co. Monaghagn has been placed on the local authority derelict sites register. This building has been vacant since 2013. The OPW is in the process of transferring it to Monaghan County Council under the protocols set out in D/PER Circular 11/15: Protocols for the Transfer and Sharing of State Property Assets.  The former Garda Station at Smithborough, Co. Monaghan has also been placed on the Local Authority derelict sites register. While it has been vacant since 2012 it is under consideration by An Garda Síochána for operational use.  The OPW has not paid any derelict site levy on these properties or any property between 2020 and 2025.  Maintenance costs to maintain the two properties since closure is as follows:      Property      Maintenance costs       Newbliss    €33,334.95      Smithborough    €51,585.75      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 395. Deputy Pa Daly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide a breakdown of the number of derelict building broken down by location; the length of time which they have been vacant; the reason they are vacant; and the cost to maintain them while vacant, in tabular form. [73780/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_383",
          "debateSectionId": "dbsect_383",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_383.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_395",
        "questionNumber": 395
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth (Deputy Hildegarde Naughton)  The Schools PV Programme provides eligible schools with up to 6 kilowatts peak of roof-mounted solar photovoltaic (PV) installations on their roofs, which equates to approximately 14 solar panels.  The Schools PV Programme is funded by the Government’s Climate Action Fund in line with the Government’s recognition that taking action on climate change is central to Ireland’s social and economic development. It is assisting schools in reducing their energy costs and carbon footprint as part of the response to meeting the 2030 and 2050 Climate Action Plan targets for the schools’ sector.  All eligible schools have now been invited to express their interest in the scheme. Since the launch of the programme late last year, there has been a really positive response in terms of applications for solar panels from schools and we are seeing the impacts today as PV panels are being installed on school roofs around the country.  Since the launch of the programme in November 2023,  • 3,300 schools who expressed interest in the scheme have progressed to tender stage,  • 3,073 schools so far approved for funding.  • 2,416 schools have confirmed their installations as complete.  There is no waiting list of schools; however, 200 schools have progressed to the tender stage and have yet to submit their funding requests to the Department.  Of the schools that expressed an interest in the scheme, 355 confirmed that they would not participate or were deemed ineligible. Reasons include schools scheduled to receive PV as part of another building project, buildings that are not suitable for PV installation, or schools that already have PV installed.  There are also approximately 200 schools who have not yet engaged with the scheme programme to date, Department Officials are contacting these schools again to seek their engagement with the PV Programme.  See below table of schools who completed the expression of interest stage per county:     County    Total Expressions of Interest received      Carlow    51      Cavan    81      Clare    126      Cork    396      Donegal    200      Dublin    587      Galway    273      Kerry    161      Kildare    120      Kilkenny    90      Laois    68      Leitrim    44      Limerick    163      Longford    44      Louth    82      Mayo    173      Meath    126      Monaghan    65      Offaly    78      Roscommon    94      Sligo    74      Tipperary    179      Waterford    92      Westmeath    84      Wexford    121      Wicklow    102      Total    3675     See below list of applications per county that do not meet the programme funding criteria:     County    Applications that do not meet programme criteria      Carlow    6      Cavan    2      Clare    5      Cork    40      Donegal    15      Dublin    108      Galway    11      Kerry    6      Kildare    17      Kilkenny    7      Laois    5      Leitrim    3      Limerick    13      Longford    2      Louth    7      Mayo    9      Meath    20      Monaghan    5      Offaly    6      Roscommon    3      Sligo    4      Tipperary    14      Waterford    6      Westmeath    8      Wexford    6      Wicklow    9      Total    337       See below completed installations per county to date:     Carlow    32      Cavan    64      Clare    110      Cork    235      Donegal    170      Dublin    280      Galway    220      Kerry    142      Kildare    56      Kilkenny    74      Laois    42      Leitrim    30      Limerick    125      Longford    27      Louth    38      Mayo    107      Meath    63      Monaghan    41      Offaly    61      Roscommon    74      Sligo    39      Tipperary    126      Waterford    70      Westmeath    45      Wexford    76      Wicklow    69      Total    2416        ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 477. Deputy Pa Daly asked the Minister for Education and Youth to provide a breakdown of the number of schools that have availed of the scheme to install solar panels on their roof; the number of completed installations; the number that applied and are on a waiting list; the number that applied and were unsuccessful, broken down by county; and if she will make a statement on the matter.  [73786/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_449",
          "debateSectionId": "dbsect_449",
          "showAs": "Education Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_449.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_477",
        "questionNumber": 477
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling students with special educational needs to receive an education that meets their needs is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of students with special educational needs are supported to attend mainstream classes with their peers. Where students with more complex needs require additional supports, special class and special school places are provided.  This is in keeping with policy on an inclusive education, which promotes that students will be supported to receive an education in the most inclusive setting possible.  Special needs assistant (SNA)s play a central role in the successful inclusion of students with additional and significant care needs in schools. They help ensure that these students can access an education to enable them to achieve their best outcomes and reach their full potential.  SNA posts are allocated to schools as a school-based resource. Principals/board of managements deploy SNAs within schools to meet the care support requirements of the students enrolled whom SNA support has been allocated. This provides schools flexibility in how the SNA support is utilised.  The NCSE has published the SNA allocations for the 2025/26 school year. For ease of reference these allocations are broken down by school year, school type and location and are available on the NCSE's website at: www.ncse.ie/set-hours-and-sna-allocations  If a school feels it has insufficient SNA support to meet the needs of its students an application can be submitted to the NCSE requesting a review of its allocation. Detailed information on the NCSE's SNA review process is published on the NCSE's website at ncse.ie/sna-review-mainstream. Each case is individually assessed and is based on the student profile of each school.  It is important to remember that when the NCSE allocates a SNA post, the board of management as the employer, is responsible for filling the vacancy. The decision on whether to employ a full time SNA to fill a full-time post or to employ an equivalent number of part time SNAs rests with the employer.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 480. Deputy Pa Daly asked the Minister for Education and Youth to provide a breakdown of the number of SNA vacancies, by county, in each of the years 2020 to 2025, in tabular form.  [73837/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_452",
          "debateSectionId": "dbsect_452",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_452.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_480",
        "questionNumber": 480
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  This Government is fully committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning.  To address teacher supply issues, my Department has implemented several measures that have led to:  • an increase of 20% in initial teacher education graduates (student teachers) between 2018 and 2023, and  • over 30% increase in the number of teachers registered with the Teaching Council since 2017.  The Department is currently producing a range of data on teacher supply to improve the understanding of the teacher supply landscape. My Department has recently published three reports: an analysis of the Teaching Council register, unmet demand in post-primary schools and on substitute teachers which are here: www.gov.ie/en/department-of-education/collections/other-statistical-reports/#teacher-demand-and-supply  An analysis of teacher payroll data, as of March 2025, shows there are 79,225 teachers employed in our schools across the country with 43,221 at primary level including special schools and 36,004 in post-primary schools.  The Department does not collate data available for the years 2020 to 2025. However, the analysis of the teacher payrolls for March 2025, showed the following unutilised allocated teaching posts in primary and post-primary schools per county:   Table: Unutilised Teaching Posts as at March 2025       County      Primary Unutilised Posts      Post-primary Unutilised Posts      Total Unutilised Posts       Carlow    16.5    6.1    22.6      Cavan    14.8    11.6    26.4      Clare    19.2    14.1    33.3      Cork    137.7    93.8    231.4      Donegal    21.9    53.8    75.7      Dublin    512.1    120.9    633.0      Galway    32.8    25.1    57.9      Kerry    9.8    37.2    47.0      Kildare    93.0    18.9    111.9      Kilkenny    15.6    19.1    34.7      Laois    24.9    9.6    34.4      Leitrim    6.0    6.6    12.6      Limerick    20.8    18.0    38.9      Longford    5.0    -2.4    2.6      Louth    36.5    -13.5    23.0      Mayo    27.3    17.1    44.4      Meath    54.0    53.4    107.4      Monaghan    7.9    2.6    10.5      Offaly    12.7    8.2    20.9      Roscommon    1.0    15.4    16.4      Sligo    14.1    18.7    32.8      Tipperary    22.5    27.5    50.0      Waterford    20.9    15.8    36.7      Westmeath    26.9    8.6    35.4      Wexford    36.3    11.0    47.3      Wicklow    37.6    24.2    61.8       Total      1227.7      621.4      1849.1          The Department provides a range of measures to address teacher supply. The Department announced new measures in 2025 including assisting teachers gain permanent roles more quickly and approving regulations recently to allow teachers who qualified overseas to undertake their induction in the State.  Measures including a STEM bursary, an expansion of upskilling programmes, improving the availability of substitution, continuing the promotion of teaching as a profession and the development of teacher workforce planning are underway.  The teaching profession is highly attractive, with strong demand for teacher education programmes with over 3,600 newly qualified teachers registered with the Teaching Council in 2025 with over 127,000 on the register. Salaries are competitive, starting at €44,879 (primary) and €46,448 (post-primary) and rising to €85,000 under the current pay deal. Few teachers resign: less than 3% of the teaching workforce resign or retire annually from contracted teaching posts.  Around 6% of first-choice CAO applications from 2017–2024 were for teaching, showing steady demand. In 2025, first preferences rose by 9% for primary teaching and 5% for post-primary. 85% of newly appointed primary teachers in 2024/25 are on full-time, mostly fixed-term contracts, 75% of new post-primary teachers are full-time and 93% of teachers with 5+ years’ experience hold permanent full-time or pro-rata contracts.  In addition to the recently announced measures, the Department will continue to consider further measures to strengthen the teaching workforce and ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 481. Deputy Pa Daly asked the Minister for Education and Youth to provide a breakdown of the school teacher vacancies in schools, by primary and secondary education and by county, in each of the years 2020 to 2025, in tabular form.  [73838/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_453",
          "debateSectionId": "dbsect_453",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_481",
        "questionNumber": 481
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling students with special educational needs to receive an education that meets their needs is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of students with special educational needs are supported to attend mainstream classes with their peers. Where students with more complex needs require additional supports, special class and special school places are provided. This is in keeping with policy on an inclusive education, which advocates that students will be supported to receive an education in the most inclusive setting possible.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  A list of all mainstream and special schools is available on my department's website on www.gov.ie. In addition, a list of schools with special classes; broken by year, location and class designation is available on the NCSE website at:ncse.ie/special-classes  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 482. Deputy Pa Daly asked the Minister for Education and Youth to provide a breakdown of the number of special education classes, by county and by primary or secondary education, in each of the years 2020 to 2025.  [73839/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_454",
          "debateSectionId": "dbsect_454",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_454.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_482",
        "questionNumber": 482
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 534. Deputy Pa Daly asked the Minister for Housing, Local Government and Heritage the measures he is taking to increase the number of properties to rent in Kerry; and if he will make a statement on the matter. [73801/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_506",
          "debateSectionId": "dbsect_506",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_506.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_534",
        "questionNumber": 534
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 556. Deputy Pa Daly asked the Minister for Social Protection the proposed timeframe for abolishing the means test for carers allowance applications. [73843/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_528",
          "debateSectionId": "dbsect_528",
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_528.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_556",
        "questionNumber": 556
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Policing, Security and Community Safety Act 2024, which I commenced on Wednesday 2 April 2025, provides for the establishment of Local Community Safety Partnerships (LCSP) within each local authority area.  The regulations for these Safety Partnerships came into operation on Monday 30 June, and 36 Partnerships are in the process of being established in local authority areas across the country.  A number of administrative steps need to be undertaken to facilitate the establishment of a Safety Partnership in a given area, including nomination of proposed members by local authorities and statutory bodies, and the appointment of all members by myself as Minister for Justice, Home Affairs and Migration.  The National Office for Community Safety, an office of my Department, are providing support to local authorities and in particular to Local Community Safety Partnership teams, in the process of establishing each Safety Partnership in their area.  I have appointed members to 32 Local Community Safety Partnerships, I expect to be making further appointments in the near future.  On 12 November 2025, I appointed members of Kerry Local Community Safety Partnership, the first meeting of which was held on the 2 December 2025. The Chair and Vice-Chair were both elected at this meeting. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 583. Deputy Pa Daly asked the Minister for Justice, Home Affairs and Migration to provide an update on local community safety partnerships in Kerry; and if he will make a statement on the matter. [73797/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_556",
          "debateSectionId": "dbsect_556",
          "showAs": "Local Community Safety Partnerships",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_556.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_583",
        "questionNumber": 583
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The judiciary are, subject only to the Constitution and the law, independent in the exercise of their judicial functions. To be of assistance, my officials have made enquiries of the Courts Service regarding the matters raised.  As the Deputy may be aware, the court poor box is a non-statutory system used by the judiciary in the District Courts to impose a financial charge on a defendant to be used for a charitable purpose, usually instead of imposing a criminal conviction. The option of paying into the court poor box arises usually where the offence is minor in nature and would not attract a custodial sentence.  The Courts Service publish Annual Reports on the Court Poor Box on the Courts Service website: www.courts.ie/publications/poor-box-2017-2023. Payments made to the court poor box are accounted for by the court office concerned and the accounting procedures are subject to audit by the Comptroller and Auditor General. Generally, charities are the recipients of poor box contributions but the decision is solely at the discretion of the judge who is independent in the matter of sentencing, as in other matters concerning the exercise of judicial functions.  In relation to next steps to address the use of the poor box in District courts, the Criminal Justice (Community Sanctions) Bill 2014, which seeks to update the Probation of Offenders Act 1907, will facilitate the effective and efficient use of community sanctions by the courts, and will ensure that the courts have a wide range of appropriate options for dealing with people who have committed minor offences.  Part 5 of the General Scheme of the Bill, as published by my Department, provides for the abolition of the Court Poor Box and the establishment of the Reparation Fund and reparation orders as a form of non-custodial sentence. This is to provide for a fair, equitable and transparent system of reparation, applicable only to minor offences and for the usage of that fund to provide services for the victims of crime.  A policy review of the Scheme of the Criminal Justice (Community Sanctions) Bill 2014, conducted by my Department, recommends that changes reflect developments in Irish penal policy since 2014. My Department is currently considering the policy review and next steps are being considered in the context of updating the Bill. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 585. Deputy Pa Daly asked the Minister for Justice, Home Affairs and Migration his plans in relation to the continued use by some District Courts of charity donations to allow motorists to avoid convictions for penalty point offences, including in cases of those driving at speeds significantly in excess of speed limits; and if he will make a statement on the matter. [73842/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_558",
          "debateSectionId": "dbsect_558",
          "showAs": "Courts Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_558.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_585",
        "questionNumber": 585
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  Well managed and maintained forests do not contribute to flooding, and in fact will contribute to flood mitigation. My Department sets standards around afforestation, felling and replanting. Drainage and the management of water and water quality is a key consideration in these standards. My Department ensures standards are met through inspection processes related to licensed forestry activity and responding to reported incidence of non compliance.  Drainage is often required to grow a healthy, thriving forest. In relation to newly planted forests, many new forests are planted without new drains and for new forests where drains are required these new drains are not connected directly to rivers or streams. These drains will stop some distance from a river or stream thereby slowing the flow of water from the forest and mitigating against downstream flooding.  As mentioned above, planting woodlands is often utilised as a flood mitigation measure, often referred to as a nature-based solution. My Department has afforestation schemes specific to promoting water quality and addressing water related issues. These include \"Forest Type 2 - Forests for water\" and \"Native Tree Area Scheme (NTA2)\".  The forest canopy will generally reduce the amount of water reaching rivers and streams and can help regulate surface run-off during periods of heavy rain. When the forest canopy is removed at clearfell stage, conditions of felling licences granted by my Department such as sediment traps and attenuation areas are utilised to slow the flow of water and protect watercourses.  My Department has introduced a Climate Resilient Reforestation scheme. This scheme funds the creation of areas for biodiversity and water protection, with associated measures including drain-blocking, slow-water damming and the planting of widely spaced groups of native broadleaves at reforestation stage. These measures have a positive impact on both flood mitigation and water quality. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 590. Deputy Pa Daly asked the Minister for Agriculture, Food and the Marine the steps he is taking to address the link between some forestry plantations and flooding; and if he will make a statement on the matter. [73650/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_564",
          "debateSectionId": "dbsect_564",
          "showAs": "Forestry Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_564.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_590",
        "questionNumber": 590
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Targeted Agriculture Modernisation Scheme (TAMS 3) provides grants to farmers to build and/or improve a specified range of farm buildings and equipment on their holdings. All investments must be linked to Climate, Environment or Animal Welfare.  Overall, a total of €547.6 million has been allocated to TAMS over the period 2019 to 2025 as outlined in the table below. The indicative allocation for both 2026 and 2027 will be similar to the allocation for this year, taking into account the number of applications received. As TAMS is a demand-led scheme it is not possible to provide a breakdown of allocations by county.     Year    Allocation      2019    €77m      2020    €90.54m      2021    €79.99m      2022    €79.67m      2023    €61.13m      2024    €72.27m      2025    €87m      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 594. Deputy Pa Daly asked the Minister for Agriculture, Food and the Marine the total allocation to TAMS in each of the years from 2019 to 2026; the indicative allocation for 2027; broken down by county, in tabular form; and if he will make a statement on the matter. [73835/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_568",
          "debateSectionId": "dbsect_568",
          "showAs": "Agriculture Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_568.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_594",
        "questionNumber": 594
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 723. Deputy Pa Daly asked the Minister for Health the current waiting list for audiology services broken down by county and by location, age, assessment type and procedures; and the length of time individuals have been waiting, in each of the years 2020 and to date in 2025, in tabular form; and if she will make a statement on the matter. [73658/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_695",
          "debateSectionId": "dbsect_695",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_695.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_723",
        "questionNumber": 723
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 724. Deputy Pa Daly asked the Minister for Health the current average waiting time for audiology appointments broken down by CHO the number currently waiting to be seen in each of the years 2020 and to date in 2025, in tabular form; and if she will make a statement on the matter. [73659/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_696",
          "debateSectionId": "dbsect_696",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_696.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_724",
        "questionNumber": 724
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  This PQ should be directed the Department of Children, Disability and Equality. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 725. Deputy Pa Daly asked the Minister for Health the waiting list for AON assessments broken down by county and by length of time waiting for an assessment in three month intervals; the waiting list for those who have been waiting longer than 6 months; 9 months, 12 months, 15 months, 18 months, 21 months, 24 months, 27 months, 30 months, 36 months; and if she will make a statement on the matter. [73660/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_697",
          "debateSectionId": "dbsect_697",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_697.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_725",
        "questionNumber": 725
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  Both I, and the Department of Health, await submission by the HSE of the Final Report by Dr. Halpin in relation to the North Kerry Lookback Review.I am closely monitoring developments on Child and Adolescent Mental Health Services in North Kerry, including the timeline for the completion of the Lookback Review. The HSE has indicated that the Review will be made available as soon as possible, acknowledging that necessary due diligence and related processes must be adhered to in the finalisation of the Review. The HSE has confirmed that it will expedite this as much as possible.  I understand that all file reviews have now been completed, and all children, young people and their families have been communicated with directly in relation to the outcome of their file review. My main concern throughout this process has been to ensure that children, young people and their families are communicated with directly in advance of the publication of the Lookback Review. I will continue to work closely with the HSE Child and Youth Mental Health National Office to drive reform of CAMHS nationally, to ensure that this key specialist service which benefits so many young people and their families each year is safe, accessible, child-centered, and delivered to the highest of standards. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 754. Deputy Pa Daly asked the Minister for Health for an update on the north Kerry lookback review; if this review will be published before the end of the year; the reasons for the ongoing delay; the engagements she has had with children and impacted families, and the dates on which these engagements took place; and if she will make a statement on the matter. [73787/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_727",
          "debateSectionId": "dbsect_727",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_727.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_754",
        "questionNumber": 754
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  Both I, and the Department of Health, await submission by the HSE of the Final Report by Dr. Halpin in relation to the North Kerry Lookback Review.I am closely monitoring developments on Child and Adolescent Mental Health Services in North Kerry, including the timeline for the completion of the Lookback Review. The HSE has indicated that the Review will be made available as soon as possible, acknowledging that necessary due diligence and related processes must be adhered to in the finalisation of the Review. The HSE has confirmed that it will expedite this as much as possible.  I understand that all file reviews have now been completed, and all children, young people and their families have been communicated with directly in relation to the outcome of their file review. My main concern throughout this process has been to ensure that children, young people and their families are communicated with directly in advance of the publication of the Lookback Review. I will continue to work closely with the HSE Child and Youth Mental Health National Office to drive reform of CAMHS nationally, to ensure that this key specialist service which benefits so many young people and their families each year is safe, accessible, child-centered, and delivered to the highest of standards. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 755. Deputy Pa Daly asked the Minister for Health regarding the north Kerry lookback review, the engagements she has had in relation to this since taking office; the dates on which those engagements took place; the content of those engagements; and if she will make a statement on the matter. [73788/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_728",
          "debateSectionId": "dbsect_728",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_728.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_755",
        "questionNumber": 755
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 756. Deputy Pa Daly asked the Minister for Health the number of people waiting to access CT scans, broken down by county and by period of time waiting, in tabular form, in each of the years 2020 to 2025; and if she will make a statement on the matter. [73789/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_729",
          "debateSectionId": "dbsect_729",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_729.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_756",
        "questionNumber": 756
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 757. Deputy Pa Daly asked the Minister for Health the current and known upcoming vacancies at University Hospital Kerry; the dates on which the vacancies arose or will arise; the dates when vacancies are expected to be filled, in tabular form; and if she will make a statement on the matter. [73790/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_730",
          "debateSectionId": "dbsect_730",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_730.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_757",
        "questionNumber": 757
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to respond to the deputy directly. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 758. Deputy Pa Daly asked the Minister for Health to provide an update on the minor injuries clinic in Killarney; and if she will make a statement on the matter. [73791/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_731",
          "debateSectionId": "dbsect_731",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_731.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_758",
        "questionNumber": 758
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 759. Deputy Pa Daly asked the Minister for Health to provide an update on beds in Dingle Community Hospital; when all beds will be open; and if she will make a statement on the matter. [73792/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_732",
          "debateSectionId": "dbsect_732",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_732.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_759",
        "questionNumber": 759
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 760. Deputy Pa Daly asked the Minister for Health to provide an update on beds in Dingle Community Hospital; when all beds will be open; and if she will make a statement on the matter. [73793/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_733",
          "debateSectionId": "dbsect_733",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_733.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_760",
        "questionNumber": 760
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As our health system faces into what is traditionally the most challenging periods of the year, I would like to assure the deputy that every measure is being taken to ensure that overcrowding is kept to a minimum in Kerry University Hospital and all our hospitals. The third iteration of the UEC Operational Plan is currently in operation and one of the 4 pillars of the plan is hospital avoidance. This focuses on supporting patients in settings other than the Emergency Department and avoiding the need for inpatient care. Amongst the initiatives involved in the plan are:  • Vaccine Preventable Illness, promote uptake of Influenza, Measles and COVID-19 vaccinations to improve compliance for all target groups including Healthcare Workers Specialist Care in the Community  • Community Specialist Teams (CSTs) for Chronic Disease Management.  • GP Out of Hours Work with GP Out of Hours Services to maintain/increase GP OOH contacts and reduce the level of GP OOH referrals to EDs  • NAS Care Pathways Maximise usage of existing NAS alternative care pathways  • Injury Units to provide a 7-day service, 8am to 8pm including Bank Holidays.  In addition to these measures the HSE has made provisions to bolster GP services with the addition of 20,000 hours available through the GP Surgery Enhanced Service to target respiratory issues which will run from December 8th to February 15th inclusive.  Mask wearing is just one of the measures we can all take to protect ourselves from infection this winter and lessen the pressures on our EDs. Individuals who wish to wear a mask should not be discouraged from doing so, in particular when disease incidence is high. Measures such as vaccinations, good hand hygiene and cough and sneeze etiquette are also important in preventing the spread of infections.  This winter COVID-19 and Flu Vaccines are available to eligible individuals by GPs and pharmacists.Expansion of community care and other measures to provide people the care they need outside of the ED can improve patient flow in acute hospitals by reducing unnecessary attendances and improving discharge supports such as home support and residential care. This will allow our ED resources to be better utilised, delivering care to those most urgently in need. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 761. Deputy Pa Daly asked the Minister for Health to outline the measures she is taking to address hospital overcrowding at the accident and emergency department in University Hospital Kerry; and if she will make a statement on the matter. [73794/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_734",
          "debateSectionId": "dbsect_734",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_734.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_761",
        "questionNumber": 761
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 762. Deputy Pa Daly asked the Minister for Health if she will increase the number of beds at the accident and emergency department in University Hospital Kerry; and if she will make a statement on the matter. [73795/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pa-Daly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pa-Daly.D.2020-02-08",
          "showAs": "Pa Daly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_735",
          "debateSectionId": "dbsect_735",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_735.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_762",
        "questionNumber": 762
      },
      "contextDate": "2025-12-18"
    }
  ]
}