{
  "head": {
    "counts": {
      "questionCount": 2845,
      "resultCount": 2845
    }
  },
  "results": [
    {
      "contextDate": "2025-04-08",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-04-08",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-08/pq_541",
        "answerText": " Minister of State at the Department of Education  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective. The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs.  As your question relates to a specific school, my department will ask the NCSE to consider the matter and provide a direct reply.  By the end of the year there will be over 20,800 special educational teachers and 23,400 special needs assistants (SNAs) in our mainstream classes, special classes and special schools. This will mean we will have over 44,000 teachers and SNAs working in our education system committed to supporting and nurturing children with special educational needs, enabling them to achieve their best outcomes and reach their full potential.  Allocations of special education teaching posts for the next school year have recently been provided to schools and SNA allocations will be confirmed by the NCSE to schools in the coming weeks.  If a school feels like it has insufficient SNA support to meet the needs of its students an application can be submitted to the NCSE requesting a review of its allocation. Detailed information on the NCSE's SNA review process is published on the NCSE's website. Each case is individually assessed and is based on the student profile of each school.  Some review requests can be concluded as an office-based exercise, whilst others require a school to be visited in order to observe the current deployment of SNA support in the school setting. The timeframe for concluding a review can vary depending on the school context or the nature of the information provided.  Following the outcome of the review, the NCSE can make a local special educational needs officer (SENO) available to the school to discuss their current deployment of SNA supports in the school and to put these supports to the best advantage of the students. NCSE in-school support is also available to schools to offer further guidance and support.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential.   ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 541. Deputy Timmy Dooley asked the Minister for Education the status of an application for a school (details supplied); and if she will make a statement on the matter. [17449/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_442",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/mul@/dbsect_442.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/dbsect_442",
          "showAs": "Special Educational Needs"
        },
        "questionNumber": 541,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "question": {
        "questionNumber": 693,
        "showAs": " 693. Deputy Timmy Dooley asked the Minister for Health since the introduction of the national access policy in 2022, the number of children placed on the waiting list for autism assessment by a primary care team in County Clare; and if she will make a statement on the matter. [14986/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_560.xml"
            },
            "pdf": null
          },
          "showAs": "Health Services Waiting Lists",
          "debateSectionId": "dbsect_560",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_560"
        },
        "to": {
          "showAs": "Health",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_693",
        "by": {
          "showAs": "Timmy Dooley",
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12"
        },
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "question": {
        "questionNumber": 694,
        "showAs": " 694. Deputy Timmy Dooley asked the Minister for Health the number of children assessed for autism by the primary care team in County Clare since the introduction of the national access policy in 2022; and if she will make a statement on the matter. [14987/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_561.xml"
            },
            "pdf": null
          },
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_561",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_561"
        },
        "to": {
          "showAs": "Health",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_694",
        "by": {
          "showAs": "Timmy Dooley",
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12"
        },
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "question": {
        "questionNumber": 361,
        "debateSection": {
          "showAs": "Schools Building Projects",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/mul@/dbsect_277.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/dbsect_277",
          "debateSectionId": "dbsect_277"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  The project referred to by the Deputy has been devolved for delivery to Limerick Clare Education and Training Board (LCETB). It is currently at Stage 2a (detailed design) of the architectural process. When finalised, the Stage 2a  report will be submitted to the Department for review and comment.  Once this is received, reviewed and approved, the project will then move to Stage 2b which allows for detailed design/planning, obtaining the necessary statutory permissions and the preparation of tender documents. The project will then move onward to tender and construction in due course.  While it is not possible to provide a timeline for the completion of the Project at this early stage, LCETB will be engaging directly with the school authority and the Department to keep them informed of all progress. ",
        "showAs": " 361. Deputy Timmy Dooley asked the Minister for Education the current status of planning for a new school building (details supplied); and if she will make a statement on the matter. [9087/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-04/pq_361",
        "by": {
          "showAs": "Timmy Dooley",
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12"
        },
        "date": "2025-03-04"
      },
      "contextDate": "2025-03-04"
    },
    {
      "question": {
        "questionNumber": 577,
        "debateSection": {
          "showAs": "Departmental Schemes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/mul@/dbsect_484.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/dbsect_484",
          "debateSectionId": "dbsect_484"
        },
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 577 and 588 together.  The Native Tree Area Scheme was introduced to facilitate small-scale tree planting and does not require an afforestation licence, therefore does not go through the licensing procedure. Strict conditions for eligibility to the Scheme do however exist to ensure sufficient safeguards are in place and to prevent any negative impact on the environment.  Applications received by my Department are reviewed for completeness to ensure they are a valid application which can be progressed to decision stage. This process involves careful assessment of each application from a silvicultural, environmental and scheme compliance perspective.  The average waiting time for the 349 NTAS applications that were approved in 2024 was 46 days from the date of receipt. Approval times can vary depending on a number of factors, including if an application is complete when received. Currently, there are 61 applications (66ha) in the system being reviewed to ensure they are a valid application and resources have been put in place to prioritise these. ",
        "showAs": " 577. Deputy Timmy Dooley asked the Minister for Agriculture, Food and the Marine the reason there is such a backlog in dealing with foresters’ native tree area scheme applications in light of their exemption from planning (details supplied); and if he will make a statement on the matter. [9519/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-04/pq_577",
        "by": {
          "showAs": "Timmy Dooley",
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12"
        },
        "date": "2025-03-04"
      },
      "contextDate": "2025-03-04"
    },
    {
      "contextDate": "2025-02-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-12/writtens/mul@/dbsect_105.xml"
            }
          },
          "debateSectionId": "dbsect_105",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-12/writtens/dbsect_105",
          "showAs": "National Car Test"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-12/pq_105",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 105,
        "showAs": " 105. Deputy Timmy Dooley asked the Minister for Transport if consideration is being given to the provision of a NCT centre in Kilrush, County Clare; and if he will make a statement on the matter. [4979/25] ",
        "answerText": " Minister for Transport  Under the Road Safety Authority Act 2006, the operation of the National Car Testing (NCT) Service is the statutory responsibility of the Road Safety Authority (RSA). This includes the provision of new test centres.  I have therefore referred the Deputy's query to the Authority for direct reply.  I would ask the Deputy to contact my office if a response with the information requested has not been received within ten days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-12",
        "by": {
          "showAs": "Timmy Dooley",
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12"
        }
      }
    },
    {
      "contextDate": "2025-02-11",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-11",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-11/pq_330",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  On 4 November 2024, funding allocations under the Large Scale Sport Infrastructure Fund (LSSIF) were announced. The total amount of grants awarded under this second round was €173 million, benefiting 35 individual projects. With this announcement, the cumulative investment from the LSSIF since the first round in 2020 now totals €297 million.  Last year the Large Scale Sport Infrastructure Fund ('LSSIF') received an unprecedented demand for funding, amounting to €665 million from 96 applications. As a result of this significant demand, a range of valid applications did not receive an LSSIF allocation at the initial allocation stage.  In relation to LSSIF applications which have not received an allocation, it should be noted that a reserve list is being prepared by the Department, on which all remaining valid applications will be assessed and placed in a prioritised order such as this project. As additional LSSIF funding becomes available, projects on the reserve list should then be able to be funded.  The timing of a further LSSIF round will depend on the necessary funding being available and in that regard the Programme for Government confirms that the Government will maintain sports funding to get more people participating in all levels of sport, particularly targeting cohorts in society where there are lower than average participation levels including people with disabilities and older people. ",
        "to": {
          "uri": null,
          "showAs": "Tourism",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 330. Deputy Timmy Dooley asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media when the next round of the large-scale sport infrastructure fund is due to open; and if he will make a statement on the matter. [3994/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_327",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/mul@/dbsect_327.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/dbsect_327",
          "showAs": "Sports Funding"
        },
        "questionNumber": 330,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-11",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-11",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-11/pq_331",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  On 4 November 2024, funding allocations under the Large Scale Sport Infrastructure Fund (LSSIF) were announced. The total amount of grants awarded under this round was €173 million, benefiting 35 individual projects. With this announcement, the cumulative investment from the LSSIF since 2020 now totals €297 million.  All applications submitted under the LSSIF were required to have the prioritised endorsement of a National Governing Body for Sport (NGB) or of a local authority. This prioritisation was one of a number of factors taken into account in the assessment and ultimate ranking of projects. It was informed by factors such as the potential to enhance sports participation, sustainability, similar access for both men and women, and the ability to execute the project within a specified timeframe.  The Department's website (www.gov.ie/en/service/6f3f3-large-scale-sport-infrastructure-fund-lssif-2024/) details the projects allocated funding as well as the prioritisation accorded to projects by local authorities and National Governing Bodies of Sport and the scoring matrix applied by the Department. ",
        "to": {
          "uri": null,
          "showAs": "Tourism",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 331. Deputy Timmy Dooley asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media to provide details of what is required to secure successful funding under the large-scale sport infrastructure fund; and if he will make a statement on the matter. [3995/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_328",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/mul@/dbsect_328.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/dbsect_328",
          "showAs": "Sports Funding"
        },
        "questionNumber": 331,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-11",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-11",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-11/pq_483",
        "answerText": " Minister for Agriculture, Food and the Marine  I can confirm that there is a total of 619 ACRES contracts failing to clear pre-payment validations due to scorecard related issues.  Each case must clear all validations before payment can issue. These validations will continue to be carried out, and my Department is working to resolve these issues so as to expedite payments. Further pay runs, to participants in both Tranches, will continue to issue on a regular basis as cases pass all required validation checks.  Everything is being done to pay, as soon as possible, all ACRES participants who clear pre-payment checks. ",
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 483. Deputy Timmy Dooley asked the Minister for Agriculture, Food and the Marine how many ACRES (tranche 2) payments are outstanding as a result of a technical or IT issues, with score cards being imported to the payroll system; and if he will make a statement on the matter. [4370/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_469",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/mul@/dbsect_469.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/dbsect_469",
          "showAs": "Agriculture Schemes"
        },
        "questionNumber": 483,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-11",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-11",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-11/pq_681",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 681. Deputy Timmy Dooley asked the Minister for Health the reason adults with type 1 diabetes attending University Hospital Limerick are still not offered insulin pumps as a treatment option, despite the availability of qualified staff required to initiate pump therapy and the administration support are all in place to commence the service; and if she will make a statement on the matter. [4623/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_665",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/mul@/dbsect_665.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/dbsect_665",
          "showAs": "Medical Aids and Appliances"
        },
        "questionNumber": 681,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_2",
        "answerText": " Minister of State at the Department of the Taoiseach  The Live Register series provides a monthly breakdown of the number of people claiming Jobseeker's Benefit, Jobseeker's Allowance and other registrants as registered with the Department of Social Protection.  Table 1 below shows the number of persons on Live Register for County Clare classified by gender, age and duration of continuous registration for November 2020 to 2024.  Table 2 below shows the number of persons on Live Register for County Clare classified by nationality grouping for November 2020 to 2024.  Table 3 below shows the number of persons on Live Register for County Clare by last held occupation for November 2020 to 2024.  It should be noted that the Live Register is not a definitive measure of unemployment as it includes part-time workers, and seasonal and casual workers entitled to Jobseeker's Benefit or Allowance.      Table 1 Persons on the Live Register in Clare by Sex, Age and Duration, November 2020 - November 2024                             Year and Month                                     November 2020    November 2021    November 2022    November 2023    November 2024      Sex    Age    Duration                           All durations    4,926    3,862    5,047    4,650    3,732            Less than one year    2,960    1,971    3,467    2,808    2,217         All ages    One year or more    1,966    1,891    1,580    1,842    1,515            All durations    550    361    517    455    374            Less than one year    389    234    404    333    269         Under 25 years    One year or more    161    127    113    122    105            All durations    4,376    3,501    4,530    4,195    3,358            Less than one year    2,571    1,737    3,063    2,475    1,948      All    25 years and over    One year or more    1,805    1,764    1,467    1,720    1,410            All durations    2,704    2,069    2,537    2,333    1,960            Less than one year    1,564    951    1,620    1,355    1,112         All ages    One year or more    1,140    1,118    917    978    848            All durations    309    187    259    220    180            Less than one year    218    111    200    156    128         Under 25 years    One year or more    91    76    59    64    52            All durations    2,395    1,882    2,278    2,113    1,780            Less than one year    1,346    840    1,420    1,199    984      Male    25 years and over    One year or more    1,049    1,042    858    914    796            All durations    2,222    1,793    2,510    2,317    1,772            Less than one year    1,396    1,020    1,847    1,453    1,105         All ages    One year or more    826    773    663    864    667            All durations    241    174    258    235    194            Less than one year    171    123    204    177    141         Under 25 years    One year or more    70    51    54    58    53            All durations    1,981    1,619    2,252    2,082    1,578            Less than one year    1,225    897    1,643    1,276    964      Female    25 years and over    One year or more    756    722    609    806    614         Source: CSO Live Register                             Table 2 Persons on the Live Register in Clare by Nationality, November 2020 - November 2024                       Year and Month                         November 2020    November 2021    November 2022    November 2023    November 2024      Nationality                     Irish nationals    3,996    3,106    3,107    2,723    2,614      Non-Irish nationals    930    756    1,940    1,927    1,118      of which:                     EU 14 excl. Irl    83    76    71    76    66      EU15 to EU27    432    321    322    286    284      United Kingdom    268    221    207    197    197      Other    147    138    1,340    1,368    571      Total Persons    4,926    3,862    5,047    4,650    3,732      Source: CSO Live Register                          Table 3 Persons on the Live Register in Clare by Last Held Occupation, November 2020 - November 2024                       Last Held Occupation      Year and Month                         November 2020      November 2021      November 2022      November 2023      November 2024        All broad occupational groups     4,926    3,862    5,047    4,650    3,732       Managers and administrators     197    158    123    122    122       Professional     341    229    239    216    204       Associate professional and technical     152    107    105    102    83       Clerical and secretarial     579    429    401    337    329       Craft and related     890    679    655    620    585       Personal and protective services     960    702    693    742    574       Sales     488    337    272    300    239       Plant and machine operatives     490    331    298    298    276       Other broad occupational groups     513    377    369    370    285       No occupation     316    513    1,892    1,543    1,035       Source: CSO Live Register                                   November 2022      November 2023      November 2024       5,047    4,650    3,732      123    122    122      239    216    204      105    102    83      401    337    329      655    620    585      693    742    574      272    300    239      298    298    276      369    370    285      1,892    1,543    1,035      ",
        "to": {
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 2. Deputy Timmy Dooley asked the Taoiseach the number of people on the live register in County Clare in November of 2020, 2021, 2022, 2023 and 2024, by age, gender, occupation, nationality and duration, in tabular form. [3038/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_27",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_27.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_27",
          "showAs": "Live Register"
        },
        "questionNumber": 2,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_13",
        "answerText": " Minister of State at the Department of the Taoiseach  I propose to take Questions Nos. 13 to 16, inclusive, together.  The exact information requested by the Deputy is not available.  The Labour Force Survey (LFS) is the official source of estimates of employment in the State. The most recent figures available are for Q3 2024.  Due to the methodology and sample size of the survey it is not possible to produce reliable county estimates from the LFS. Regional estimates of employment are produced by NUTS 3 level. NUTS are the geocode standard developed and regulated by Eurostat.  The NUTS 3 Mid-West region includes counties Clare, Tipperary, Limerick City and County.  The current NUTS 3 classification for Ireland, incorporating changes made under the Local Government Act 2014, is available from 2012 onwards in respect of LFS statistics.  The tables for this response use Q2 as the reference period for the year.  Table 1 shows the total number of persons in employment (ILO) in the Mid-west region 15-89 years, Q2 2012 – Q2 2024.  Table 2 shows the employment rate (ILO) of persons in the Mid-West region aged 15-64 years by sex, Q2 2012 – Q2 2024.  Table 3 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region by NACE Rev. 2 economic sector, Q2 2012 – Q2 2024.  Table 4 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region, by sex and FTPT status, Q2 2012 – Q2 2024     Table 1 Number of persons aged 15 - 89 years in employment (ILO) in the Mid-West region, Q2 2012 - Q2 2024, 000s                                                Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Persons in employment    189.4    192.2    193.6    200.2    206.9    219.4    218.0    221.1    205.3    231.6    252.3    255.3    267.2       Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                                   Table 2 Employment rate of persons in the Mid-West region aged 15 - 64 years (ILO)  by sex, Q2 2012 - Q2 2024, %                                             -    Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Male    62.6%    63.8%    66.1%    68.7%    71.0%    73.5%    72.4%    70.8%    67.1%    73.6%    78.3%    77.0%    76.9%      Female    54.8%    56.9%    56.1%    57.4%    60.0%    63.9%    58.9%    62.6%    56.3%    62.7%    68.2%    67.5%    69.7%      All    58.7%    60.4%    61.1%    63.0%    65.5%    68.7%    65.7%    66.7%    61.7%    68.2%    73.2%    72.2%    73.2%      Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                           ",
        "to": {
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 13. Deputy Timmy Dooley asked the Taoiseach the number of persons aged 15 to 89 years in employment in County Clare for each of the years from 2011 to 2024, in tabular form. [2963/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_33",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_33.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_33",
          "showAs": "Departmental Data"
        },
        "questionNumber": 13,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_14",
        "answerText": " Minister of State at the Department of the Taoiseach  I propose to take Questions Nos. 13 to 16, inclusive, together.  The exact information requested by the Deputy is not available.  The Labour Force Survey (LFS) is the official source of estimates of employment in the State. The most recent figures available are for Q3 2024.  Due to the methodology and sample size of the survey it is not possible to produce reliable county estimates from the LFS. Regional estimates of employment are produced by NUTS 3 level. NUTS are the geocode standard developed and regulated by Eurostat.  The NUTS 3 Mid-West region includes counties Clare, Tipperary, Limerick City and County.  The current NUTS 3 classification for Ireland, incorporating changes made under the Local Government Act 2014, is available from 2012 onwards in respect of LFS statistics.  The tables for this response use Q2 as the reference period for the year.  Table 1 shows the total number of persons in employment (ILO) in the Mid-west region 15-89 years, Q2 2012 – Q2 2024.  Table 2 shows the employment rate (ILO) of persons in the Mid-West region aged 15-64 years by sex, Q2 2012 – Q2 2024.  Table 3 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region by NACE Rev. 2 economic sector, Q2 2012 – Q2 2024.  Table 4 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region, by sex and FTPT status, Q2 2012 – Q2 2024     Table 1 Number of persons aged 15 - 89 years in employment (ILO) in the Mid-West region, Q2 2012 - Q2 2024, 000s                                                Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Persons in employment    189.4    192.2    193.6    200.2    206.9    219.4    218.0    221.1    205.3    231.6    252.3    255.3    267.2       Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                                   Table 2 Employment rate of persons in the Mid-West region aged 15 - 64 years (ILO)  by sex, Q2 2012 - Q2 2024, %                                             -    Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Male    62.6%    63.8%    66.1%    68.7%    71.0%    73.5%    72.4%    70.8%    67.1%    73.6%    78.3%    77.0%    76.9%      Female    54.8%    56.9%    56.1%    57.4%    60.0%    63.9%    58.9%    62.6%    56.3%    62.7%    68.2%    67.5%    69.7%      All    58.7%    60.4%    61.1%    63.0%    65.5%    68.7%    65.7%    66.7%    61.7%    68.2%    73.2%    72.2%    73.2%      Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                           ",
        "to": {
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 14. Deputy Timmy Dooley asked the Taoiseach to list, by sex, the employment rate in County Clare for those aged 15 to 64 years for each of the years from 2011 to 2024, in tabular form. [2964/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_33",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_33.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_33",
          "showAs": "Departmental Data"
        },
        "questionNumber": 14,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_15",
        "answerText": " Minister of State at the Department of the Taoiseach  I propose to take Questions Nos. 13 to 16, inclusive, together.  The exact information requested by the Deputy is not available.  The Labour Force Survey (LFS) is the official source of estimates of employment in the State. The most recent figures available are for Q3 2024.  Due to the methodology and sample size of the survey it is not possible to produce reliable county estimates from the LFS. Regional estimates of employment are produced by NUTS 3 level. NUTS are the geocode standard developed and regulated by Eurostat.  The NUTS 3 Mid-West region includes counties Clare, Tipperary, Limerick City and County.  The current NUTS 3 classification for Ireland, incorporating changes made under the Local Government Act 2014, is available from 2012 onwards in respect of LFS statistics.  The tables for this response use Q2 as the reference period for the year.  Table 1 shows the total number of persons in employment (ILO) in the Mid-west region 15-89 years, Q2 2012 – Q2 2024.  Table 2 shows the employment rate (ILO) of persons in the Mid-West region aged 15-64 years by sex, Q2 2012 – Q2 2024.  Table 3 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region by NACE Rev. 2 economic sector, Q2 2012 – Q2 2024.  Table 4 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region, by sex and FTPT status, Q2 2012 – Q2 2024     Table 1 Number of persons aged 15 - 89 years in employment (ILO) in the Mid-West region, Q2 2012 - Q2 2024, 000s                                                Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Persons in employment    189.4    192.2    193.6    200.2    206.9    219.4    218.0    221.1    205.3    231.6    252.3    255.3    267.2       Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                                   Table 2 Employment rate of persons in the Mid-West region aged 15 - 64 years (ILO)  by sex, Q2 2012 - Q2 2024, %                                             -    Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Male    62.6%    63.8%    66.1%    68.7%    71.0%    73.5%    72.4%    70.8%    67.1%    73.6%    78.3%    77.0%    76.9%      Female    54.8%    56.9%    56.1%    57.4%    60.0%    63.9%    58.9%    62.6%    56.3%    62.7%    68.2%    67.5%    69.7%      All    58.7%    60.4%    61.1%    63.0%    65.5%    68.7%    65.7%    66.7%    61.7%    68.2%    73.2%    72.2%    73.2%      Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                           ",
        "to": {
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 15. Deputy Timmy Dooley asked the Taoiseach the number of persons aged 15 to 89 years in employment classified by NACE Rev. 2 Economic Sector in County Clare for each of the years from 2011 to 2024, in tabular form. [2965/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_33",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_33.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_33",
          "showAs": "Departmental Data"
        },
        "questionNumber": 15,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_16",
        "answerText": " Minister of State at the Department of the Taoiseach  I propose to take Questions Nos. 13 to 16, inclusive, together.  The exact information requested by the Deputy is not available.  The Labour Force Survey (LFS) is the official source of estimates of employment in the State. The most recent figures available are for Q3 2024.  Due to the methodology and sample size of the survey it is not possible to produce reliable county estimates from the LFS. Regional estimates of employment are produced by NUTS 3 level. NUTS are the geocode standard developed and regulated by Eurostat.  The NUTS 3 Mid-West region includes counties Clare, Tipperary, Limerick City and County.  The current NUTS 3 classification for Ireland, incorporating changes made under the Local Government Act 2014, is available from 2012 onwards in respect of LFS statistics.  The tables for this response use Q2 as the reference period for the year.  Table 1 shows the total number of persons in employment (ILO) in the Mid-west region 15-89 years, Q2 2012 – Q2 2024.  Table 2 shows the employment rate (ILO) of persons in the Mid-West region aged 15-64 years by sex, Q2 2012 – Q2 2024.  Table 3 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region by NACE Rev. 2 economic sector, Q2 2012 – Q2 2024.  Table 4 shows the number of persons in employment (ILO) aged 15-89 years in the Mid-West region, by sex and FTPT status, Q2 2012 – Q2 2024     Table 1 Number of persons aged 15 - 89 years in employment (ILO) in the Mid-West region, Q2 2012 - Q2 2024, 000s                                                Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Persons in employment    189.4    192.2    193.6    200.2    206.9    219.4    218.0    221.1    205.3    231.6    252.3    255.3    267.2       Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                                   Table 2 Employment rate of persons in the Mid-West region aged 15 - 64 years (ILO)  by sex, Q2 2012 - Q2 2024, %                                             -    Q2 2012    Q2 2013    Q2 2014    Q2 2015    Q2 2016    Q2 2017    Q2 2018    Q2 2019    Q2 2020    Q2 2021    Q2 2022    Q2 2023    Q2 2024      Male    62.6%    63.8%    66.1%    68.7%    71.0%    73.5%    72.4%    70.8%    67.1%    73.6%    78.3%    77.0%    76.9%      Female    54.8%    56.9%    56.1%    57.4%    60.0%    63.9%    58.9%    62.6%    56.3%    62.7%    68.2%    67.5%    69.7%      All    58.7%    60.4%    61.1%    63.0%    65.5%    68.7%    65.7%    66.7%    61.7%    68.2%    73.2%    72.2%    73.2%      Source: Labour Force Survey (LFS), Central Statistics Office, Ireland.                                             Data may be subject to future revision.                                             Data may be subject to sampling or other survey errors, which are greater in respect of smaller values or estimates of change.                                           ",
        "to": {
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 16. Deputy Timmy Dooley asked the Taoiseach the number of persons aged 15 to 89 years in employment classified by sex and full- or part-time status in County Clare for each of the years from 2011 to 2024, in tabular form. [2966/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_33",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_33.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_33",
          "showAs": "Departmental Data"
        },
        "questionNumber": 16,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_88",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Darragh O'Brien)  The Government has put a range of policies and measures in place to alleviate fuel and energy poverty. These measures supplement lower income households through the Fuel Allowance and other payments, as well as providing free energy efficiency upgrades through the Sustainable Energy Authority of Ireland schemes and the Social Housing retrofitting programme.  Budget 2025 provided a €2.6 billion package of social protection measures to support households, individuals and businesses across Ireland impacted by recent high levels of inflation. It also introduced the Electricity Costs Emergency Benefit Scheme IV through which over 2.2 million households will receive two payments of €125 (inclusive of VAT) in the November/December 2024 and January/February 2025 billing cycles, at a total cost of €520 million. The payments apply to domestic electricity accounts, including those with Pay-As-You-Go meters, which are subject to distribution use of system charges at the rate for urban domestic customers (DG1) or the rate for rural domestic customers (DG2).  The Warmer Homes Scheme is a fully-funded energy upgrade scheme which aims to improve the energy efficiency and warmth of homes owned by people in or at risk of energy poverty. The scheme is operated by the Sustainable Authority of Ireland (SEAI) and is funded through the Exchequer and the European Regional Development Fund. The Scheme has been in existence in different forms since 2000 and has provided upgrades to over 160,000 homes since then. In 2024, 7,743 fully funded energy upgrades for low-income households were completed. The number of completed Warmer Homes scheme installs completed in County Clare are as follows:     2020    2021    2022    2023    2024    Total      20    48    78    75    137    358     Additionally, there were 342 households in Clare in the Warmer Homes work programme at the end of December 2024, approved for installation. ",
        "to": {
          "uri": null,
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 88. Deputy Timmy Dooley asked the Minister for the Environment, Climate and Communications the measures put in place by his Department to alleviate fuel and energy poverty in County Clare, in 2020, 2021, 2022, 2023 and 2024, in tabular form; and if he will make a statement on the matter. [2990/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_95",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_95.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_95",
          "showAs": "Fuel Poverty"
        },
        "questionNumber": 88,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_114",
        "answerText": " Tánaiste and Minister for Defence  My Department has Civil Service staff located in Newbridge, Galway, Roscrea, Cork and Dublin, with its headquarters in Newbridge, Co. Kildare. The Department also employs Civilian Employees who work to support Defence Forces’ capability in military establishments around the country. My Department has no locations in any of the local electoral areas in County Clare in which it employs public sector workers. ",
        "to": {
          "uri": null,
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 114. Deputy Timmy Dooley asked the Tánaiste and Minister for Defence the number of public sector workers in each of the local electoral areas in County Clare, per sector (details supplied), in tabular form; and if he will make a statement on the matter. [2973/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_119",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_119.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_119",
          "showAs": "Public Sector Staff"
        },
        "questionNumber": 114,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_146",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to cycling and public transport infrastructure, including the provision of funding to the National Transport Authority (NTA) in support of public bike-sharing schemes in Galway, Limerick, Cork and Waterford.  Matters related to the day-to-day operations, management and expansion of these public bike schemes are primarily a matter for the relevant local authorities, in conjunction with the NTA.  Outside of the regional cities, many local authorities have arrangements in place with shared mobility companies to provide bike-sharing schemes under contract or licence agreement. These schemes are not funded through the NTA. Accordingly, any plans to provide or expand such schemes in County Clare would be a matter for Clare County Council. ",
        "to": {
          "uri": null,
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 146. Deputy Timmy Dooley asked the Minister for Transport his plans to expand the public bike scheme in County Clare; and if he will make a statement on the matter. [2222/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_145",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_145.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_145",
          "showAs": "Cycling Policy"
        },
        "questionNumber": 146,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_329",
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 329 and 354 together.  My Department has Civil Service staff located in Newbridge, Galway, Roscrea, Cork and Dublin, with its headquarters in Newbridge, Co. Kildare. The Department also employs Civilian Employees who work to support Defence Forces’ capability in military establishments around the country. My Department has no locations in any of the local electoral areas in County Clare in which it employs public sector workers. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 329. Deputy Timmy Dooley asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the number of public sector workers in each of the local electoral areas in County Clare, per sector (details supplied), in tabular form; and if he will make a statement on the matter. [2973/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_319",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_319.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_319",
          "showAs": "Public Sector Staff"
        },
        "questionNumber": 329,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_476",
        "answerText": " Minister for Education (Deputy Helen McEntee)  I propose to take Questions Nos. 476 and 499 together.  I wish to advise the Deputy that the following staff are employed in County Clare, in respect of the areas of the Education Sector for which my Department has responsibility.  Please note, whereas data can be provided on a per County basis, no indicators are available to identify local electoral areas within Counties, and this information is therefore not available.   School Staff as at September 2024       Level      County      Whole Time Equivalent Posts      Total Number of Persons Employed       Post Primary    Clare    752.7    805      Primary    Clare    961.69    1,059      Non Teaching Staff    Clare    446.8    561     What is included in this figure is all teaching staff at primary and post primary level, in the case of schools paid by the Department of Education Payroll, all Special Needs Assistants (SNAs), caretakers and administrative staff. The figures also include Teachers and SNAs employed in Education and Training Board (ETB) schools, but excludes administrative and caretaking staff in ETB schools, as well as staff employed within the ETB itself.   Other Public Servants employed in County Clare      Organisation/employee type    31 December 2024 (Headcount)       Organisation/employee type      31 December 2024 (Headcount)        Department of Education staff - Co. Clare          National Education Psychologists    7      Inspectors    4      Administrative staff    1      National Council for Special Education (6 Advisors and Visiting Teachers and 4 Civil Servants    10     Please note, details of the total number of staff who are employed in the early years and pre school sector can be obtained from the Department of Children, Equality, Disability, Integration and Youth.  Details of the number of persons employed in the Higher or Further Education Sector can be obtained from the Department of Further Higher Education, Research, Innovation and Science. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 476. Deputy Timmy Dooley asked the Minister for Education the number of public sector workers in each of the local electoral areas in County Clare, per sector (details supplied), in tabular form; and if she will make a statement on the matter. [2973/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_451",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_451.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_451",
          "showAs": "Public Sector Staff"
        },
        "questionNumber": 476,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_558",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 558 and 564 together.  Under Section 159 of the Local Government Act 2001, each Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which he/she is responsible. My Department oversees workforce planning for the local government sector, including the monitoring of local government sector employment levels. To this end, my Department gathers aggregate quarterly data on staff numbers in each local authority on a whole time equivalent basis.  However, granular data, in terms of the detailed breakdown of the numbers of staff allocated to each of the local electoral areas within local authorities is not collected and consequently is not available in my Department. The relevant information would be available from the local authority concerned.  Staffing numbers for Clare County Council are available on the Public Service Numbers databank, which is hosted and maintained by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and is available at the following link:  https://databank.per.gov.ie/Public_Service_Numbers.aspx?rep=LA ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 558. Deputy Timmy Dooley asked the Minister for Housing, Local Government and Heritage the number of public sector workers in each of the local electoral areas in County Clare, per sector (details supplied), in tabular form; and if he will make a statement on the matter. [2973/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_524",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_524.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_524",
          "showAs": "Public Sector Staff"
        },
        "questionNumber": 558,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_609",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 563 and 609 together.  The Housing Assistance Payment (HAP) is a form of social housing support available for people who have a long-term housing need. Any household assessed as eligible for social housing is immediately eligible for HAP. Eligible households can source their own accommodation in the private rental sector which should be within the HAP rent limits provided to them by the local authority.  The latest available data covers the period to the end of Q3 2024. The table below provides a breakdown of the total number of active HAP tenancies registered in Clare County Council at the end of each year from 2020-2023 and to end Q3 2024.     Local Authority    2020    2021    2022    2023    Q3 2024      Clare County Council    1,423    1,347    1,209    1,160    1,091    ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 609. Deputy Timmy Dooley asked the Minister for Housing, Local Government and Heritage the number of persons in receipt of housing assistance payment in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3037/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_525",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_525.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_525",
          "showAs": "Housing Schemes"
        },
        "questionNumber": 609,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_634",
        "answerText": " Minister for Social Protection  A person is said to be in consistent poverty if they are both at-risk-of-poverty (AROP) and suffering from material deprivation. Data on rates of consistent poverty are derived from the CSOs Survey of Income and Living Conditions (SILC).  The SILC is an annual survey carried out by the CSO of a representative sample of the population. The survey collects information on the income and living conditions of different households in Ireland, in order to derive indicators on poverty, deprivation and social exclusion. It is carried out in every EU country under EU legislation and commenced in Ireland in June 2003.  The definition of income in SILC is based on a 12-month period. The income reference period for SILC is the previous calendar year. Therefore, the income reference period for the latest data from SILC 2023 is from January to December 2022. The achieved sample size in Ireland was:  • 4,191 households and 10,199 individuals in 2023.  Official poverty data, as collated by the CSO, is not available at an electoral area or county level. However, it does provide equivalent regional data. County Clare is included in the Southern region, along with Counties Tipperary, Limerick, Waterford, Kilkenny, Carlow, Wexford, Cork, and Kerry.  The below table sets out the consistent poverty rate for each of the three regions alongside the National rate for the years 2020 to 2023 (due to a break in time series in the methodology used to collect SILC data, income data from the 2020 SILC onwards is not directly comparable with previous years).     -    Southern    Northern and Western    Eastern and Midland    National      2020    4.9%    4.4%    4.0%    4.4%      2021    5.5%    3.8%    3.5%    4.2%      2022    5.9%    8.2%    3.0%    4.9%      2023    4.0%    4.2%    3.1%    3.6%     All the regions experienced a decrease in consistent poverty in 2023 compared to 2020. The Northern and Western region decreased by 0.2 percentage points, the Southern region dropped by 0.9 percentage points, and the Eastern and Midland region declined by 0.9 percentage points.   ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 634. Deputy Timmy Dooley asked the Minister for Social Protection to list the level of consistent poverty in each of the electoral areas of Ennis, Ennistymon, Killaloe, Kilrush, and Shannon, in County Clare for each of the years 2011 to 2024, in tabular form; and if he will make a statement on the matter. [2967/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_590",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_590.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_590",
          "showAs": "Poverty Data"
        },
        "questionNumber": 634,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_635",
        "answerText": " Minister for Social Protection  While there is no official indicator at EU level for measuring the rate of people experiencing food poverty, the Economic and Social Research Institute (ESRI) has developed a deprivation-based measure of food poverty in Ireland, based on data from the Survey of Income and Living Conditions (SILC).  Under this measure, Food Poverty is defined as the inability to have an adequate and nutritious diet due to issues of affordability or accessibility. It is measured by the percentage of individuals experiencing one or more of the following –  • Unable to afford a meal with meat, or vegetarian equivalent, every second day,  • Unable to afford a weekly roast dinner (or vegetarian equivalent), and  • Missing one substantial meal in the last fortnight due to lack of money.  Due to sample size constraints in the SILC, data for the number of people experiencing food poverty, under this measure, is only available at the National level and cannot be reported at regional, county or electoral area level.  The national rate of food poverty in Ireland in SILC 2023 was 8.9%, up from 8.4% in SILC 2022 but down from 12.2% in SILC 2020. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 635. Deputy Timmy Dooley asked the Minister for Social Protection to list the level of food poverty in each of the electoral areas of Ennis, Ennistymon, Killaloe, Kilrush, and Shannon, in County Clare for each of the years 2011 to 2024, in tabular form; and if he will make a statement on the matter. [2969/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_591",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_591.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_591",
          "showAs": "Poverty Data"
        },
        "questionNumber": 635,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_692",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 692 and 740 together,  The number of recipients of Farm Assist in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Farm Assist    230    239    194    176    158     The Deputy may also be interested to know that the the number of people on these schemes by year, including a  breakdown by county, is available in the Annual Statistics Reports published by the Statistics Unit of the Department of Social Protection on gov.ie (currently available up to 2023). ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 692. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of farm assist in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3015/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_640",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_640.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_640",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 692,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_693",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 693, 698, 741 and 746 together.  Both Fish Assist and Jobseeker’s for Professional Artists are administered under the Jobseeker’s Allowance scheme. As such, county breakdowns are not separately available for these forms of Jobseeker’s Allowance. The table below details the number of recipients of Jobseeker’s Allowance for county Clare in each of the years requested. These numbers are inclusive of any recipients of Fish Assist or Jobseeker’s for Professional Artists.     -    2020    2021    2022    2023    2024      Jobseeker's Allowance    3144    2925    4290    3906    2995     The total number of recipients of Jobseeker's Allowance in the State is shown in the table below. Again, as Jobseeker's Allowance for Professional Artists is administered under the Jobseeker's Allowance scheme, separate numbers for this are not available.     -    2020    2021    2022    2023    2024      Jobseeker's Allowance    125,703    108,414    126,616    119,356    107,693    ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 693. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of fish assist in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3016/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_642",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_642.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_642",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 693,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_694",
        "answerText": " Minister for Social Protection  I propose to take questions Nos. 693, 698, 741 and 746 together.  The number of recipients of Jobseeker's Allowance and Jobseeker's Transitional Payment in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Jobseeker's Allowance    3144    2925    4290    3906    2995      Jobseeker's Transitional Payment    292    333    551    579    497     The Deputy may also be interested to know that the number of people on these schemes by year, including a  breakdown by county, is available in the Annual Statistics Reports published by the Statistics Unit of the Department of Social Protection on gov.ie (currently available up to 2023). ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 694. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of jobseeker's allowance in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3017/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_643",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_643.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_643",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 694,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_695",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 695, 696, 719, 739, 743, 744 together.  The number of recipients of Jobseeker's Benefit in County Clare for each of the years 2020 - 2024 are shown below. Note that Jobseeker's Benefit for the Self-Employed and Benefit Payment for 65-year-olds are administered as part of the Jobseeker's Benefit scheme. As such, county breakdowns are not separately available for these forms of Jobseeker’s Benefit. The table below details the number of recipients of Jobseeker’s Benefit for county Clare in each of the years requested. These numbers are inclusive of any recipients of Jobseeker's Benefit for the Self-Employed and Benefit Payment for 65-year-olds. Note that Benefit Payment for 65-year-olds was introduced in February 2021.     -    2020    2021    2022    2023    2024      Jobseeker's Benefit    1046    1120    1169    1070    1101     The Deputy may also be interested to know that the number of people on Jobseeker's Benefit by year, including a  breakdown by county, is available in the Annual Statistics Reports published by the Statistics Unit of the Department of Social Protection on gov.ie (currently available up to 2023). ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 695. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of jobseeker's benefit in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3018/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_644",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_644.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_644",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 695,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_696",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 695, 696, 719, 739, 743, 744 together.  The number of recipients of Jobseeker's Benefit in County Clare for each of the years 2020 - 2024 are shown below. Note that Jobseeker's Benefit for the Self-Employed and Benefit Payment for 65-year-olds are administered as part of the Jobseeker's Benefit scheme. As such, county breakdowns are not separately available for these forms of Jobseeker’s Benefit. The table below details the number of recipients of Jobseeker’s Benefit for county Clare in each of the years requested. These numbers are inclusive of any recipients of Jobseeker's Benefit for the Self-Employed and Benefit Payment for 65-year-olds. Note that Benefit Payment for 65-year-olds was introduced in February 2021.     -    2020    2021    2022    2023    2024      Jobseeker's Benefit    1046    1120    1169    1070    1101     The Deputy may also be interested to know that the number of people on Jobseeker's Benefit by year, including a  breakdown by county, is available in the Annual Statistics Reports published by the Statistics Unit of the Department of Social Protection on gov.ie (currently available up to 2023). ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 696. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of jobseeker's benefit for the self-employed in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3019/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_644",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_644.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_644",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 696,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_697",
        "answerText": " Minister for Social Protection  I propose to take questions Nos. 693, 698, 741 and 746 together.  The number of recipients of Jobseeker's Allowance and Jobseeker's Transitional Payment in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Jobseeker's Allowance    3144    2925    4290    3906    2995      Jobseeker's Transitional Payment    292    333    551    579    497     The Deputy may also be interested to know that the number of people on these schemes by year, including a  breakdown by county, is available in the Annual Statistics Reports published by the Statistics Unit of the Department of Social Protection on gov.ie (currently available up to 2023). ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 697. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of jobseeker's transitional payment in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3020/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_643",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_643.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_643",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 697,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_698",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 693, 698, 741 and 746 together.  Both Fish Assist and Jobseeker’s for Professional Artists are administered under the Jobseeker’s Allowance scheme. As such, county breakdowns are not separately available for these forms of Jobseeker’s Allowance. The table below details the number of recipients of Jobseeker’s Allowance for county Clare in each of the years requested. These numbers are inclusive of any recipients of Fish Assist or Jobseeker’s for Professional Artists.     -    2020    2021    2022    2023    2024      Jobseeker's Allowance    3144    2925    4290    3906    2995     The total number of recipients of Jobseeker's Allowance in the State is shown in the table below. Again, as Jobseeker's Allowance for Professional Artists is administered under the Jobseeker's Allowance scheme, separate numbers for this are not available.     -    2020    2021    2022    2023    2024      Jobseeker's Allowance    125,703    108,414    126,616    119,356    107,693    ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 698. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of professional artists on jobseeker's allowance in the State, and in County Clare, for each of the years 2020 to 2024; and if he will make a statement on the matter. [3021/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_642",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_642.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_642",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 698,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_699",
        "answerText": " Minister for Social Protection  The number of recipients of Supplementary Welfare Allowance in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Supplementary Welfare Allowance    109    106    189    168    188    ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 699. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons who received a supplementary welfare allowance payment in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3023/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_645",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_645.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_645",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 699,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_700",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 700 and 748 together.  The number of recipients of Blind Pension in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Blind Pension    10    12    17    14    15      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 700. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of the blind pension in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3025/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_646",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_646.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_646",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 700,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_701",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 701, 702, 704, 705, 749, 750, 752, 753 together.  The number of recipients of Disability Allowance, Carer's Allowance, Invalidity Pension, and Carer's Benefit in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Disability Allowance    3658    3825    3855    3997    4136      Carer's Allowance    2229    2320    2311    2350    2388      Invalidity Pension    1293    1339    1300    1325    1267      Carer's Benefit    97    89    74    104    111      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 701. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of carer's allowance in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3026/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_647",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_647.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_647",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 701,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_702",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 701, 702, 704, 705, 749, 750, 752, 753 together.  The number of recipients of Disability Allowance, Carer's Allowance, Invalidity Pension, and Carer's Benefit in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Disability Allowance    3658    3825    3855    3997    4136      Carer's Allowance    2229    2320    2311    2350    2388      Invalidity Pension    1293    1339    1300    1325    1267      Carer's Benefit    97    89    74    104    111      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 702. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of carer's benefit in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3027/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_647",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_647.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_647",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 702,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_703",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 703 and 751 together.  Constant Attendance Allowance is an increase to Disablement Benefit for persons who lose their physical or mental ability due to an accident at work or a work-related illness, and as a result need daily care.  The Department of Social Protection does not currently hold statistics on the number of recipients of the Constant Attendance Allowance by county; the number of recipients of Disablement Benefit by county are given in the below table. Note that statistics on number of recipients by county of Disablement Benefit were not maintained before 2021 and so are not currently available.     -    2021    2022    2023    2024      Disablement Benefit    361    358    387    385      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 703. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of constant attendance allowance in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3028/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_648",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_648.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_648",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 703,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_704",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 701, 702, 704, 705, 749, 750, 752, 753 together.  The number of recipients of Disability Allowance, Carer's Allowance, Invalidity Pension, and Carer's Benefit in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Disability Allowance    3658    3825    3855    3997    4136      Carer's Allowance    2229    2320    2311    2350    2388      Invalidity Pension    1293    1339    1300    1325    1267      Carer's Benefit    97    89    74    104    111      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 704. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of disability allowance in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3029/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_647",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_647.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_647",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 704,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_705",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 701, 702, 704, 705, 749, 750, 752, 753 together.  The number of recipients of Disability Allowance, Carer's Allowance, Invalidity Pension, and Carer's Benefit in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Disability Allowance    3658    3825    3855    3997    4136      Carer's Allowance    2229    2320    2311    2350    2388      Invalidity Pension    1293    1339    1300    1325    1267      Carer's Benefit    97    89    74    104    111      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 705. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of invalidity pension in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3030/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_647",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_647.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_647",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 705,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_706",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 706, 714, 734, 747, 754, 759 together.  The Supplementary Welfare Allowance scheme is the safety net within the overall social welfare system in that it provides assistance to eligible people in the State whose means are insufficient to meet their needs and those of their dependents. Supports provided under the scheme can consist of a basic weekly payment, a weekly or monthly supplement in respect of certain expenses, as well as Additional Needs Payments.  The Basic Supplementary Welfare allowance provides immediate assistance for those in need who are awaiting the outcome of a claim or an appeal for a primary social welfare payment or do not qualify for payment under other State schemes.  Rent supplement provides short-term income support to eligible people living in private rented accommodation whose means are insufficient to meet their accommodation costs and who do not have accommodation available to them from any other source. The scheme ensures that for those who were renting, but whose circumstances have changed due to temporary loss of employment, can continue to meet their rental commitments.  Under the Supplementary Welfare Allowance scheme, my department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income. This is an overarching term used to refer to Exceptional and Urgent Needs Payments, and certain supplements to assist with ongoing or recurring costs that cannot be met from the customer’s own resources, and which are deemed to be necessary. Urgent Needs Payments make up only a small percentage of the payments made under the Additional Needs Payment scheme.  Table 1 shows the number of Basic Supplementary Allowance and supplement recipients in Co Clare, at year end 2020-2024.  Table 2 shows the number of Additional Needs Payments (excluding supplements) issued in Co Clare, 2020-2024.  Any person who considers they may have an entitlement to a Supplementary Welfare Allowance payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  I trust this clarifies the matter for the Deputies.   Tabular Statement    Table 1- Basic Supplementary Welfare Allowance and Supplement recipients in Co Clare, at year end 2020-2024.       Scheme      End of 2020      End of 2021      End of 2022      End of 2023      End of 2024       Basic Supplementary Welfare Allowance    111    115    193    169    194      Rent Supplement    132    61    57    54    54      Other Supplements    52    48    56    51    41      Table 2- Additional Needs Payments (excluding supplements) issued in Co Clare, 2020-2024      -     2020      2021      2022      2023      2024       Number of Exceptional Needs Payments/Urgent Needs Payments    1,777    1,270    3,666    2,706    1,800      Of which Exceptional Needs Payments    1,763    1,264    3,638    2,682    1,783      Of which Urgent Needs Payments    14    6    28    24    17 -        ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 706. Deputy Timmy Dooley asked the Minister for Social Protection the number of people who received an urgent needs payment in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3031/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_649",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_649.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_649",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 706,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_707",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 707 and 755 together.  The number of recipients of the Wage Subsidy Scheme in County Clare at the end of 2024 was 66.  Note that statistics on the number of recipients of the Wage Subsidy Scheme by county were not maintained by the DSP prior to 2024 and so the number of recipients broken down by county for the years 2020 - 2023 is not available. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 707. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of the wage subsidy scheme in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3032/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_650",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_650.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_650",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 707,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_708",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 708, 718, 738, 756 together.  The number of recipients of Back to Work Enterprise Allowance and Back to Education Allowance in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Back to Work Enterprise Allowance    88    81    70    69    72      Back to Education Allowance    130    141    101    93    102      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 708. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of the back to education allowance in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3033/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_651",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_651.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_651",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 708,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_709",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 709 and 757 together.  The number of recipients of State Pension (Contributory) in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      State Pension (Contributory)    10707    11610    12108    12684    13433      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 709. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of the State pension (contributory) in County Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3034/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_652",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_652.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_652",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 709,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_710",
        "answerText": " Minister for Social Protection  The table below shows the end-year numbers of recipients of state pension non-contributory in Co Clare for the years 2020 - 2024. The numbers have remained relatively consistent, averaging at 3,179 over the past five years.      Date      Number of recipients of SPNC (personal rate)       2024    3,120      2023    3,253      2022    3,204      2021    3,119      2020    3,201     I trust this clarifies the matter for the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 710. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of the State pension (non-contributory) in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3035/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_653",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_653.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_653",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 710,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_711",
        "answerText": " Minister for Social Protection  The number of recipients of Rent Supplement in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      Rent Supplement    126    66    56    58    52      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 711. Deputy Timmy Dooley asked the Minister for Social Protection the number of persons in receipt of rent supplement in County Clare for each of the years 2020 to 2024; and if he will make a statement on the matter. [3036/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_655",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_655.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_655",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 711,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_712",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 712 and 732 together.  The Back to School Clothing and Footwear Allowance (BSCFA) scheme provides a once-off payment to eligible families to assist with the costs of clothing and footwear when children start or return to school each autumn. The scheme operates from June to September each year.  The allowance is paid in respect of eligible children between the ages of 4 and 17 on or before 30 September and eligible children between the ages of 18 and 22 on or before 30 September, if returning to full time second level education. To qualify for the allowance, the applicant must be in receipt of an increase for a qualified child in respect of the child for whom the allowance is being claimed, the applicant must be in receipt of a qualifying payment and the assessable income for the household must be within a set income limit.  The number of BSCFA recipients and the number of qualified children for whom BSCFA was approved in County Clare in 2020, 2021, 2022, 2023 and 2024 is set out in tabular form below.      Year      BSCFA recipients in County Clare      Number of children benefiting in County Clare       2020    3,172    6,004      2021    3,008    5,743      2022    3,679    6,644      2023    3,622    6,499      2024    3,440    6,220       I trust this clarifies the matter for the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 712. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of the back-to-school clothing and footwear allowance in County Clare, in 2020, 2021, 2022, 2023 and 2024; and if he will make a statement on the matter. [3040/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_656",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_656.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_656",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 712,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_713",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 713, 715, 733 and 735 together.  The number of recipients of One Parent Family Payment and Back to Work Family Dividend in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      One Parent Family Payment    667    833    1023    1024    938      Back to Work Family Dividend    48    58    65    44    55      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 713. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of the back to work family dividend in County Clare, in 2020, 2021, 2022, 2023 and 2024; and if he will make a statement on the matter. [3041/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_657",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_657.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_657",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 713,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_714",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 706, 714, 734, 747, 754, 759 together.  The Supplementary Welfare Allowance scheme is the safety net within the overall social welfare system in that it provides assistance to eligible people in the State whose means are insufficient to meet their needs and those of their dependents. Supports provided under the scheme can consist of a basic weekly payment, a weekly or monthly supplement in respect of certain expenses, as well as Additional Needs Payments.  The Basic Supplementary Welfare allowance provides immediate assistance for those in need who are awaiting the outcome of a claim or an appeal for a primary social welfare payment or do not qualify for payment under other State schemes.  Rent supplement provides short-term income support to eligible people living in private rented accommodation whose means are insufficient to meet their accommodation costs and who do not have accommodation available to them from any other source. The scheme ensures that for those who were renting, but whose circumstances have changed due to temporary loss of employment, can continue to meet their rental commitments.  Under the Supplementary Welfare Allowance scheme, my department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income. This is an overarching term used to refer to Exceptional and Urgent Needs Payments, and certain supplements to assist with ongoing or recurring costs that cannot be met from the customer’s own resources, and which are deemed to be necessary. Urgent Needs Payments make up only a small percentage of the payments made under the Additional Needs Payment scheme.  Table 1 shows the number of Basic Supplementary Allowance and supplement recipients in Co Clare, at year end 2020-2024.  Table 2 shows the number of Additional Needs Payments (excluding supplements) issued in Co Clare, 2020-2024.  Any person who considers they may have an entitlement to a Supplementary Welfare Allowance payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  I trust this clarifies the matter for the Deputies.   Tabular Statement    Table 1- Basic Supplementary Welfare Allowance and Supplement recipients in Co Clare, at year end 2020-2024.       Scheme      End of 2020      End of 2021      End of 2022      End of 2023      End of 2024       Basic Supplementary Welfare Allowance    111    115    193    169    194      Rent Supplement    132    61    57    54    54      Other Supplements    52    48    56    51    41      Table 2- Additional Needs Payments (excluding supplements) issued in Co Clare, 2020-2024      -     2020      2021      2022      2023      2024       Number of Exceptional Needs Payments/Urgent Needs Payments    1,777    1,270    3,666    2,706    1,800      Of which Exceptional Needs Payments    1,763    1,264    3,638    2,682    1,783      Of which Urgent Needs Payments    14    6    28    24    17 -        ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 714. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of basic supplementary welfare allowance in County Clare, in 2020, 2021, 2022, 2023 and 2024; and if he will make a statement on the matter. [3042/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_649",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_649.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_649",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 714,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_715",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 713, 715, 733 and 735 together.  The number of recipients of One Parent Family Payment and Back to Work Family Dividend in County Clare for each of the years 2020 - 2024 are shown below.     -    2020    2021    2022    2023    2024      One Parent Family Payment    667    833    1023    1024    938      Back to Work Family Dividend    48    58    65    44    55      ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 715. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of one parent family payment in County of Clare, for each year from 2001 to 2024; and if he will make a statement on the matter. [3043/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_657",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_657.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_657",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 715,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_716",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 716 and 736 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  In Budget 2025, it was announced that the Hot School Meals Scheme will be extended to all remaining primary schools in 2025, meaning that approximately 3,700 schools and 682,000 children will be eligible for school meals in 2025.  The number of students who benefit from the School Meals Programme in County Clare for each of the years 2020 to 2024 are listed in the table below.   County Clare students who benefit from the School Meals Programme from 2020 to 2024       Schools Only (Primary & Secondary) in Clare           Academic Year      Pupils Benefitting        2020-2021     3,748       2021-2022     3,942       2022-2023     5,368       2023-2024     9,937       I trust this clarifies the matter. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 716. Deputy Timmy Dooley asked the Minister for Social Protection the number of students who benefit from the school meals scheme in the county of Clare for each of the years 2020 to 2024 inclusive; and if he will make a statement on the matter. [3044/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_658",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_658.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_658",
          "showAs": "School Meals Programme"
        },
        "questionNumber": 716,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Timmy-Dooley.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Timmy-Dooley.S.2002-09-12",
          "showAs": "Timmy Dooley"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_717",
        "answerText": " Minister for Social Protection  Working Family Payment (WFP) is a weekly in-work support which provides an income top-up for employees on low earnings with children. To qualify for Working Family Payment, the customer must have at least one qualified child who normally resides with them and be working a minimum of 38 hours per fortnight in ongoing insurable employment.  Please find table below with the number of WFP recipients per year (end of each year) for county Clare:      2020      2021      2022      2023      2024       990    929    903    911    928     I trust this clarifies the matter for the Deputy ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 717. Deputy Timmy Dooley asked the Minister for Social Protection the number of people in receipt of the working family payment in County Clare, in 2020, 2021, 2022, 2023 and 2024; and if he will make a statement on the matter. [3045/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_659",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_659.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_659",
          "showAs": "Social Welfare Payments"
        },
        "questionNumber": 717,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    }
  ]
}