{
  "head": {
    "counts": {
      "questionCount": 4805,
      "resultCount": 4805
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 540. Deputy John Brady asked the Minister for Health the status of section 39 pay restoration for organisations funded by her Department; the reason workers in a team (details supplied) funded by her Department have received only one round of restoration while HSE-funded colleagues have received full restoration and scheduled increases; her plans to ensure full parity of pay and eliminate the resulting disparity among staff; and if she will make a statement on the matter. [70918/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_511",
          "debateSectionId": "dbsect_511",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_511.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_540",
        "questionNumber": 540
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  At community level, the Government is fully supportive of community initiatives that encourage wider adoption of energy efficiency measures. My Department funds a range of energy upgrade supports administered by the Sustainable Energy Authority of Ireland (SEAI), which communities can avail of.  These include:  • The Sustainable Energy Communities (SECs) which supports communities, through local mentors and co-ordinators, on their decarbonisation journey and to undertake Energy Master Plans (EMPs) identifying energy projects in their local areas;  • The Community Energy Grant (CEG) Scheme which provides funding for a range of improvements to existing buildings including insulation, heat pump systems, solar PV, energy-efficient lighting, and energy monitors, as well as other energy upgrades; and,  • The Micro-generation Support Scheme (MSS) which can provide support to community organisation for renewable installations.  Information on SEAI supported community grants can be found at: www.seai.ie/grants/community-grants  My Department also supports local community groups through the Community Climate Action Programme (CCAP) administered by Community Climate Action Officers (CCAO) in our local authorities. The programme’s two strands support communities, large and small, rural and urban, to build low carbon communities in a considered and structured way. Community groups should contact their local CCAO in their Local Authority for more information. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 90. Deputy John Brady asked the Minister for Climate, Energy and the Environment to outline and provide detailed information on the grants available for community organisations for energy upgrades; and if he will make a statement on the matter. [70164/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_102",
          "debateSectionId": "dbsect_102",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_90",
        "questionNumber": 90
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 261. Deputy John Brady asked the Minister for Transport the position regarding the new planned Local Link service between Roundwood and Bray, County Wicklow; when the service is due to commence; the details of the schedule; and if he will make a statement on the matter. [69949/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_240",
          "debateSectionId": "dbsect_240",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_240.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_261",
        "questionNumber": 261
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  The NCSE is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at [ oireachtasqueries@ncse.ie ]. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 398. Deputy John Brady asked the Minister for Education and Youth if a letter of eligibility can be provided from the NCSE to a person (details provided), as they need to move to a special school setting; and if she will make a statement on the matter. [69313/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_357",
          "debateSectionId": "dbsect_357",
          "showAs": "National Council for Special Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_357.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_398",
        "questionNumber": 398
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  It has not been possible to collate the information requested by the Deputy in the time available. I will write to the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 440. Deputy John Brady asked the Minister for Justice, Home Affairs and Migration if funding for the refurbishment of the former Wicklow district courthouse in Wicklow town is provided for in the revised Department sectoral plan which was compiled following the review of the National Development Plan; if he can provide a cost of refurbishing the building; and if he will make a statement on the matter. [68101/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_389",
          "debateSectionId": "dbsect_389",
          "showAs": "Court Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_389.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_440",
        "questionNumber": 440
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 148. Deputy John Brady asked the Minister for Foreign Affairs and Trade to provide an update on a passport application (details supplied), given the applicants travel date is imminent; and if she will make a statement on the matter. [65330/25] ",
        "debateSection": {
          "showAs": "Passport Services",
          "debateSectionId": "dbsect_162",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_162",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_162.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "questionNumber": 148,
        "answerText": " Minister for Foreign Affairs and Trade  All passport applications are subject to the provisions of the Passports Act, 2008 (“the 2008 Act”). Under Section 14(1) of the Act, the consent of a child’s guardian(s) must be given before the Passport Service can issue them a passport.  In order to protect the integrity of the Irish passport and the rights of the child and their guardian(s), it is important that the Child Identity and Consent form is correctly completed, witnessed and validated by the Passport Service for both first time and renewal applications for children. Guardians must be present to the person acting as a witness.  The witnessing of passport forms is a vital element of the identity verification process for the Passport Service, as it provides initial assurance that the person in the photograph is the same person submitting the passport application form. In the case of children, it is essential that the Passport Service verifies the consent of the child’s guardians before a passport can issue. This ensures that the Passport Service protects the integrity of the passport itself and the rights of the child and their guardians.  Turnaround time applies to fully complete and correct applications, and begins from the date that supporting documents are received by the Passport Service, not the date the online application is made. Applications that are incorrect or incomplete will take longer to process. Since 2022, the Passport Service has operated a document management system whereby incomplete applications that require further supporting documents are prioritised once the additional documents are received by the Passport Service. These applications are then processed within 15 working days.  With regard to the Deputy's query, the supporting documents for this application was received by the Passport Service on 20 October 2025. As both guardians were not present when the Child Identity and Consent form was witnessed, this form was not acceptable. Another Child Identity and Consent form was requested by the Passport Service on 10 November 2025. This was received by the Passport Service on 18 November 2025. The application is currently queuing to be re-examined by the Passport Entitlement team. Therefore, this application is within the turnaround time. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Foreign",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_148",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 214,
        "showAs": " 214. Deputy John Brady asked the Minister for Climate, Energy and the Environment the volumes of domestic, commercial and medical waste contained in the illegal landfill in Whitestown, County Wicklow; and if he will make a statement on the matter. [63392/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_214",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 215,
        "showAs": " 215. Deputy John Brady asked the Minister for Climate, Energy and the Environment the amount of material that has been removed from the illegal landfill at Whitestown, County Wicklow; and if he will make a statement on the matter. [63393/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_215",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 216,
        "showAs": " 216. Deputy John Brady asked the Minister for Climate, Energy and the Environment to provide details of the location the waste from the illegal landfill at Whitestown, County Wicklow, has been removed to; the location the remainder is to be taken to; and if he will make a statement on the matter. [63394/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_216",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 217,
        "showAs": " 217. Deputy John Brady asked the Minister for Climate, Energy and the Environment the details and timeframe of the remediation plan for the illegal landfill at Whitestown, County Wicklow; if he will make the plan public; and if he will make a statement on the matter. [63395/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_217",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 218,
        "showAs": " 218. Deputy John Brady asked the Minister for Climate, Energy and the Environment to provide details on pollution or contamination to the environment or watercourses at the illegal landfill at Whitestown, County Wicklow, or adjoining lands; and if he will make a statement on the matter. [63396/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_218",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 219,
        "showAs": " 219. Deputy John Brady asked the Minister for Climate, Energy and the Environment the total costs to date, including legal costs, incurred in addressing the illegal landfill at Whitestown, County Wicklow; to specify the parties that have borne these costs; and if he will make a statement on the matter. [63397/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_219",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 220,
        "showAs": " 220. Deputy John Brady asked the Minister for Climate, Energy and the Environment the details of funding provided to Wicklow County Council to help address the illegal landfill at Whitestown, County Wicklow, including the amounts and years in which such funding was allocated; and if he will make a statement on the matter. [63398/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_220",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 221,
        "showAs": " 221. Deputy John Brady asked the Minister for Climate, Energy and the Environment the projected final costs to remediate the illegal landfill at Whitestown, County Wicklow; the party which will bear these costs; and if he will make a statement on the matter. [63399/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_221",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Illegal Dumping",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_173",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 214 to 221, inclusive, together.  In accordance with the Waste Management Act, the management of waste including the remediation of legacy landfill sites, such as Whitestown, is the legal responsibility of the respective local authorities. In this context, site specific and operational questions are a matter for the local authority and should be addressed directly to Wicklow County Council in this instance. Local Authorities must comply with the remediation requirements in accordance with the Environmental Protection Agency waste licence regime to ensure the necessary environmental safeguards are put in place.  The landfill remediation grant scheme was established with the express purposes of assisting local authorities in recognition of the significant financial burden placed on them to meet this obligation. The statutory responsibility of the relevant local authority in remediating these sites is reflected and reinforced in the first National Waste Management Plan for a Circular Economy.  I am advised that the remediation of the Whitestown site is subject to ongoing legal proceedings in the High Court and Wicklow County Council is acting in accordance with High Court judgements to remediate the site.  Wicklow County Council has availed of funding through the Landfill Remediation Grant Scheme in respect of Whitestown as set out in the table below.     Year    Grant Amount (€)      2013    €958,428.53      2014    €2,293,799.90      2016    €616,135.17      2021    €428,320.30      2022    €540,966.10      2023    €1,351,861.16      2024    €962,653.78      2025 (YTD)    €59,985.27       Funding supports Wicklow County Council in assessing and managing the site in accordance with the High Court proceedings to ensure the optimal environmental outcome, as capital works only. No legal costs are funded by the Department.  I am advised that tendering processes for capital works and material outlets have been undertaken by the Council this year and a provision of €15 million has been made by the Department to support this work in 2026. It is expected that the remediation of Whitestown will cost in the region of €45M over a three year period with a further year of monitoring of the site required following the remediation. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 355,
        "showAs": " 355. Deputy John Brady asked the Minister for Finance to provide details of efforts by ISIF to ensure work recommences on the Greystones Media Campus; and if he will make a statement on the matter. [63158/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Finance"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_355",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_296",
          "showAs": "Film Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_296",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_296.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Finance (Deputy Paschal Donohoe)  The National Treasury Management Agency (NTMA) has informed me that the Ireland Strategic Investment Fund (ISIF) has invested in Greystones Media Campus Ltd (GMC) on a commercial basis as a minority investor.  ISIF has invested alongside Hackman Capital Partners, the controlling majority shareholder, and Capwell, another minority shareholder. ISIF regularly engages with GMC and other shareholders regarding the proposed development.  However, the timing and scope of the project are determined by the company, not ISIF. As a commercial investor, ISIF cannot disclose any non-public or commercially sensitive information related to its investment in GMC. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 383,
        "showAs": " 383. Deputy John Brady asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of a review being carried out on the River Dargle in Bray, County Wicklow, as part of the National Catchment Flood Risk Assessment and Management Programme; and if he will make a statement on the matter. [63287/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_383",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_323",
          "showAs": "Flood Relief Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_323",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  I propose to take Questions Nos. 383, 384 and 385 together.  The Bray Flood Map Review is being carried under the OPW flood Map Review Programme details of which are on the OPW flood portal www.floodinfo.ie .  The Map Review is being progressed by an external consultant and is nearing completion. It is foreseen that the new flood maps for the Bray Map Review will initially be published on www.floodinfo.ie early in 2026 for a consultation period of 30 days, allowing the public to make submissions. Following the consultation, any submissions will be reviewed and addressed and the final maps, accompanied by a report, will then be published on www.floodinfo.ie to complete the Map Review.  The development, planning and construction of the Bray (River Dargle) Flood Relief Scheme was undertaken under local authority powers, with funding provided by the OPW. Works on the scheme were completed in November 2017, with maintenance commencing in 2018. The scheme provides protection against a 1% Annual Exceedance Probability (1-in-100 years) fluvial flooding event and a 0.5% Annual Exceedance Probability (1-in-200 years) tidal flooding event for some 660 properties.  Wicklow County Council, as the scheme’s lead authority, maintains and upkeeps the scheme. Maintenance activities include the clearance of silt and debris from the river channel, clearance of trash and debris screens, control of invasive species, and routine maintenance of outfall valves, culverts and demountables. The OPW reimburses Wicklow County Council for all eligible, valid and vouched expenditure and costs incurred in the maintenance of the scheme. Payments made to Wicklow County Council in respect of recouped maintenance costs are indicated below.        Year      Year of Recoupment       2021*    €70,023.74      2022    €16,995.57      2023    €48,161.47      2024    €41,061.20       Total      €176,241.98        *This payment relates to the recoupment of maintenance costs incurred since completion of the scheme. A recoupment claim for 2025 is currently being processed by OPW officials. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 384,
        "showAs": " 384. Deputy John Brady asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if the review being carried out on the River Dargle in Bray, County Wicklow as part of the National Catchment Flood Risk Assessment and Management Programme will be published when complete; when the flood mapping on www.floodinfo.ie relating to the River Dargle will be updated; and if he will make a statement on the matter. [63288/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_384",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_323",
          "showAs": "Flood Relief Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_323",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  I propose to take Questions Nos. 383, 384 and 385 together.  The Bray Flood Map Review is being carried under the OPW flood Map Review Programme details of which are on the OPW flood portal www.floodinfo.ie .  The Map Review is being progressed by an external consultant and is nearing completion. It is foreseen that the new flood maps for the Bray Map Review will initially be published on www.floodinfo.ie early in 2026 for a consultation period of 30 days, allowing the public to make submissions. Following the consultation, any submissions will be reviewed and addressed and the final maps, accompanied by a report, will then be published on www.floodinfo.ie to complete the Map Review.  The development, planning and construction of the Bray (River Dargle) Flood Relief Scheme was undertaken under local authority powers, with funding provided by the OPW. Works on the scheme were completed in November 2017, with maintenance commencing in 2018. The scheme provides protection against a 1% Annual Exceedance Probability (1-in-100 years) fluvial flooding event and a 0.5% Annual Exceedance Probability (1-in-200 years) tidal flooding event for some 660 properties.  Wicklow County Council, as the scheme’s lead authority, maintains and upkeeps the scheme. Maintenance activities include the clearance of silt and debris from the river channel, clearance of trash and debris screens, control of invasive species, and routine maintenance of outfall valves, culverts and demountables. The OPW reimburses Wicklow County Council for all eligible, valid and vouched expenditure and costs incurred in the maintenance of the scheme. Payments made to Wicklow County Council in respect of recouped maintenance costs are indicated below.        Year      Year of Recoupment       2021*    €70,023.74      2022    €16,995.57      2023    €48,161.47      2024    €41,061.20       Total      €176,241.98        *This payment relates to the recoupment of maintenance costs incurred since completion of the scheme. A recoupment claim for 2025 is currently being processed by OPW officials. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 385,
        "showAs": " 385. Deputy John Brady asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the funding provided to Wicklow County Council between 2017 and 2025 for maintenance work on the River Dargle Flood Protection Scheme in County Wicklow, in tabular form; and if he will make a statement on the matter. [63289/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_385",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_323",
          "showAs": "Flood Relief Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_323",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  I propose to take Questions Nos. 383, 384 and 385 together.  The Bray Flood Map Review is being carried under the OPW flood Map Review Programme details of which are on the OPW flood portal www.floodinfo.ie .  The Map Review is being progressed by an external consultant and is nearing completion. It is foreseen that the new flood maps for the Bray Map Review will initially be published on www.floodinfo.ie early in 2026 for a consultation period of 30 days, allowing the public to make submissions. Following the consultation, any submissions will be reviewed and addressed and the final maps, accompanied by a report, will then be published on www.floodinfo.ie to complete the Map Review.  The development, planning and construction of the Bray (River Dargle) Flood Relief Scheme was undertaken under local authority powers, with funding provided by the OPW. Works on the scheme were completed in November 2017, with maintenance commencing in 2018. The scheme provides protection against a 1% Annual Exceedance Probability (1-in-100 years) fluvial flooding event and a 0.5% Annual Exceedance Probability (1-in-200 years) tidal flooding event for some 660 properties.  Wicklow County Council, as the scheme’s lead authority, maintains and upkeeps the scheme. Maintenance activities include the clearance of silt and debris from the river channel, clearance of trash and debris screens, control of invasive species, and routine maintenance of outfall valves, culverts and demountables. The OPW reimburses Wicklow County Council for all eligible, valid and vouched expenditure and costs incurred in the maintenance of the scheme. Payments made to Wicklow County Council in respect of recouped maintenance costs are indicated below.        Year      Year of Recoupment       2021*    €70,023.74      2022    €16,995.57      2023    €48,161.47      2024    €41,061.20       Total      €176,241.98        *This payment relates to the recoupment of maintenance costs incurred since completion of the scheme. A recoupment claim for 2025 is currently being processed by OPW officials. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 408,
        "showAs": " 408. Deputy John Brady asked the Minister for Enterprise, Tourism and Employment for an update regarding the recommencement of work on the Greystones Media Campus; and if he will make a statement on the matter. [63154/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_408",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_344",
          "showAs": "Industrial Development",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_344",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Enterprise, Tourism and Employment  I propose to take Questions Nos. 408 and 409 together.  As the Deputy will be aware, IDA Ireland sold a site at Greystones Business Technology Park, County Wicklow, under a 999-year lease dated 21 April 2022 to Greystones Media Campus Owner Ltd., using its authority under the Industrial Development Acts. The use of the lands is restricted to manufacturing and/or internationally traded services in line with the relevant Industrial Development (Service Industries) Order 2010. The lease required the tenant to substantially commence development within a set timeframe, extendable upon request with written approval from the IDA, which cannot be unreasonably withheld.  The company also secured a 10-year planning permission for a film studio media campus from Wicklow County Council (Planning Ref 20620) in 2020.  While detail of the IDA’s engagement with client companies is commercially sensitive, I can again assure the Deputy that the IDA is engaging regularly with the company regarding project progress and their lease obligations. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 409,
        "showAs": " 409. Deputy John Brady asked the Minister for Enterprise, Tourism and Employment to provide details of any penalties imposed by the IDA on the company that is developing the Greystones Media Campus for failure to adhere to the terms and conditions of the lease; and if he will make a statement on the matter. [63155/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_409",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_344",
          "showAs": "Industrial Development",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_344",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Enterprise, Tourism and Employment  I propose to take Questions Nos. 408 and 409 together.  As the Deputy will be aware, IDA Ireland sold a site at Greystones Business Technology Park, County Wicklow, under a 999-year lease dated 21 April 2022 to Greystones Media Campus Owner Ltd., using its authority under the Industrial Development Acts. The use of the lands is restricted to manufacturing and/or internationally traded services in line with the relevant Industrial Development (Service Industries) Order 2010. The lease required the tenant to substantially commence development within a set timeframe, extendable upon request with written approval from the IDA, which cannot be unreasonably withheld.  The company also secured a 10-year planning permission for a film studio media campus from Wicklow County Council (Planning Ref 20620) in 2020.  While detail of the IDA’s engagement with client companies is commercially sensitive, I can again assure the Deputy that the IDA is engaging regularly with the company regarding project progress and their lease obligations. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 410,
        "showAs": " 410. Deputy John Brady asked the Minister for Enterprise, Tourism and Employment to provide details of IDA site visits to Wicklow, including location, for each year between 2020 and 2025; and if he will make a statement on the matter. [63156/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_410",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_345",
          "showAs": "Industrial Development",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_345",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          }
        },
        "answerText": "",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 411,
        "showAs": " 411. Deputy John Brady asked the Minister for Enterprise, Tourism and Employment to provide details of all job creation strategies for Wicklow; and if he will make a statement on the matter. [63157/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_411",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_346",
          "showAs": "Job Creation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_346",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_346.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Regional development is a key element of our national enterprise policy, as set out in the Programme for Government and the White Paper on Enterprise, and is a key focus of the work of my Department and its agencies.  Enterprise Ireland launched its new strategy “Delivering for Ireland, Leading Globally (2025–2029)” earlier this year. This strategy prioritises regional enterprise development, innovation, and sustainability and building the capability of Irish companies to grow in world markets. Over 60 percent of all EI client company employment is outside Dublin.  Enterprise Ireland is an active member of the Mid-East Regional Enterprise Plan Steering Group with partners including the Local Authorities. The plan includes actions across the three Mid East counties (Kildare, Wicklow, and Meath).  The Mid-East Regional Enterprise Plan to 2024 (and extended to 2025) highlights strategic objectives and actions across a number of sectors for Wicklow as follows:  • Developing Wicklow / East Coast as a hub for the screen content creation sector through actions such as building the Content Creation Enterprise Hub (Clermont) and establishing a Crew Development Hub to organize and deliver skills and talent initiatives for crew roles in the screen industry. Wicklow County Council is also developing a Wicklow Screen Sector Development Strategy to support the growth of the industry across the region. This strategy is currently being developed in conjunction with industry stakeholders.  • Development of a Food Incubation Development Hub in County Wicklow arising from the Wicklow County Council Food & Drink Strategy. A Feasibility Study carried out for WCC recommended the establishment of a food hub and incubation units for the county with a focus on development and support of food businesses in Wicklow.  • Establishment of Marine Enterprise Facilities by developing Marine Enterprise Hubs at Wicklow and Arklow harbours to service the offshore wind industry and other marine services such as aquaculture.  Regional development is one of four key strategic objectives of the IDA 2025–2029 strategy, \"Adapt Intelligently\" with a commitment to secure 550 foreign direct investment (FDI) projects outside Dublin - 55% of all planned investments. Additionally, the overarching goal is to create 75,000 new jobs nationwide and generate a projected €250 billion in economic impact with the IDA having set ambitious targets for every region in Ireland.  There are 121 IDA client companies in the Mid-East Region, Comprised of Louth, Meath, Kildare and Wicklow, employing 20,470 people. 22 of these are in Wicklow, employing 2,695.  The FDI performance in the region has been consistent over the past five years with employment among IDA clients increasing by 10%. The Mid-East has a significant ecosystem of well-established companies across Technology, Life Sciences, International Financial Services and Engineering & Industrial Technologies. It has also won significant investment in the Food and the Film sub-sectors.  A robust property and infrastructure ecosystem can be the key differentiator in winning FDI projects. The availability of suitable property and strategic sites is a critical component of the regional value proposition and to the winning of investments into the regions from both new-name clients and from the existing client base. IDA, through its Regional Property Programme aims to address regional market failure through investment in land, buildings and essential infrastructure in regional locations as required by current and prospective clients of IDA as well as those of Enterprise Ireland and the Local Enterprise Offices. In this regard, the IDA has 24.4 ha of land at its Arklow Business & Technology Park, Ballynattin, Co. Wicklow with 12.88 ha available for marketing.  The Local Enterprise Offices (LEOs), located in the 31 Local Authorities, are a key partner for small businesses in Ireland, helping them to identify and tackle their controllable costs. The LEO in County Wicklow is actively engaged with their local business community, working to promote a suite of supports designed to assist small businesses to reduce their costs and become more productive and more competitive.  In 2024 LEO Wicklow approved €731,913 in direct grant assistance to start-ups and existing businesses under the Feasibility, Priming and Business Expansion Grants. These supports enable entrepreneurs and small businesses to start, sustain and scale operations which contributes to job creation within the county.  Last year LEO Wicklow also delivered the Start Your Own Business (SYOB) programmes to 144 aspiring entrepreneurs. This programme guides clients through the various aspects of business and business planning. It highlights the importance of planning ahead when setting up a new venture and assists entrepreneurs in honestly assessing their business idea, its viability and help them decide if they should proceed or take a step back.  I continue to emphasise the importance of regional development and the role of my department’s agencies in driving economic growth in the regions. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 537,
        "showAs": " 537. Deputy John Brady asked the Minister for Culture, Communications and Sport to provide details of his plans and timeframe to bring RTE under the remit of the Comptroller and Auditor General; and if he will make a statement on the matter. [63784/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_537",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_446",
          "showAs": "Media Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_446",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_446.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Culture, Communications and Sport  On 7 May 2024, the Government accepted in principle the 116 recommendations of the Expert Advisory Committees appointed to carry out reviews of RTÉ in relation to Governance and Culture and Contractor Fees, HR and Other Matters. The re-assignment of the Comptroller and Auditor General as auditor of RTÉ was a key recommendation of the Expert Advisory Committee on Governance and Culture.  The General Scheme of the Broadcasting (Amendment) Bill provides that the Comptroller and Auditor General will undertake the following activities in relation to RTÉ:  • carry out an audit of the RTÉ's annual accounts under section 5 of the Comptroller and Auditor General (Amendment) Act 1993;  • carry out, where the Comptroller and Auditor General considers it appropriate, a value-for-money examination under section 9 of the Comptroller and Auditor General (Amendment) Act 1993;  • submit, under section 11 of the Comptroller and Auditor General (Amendment) Act 1993;  • on foot of its annual audit, an audit report; and,  • on foot of an annual audit or any value-for-money examination, a special report.  The revised General Scheme was submitted to the Joint Oireachtas Committee on Arts, Media, Communications, Culture and Sport for pre-legislative scrutiny and the Committee published their report on 17 September 2025. Following consideration of the recommendations, the next step will be Government approval and publication of the Bill. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 570,
        "showAs": " 570. Deputy John Brady asked the Minister for Housing, Local Government and Heritage the rationale and assessment criteria applied for the decision not to provide funding for the proposed social and affordable housing development at Rehills Land, Bray, County Wicklow; if she plans to engage with Wicklow County Council to progress much needed housing on this site; and if he will make a statement on the matter. [63159/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_570",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_472",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_472",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_472.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  My Department received a SHIP Funding Application from Wicklow County Council to construct 140 new social homes at the Rehills site in Bray Co Wicklow in June 2025.  Upon review, my Department stated its significant concerns about the high overall costs, particularly abnormal costs, primarily relating to the provision of a vehicular access bridge.  On 24 October 2025 my Department wrote to Wicklow County Council to inform them that their application for funding may not be approved in its current form. The letter also recommended that the council should liaise with the Housing Activation Office to explore alternative funding options for the bridge.  My Department also indicated that it is willing to consider a revised submission in respect of the housing element of the scheme separate from the vehicular access bridge and remain available to work with the council to develop a viable housing solution for the Rehills site. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 605,
        "showAs": " 605. Deputy John Brady asked the Minister for Housing, Local Government and Heritage if the housing proposal from Wicklow County Council at Rehills Land, Bray, County Wicklow which was recently refused funding by the Housing Agency will now be reviewed by the Housing Activation Office; if funding will be made available to enable this project to progress; and if he will make a statement on the matter. [63779/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_605",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_502",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_502",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  On 24 October 2025 my Department wrote to Wicklow County Council to inform them that they are not in a position to approve the SHIP Stage 1 application in its current form. My Department is willing to consider a revised submission and remains available to work with the council to develop a viable solution for the Rehills site.  In the coming months I will be bringing forward a new Housing Infrastructure Investment Fund to support investment in public infrastructure projects needed to enable housing development. The fund will be managed by the Housing Activation Office. While I cannot comment on any individual project or area in advance of the opening of the Housing Infrastructure Fund, there will be engagement with local authorities to identify suitable projects. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 606,
        "showAs": " 606. Deputy John Brady asked the Minister for Housing, Local Government and Heritage to provide details for the significant delays in commencing construction on 18 social housing units at Kilbride Lodge, Bray, County Wicklow; when construction is due to commence; and if he will make a statement on the matter. [63781/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_606",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_503",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_503",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_503.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 606, 607 and 608 together.  My Department has not received a funding application from Wicklow County Council in respect of Kilbride Lodge, Bray, County Wicklow and as such does not hold the information requested in the question. This information may be available from Wicklow County Council directly.  Government is fully committed to working with all stakeholders to deliver social homes at scale and to continue accelerating social housing supply and my Department will engage with Wicklow County Council on any applications they submit for social housing developments. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 607,
        "showAs": " 607. Deputy John Brady asked the Minister for Housing, Local Government and Heritage to provide details of the original estimated cost of constructing 18 social housing units at Kilbride Lodge, Bray, County Wicklow when planning was approved by Wicklow County Council, in 2021; and if he will make a statement on the matter. [63782/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_607",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_503",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_503",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_503.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 606, 607 and 608 together.  My Department has not received a funding application from Wicklow County Council in respect of Kilbride Lodge, Bray, County Wicklow and as such does not hold the information requested in the question. This information may be available from Wicklow County Council directly.  Government is fully committed to working with all stakeholders to deliver social homes at scale and to continue accelerating social housing supply and my Department will engage with Wicklow County Council on any applications they submit for social housing developments. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 608,
        "showAs": " 608. Deputy John Brady asked the Minister for Housing, Local Government and Heritage to provide details of the current cost of constructing 18 social housing units at Kilbride Lodge, Bray, County Wicklow; and if he will make a statement on the matter. [63783/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_608",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_503",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_503",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_503.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 606, 607 and 608 together.  My Department has not received a funding application from Wicklow County Council in respect of Kilbride Lodge, Bray, County Wicklow and as such does not hold the information requested in the question. This information may be available from Wicklow County Council directly.  Government is fully committed to working with all stakeholders to deliver social homes at scale and to continue accelerating social housing supply and my Department will engage with Wicklow County Council on any applications they submit for social housing developments. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 941,
        "showAs": " 941. Deputy John Brady asked the Minister for Children, Disability and Equality the number of childcare providers receiving core funding for each year between 2022-2025, by county, in tabular form; and if she will make a statement on the matter. [63785/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Children"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_941",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_731",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_731",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_731.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Children, Disability and Equality  Participation in Core Funding is optional, but it remains open to all registered providers subject to their agreement to the terms and conditions of the Scheme.  Please see the table below which outlines the number of childcare providers per county with an activated Core Funding Partner Service Agreement during each of the programme years from 2022-2025. The data contained within the table is representative of the highest uptake figures across each of the programme years.       County Division          2022/2023        2023/2024        2024/2025        Cork City    158    164    165      County Carlow    47    48    51      County Cavan    72    74    74      County Clare    134    142    148      County Cork    329    346    371      County Donegal    156    159    170      County Galway    281    290    287      County Kerry    135    149    147      County Kildare    173    175    180      County Kilkenny    92    95    100      County Laois    84    89    90      County Leitrim    36    39    40      County Limerick    184    199    216      County Longford    36    35    35      County Louth    105    106    106      County Mayo    128    127    129      County Meath    182    185    190      County Monaghan    61    65    65      County Offaly    64    68    70      County Roscommon    61    62    67      County Sligo    76    79    76      County Tipperary    177    182    183      County Waterford    91    89    93      County Westmeath    82    82    84      County Wexford    136    136    144      County Wicklow    152    152    153      Dublin City    387    394    383      Dun Laoghaire-Rathdown    164    163    158      Fingal    260    273    264      South Dublin    205    206    207       Total      4248      4373      4446        There may be a small number of services who received Core Funding at different times through each of the programme years and are not captured in the figures presented above.  As applications continue to be submitted, it is not yet possible to make an accurate assessment regarding the total number of childcare providers participating in Core Funding in the fourth programme year.  The fourth programme year of Core Funding began on 1 September. As of 17 November 2025, 4,549 services have signed up to the fourth year of Core Funding. This represents over 92% of all eligible services and this number continues to grow.  This year the scheme has continued to deliver improved affordability and accessibility for parents whilst ensuring improved quality and sustainability for Partner Services through increased investment, rising from €331 million in the 2024/2025 programme year to over €390 million in 2025/2026. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 942,
        "showAs": " 942. Deputy John Brady asked the Minister for Children, Disability and Equality the number of childcare providers that have withdrawn from core funding for each year between 2022-2025, by county, in tabular form; and if she will make a statement on the matter. [63786/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Children"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_942",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_732",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_732",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_732.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Children, Disability and Equality  As Core Funding is an optional scheme, services have the autonomy and business freedom to withdraw from Core Funding, even though this will result in the loss of the significant financial support it offers them and the substantial benefits and certainty it brings to the families availing of these services.  An analysis of the services that left Core Funding in previous programme years was conducted in August of this year (analyses of this nature are only feasible on a programme year basis, as annual Core Funding contracts run from September to August).  In the interest of clarity, transparency and consistent reporting, I have defined a service that left Core Funding as any service that had a gap between contracts for Core Funding of 4 or more weeks. There are a number of reasons that a service might fall into this definition, for example a service could have withdrawn from the scheme, been removed from the scheme for breach of rules, or experienced a delay in re-contracting following a change of circumstance application or between programme years. Many services have left and later re-joined the scheme. There may be a small number of services who left the scheme and subsequently closed at a later date and are not captured in the figures below.  The tables below provide a breakdown of the services that left Core Funding in each programme year by county division. Some services may have left and rejoined multiple times across the three years, and therefore the figures cannot be summed across programme years from the breakdown below.      County division      Year 1 Withdrawals (2022/2023)      Year 2 Withdrawals (2023/2024)      Year 3 Withdrawals (2024/2025)       County Cork    13    14    1      County Clare    5    4    1      County Cavan    3    3    0      County Carlow    0    0    0      Cork City    2    4    1      County Donegal    13    9    0      Dun Laoghaire-Rathdown    9    12    1      South Dublin    10    19    1      Dublin City    15    56    6      Fingal    8    29    1      County Galway    25    32    0      County Kildare    11    13    0      County Kilkenny    1    2    0      County Kerry    4    8    0      County Longford    2    0    0      County Louth    5    2    0      County Limerick    5    11    3      County Leitrim    2    0    0      County Laois    4    6    0      County Meath    4    13    0      County Monaghan    0    4    1      County Mayo    8    12    0      County Offaly    7    2    0      County Roscommon    1    5    0      County Sligo    0    5    0      County Tipperary    11    14    1      County Waterford    6    2    0      County Westmeath    1    1    1      County Wicklow    4    10    0      County Wexford    4    11    1       Total      183      303      19      It should be noted that of the 507 services tabulated above, some 356 services were contracted to Core Funding as of August 5, 2025 - meaning over 70% of services who withdrew, subsequently returned to Core Funding.  The fourth year of Core Funding began on 1 September 2025. As of 14 November, 4,545 services have signed up to the fourth year of Core Funding. This represents 92% of all eligible services and this number continues to grow.  As applications continue to be submitted, it is not yet possible to make an accurate assessment regarding whether further services have made the decision to no longer participate in Core Funding in the fourth programme year, which started on 1 September 2025. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1041,
        "showAs": " 1041. Deputy John Brady asked the Minister for Health the number of conditions currently screened for in the National Newborn Bloodspot Screening Programme; and if she will make a statement on the matter. [63150/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1041",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_826",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_826",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_826.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1041 and 1042 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all newborn babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’), which tests for nine rare but serious conditions that are treatable, if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  As the Deputy may be aware, a new National Rare Disease Strategy was launched in August 2025. This Strategy aims to ensure that all people living with a rare disease, and their families, have access to equitable, inclusive and cross-sectoral care throughout their life journey that will enable them to reach their full potential and to live their best lives. Work is ongoing to ensure that the full implementation of the Strategy including the establishment of an Implementation Oversight Group and the development of a detailed implementation plan outlining the actions required to fully achieve the Strategy's 11 recommendations.  I would highlight that any changes to Ireland’s screening programmes will be facilitated through established protocols. The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes to Ireland’s screening programmes. NSAC assesses the evidence in a robust and transparent manner, and against internationally accepted criteria, before making recommendations to myself as Minister for Health.  The rigorous processes utilised by NSAC are critical to ensure that our screening programmes are effective, quality assured and operating to safe standards, and that the benefits of screening outweigh the harms.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from NSAC on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy  (SMA) to the NNBS programme were approved. In Budget 2024, an additional €1.4 million of new development funding was provided to support the SCID and SMA implementation process.  In terms of the current status, the HSE has advised that the equipment needed to enable the roll-out testing for SCID and SMA has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of calls for the further expansion of the NNBSP, in 2024, NSAC established a Newborn Screening Subgroup to provide additional expertise to support the Committee’s decision-making processes.  In May 2025, the Newborn Screening Subgroup completed work on developing a framework for the prioritisation of proposals related to newborn screening. This framework was subsequently used to identify 10 conditions. These conditions have now been referred by NSAC to the Health Information and Quality Authority (HIQA) to undergo a Health Technology Assessment (HTA), as resources allow.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies in order to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multi-disciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time-intensive and rigorous processes.  I am glad to note that the first of the aforementioned HTAs, to consider the addition of Congenital Adrenal Hyperplasia to the NNBSP, has now commenced and I look forward to receiving a recommendation from NSAC in this regard in 2026.  I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1042,
        "showAs": " 1042. Deputy John Brady asked the Minister for Health her plans to expand the number of conditions that are currently screened for in the National Newborn Bloodspot Screening Programme; and if she will make a statement on the matter. [63151/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1042",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_826",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_826",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_826.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1041 and 1042 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all newborn babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’), which tests for nine rare but serious conditions that are treatable, if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  As the Deputy may be aware, a new National Rare Disease Strategy was launched in August 2025. This Strategy aims to ensure that all people living with a rare disease, and their families, have access to equitable, inclusive and cross-sectoral care throughout their life journey that will enable them to reach their full potential and to live their best lives. Work is ongoing to ensure that the full implementation of the Strategy including the establishment of an Implementation Oversight Group and the development of a detailed implementation plan outlining the actions required to fully achieve the Strategy's 11 recommendations.  I would highlight that any changes to Ireland’s screening programmes will be facilitated through established protocols. The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes to Ireland’s screening programmes. NSAC assesses the evidence in a robust and transparent manner, and against internationally accepted criteria, before making recommendations to myself as Minister for Health.  The rigorous processes utilised by NSAC are critical to ensure that our screening programmes are effective, quality assured and operating to safe standards, and that the benefits of screening outweigh the harms.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from NSAC on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy  (SMA) to the NNBS programme were approved. In Budget 2024, an additional €1.4 million of new development funding was provided to support the SCID and SMA implementation process.  In terms of the current status, the HSE has advised that the equipment needed to enable the roll-out testing for SCID and SMA has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of calls for the further expansion of the NNBSP, in 2024, NSAC established a Newborn Screening Subgroup to provide additional expertise to support the Committee’s decision-making processes.  In May 2025, the Newborn Screening Subgroup completed work on developing a framework for the prioritisation of proposals related to newborn screening. This framework was subsequently used to identify 10 conditions. These conditions have now been referred by NSAC to the Health Information and Quality Authority (HIQA) to undergo a Health Technology Assessment (HTA), as resources allow.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies in order to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multi-disciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time-intensive and rigorous processes.  I am glad to note that the first of the aforementioned HTAs, to consider the addition of Congenital Adrenal Hyperplasia to the NNBSP, has now commenced and I look forward to receiving a recommendation from NSAC in this regard in 2026.  I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1043,
        "showAs": " 1043. Deputy John Brady asked the Minister for Health to provide all recommendations from the National Screening Advisory Committee since 2019 regarding the expansion of the National Newborn Bloodspot Screening Programme; and if she will make a statement on the matter. [63152/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1043",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_828",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_828",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_828.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1043 and 1044 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  I would highlight that any changes to Ireland’s screening programmes will be facilitated through established, evidence-driven protocols. The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes by assessing the evidence robustly and transparently, and against internationally accepted criteria, before making recommendations to myself as Minister for Health.  The rigorous processes utilised by NSAC are critical to ensure that our screening programmes are effective, quality assured and operating to safe standards.  Progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). Since its inception in 2019, NSAC have made three recommendations in relation to the expansion of the NNBSP.  In 2022, screening for Adenosine Deaminase-Severe Combined Immunodeficiency (ADA-SCID) was introduced. In 2023, two additional recommendations from NSAC on the introduction of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) were approved. An additional €1.4 million of new development funding was allocated in Budget 2024 to support the implementation process for SCID and SMA.  In terms of the current status, the HSE has advised that the equipment needed to enable the roll-out testing for SCID and SMA has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland, in accordance with internationally accepted criteria and best practice. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1044,
        "showAs": " 1044. Deputy John Brady asked the Minister for Health to provide the recommendations from the National Screening Advisory Committee since 2019 regarding the expansion of the National Newborn Bloodspot Screening Programme that have not been implemented; to provide details of when the recommendation was made and when it will be implemented; and if she will make a statement on the matter. [63153/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "John Brady",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "memberCode": "John-Brady.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1044",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_828",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_828",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_828.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1043 and 1044 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  I would highlight that any changes to Ireland’s screening programmes will be facilitated through established, evidence-driven protocols. The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes by assessing the evidence robustly and transparently, and against internationally accepted criteria, before making recommendations to myself as Minister for Health.  The rigorous processes utilised by NSAC are critical to ensure that our screening programmes are effective, quality assured and operating to safe standards.  Progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). Since its inception in 2019, NSAC have made three recommendations in relation to the expansion of the NNBSP.  In 2022, screening for Adenosine Deaminase-Severe Combined Immunodeficiency (ADA-SCID) was introduced. In 2023, two additional recommendations from NSAC on the introduction of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) were approved. An additional €1.4 million of new development funding was allocated in Budget 2024 to support the implementation process for SCID and SMA.  In terms of the current status, the HSE has advised that the equipment needed to enable the roll-out testing for SCID and SMA has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland, in accordance with internationally accepted criteria and best practice. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) is leading the development and rollout of strategic park and ride sites nation-wide through the Park and Ride Development Office (PRDO).  The Programme for Government commits to working with local authorities and relevant agencies to develop affordable Park and Ride facilities on the outskirts of major towns and cities.  The NTA established the PRDO in February 2020. The function of the PRDO is to enable and advance the delivery of strategic Park & Ride sites in collaboration with Local Authorities and transport agencies across all regions of the State by providing full time specialist resources on these projects.  The PRDO published a Park & Ride Strategy for the Greater Dublin Area as part of the NTA Transport Strategy for the Greater Dublin Area 2022-2027. The Strategy sets out the vision and objectives for Park & Ride and identified the zones for strategic Park & Ride sites in the region.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_200",
        "debateSection": {
          "debateSectionId": "dbsect_213",
          "showAs": "Park-and-Ride Facilities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_213",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_213.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 200,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 200. Deputy John Brady asked the Minister for Transport to provide details of park and ride facilities that are being developed in County Wicklow; the locations; at what stage the plans are at regarding planning/construction; a timeframe for delivery; the total cost; and if he will make a statement on the matter. [62540/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The NTA Greater Dublin Area Transport Strategy 2022-2042, adopted in 2023, included a recommendation to extend the DART service to Wicklow town. I understand this extension can be facilitated through utilising the new battery-electric DART carriages which have started arriving in Ireland and are currently undergoing certification and safety testing.  The new battery-electric DART carriages will first be deployed from Dublin to Drogheda from 2027. As more carriages arrive, it is intended to also deploy them to extend DART services to and from Wicklow. The NTA is currently examining this issue with a view to progressing the extension around 2029.  The recently concluded Review of the National Development Plan has confirmed the Department of Transport’s annual capital allocations from 2026 to 2030. The Department is currently reviewing key programmes and projects in the transport sector in the context of that capital funding envelope, including elements of the DART+ Programme, and a decision on a programme of delivery within the available funding will be made in the coming months.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_201",
        "debateSection": {
          "debateSectionId": "dbsect_214",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_214",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_214.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 201,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 201. Deputy John Brady asked the Minister for Transport to provide an update on plans to extend the DART to Wicklow Town; and if he will make a statement on the matter. [62541/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Transport (Deputy Seán Canney)  As Minister of State with responsibility for International and Road Transport, Logistics, Rail and Ports, I am not involved in the day-to-day operations of public transport.  The issue raised by the Deputy is an operational matter for Irish Rail. Therefore, I have referred the Deputy's questions to Irish Rail for direct response. Please advise my private office if you do not receive a reply within ten working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_202",
        "debateSection": {
          "debateSectionId": "dbsect_215",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_215",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_215.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 202,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 202. Deputy John Brady asked the Minister for Transport if additional carriages will be added to the Dublin to Rosslare rail line to help address the serious overcrowding issues on the trains; and if he will make a statement on the matter. [62542/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  I propose to take Questions Nos. 203 and 204 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of these projects.  I can confirm that €1,450,000 has been allocated for the N11/M11 Bus Priority Interim scheme and €4,000,000 has been allocated for the N11/N25 Oilgate to Rosslare scheme in 2025. As with all national roads projects in the NDP, the delivery programme for these projects will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply regarding projects on the N11. Please advise my private office if you do not receive a reply within 10 working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_203",
        "debateSection": {
          "debateSectionId": "dbsect_217",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_217",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_217.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 203,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 203. Deputy John Brady asked the Minister for Transport if funding for the upgrade of the N11 will be made available; when works will commence; and if he will make a statement on the matter. [62543/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  I propose to take Questions Nos. 203 and 204 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of these projects.  I can confirm that €1,450,000 has been allocated for the N11/M11 Bus Priority Interim scheme and €4,000,000 has been allocated for the N11/N25 Oilgate to Rosslare scheme in 2025. As with all national roads projects in the NDP, the delivery programme for these projects will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply regarding projects on the N11. Please advise my private office if you do not receive a reply within 10 working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_204",
        "debateSection": {
          "debateSectionId": "dbsect_217",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_217",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_217.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 204,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 204. Deputy John Brady asked the Minister for Transport to provide details of the N11 bus priority scheme; if funding is currently available for the scheme; the phases and timeframe; and if he will make a statement on the matter. [62544/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister of Transport, I have responsibility for policy and overall funding of public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure including, in consultation with Iarnród Éireann, the East Coast Railway Infrastructure Protection Projects (ECRIPP).  Noting the NTA's responsibility in this matter, I have referred the Deputy's questions to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_205",
        "debateSection": {
          "debateSectionId": "dbsect_218",
          "showAs": "Coastal Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_218",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_218.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 205,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 205. Deputy John Brady asked the Minister for Transport the plans in place to carry out costal protection works at the Murrough in Wicklow Town to protect the rail line; and if he will make a statement on the matter. [62545/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA), including light rail.  As the Deputy may be aware, the Transport Strategy for the GDA 2022-2042 was published by the NTA in January 2023. The strategy sets out a statutory framework for transport investment across the region over a twenty-year period and provides a clear statement of transport planning policy for the GDA.  Implementation of the strategy has been divided into three phases – short-term up to 2030, medium-term from 2031 to 2036, and longer-term from 2037 to 2042. An extension of the Luas Green line to Bray is part of the strategy’s medium-term proposals for development and delivery within 2031-2036 and is part of a number of proposed expansions to the Luas network over the lifetime of the strategy.  Noting the NTA's responsibility in the development of public transport infrastructure in the GDA, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_206",
        "debateSection": {
          "debateSectionId": "dbsect_219",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_219",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_219.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 206,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 206. Deputy John Brady asked the Minister for Transport the plans to extend the LUAS to Bray; the planning completed on the project to date; the cost of the project to date; for a timeframe for delivery; and if he will make a statement on the matter. [62546/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Transport (Deputy Jerry Buttimer)  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_207",
        "debateSection": {
          "debateSectionId": "dbsect_220",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_220",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_220.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 207,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 207. Deputy John Brady asked the Minister for Transport for an update on the planned new Local Link service between Bray and Glendalough in County Wicklow, including when the service is due to commence; to provide details of the schedule; and if he will make a statement on the matter. [62547/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  The recently concluded review of the National Development Plan has confirmed the Department of Transport’s annual capital allocations from 2026 to 2030. The Department is in the process of reviewing key programmes and projects in the transport sector in the context of that newly confirmed capital funding envelope, including plans for investment in public transport projects, and a decision on a programme of delivery within the available funding will be made in the coming months. My Department will now progress the sectoral plan for the 2026 to 2030 period, which will be published later this year and which will inform transport priorities in the coming years.  I can at this time confirm that the overall funding for the Active Travel and Greenways Programme will be €360 million for next year, supporting the delivery of high-quality walking and cycling infrastructure across the country. As part of the local authority allocation’s determination process, both the NTA and TII will liaise with local authorities to fully understand their Active Travel and Greenways project proposals and priorities. Allocations for 2026, including those for Wicklow County Council, are expected to be announced in early 2026 at which point a list of supported projects will also be available. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_208",
        "debateSection": {
          "debateSectionId": "dbsect_221",
          "showAs": "Transport Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_221",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_221.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 208,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 208. Deputy John Brady asked the Minister for Transport the projects in Wicklow that will be prioritised and funded following the review of the National Development Plan; and if he will make a statement on the matter. [62548/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the N81 Tallaght to Hollywood Cross.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_209",
        "debateSection": {
          "debateSectionId": "dbsect_222",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_222",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_222.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 209,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 209. Deputy John Brady asked the Minister for Transport if funding will be made available to progress the N81 Tallaght to Hollywood Cross upgrade scheme; and if he will make a statement on the matter. [62549/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Transport (Deputy Seán Canney)  The Road Safety Authority (RSA) has a statutory remit to report on fatal, serious and minor injury collisions on public roads. The RSA receives both coronial data and collision data from An Garda Síochána for this purpose and produces official statistics to help develop evidence-based road safety interventions.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_210",
        "debateSection": {
          "debateSectionId": "dbsect_223",
          "showAs": "Road Traffic Accidents",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_223",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_223.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 210,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 210. Deputy John Brady asked the Minister for Transport to provide details of road traffic accidents on the N81 in County Wicklow for each year between 2015 and 2025; the type of accidents; if anyone was injured; if there have been any fatalities, in tabular form; and if he will make a statement on the matter. [62550/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I can confirm that the Office of Public Works (OPW) has scheduled refurbishment, Mechanical & Electrical, and Universal Access works to Greystones Garda Station.  The proposed refurbishment is intended to rationalise the three parts of the Garda Station improving accessibility for staff and the public.  M&E works will include heating up-grades and insulation of the walls and floors  The Universal Access works will relocate the public entrance to the rear and allow for Part M compliance to be addressed.  The above planned works are at pre-tender stage so project cost is not yet established until the tender process is complete.  Works  are due to commence in 2026.  The commencement dates for works are subject to statutory obligations, final sign-off on design, funding, and operational requirements of An Garda Síochána and the internal approval process of An Garda Síochána and the OPW. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_231",
        "debateSection": {
          "debateSectionId": "dbsect_243",
          "showAs": "Office of Public Works",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_243",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_243.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Public Expenditure"
        },
        "questionNumber": 231,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 231. Deputy John Brady asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the details of plans to upgrade the Garda station in Greystones; when work is due to commence; the timeframe for delivery; the cost of the project; and if he will make a statement on the matter. [62565/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 332 and 333 together.  Development contribution charges to be applied on developers are set at the planning permission stage but are not collectable by the relevant local authority until after the development work commences. Commencement notices are issued by the developer to the local authority and these generally trigger the raising of the charge. The normal practice is for the developer to issue a commencement notice for all units in the development at the construction start date which could mean that the full development charges are due immediately. Alternatively, a phased payment plan is agreed between the planning authority and the developer and in other cases, commencement notices are issued for blocks of units on a phased basis.  When a commencement notice is received, development contributions collectable within the next 12 months are usually treated as income. An invoice is raised and shown as income in Appendix 5 (Summary of Capital Expenditure and Income) of the local authority AFS. Development levy debtors are classified as development contributions that are owed in respect of the current year and previous years, and are shown in Note 5 (Trade Debtors and Prepayments) of the AFS.  Local authorities operate on an accrual accounting basis and recognise income and expenditure as incurred, regardless of the cash transactions. The Annual Financial Statements (AFS) of local authorities do not separately show the amount of cash collected in relation to development contributions, but instead show the amount of development contributions due to local authorities.  Income from development contributions not due to be paid within the current year is deferred and is not separately disclosed in the AFS. Neither are long-term development contribution debtors reported separately in the AFS. (Although this information is recorded within local authorities' Financial Management Systems).  The most recent audited data available is in respect of the financial year ending 31st December 2023. The figure for development levy debtors (development contributions that are owed in respect of the current year and previous years) in Note 5 of the Local Authority Amalgamated AFS 2023 was €285m, gross of any bad debt provisions. The figure for development levy income (based on invoices raised when a commencement notice is received) in Appendix 5 of the Local Authority Amalgamated AFS 2023 was €260m. The table attached sets out the amounts for each local authority from 2015 to 2023. Audited figures for 2024 and 2025 are not yet available.  A significant change to local government structures took place in 2014 when town and borough councils were amalgamated with their county authorities. Retrieving the information on development levy income and debtors between 2010 and 2014 for each of the former local authorities (planning authorities) that existed before the amalgamation would involve a disproportionate amount of time and work and would not be directly comparable to the position since 2015.  [https://data.oireachtas.ie/ie/oireachtas/debates/questions/supportingDocumentation/2025-11-13_pq-332-333-13-11-2025_en.docx] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_332",
        "debateSection": {
          "debateSectionId": "dbsect_323",
          "showAs": "Development Contributions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_323",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_323.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 332,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 332. Deputy John Brady asked the Minister for Housing, Local Government and Heritage the amount in development levies collected by each local authority for each year between 2010 and 2025, in tabular form; and if he will make a statement on the matter. [62691/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 332 and 333 together.  Development contribution charges to be applied on developers are set at the planning permission stage but are not collectable by the relevant local authority until after the development work commences. Commencement notices are issued by the developer to the local authority and these generally trigger the raising of the charge. The normal practice is for the developer to issue a commencement notice for all units in the development at the construction start date which could mean that the full development charges are due immediately. Alternatively, a phased payment plan is agreed between the planning authority and the developer and in other cases, commencement notices are issued for blocks of units on a phased basis.  When a commencement notice is received, development contributions collectable within the next 12 months are usually treated as income. An invoice is raised and shown as income in Appendix 5 (Summary of Capital Expenditure and Income) of the local authority AFS. Development levy debtors are classified as development contributions that are owed in respect of the current year and previous years, and are shown in Note 5 (Trade Debtors and Prepayments) of the AFS.  Local authorities operate on an accrual accounting basis and recognise income and expenditure as incurred, regardless of the cash transactions. The Annual Financial Statements (AFS) of local authorities do not separately show the amount of cash collected in relation to development contributions, but instead show the amount of development contributions due to local authorities.  Income from development contributions not due to be paid within the current year is deferred and is not separately disclosed in the AFS. Neither are long-term development contribution debtors reported separately in the AFS. (Although this information is recorded within local authorities' Financial Management Systems).  The most recent audited data available is in respect of the financial year ending 31st December 2023. The figure for development levy debtors (development contributions that are owed in respect of the current year and previous years) in Note 5 of the Local Authority Amalgamated AFS 2023 was €285m, gross of any bad debt provisions. The figure for development levy income (based on invoices raised when a commencement notice is received) in Appendix 5 of the Local Authority Amalgamated AFS 2023 was €260m. The table attached sets out the amounts for each local authority from 2015 to 2023. Audited figures for 2024 and 2025 are not yet available.  A significant change to local government structures took place in 2014 when town and borough councils were amalgamated with their county authorities. Retrieving the information on development levy income and debtors between 2010 and 2014 for each of the former local authorities (planning authorities) that existed before the amalgamation would involve a disproportionate amount of time and work and would not be directly comparable to the position since 2015.  [https://data.oireachtas.ie/ie/oireachtas/debates/questions/supportingDocumentation/2025-11-13_pq-332-333-13-11-2025_en.docx] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_333",
        "debateSection": {
          "debateSectionId": "dbsect_323",
          "showAs": "Development Contributions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_323",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_323.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 333,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 333. Deputy John Brady asked the Minister for Housing, Local Government and Heritage the amount in uncollected development levies by each local authority for each year between 2010 and 2025, the duration of time for the uncollected Levies, in tabular form; and if he will make a statement on the matter. [62692/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_334",
        "debateSection": {
          "debateSectionId": "dbsect_324",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_324",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_324.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 334,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 334. Deputy John Brady asked the Minister for Housing, Local Government and Heritage the funding spent on clearing Cherry Laurel for each year between 2000 and 2025, including location and cost, in tabular form; and if he will make a statement on the matter. [62693/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_335",
        "debateSection": {
          "debateSectionId": "dbsect_325",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_325",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_325.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 335,
        "by": {
          "memberCode": "John-Brady.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Brady.D.2016-10-03",
          "showAs": "John Brady"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 335. Deputy John Brady asked the Minister for Housing, Local Government and Heritage the funding spent clearing Rhododendron for each year between 2000 and 2025, including location and cost, in tabular form; and if he will make a statement on the matter. [62694/25] "
      }
    }
  ]
}