{
  "head": {
    "counts": {
      "questionCount": 348,
      "resultCount": 348
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector, with €259m of funding paid directly to services in year 1 of the scheme, of which €210.8m was entirely new funding. The scheme now provides over €390 million investment in this sector. I was pleased to announce that the State is increasing investment through Core Funding in 2026, with €480 million allocated for Core Funding in its fifth year which begins in September 2026.  In response to concerns raised by some sector representatives regarding the financial viability of sessional early learning and childcare services, the Department commissioned an independent financial review of sessional early learning and childcare services in 2023.  This review involved sessional services volunteering to participate in the research project that aimed to gather evidence on financial viability to underpin policy development and possible targeted measures through the new funding model.  The review was carried out by Frontier Economics and the report was published on 8 January 2024.  In response to these concerns, the Department also introduced targeted measures for sessional services in 2023 through Core Funding. These measures included a flat rate allocation for all sessional-only services and a minimum base rate allocation which benefits small and medium sized services. These targeted measures have since been strengthened annually.  The financial viability of all early learning and childcare services will continue to be kept under review by the Department through analysis of financial returns under Core Funding Financial Reporting Requirements.  Apteligen Limited were awarded the contract for the analysis of the first two years financial data collected through Core Funding in September 2025. Work is underway, and the project is scheduled to be completed in the first quarter of 2026 with a report to be published thereafter.  This analysis will provide key insights into the Early Learning and Care and School Aged Childcare sector. Insights from this project will strengthen the evidence base available to inform the development of policies for this sector delivering a public good in partnership with the State.  In addition, an evaluation of the first year of Core Funding and the development of an evaluation framework for the scheme is currently underway. This project will examine the early implementation of Core Funding and make recommendations for future evaluations of the grant. Findings from the project are expected in Quarter 1 2026.  This project is being undertaken by Irish Government Economic and Evaluation Service or IGEES policy analysts working in the Research and Evaluation Unit of the Department.  IGEES is an integrated cross-government service established in 2012 with the objective of enhancing the role of economics and value for money analysis in public policy making. It is part of the Department of Public Expenditure, NDP Delivery and Reform.  In addition to this formal evaluation, since the Scheme was introduced, its effectiveness has been subject to ongoing review and the scheme itself has evolved year on year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 86. Deputy Michael Murphy asked the Minister for Children, Disability and Equality if her Department has conducted or commissioned any recent analysis of the financial sustainability of small and medium-sized childcare providers under the current core funding model; and if she will publish the findings of such analysis; and if she will make a statement on the matter. [65167/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_130",
          "debateSectionId": "dbsect_130",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_130.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_86",
        "questionNumber": 86
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. This includes all application and scheduling matters. Neither I nor my officials are involved in the service at an operational level. Accordingly, the information requested is held by the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 311. Deputy Michael Murphy asked the Minister for Transport the number of learner drivers who failed to show up for their scheduled driving test appointment, by driving test centre, by month, from January 2025 to date in December 2025, in tabular form. [72021/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_219",
          "debateSectionId": "dbsect_219",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_219.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_311",
        "questionNumber": 311
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 905. Deputy Michael Murphy asked the Minister for Health if she will urgently intervene to ensure that a child (details supplied) receives an appointment with CAMHS and receives immediate access to appropriate mental-health and behavioural supports; and if she will make a statement on the matter. [71408/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_720",
          "debateSectionId": "dbsect_720",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_720.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_905",
        "questionNumber": 905
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Community Centre Investment Fund (CCIF) was introduced to provide high quality, accessible, community spaces that are available to all groups in all communities in both rural and urban areas. Some €110 million has been allocated since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres.  I am committed to delivering further iterations of the scheme in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. I expect to announce the next round of CCIF early next year, which will focus on refurbishment work in existing community centres. The details in this regard are currently being finalised.  My Department also supports community facilities with enhancement works through a range of other funding streams including through the CLÁR programme, LEADER and the Town and Village Renewal Scheme. I would encourage any interested organisations to check my Department’s website for information on funding opportunities and announcements. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1178. Deputy Michael Murphy asked the Minister for Rural and Community Development and the Gaeltacht if his Department's Community Centres Investment Fund can provide support in circumstances where an existing community centre, due to age, structural condition or non-compliance with modern standards, must be demolished and fully rebuilt; if such full-rebuild projects are eligible for funding under any strand of the scheme; if not, whether the eligibility can be changed for 2026; and if he will make a statement on the matter. [71548/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_993",
          "debateSectionId": "dbsect_993",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_993.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1178",
        "questionNumber": 1178
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Michael Murphy  To what extent has the Department assessed the potential cost implications for public sector pay and pension liabilities that would arise in the event of Irish unification? This is not a political question. It is a simple question of forward planning, good governance and having all the facts in the context of this important debate. \n Deputy Jack Chambers  The gross Exchequer estimated pay bill for Ireland's public service is €30.4 billion for 2026. In terms of staffing, forecast numbers in 2026 are just under 439,400 full-time equivalent public servants. This is the highest ever level of employment in the public service. Overall, the pay bill is a function of public service numbers and the costs associated with public service pay agreements. The current agreement, Public Service Agreement 2024-2026, was agreed in January 2024 and ratified by public service unions and representative associations in March 2024. This agreement achieves a balanced approach to public service pay in the context of both the State's fiscal position and the broader economic environment. The agreement provides for general round increases totalling 9.25% and a provision for local bargaining of 1% of the basic pay cost. In total, the agreement will cost approximately €3.6 billion spread over four budget years.  There is a complex multiplicity of pension arrangements within the Irish public service, encompassing schemes with differing provisions that apply to staff recruited prior to 1995, post 1995 and post 2004, as well as the Single Public Service Pension Scheme introduced in 2013. The gross Exchequer pension bill in 2026 is estimated to be €4.9 billion, which will support a projected 200,700 public service pensioners.  The latest value of the State’s accrued-to-date liability in respect of public service retirement benefits for active employees, pensioners and deferred members has been calculated as €175.7 billion. This will fall to be paid over the next 70 years or so. Northern Ireland’s pay and pensions are subject to different arrangements, with different grades, pay scales, premium payments and superannuation payments. An assessment of pension costs requires individual member data along with detailed data on the varied pension scheme rules and entitlements by sector, for example, the civil service, health, education and local authority sectors. Such an exercise constitutes a complex and substantial analytical undertaking. \n Deputy Michael Murphy  I support the long-term aspiration of Irish unity based on consent. However, if we are serious about this aspiration, we also need to be serious about the practicalities that come with it and the financial implications. Right now, there is little discussion about the fiscal implications of Irish unification, particularly disparities that exist in public sector pay and pensions, social protection systems, taxation, health and infrastructure. This is not a political question. It is simply a question of good governance and having all of the information. The Good Friday Agreement provides a democratic pathway for constitutional change, but that pathway requires facts, not assumptions. My question is simple. Has the Department assessed the potential cost implications for the State? If we want to be informed and want responsible debate, we must first establish a clear understanding of the potential financial landscape. \n Deputy Jack Chambers  Such an exercise constitutes a complex and substantial analytical undertaking requiring access to detailed, contemporaneous micro-level data on the pay structures and pensions of both current and former employees in order to accurately assess the full costs. It also involves a range of assumptions in relation to the pay and pensions policy implications. My Department does not have access to the required level of detailed data relating to the remuneration and pension arrangements of public servants in Northern Ireland to set out that context. I have some macro data here. We know that the total size of the public service of Northern Ireland, inclusive of civil service, health, education, police and local government employees, is estimated to indicate approximately 227,500 in October 2025. The annual pay bill is estimated to be approximately 14.4 billion for core civil service and departmental staff. I have been told that this increases to approximately £18 billion when the wider public services are included. Total public expenditure for the Northern Ireland Executive is estimated at €32 billion in 2025. I have set out some high-level data from the team who assessed the Deputy's question. It would require a lot more specific and micro-level data to answer it, however. \n Deputy Michael Murphy  I am sure the Minister agrees there are huge disparities between systems North and South in public sector pay structures, pension liabilities, welfare supports in particular, and broader public spending. Any future settlement, whenever it might arise, will have significant financial consequences for this State. Ignoring that reality does not make it go away. All I am seeking, and what the public deserves, is clarity on whether the State has even begun to model these implications. If unity is ever to happen, it must be built on facts and not on vague assumptions or political slogans. My question is really about sensible and prudent long-term planning, nothing more and certainly nothing less. \n Deputy Jack Chambers  That is why I stated that to give an accurate picture would require a detailed analytical assessment. Pay and pension provisions are subject to different arrangements across different grades, pay scales, premium payments and superannuation payments. In the context of the Deputy's question, we have not been able to put a number beside the information he has requested. That would be an important consideration. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 12. Deputy Michael Murphy asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if his Department has assessed the potential cost implications for public service pay and pension liabilities that would arise in the event of Irish unification. [62807/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_13",
          "debateSectionId": "dbsect_13",
          "showAs": "Public Sector Pay",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_13.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_12",
        "questionNumber": 12
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The Government is committed to the continued accelerated provision of additional special class and special school places next year by providing at least 3,000 new places in locations where it best meets existing and future demand. The provision of timely information is a key requirement to support the forward planning of new special education provision.  The National Council for Special Education (NCSE) are the statutory body tasked with sanctioning new special education provision in our schools.  The NCSE are currently reviewing and assessing information provided through the parents' notification process which closed on 1 October.  The new timeline of 1 October was publicised widely and communicated to schools, special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the timeline and process.  This earlier date in October coincides with when schools begin enrolment processes so affords parents the opportunity to enrol in existing classes. Many mainstream schools, particularly at post-primary level commence admissions processes for the following school year on 1 October annually.  The NCSE advise that the majority of children and young people coming through the Parents Notify process and seeking a special class or special school place for the 2026/2027 school year are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  As with other applications for support, it is important that those who come forward after the closing date are assured that they are not forgotten or excluded from the system.  The NCSE advise my department that they liaising closely with the family of the child referred to by the Deputy and will continue to do so. I would stress that the NCSE will continue to support all children made known to them after 1 October in their existing placement with appropriate supports.  At the same time, it is critical that the NCSE has as much local information as possible as early as possible to effectively plan new provision. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 103. Deputy Michael Murphy asked the Minister for Education and Youth the way in which it is consistent with a fair, child-centred approach for the NCSE to refuse to issue a letter of eligibility to a child (details supplied) in south Tipperary; and the urgent steps she will take to ensure the child is not denied an appropriate placement for September 2026; and if she will make a statement on the matter. [69737/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_125",
          "debateSectionId": "dbsect_125",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_125.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_103",
        "questionNumber": 103
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 378, 377 and 379 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  There is no mechanism to place applications on hold once a quota has been exhausted. Once a new quota threshold has been introduced through amending secondary legislation, new applications may be submitted for consideration to be processed by date of receipt. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 377. Deputy Michael Murphy asked the Minister for Enterprise, Tourism and Employment in light of the recent announcement that the quota for general employment permits for dairy farm assistants has been exhausted, with no new applications being accepted, the representations his Department has received from farming representative bodies regarding the urgent need to increase the quota for the upcoming spring season.  [71063/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_373",
          "debateSectionId": "dbsect_373",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_373.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_377",
        "questionNumber": 377
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 378, 377 and 379 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  There is no mechanism to place applications on hold once a quota has been exhausted. Once a new quota threshold has been introduced through amending secondary legislation, new applications may be submitted for consideration to be processed by date of receipt. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 378. Deputy Michael Murphy asked the Minister for Enterprise, Tourism and Employment given the critical labour shortages being reported in the dairy-farming sector, particularly during the busy spring calving season, if he will commit to immediately reopening or extending the quota for dairy farm assistants, or otherwise fast-tracking additional permits to ensure farms have sufficient staff for the spring workload. [71064/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_373",
          "debateSectionId": "dbsect_373",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_373.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_378",
        "questionNumber": 378
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 378, 377 and 379 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  There is no mechanism to place applications on hold once a quota has been exhausted. Once a new quota threshold has been introduced through amending secondary legislation, new applications may be submitted for consideration to be processed by date of receipt. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 379. Deputy Michael Murphy asked the Minister for Enterprise, Tourism and Employment the timeframe for when the current review of the occupations lists for employment permits will conclude; and if the Department will publish interim arrangements or special allowances for agricultural employers facing urgent labour shortages while that review is ongoing. [71065/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_373",
          "debateSectionId": "dbsect_373",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_373.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_379",
        "questionNumber": 379
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department engages with our Education counterparts in Northern Ireland on a range of aspects of education policy and practice.  Under the North-South Ministerial Council Education Sectoral structure, a work programme has been agreed and is being implemented. This contains working groups as follows:   (a)   Special Education Policy and Inclusion Working Group     (b)   Educational Disadvantage Working Group     (c)   Teacher Qualifications Working Group     (d)   School, Youth & Teaching Exchanges Working Group     (e)   Digital/Artificial Intelligence issues in schools and Education Working Group     (f)   Early Years Education Working Group     (g)   Cooperation under the Common Travel Area Education MOU Working Group    The work of these groups is monitored by the Ministers and is regularly reported on at bi-annual meetings between the Ministers.  There is cooperation under the PeacePlus Programme funded by both Departments and the EU, which includes work on shared learning in education and school and teacher exchanges.  Under the Shared Island Fund, cooperation on a North-South basis is being funded to address educational disadvantage through -  • The pilot programme, RAISE, which supports a whole of community approach to tackle educational disadvantage in Northern Ireland. There are policy and practical learnings for both Departments arising from this programme.  • The Teacher Research Exchange Project (T-REX) involves the linking of teachers’ evidence-based practice in the classroom with an on-line collaborative platform, enabling that effective research and practice to be shared between education professionals  • Creative Connections Programme enables training and Creative Connections in schools. This project enables teachers and artists in both jurisdictions to be trained together to work in teacher-artist partnerships in schools.  In addition, both Departments engage on policy matters, including sharing experience and practical knowledge. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 396. Deputy Michael Murphy asked the Minister for Education and Youth if her Department is engaging with counterparts in Northern Ireland on curriculum development, teacher exchanges or shared educational initiatives. [62805/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_392",
          "debateSectionId": "dbsect_392",
          "showAs": "School Curriculum",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_392.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_396",
        "questionNumber": 396
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 514 and 513 together.  My colleague the Minister for Enterprise, Tourism and Employment has policy and operational responsibility for employment permits. Arising from my ongoing engagement with sector stakeholders, my Department is in regular contact with the Department of Enterprise, Tourism and Employment (DETE) regarding the labour shortages that exist in certain sub-sectors of agrifood.  The role of the dairy farm assistant first became eligible for an employment permit in 2018 and has been provided with a quota of 1,100 General Employment Permits to date. This quota is filled since November 2025. DETE is currently conducting a review of the employment permits occupations lists, following a public consultation that invited submissions from stakeholders. This review will determine future employment permit quotas. I am informed that an assessment of all submissions and supporting evidence is underway and that each review incorporates research undertaken by the SOLAS Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs, along with input from the Inter-Departmental Group on Economic Migration, of which my Department is a member. Final recommendations from this review are expected to be published in early 2026.  I will continue to work closely with the sector and with the Minister for Enterprise, Tourism and Employment to help ensure that there is a sufficient workforce available to the agrifood sector. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 513. Deputy Michael Murphy asked the Minister for Agriculture, Food and the Marine if his Department considers the exhaustion of the permit quota for dairy farm workers, at a time when labour demand in the sector is especially high, to pose a risk to farm productivity and food output in the spring; and if so, the actions his Department propose to support farmers under labour pressure. [71066/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_488",
          "debateSectionId": "dbsect_488",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_488.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_513",
        "questionNumber": 513
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 514 and 513 together.  My colleague the Minister for Enterprise, Tourism and Employment has policy and operational responsibility for employment permits. Arising from my ongoing engagement with sector stakeholders, my Department is in regular contact with the Department of Enterprise, Tourism and Employment (DETE) regarding the labour shortages that exist in certain sub-sectors of agrifood.  The role of the dairy farm assistant first became eligible for an employment permit in 2018 and has been provided with a quota of 1,100 General Employment Permits to date. This quota is filled since November 2025. DETE is currently conducting a review of the employment permits occupations lists, following a public consultation that invited submissions from stakeholders. This review will determine future employment permit quotas. I am informed that an assessment of all submissions and supporting evidence is underway and that each review incorporates research undertaken by the SOLAS Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs, along with input from the Inter-Departmental Group on Economic Migration, of which my Department is a member. Final recommendations from this review are expected to be published in early 2026.  I will continue to work closely with the sector and with the Minister for Enterprise, Tourism and Employment to help ensure that there is a sufficient workforce available to the agrifood sector. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 514. Deputy Michael Murphy asked the Minister for Agriculture, Food and the Marine if his Department will collaborate with the Department of Enterprise, Tourism and Employment to provide evidence to support a quota increase for dairy farm assistants, given the clearly demonstrated ongoing shortage and the urgency described by farmers themselves. [71067/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_488",
          "debateSectionId": "dbsect_488",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_488.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_514",
        "questionNumber": 514
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service, including recruitment and staffing matters.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days.  Pending this response, I wish to advise the Deputy that the figures for the number of testers by test centre are also made available on the CSO website on a monthly basis at the following link: www.data.cso.ie/table/ROA38. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 182. Deputy Michael Murphy asked the Minister for Transport the current number of driver testers employed in each driving test centre; and if he will make a statement on the matter. [69061/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_173",
          "debateSectionId": "dbsect_173",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Recognising the vitally important role of secretaries and caretakers within school communities, Department officials have been working intensively with stakeholders, with the Workplace Relations Commission (WRC) and with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, to establish a platform for meaningful discussion and resolution.  I believe that all parties have a responsibility to make sure that these talks succeed and that both sides must come together with an open mind without preconditions or pre-conceived ideas of a final outcome.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC. The matter has now been referred to the Labour Court, and a hearing will take place on 12 January 2026. The parties remain in process, and my Department remains committed and ready to engage with Fórsa to reach a resolution on this important matter. As with any industrial relations process the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 382. Deputy Michael Murphy asked the Minister for Education and Youth if she will provide an update on the ongoing dispute involving school secretaries and caretakers; the current status of engagement between her Department, Fórsa and other stakeholders; the steps being taken to resolve outstanding issues relating to pay, conditions and the implementation of prior agreements; and if she will make a statement on the matter. [69016/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_342",
          "debateSectionId": "dbsect_342",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_342.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_382",
        "questionNumber": 382
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Redundancy Payments Act 1967, as amended, provides for the making of payments by employers to employees in respect of redundancy. It is an important safety net for workers.  If an employer is unable to pay due to financial difficulties or become insolvent, an application for payment from the Social Insurance Fund (SIF) may be submitted by the employer or employer representative to this Department. The Redundancy Payments Scheme provides a safeguard for employee’s rights ensuring they receive their statutory redundancy entitlements due.  I can confirm that applications under the Redundancy Payment Scheme have been submitted to my Department in respect of these employees between 31 October and 4 November 2025.  Officials have actively engaged with the employer representative and sought additional information from them throughout this period, to assist with establishing entitlements. This outstanding information was provided to my Department on 2 December 2025.  All applications submitted have now being assigned to Deciding Officers to process. Processing will be completed without delay.  I trust this clarifies these matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 550. Deputy Michael Murphy asked the Minister for Social Protection the status of applications for redundancy payments in respect of the former employees of a hotel (details supplied); the reason for the ongoing delay in processing these claims, given that the required forms were submitted to the Department by the liquidators on 30 October 2025; the way in which his Department is addressing the fact that the previous owners are unlikely to provide any statement of affairs; and if he will make a statement on the matter. [69578/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_477",
          "debateSectionId": "dbsect_477",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_477.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_550",
        "questionNumber": 550
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 618. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the allocation of standard and advanced Garda motorcycles; and the number of RPU members trained to standard and advanced motorcycle level, by divisional roads policing unit. [69440/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_518",
          "debateSectionId": "dbsect_518",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_518.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_618",
        "questionNumber": 618
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for managing the administration and business of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, including the training and allocation of Garda personnel and the deployment of resources available to him.  There are a total of 515 Garda members currently trained to CPD3 standard for the operation of high-powered Garda vehicles in the organisation. Garda authorities advise, however, that not all trained members remain in roles that require this certification as some may have been promoted and/or successful in competitions to transfer to other positions within the organisation where this certification is not applicable.  Garda authorities advise that they are unable to provide a count of the current divisional allocation of trained members within the timeframe available as this would require consultation with each individual Divisional Roads Policing Unit.  To be of assistance, the Garda authorities have provided the below table which shows the number of RPU High Powered Vehicles by Division.     Division    No of Vehicles      Clare Tipperary    1      Cork City    1      Cork County    2      DMR North    1      DMR Traffic    3      Donegal    2      Galway    1      Kildare Carlow    2      Louth Cavan Monaghan    3      Mayo Roscommon Longford    1      Meath Westmeath    1      Waterford Kilkenny    1      Wexford Wicklow    1     In the interest of transparency, An Garda Síochána publishes information in relation to the allocation of Gardaí nationally. This includes a breakdown of Gardaí assigned to the roads policing unit nationwide. This can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ .  The Deputy should select the most recently available date and then select the file titled ‘Roads policing by division to the most recent date\" to access a breakdown of Garda members. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 619. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the number of roads policing members currently trained to CPD3 standard for the operation of high-powered Garda vehicles; and the allocation of these members and vehicles across each Divisional Roads Policing Unit. [69442/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_519",
          "debateSectionId": "dbsect_519",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_519.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_619",
        "questionNumber": 619
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 776. Deputy Michael Murphy asked the Minister for Children, Disability and Equality the immediate measures she is taking to address the significant staffing shortages across the children's disability network teams (CDNTs) in south Tipperary (details supplied); the steps being taken to fill these posts as a matter of urgency; and if she will make a statement on the matter. [69446/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_625",
          "debateSectionId": "dbsect_625",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_625.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_776",
        "questionNumber": 776
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 777. Deputy Michael Murphy asked the Minister for Children, Disability and Equality the actions being taken to reduce the long waiting lists for assessment and therapies in the south Tipperary CDNTs (details supplied); the expected timeline for improvements; and if she will make a statement on the matter. [69447/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_626",
          "debateSectionId": "dbsect_626",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_626.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_777",
        "questionNumber": 777
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 778. Deputy Michael Murphy asked the Minister for Children, Disability and Equality the evaluation of interim measures currently being used by CDNTs in south Tipperary, including the DIR pilot programme, parent coaching model, SLT communication clinic, and positive behaviour support involvement to address therapy backlogs; the outcomes of these initiatives to date; and the long-term plan to ensure sustainable, fully-staffed interdisciplinary CDNTs in the region; and if she will make a statement on the matter. [69448/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_627",
          "debateSectionId": "dbsect_627",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_627.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_778",
        "questionNumber": 778
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 779. Deputy Michael Murphy asked the Minister for Children, Disability and Equality the specific recruitment and retention strategies being implemented to overcome the HSE-identified difficulties in filling posts in south Tipperary CDNTs; whether financial incentives, streamlined recruitment pathways, or international recruitment campaigns are being considered; and if she will make a statement on the matter. [69449/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_628",
          "debateSectionId": "dbsect_628",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_628.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_779",
        "questionNumber": 779
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 780. Deputy Michael Murphy asked the Minister for Children, Disability and Equality if she will report on the impact that current delays in assessment and therapy provision in south Tipperary CDNTs are having on children and families; and the steps being taken to ensure that no child loses developmental potential due to delays in access to early intervention; and if she will make a statement on the matter. [69450/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_629",
          "debateSectionId": "dbsect_629",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_629.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_780",
        "questionNumber": 780
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 859. Deputy Michael Murphy asked the Minister for Health the contingency or interim service arrangements that have been put in place for children on the waiting list for the community ophthalmology service in south Tipperary, following the unsuccessful recruitment of a consultant community ophthalmologist and the retirement of the previous postholder; if weekend clinics, private sourcing, inter-HSE area referrals, or other contractual supports are being utilised to address this service gap; the current number of children on the waiting list; when children referred as far back as 2021, as well as those added to the list in mid-2023 including two specific cases (details supplied) can expect to receive an appointment; and if she will make a statement on the matter. [69106/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_706",
          "debateSectionId": "dbsect_706",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_706.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_859",
        "questionNumber": 859
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Project Ireland 2040 and the National Development Plan highlight the Rural Regeneration and Development Fund (RRDF) and Urban Regeneration and Development Fund (URDF) as being key measures in achieving Ireland’s the long term strategic priorities and these schemes are designed to operate in a parallel and complimentary fashion.  The URDF is administered by the Department of Housing, Local Government and Heritage and established to support more compact and sustainable development, through the regeneration and rejuvenation of Ireland’s five cities and other large towns with populations of over 10,000.  Administered by my department, RRDF is a major capital investment scheme. It seeks to support large-scale, ambitious projects which can achieve sustainable economic and social development in rural areas in line with the Town Centre First Policy. The focus of the RRDF is on rural towns and villages with a population of less than 10,000 people. To date, the RRDF has allocated over €613 million for 273 projects across Ireland.  Calls for applications to the RRDF are sought under two categories. Category 1 relates to large scale capital works projects with all necessary planning and consents in place and are ready to proceed. Category 2, which typically provides funding of up to €1m per project, relates to projects which may planning permissions and statutory consents and further development to become ready for Category 1 status.  I was delighted to recently announce successful projects under the Fourth Call for Category 2 applications, with funding of over €20.5 million being allocated to 30 landmark regeneration projects in rural communities across the country. I can also confirm it is my intention to launch a Call for Proposals for larger scale Category 1 RRDF projects in the near future.  I am committed to ensuring that the RRDF can continue to support high quality and transformational projects across rural Ireland in line with the objectives of Our Rural Future and the Town Centre First policy. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 69. Deputy Michael Murphy asked the Minister for Rural and Community Development and the Gaeltacht for a progress update on the Rural Regeneration and Development Fund; and if he will make a statement on the matter. [59494/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_69",
        "questionNumber": 69
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Jim O'Callaghan  Following a recent meeting in University Hospital Waterford, UHW, attended by representatives and officials in my Department, I am advised that the pathologists employed at that location have indicated they are not available to carry out post mortems. On foot of this, my Department has been engaging with locum pathologists with a view to agreeing a solution to the situation in UHW from 1 January next. This approach is an unfortunate necessity to minimise any impact on bereaved family members who are engaging with the Coroner Service. A long-term sustainable solution is, nevertheless, required whereby locum pathologists are not relied upon to provide for the autopsy service and instead this service to the community is provided from within the pathology profession in Ireland generally.  I am afraid that I am also advised there are issues arising with respect to the performance of post mortems within the pathology profession generally. These include issues relating to training and recruitment as well as competing demands on pathologists in areas of diagnostic and research work. These are concerns that I am particularly worried about. There is an overlap here between my Department, which has responsibility for the Coroner Service and inquests, and the Minister for Health, Deputy Jennifer Carroll MacNeill.  In April 2022, my Department established a standing committee on the provision of coroner-directed post mortem examination services, membership of which consists of representatives from the Department of Health, HSE, Office of the State Pathologist, Garda, Coroners Society, and other officials from the faculty of pathology in the Royal College of Physicians. While this committee is an important forum with appropriate membership to discuss issues in relation to the autopsy service, I am conscious that the situation in University Hospital Waterford has reached a critical juncture and an urgent solution is required. I will consider and continue to seek to engage on this issue but it is an issue over which I do not have full control in light of what pathologists are doing at present. \n Deputy Michael Murphy  We are little more than 40 days from a cliff edge that the Minister has just described as a \"critical juncture\". From 1 January post mortems will no longer be carried out at UHW, a service that carries out 700 cases every year, which are often the most tragic and traumatic of deaths. Behind every one of these cases is a family in shock waiting for answers and waiting simply to lay a loved one to rest yet today, with the deadline fast approaching, there is no clarity on who will perform these examinations, where they will take place,or how families in counties Waterford, Wexford, Kilkenny, Carlow and Tipperary will be protected from delays that could last days or weeks. How will the Minister ensure that bereaved families in the south east are not plunged into a crisis of delays, distress and indignity from 1 January? Families deserve certainty, they deserve compassion and a plan, and they deserve it now. \n Deputy Jim O'Callaghan  I agree with the Deputy that it is a very traumatic experience for a family after there has been a death if they are told that there has to be a post mortem and then there can be a considerable wait prior to the funeral. I would not like to see Ireland develop in the same way as other countries where there is a significant delay between death and the funeral. One of the things we do very well in this country is death and it is not something that we want to change by having a big gap between death and a funeral.  Where a coroner deems a post mortem examination to be required, the coroner concerned will arrange the post mortem examination to be conducted as expeditiously as possible to ensure timely release of the remains to the next of kin. Depending on the circumstance of the death, a post mortem examination is carried out by a pathologist or, in State forensic cases, by the Office of the State Pathologist. I am in the process of seeking to review the law in respect of coroners. We need to examine the circumstances of when we order a post mortem. A post mortem is not needed in all the situations that we have them at present, particularly for elderly people, but that level of reform will not be in place by 1 January. I am concerned about what the Deputy has narrated as to the circumstances in University Hospital Waterford. \n Deputy Michael Murphy  This is not an abstract policy issue; this is a human one. There are 700 cases every year. Every day that a family waits for a post mortem is a day they cannot hold a funeral, cannot begin the grieving process and cannot find closure. That is the reality that awaits hundreds of families across the south east if this service collapses on 1 January. Coroners, funeral directors and front-line responders still have no guidance. Families deserve reassurance that they will not be left waiting in deep distress for a service that is their right. I again ask the Minister, respectfully but firmly, to commit to guaranteeing that no family across the south east will face avoidable delays or uncertainty on the most difficult days of their lives. The people we represent in the south east deserve nothing less. \n Deputy Jim O'Callaghan  I thank the Deputy. I will give the statistics in respect of University Hospital Waterford. There are nine sanctioned consultant pathology posts of which eight are currently filled with one vacancy to be filled next year. Two posts were filled earlier this year and these appointments have not been made on the basis of the autopsy element being excluded. The remaining six pathologists have provided the autopsy service with three taking on the bulk of the workload. All six have confirmed that they will withdraw the service from 1 January. This is happening because consultants are withdrawing from a service. We need to look again at the contracts of individuals we are hiring as pathologists, so that there is a requirement that they perform post mortems and autopsies.  As the Deputy said, approximately 700 autopsies are conducted in University Hospital Waterford every year. The local pathologist services with which the Department is engaging will be contracted to provide a service from pathologists not already providing services in Ireland. In practice, this will be from the UK. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 76. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration if he will provide an update on the urgent discussions referenced in his written reply of 22 October 2025 regarding the planned discontinuation of coronial post mortems at University Hospital Waterford from 1 January 2026; the interim arrangements that have now been agreed for counties Waterford, Wexford, Kilkenny, Tipperary and Carlow; and the way in which his Department intends to ensure that bereaved families in the south east are not subjected to further delays or distress as a result of these changes. [68836/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_22",
          "debateSectionId": "dbsect_22",
          "showAs": "Coroners Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_22.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_76",
        "questionNumber": 76
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 127, 134, 363 and 367 together.  Coroners are independent office holders, and my Department has no role in directing their work during the death investigation function. Neither does the Department have any role in relation to the work of pathologists who, as clinicians, undertake postmortem examinations on the direction of a coroner.  Policy and operational responsibilities for the provision of postmortem examination services to support the work of the Coroner Service is supported by several departments and agencies. My Department is responsible for the legislation underpinning the work of coroners, while the provision of the postmortem examination service is largely provided through the health service and its personnel. It is important to clarify that pathologists, other than forensic pathologists in the Office of the State Pathologist, are not contracted to either my Department, or to coroners.  Where a coroner deems a postmortem examination to be required, the coroner concerned will arrange the post-mortem examination to be conducted as expeditiously as possible to ensure timely release of remains to the next of kin of the deceased. Depending on the circumstances of the death, a post-mortem examination will be carried out by a pathologist or, in state forensic cases, by the Office of the State Pathologist.  My Department is aware that securing the provision of the postmortem service for the coronial death investigation function is challenging and I have been engaging with the Minister for Health to address the reasons behind these challenges.  I am advised that there are issues arising with respect to the performance of port-mortems within the pathology profession generally, including relating to training and recruitment, as well as competing demands on pathologists in areas of diagnostic and research work and I acknowledge those concerns.  With this in mind, my Department in April 2022 established a ‘Standing Committee on the Provision of Coroner Directed postmortem examination services', membership of which consists of representatives from the Department of Health, the Health Service Executive, the Office of the State Pathologist, An Garda Síochána, the Coroners Society of Ireland, the Department of Housing, Local Authorities and Heritage and the Faculty of Pathology, Royal College of Physicians Ireland as well as my Department. While this committee is an important forum with appropriate membership to discuss issues in relation to the autopsy service, I am conscious that the situation in University Hospital Waterford has reached a critical juncture, and an urgent solution is required.  Following a recent meeting in UHW attended by representatives of these parties and officials in my Department, I am advised that the pathologists employed at that location have indicated that they are not available to carry out post-mortems. On foot of this my Department has been engaging with locum pathologists with a view to agreeing a solution to the situation in UHW from 1 January next. This approach is an unfortunate necessity to minimise any impact on bereaved family members who are engaging with the Coroner Service. However, a long-term sustainable solution is nevertheless required, whereby locum pathologists are not relied upon to provide the autopsy service, and instead this service to the community is provided from within the pathology profession in Ireland generally. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 127. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the specific timelines, actions and responsibilities in place across his Department, the Department of Health and the HSE to secure ongoing coronial post-mortem capacity in University Hospital Waterford (details supplied); if he will ensure that the existing modern mortuary facilities at UHW continue to be used; the status of the collaborative process initiated with the Minister for Health to resolve this matter before 1 January 2026; and if he will make a statement on the matter. [65228/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_127",
        "questionNumber": 127
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 127, 134, 363 and 367 together.  Coroners are independent office holders, and my Department has no role in directing their work during the death investigation function. Neither does the Department have any role in relation to the work of pathologists who, as clinicians, undertake postmortem examinations on the direction of a coroner.  Policy and operational responsibilities for the provision of postmortem examination services to support the work of the Coroner Service is supported by several departments and agencies. My Department is responsible for the legislation underpinning the work of coroners, while the provision of the postmortem examination service is largely provided through the health service and its personnel. It is important to clarify that pathologists, other than forensic pathologists in the Office of the State Pathologist, are not contracted to either my Department, or to coroners.  Where a coroner deems a postmortem examination to be required, the coroner concerned will arrange the post-mortem examination to be conducted as expeditiously as possible to ensure timely release of remains to the next of kin of the deceased. Depending on the circumstances of the death, a post-mortem examination will be carried out by a pathologist or, in state forensic cases, by the Office of the State Pathologist.  My Department is aware that securing the provision of the postmortem service for the coronial death investigation function is challenging and I have been engaging with the Minister for Health to address the reasons behind these challenges.  I am advised that there are issues arising with respect to the performance of port-mortems within the pathology profession generally, including relating to training and recruitment, as well as competing demands on pathologists in areas of diagnostic and research work and I acknowledge those concerns.  With this in mind, my Department in April 2022 established a ‘Standing Committee on the Provision of Coroner Directed postmortem examination services', membership of which consists of representatives from the Department of Health, the Health Service Executive, the Office of the State Pathologist, An Garda Síochána, the Coroners Society of Ireland, the Department of Housing, Local Authorities and Heritage and the Faculty of Pathology, Royal College of Physicians Ireland as well as my Department. While this committee is an important forum with appropriate membership to discuss issues in relation to the autopsy service, I am conscious that the situation in University Hospital Waterford has reached a critical juncture, and an urgent solution is required.  Following a recent meeting in UHW attended by representatives of these parties and officials in my Department, I am advised that the pathologists employed at that location have indicated that they are not available to carry out post-mortems. On foot of this my Department has been engaging with locum pathologists with a view to agreeing a solution to the situation in UHW from 1 January next. This approach is an unfortunate necessity to minimise any impact on bereaved family members who are engaging with the Coroner Service. However, a long-term sustainable solution is nevertheless required, whereby locum pathologists are not relied upon to provide the autopsy service, and instead this service to the community is provided from within the pathology profession in Ireland generally. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 134. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration if he will provide an update on the urgent discussions referenced in his written reply of 22 October 2025 regarding the planned discontinuation of coronial post-mortems at University Hospital Waterford from 1 January 2026; the interim arrangements which have been agreed for counties Waterford, Wexford, Kilkenny, Tipperary and Carlow; and the way in which his Department plans to ensure that bereaved families in the south-east are not subjected to further delays or distress as a result of these changes. [65227/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_134",
        "questionNumber": 134
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 127, 134, 363 and 367 together.  Coroners are independent office holders, and my Department has no role in directing their work during the death investigation function. Neither does the Department have any role in relation to the work of pathologists who, as clinicians, undertake postmortem examinations on the direction of a coroner.  Policy and operational responsibilities for the provision of postmortem examination services to support the work of the Coroner Service is supported by several departments and agencies. My Department is responsible for the legislation underpinning the work of coroners, while the provision of the postmortem examination service is largely provided through the health service and its personnel. It is important to clarify that pathologists, other than forensic pathologists in the Office of the State Pathologist, are not contracted to either my Department, or to coroners.  Where a coroner deems a postmortem examination to be required, the coroner concerned will arrange the post-mortem examination to be conducted as expeditiously as possible to ensure timely release of remains to the next of kin of the deceased. Depending on the circumstances of the death, a post-mortem examination will be carried out by a pathologist or, in state forensic cases, by the Office of the State Pathologist.  My Department is aware that securing the provision of the postmortem service for the coronial death investigation function is challenging and I have been engaging with the Minister for Health to address the reasons behind these challenges.  I am advised that there are issues arising with respect to the performance of port-mortems within the pathology profession generally, including relating to training and recruitment, as well as competing demands on pathologists in areas of diagnostic and research work and I acknowledge those concerns.  With this in mind, my Department in April 2022 established a ‘Standing Committee on the Provision of Coroner Directed postmortem examination services', membership of which consists of representatives from the Department of Health, the Health Service Executive, the Office of the State Pathologist, An Garda Síochána, the Coroners Society of Ireland, the Department of Housing, Local Authorities and Heritage and the Faculty of Pathology, Royal College of Physicians Ireland as well as my Department. While this committee is an important forum with appropriate membership to discuss issues in relation to the autopsy service, I am conscious that the situation in University Hospital Waterford has reached a critical juncture, and an urgent solution is required.  Following a recent meeting in UHW attended by representatives of these parties and officials in my Department, I am advised that the pathologists employed at that location have indicated that they are not available to carry out post-mortems. On foot of this my Department has been engaging with locum pathologists with a view to agreeing a solution to the situation in UHW from 1 January next. This approach is an unfortunate necessity to minimise any impact on bereaved family members who are engaging with the Coroner Service. However, a long-term sustainable solution is nevertheless required, whereby locum pathologists are not relied upon to provide the autopsy service, and instead this service to the community is provided from within the pathology profession in Ireland generally. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 363. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the specific timelines, actions and responsibilities now in place across his Department, the Department of Health and the HSE to secure ongoing coronial post-mortem capacity in the region (details supplied); if he will ensure that the existing modern mortuary facilities at UHW continue to be used; and his views on the status of the collaborative process he has initiated with the Minister for Health to resolve this matter before 1 January 2026. [68837/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_363",
        "questionNumber": 363
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 127, 134, 363 and 367 together.  Coroners are independent office holders, and my Department has no role in directing their work during the death investigation function. Neither does the Department have any role in relation to the work of pathologists who, as clinicians, undertake postmortem examinations on the direction of a coroner.  Policy and operational responsibilities for the provision of postmortem examination services to support the work of the Coroner Service is supported by several departments and agencies. My Department is responsible for the legislation underpinning the work of coroners, while the provision of the postmortem examination service is largely provided through the health service and its personnel. It is important to clarify that pathologists, other than forensic pathologists in the Office of the State Pathologist, are not contracted to either my Department, or to coroners.  Where a coroner deems a postmortem examination to be required, the coroner concerned will arrange the post-mortem examination to be conducted as expeditiously as possible to ensure timely release of remains to the next of kin of the deceased. Depending on the circumstances of the death, a post-mortem examination will be carried out by a pathologist or, in state forensic cases, by the Office of the State Pathologist.  My Department is aware that securing the provision of the postmortem service for the coronial death investigation function is challenging and I have been engaging with the Minister for Health to address the reasons behind these challenges.  I am advised that there are issues arising with respect to the performance of port-mortems within the pathology profession generally, including relating to training and recruitment, as well as competing demands on pathologists in areas of diagnostic and research work and I acknowledge those concerns.  With this in mind, my Department in April 2022 established a ‘Standing Committee on the Provision of Coroner Directed postmortem examination services', membership of which consists of representatives from the Department of Health, the Health Service Executive, the Office of the State Pathologist, An Garda Síochána, the Coroners Society of Ireland, the Department of Housing, Local Authorities and Heritage and the Faculty of Pathology, Royal College of Physicians Ireland as well as my Department. While this committee is an important forum with appropriate membership to discuss issues in relation to the autopsy service, I am conscious that the situation in University Hospital Waterford has reached a critical juncture, and an urgent solution is required.  Following a recent meeting in UHW attended by representatives of these parties and officials in my Department, I am advised that the pathologists employed at that location have indicated that they are not available to carry out post-mortems. On foot of this my Department has been engaging with locum pathologists with a view to agreeing a solution to the situation in UHW from 1 January next. This approach is an unfortunate necessity to minimise any impact on bereaved family members who are engaging with the Coroner Service. However, a long-term sustainable solution is nevertheless required, whereby locum pathologists are not relied upon to provide the autopsy service, and instead this service to the community is provided from within the pathology profession in Ireland generally. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 367. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration if he will provide an update on the interdepartmental discussions and collaborative efforts underway between his Department, the Department of Health, the HSE, and University Hospital Waterford in relation to the continuation of coronial post-mortem services for the southeast region; if he will outline the progress made since his previous statement to the House in October towards securing the retention of a local and timely service beyond 1 January 2026; and if he will make a statement on the matter. [60926/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_367",
        "questionNumber": 367
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As the Deputy may be aware SUSI supports which are governed by the Student Grant Scheme are only for students in further and higher education. The college in question caters for post primary students in 5th, 6th and repeat 6th year and therefore does not meet the eligibility requirements of the Student Grant Scheme. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 545. Deputy Michael Murphy asked the Minister for Further and Higher Education, Research, Innovation and Science if students attending private tutorial colleges (details supplied) are eligible to apply for SUSI grants; the criteria governing eligibility for students enrolled in such institutions; and if he will make a statement on the matter. [68926/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_488",
          "debateSectionId": "dbsect_488",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_488.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_545",
        "questionNumber": 545
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  The approach of the Government in relation to Irish unity is guided by Article 3 of the Constitution, as amended by the people in 1998.  The Government respects and affirms everyone’s right on this island to make the case for the constitutional future for Northern Ireland they wish to see - whether they are nationalist, unionist or do not identify with either tradition.  In the event of a future referendum within the consent provisions of the Good Friday Agreement, the Government would make all necessary preparations in accordance with the terms of the Constitution and the procedures of the Agreement.  The Programme for Government affirms the Government’s commitment to the unity of the Irish people, and to a sustained focus on and investment in reconciliation, developing the three sets of relationships recognised in the Good Friday Agreement to unlock the full potential of our island.  Through programmes such as the Shared Island Initiative, the Government is moving forward with the vital task of building a lasting reconciliation between all communities on this island. This is backed by the Government’s Shared Island Fund, now a €2 billion commitment out to 2035.  With over €600m now allocated from the Shared Island Fund the Government is taking sustained, strategic action and investment to improve people’s lives and strengthen connections across the island of Ireland for our shared future.  In April, I announced the ‘Shared Home Place’ programme as a new dimension of the Initiative to commence in 2026, which will be open to people from every corner of the island to build new connections through our place-based heritage.  This new programme will engage with the contributions of all traditions across the island of Ireland, including Irish, British, Anglo-Irish and Ulster Scots traditions - recognising how these are an integral part of the heritage of every county today and crucial to how we approach and build our future.  The programme will also recognise and include the greater ethnic and cultural diversity of the island now, which is a source of richness and strength in society, and engage with diaspora communities in Britain, the United States, and further afield.  Shared Home Place will build on the sustained programme of all-island dialogue and engagement that the Government of Ireland has supported, including through the Shared Island Dialogue series which involved more than 4,000 representatives, and the Shared Island Youth Forum of 80 representatives who deliberated over a year and in 2024 produced an impressive statement of their vision and values for a shared future on this island.  The Shared Island research programme is providing high-quality evidence and analysis of the whole island, on economic, social, cultural and political issues.  In April, I launched a new phase of my Department’s joint Shared Island research programme with the Economic and Social Research Institute, with a focus on strategic policy and cooperation considerations for the island, and research projects for 2025-26 are underway. This includes a new annual report series by the ESRI assessing economic trends across the island of Ireland, the first of which will be published next week. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 58. Deputy Michael Murphy asked the Taoiseach if consideration has been given to developing public information or civic education materials outlining the institutional, economic and constitutional realities associated with Irish unification, to ensure any future debate is evidence-based. [62803/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_70",
          "debateSectionId": "dbsect_70",
          "showAs": "Northern Ireland",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_58",
        "questionNumber": 58
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 199, 201, 202, 203, 205, 206 and 207 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and responsibility for the allocation and deployment of resources and personnel available to him, including the Garda fleet.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including the total number of Garda motorcycles in the Garda fleet. Monthly Fleet reports are currently available from 2020 to date. This is available on the Garda website at the following link: www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html.  The total number of motorcycles in the Garda fleet broken down by Division and District and the numbers of motorcycles removed from and assigned to the fleet from 2020 to date are available in the Fleet Reports.  I am advised by the Garda authorities that a comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  All vehicles on the Garda fleet are operated up to the manufacturer’s durability limits or uneconomic repair, irrespective of age. It is not possible to give an accurate figure for vehicles currently off the road for maintenance as this changes daily.  I am also informed that the average age of the Garda motorcycle fleet is 5.4 years and the average mileage is 40,907 kilometres.  The Garda authorities have provided the following breakdown of motorcycle procurements in the last five years:      Year      No. of Motorcycles       2021    1      2022    1      2023    12      2024    38      2025    4       Total      56      The purchase and allocation of vehicles is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  An Garda Siochana Fleet Management have received budget approval for the purchase of a significant number of motorcycles as part of their 2026 Purchase Plan. The exact number will be confirmed over the coming weeks.  The Garda Authorities have also provided the following table with the number of Garda motorcycles currently deployed for Roads Policing duties and the proportion this represents of the overall Roads Policing unit:      Vehicle      Total      % of Roads Policing fleet       Cars     186    60.59      Vans    5    1.63      Motorbikes    92    29.97      4x4    23    7.49      Other    1    0.32       Total      307      100%       ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 199. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the total number of Garda motorcycles currently in the Garda fleet; the number in active operational service; the number undergoing repair or awaiting replacement; and if he will make a statement on the matter. [68492/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_199",
        "questionNumber": 199
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 200. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the number of Garda motorcycles assigned to each Garda division; and the number of trained motorcycle Gardaí available in each division. [68493/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_177",
          "debateSectionId": "dbsect_177",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_200",
        "questionNumber": 200
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 199, 201, 202, 203, 205, 206 and 207 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and responsibility for the allocation and deployment of resources and personnel available to him, including the Garda fleet.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including the total number of Garda motorcycles in the Garda fleet. Monthly Fleet reports are currently available from 2020 to date. This is available on the Garda website at the following link: www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html.  The total number of motorcycles in the Garda fleet broken down by Division and District and the numbers of motorcycles removed from and assigned to the fleet from 2020 to date are available in the Fleet Reports.  I am advised by the Garda authorities that a comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  All vehicles on the Garda fleet are operated up to the manufacturer’s durability limits or uneconomic repair, irrespective of age. It is not possible to give an accurate figure for vehicles currently off the road for maintenance as this changes daily.  I am also informed that the average age of the Garda motorcycle fleet is 5.4 years and the average mileage is 40,907 kilometres.  The Garda authorities have provided the following breakdown of motorcycle procurements in the last five years:      Year      No. of Motorcycles       2021    1      2022    1      2023    12      2024    38      2025    4       Total      56      The purchase and allocation of vehicles is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  An Garda Siochana Fleet Management have received budget approval for the purchase of a significant number of motorcycles as part of their 2026 Purchase Plan. The exact number will be confirmed over the coming weeks.  The Garda Authorities have also provided the following table with the number of Garda motorcycles currently deployed for Roads Policing duties and the proportion this represents of the overall Roads Policing unit:      Vehicle      Total      % of Roads Policing fleet       Cars     186    60.59      Vans    5    1.63      Motorbikes    92    29.97      4x4    23    7.49      Other    1    0.32       Total      307      100%       ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 201. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the number of Garda motorcycles currently deployed specifically for roads policing/traffic duties; the proportion this represents of the overall roads policing unit fleet; and if he will make a statement on the matter. [68494/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_201",
        "questionNumber": 201
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 199, 201, 202, 203, 205, 206 and 207 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and responsibility for the allocation and deployment of resources and personnel available to him, including the Garda fleet.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including the total number of Garda motorcycles in the Garda fleet. Monthly Fleet reports are currently available from 2020 to date. This is available on the Garda website at the following link: www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html.  The total number of motorcycles in the Garda fleet broken down by Division and District and the numbers of motorcycles removed from and assigned to the fleet from 2020 to date are available in the Fleet Reports.  I am advised by the Garda authorities that a comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  All vehicles on the Garda fleet are operated up to the manufacturer’s durability limits or uneconomic repair, irrespective of age. It is not possible to give an accurate figure for vehicles currently off the road for maintenance as this changes daily.  I am also informed that the average age of the Garda motorcycle fleet is 5.4 years and the average mileage is 40,907 kilometres.  The Garda authorities have provided the following breakdown of motorcycle procurements in the last five years:      Year      No. of Motorcycles       2021    1      2022    1      2023    12      2024    38      2025    4       Total      56      The purchase and allocation of vehicles is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  An Garda Siochana Fleet Management have received budget approval for the purchase of a significant number of motorcycles as part of their 2026 Purchase Plan. The exact number will be confirmed over the coming weeks.  The Garda Authorities have also provided the following table with the number of Garda motorcycles currently deployed for Roads Policing duties and the proportion this represents of the overall Roads Policing unit:      Vehicle      Total      % of Roads Policing fleet       Cars     186    60.59      Vans    5    1.63      Motorbikes    92    29.97      4x4    23    7.49      Other    1    0.32       Total      307      100%       ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 202. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration for a regional breakdown (Dublin, Eastern, Southern, Northwestern) of Garda motorcycles currently operational. [68495/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_202",
        "questionNumber": 202
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 199, 201, 202, 203, 205, 206 and 207 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and responsibility for the allocation and deployment of resources and personnel available to him, including the Garda fleet.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including the total number of Garda motorcycles in the Garda fleet. Monthly Fleet reports are currently available from 2020 to date. This is available on the Garda website at the following link: www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html.  The total number of motorcycles in the Garda fleet broken down by Division and District and the numbers of motorcycles removed from and assigned to the fleet from 2020 to date are available in the Fleet Reports.  I am advised by the Garda authorities that a comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  All vehicles on the Garda fleet are operated up to the manufacturer’s durability limits or uneconomic repair, irrespective of age. It is not possible to give an accurate figure for vehicles currently off the road for maintenance as this changes daily.  I am also informed that the average age of the Garda motorcycle fleet is 5.4 years and the average mileage is 40,907 kilometres.  The Garda authorities have provided the following breakdown of motorcycle procurements in the last five years:      Year      No. of Motorcycles       2021    1      2022    1      2023    12      2024    38      2025    4       Total      56      The purchase and allocation of vehicles is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  An Garda Siochana Fleet Management have received budget approval for the purchase of a significant number of motorcycles as part of their 2026 Purchase Plan. The exact number will be confirmed over the coming weeks.  The Garda Authorities have also provided the following table with the number of Garda motorcycles currently deployed for Roads Policing duties and the proportion this represents of the overall Roads Policing unit:      Vehicle      Total      % of Roads Policing fleet       Cars     186    60.59      Vans    5    1.63      Motorbikes    92    29.97      4x4    23    7.49      Other    1    0.32       Total      307      100%       ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 203. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the number of Garda motorcycles that have been procured in each of the past five years; and the number due for replacement based on age or mileage. [68496/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_203",
        "questionNumber": 203
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 204. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the number of Garda members currently qualified as advanced motorcycle riders; and the number who completed training in each of the past three years. [68498/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_178",
          "debateSectionId": "dbsect_178",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_178.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_204",
        "questionNumber": 204
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 199, 201, 202, 203, 205, 206 and 207 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and responsibility for the allocation and deployment of resources and personnel available to him, including the Garda fleet.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including the total number of Garda motorcycles in the Garda fleet. Monthly Fleet reports are currently available from 2020 to date. This is available on the Garda website at the following link: www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html.  The total number of motorcycles in the Garda fleet broken down by Division and District and the numbers of motorcycles removed from and assigned to the fleet from 2020 to date are available in the Fleet Reports.  I am advised by the Garda authorities that a comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  All vehicles on the Garda fleet are operated up to the manufacturer’s durability limits or uneconomic repair, irrespective of age. It is not possible to give an accurate figure for vehicles currently off the road for maintenance as this changes daily.  I am also informed that the average age of the Garda motorcycle fleet is 5.4 years and the average mileage is 40,907 kilometres.  The Garda authorities have provided the following breakdown of motorcycle procurements in the last five years:      Year      No. of Motorcycles       2021    1      2022    1      2023    12      2024    38      2025    4       Total      56      The purchase and allocation of vehicles is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  An Garda Siochana Fleet Management have received budget approval for the purchase of a significant number of motorcycles as part of their 2026 Purchase Plan. The exact number will be confirmed over the coming weeks.  The Garda Authorities have also provided the following table with the number of Garda motorcycles currently deployed for Roads Policing duties and the proportion this represents of the overall Roads Policing unit:      Vehicle      Total      % of Roads Policing fleet       Cars     186    60.59      Vans    5    1.63      Motorbikes    92    29.97      4x4    23    7.49      Other    1    0.32       Total      307      100%       ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 205. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the distribution of Garda motorcycles between urban and rural divisions; and if he will make a statement on the matter. [68499/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_205",
        "questionNumber": 205
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 199, 201, 202, 203, 205, 206 and 207 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and responsibility for the allocation and deployment of resources and personnel available to him, including the Garda fleet.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including the total number of Garda motorcycles in the Garda fleet. Monthly Fleet reports are currently available from 2020 to date. This is available on the Garda website at the following link: www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html.  The total number of motorcycles in the Garda fleet broken down by Division and District and the numbers of motorcycles removed from and assigned to the fleet from 2020 to date are available in the Fleet Reports.  I am advised by the Garda authorities that a comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  All vehicles on the Garda fleet are operated up to the manufacturer’s durability limits or uneconomic repair, irrespective of age. It is not possible to give an accurate figure for vehicles currently off the road for maintenance as this changes daily.  I am also informed that the average age of the Garda motorcycle fleet is 5.4 years and the average mileage is 40,907 kilometres.  The Garda authorities have provided the following breakdown of motorcycle procurements in the last five years:      Year      No. of Motorcycles       2021    1      2022    1      2023    12      2024    38      2025    4       Total      56      The purchase and allocation of vehicles is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  An Garda Siochana Fleet Management have received budget approval for the purchase of a significant number of motorcycles as part of their 2026 Purchase Plan. The exact number will be confirmed over the coming weeks.  The Garda Authorities have also provided the following table with the number of Garda motorcycles currently deployed for Roads Policing duties and the proportion this represents of the overall Roads Policing unit:      Vehicle      Total      % of Roads Policing fleet       Cars     186    60.59      Vans    5    1.63      Motorbikes    92    29.97      4x4    23    7.49      Other    1    0.32       Total      307      100%       ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 206. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the average age and mileage of the Garda motorcycle fleet; and the number currently out of service due to maintenance requirements. [68500/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_206",
        "questionNumber": 206
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 199, 201, 202, 203, 205, 206 and 207 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and responsibility for the allocation and deployment of resources and personnel available to him, including the Garda fleet.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including the total number of Garda motorcycles in the Garda fleet. Monthly Fleet reports are currently available from 2020 to date. This is available on the Garda website at the following link: www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html.  The total number of motorcycles in the Garda fleet broken down by Division and District and the numbers of motorcycles removed from and assigned to the fleet from 2020 to date are available in the Fleet Reports.  I am advised by the Garda authorities that a comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  All vehicles on the Garda fleet are operated up to the manufacturer’s durability limits or uneconomic repair, irrespective of age. It is not possible to give an accurate figure for vehicles currently off the road for maintenance as this changes daily.  I am also informed that the average age of the Garda motorcycle fleet is 5.4 years and the average mileage is 40,907 kilometres.  The Garda authorities have provided the following breakdown of motorcycle procurements in the last five years:      Year      No. of Motorcycles       2021    1      2022    1      2023    12      2024    38      2025    4       Total      56      The purchase and allocation of vehicles is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.  An Garda Siochana Fleet Management have received budget approval for the purchase of a significant number of motorcycles as part of their 2026 Purchase Plan. The exact number will be confirmed over the coming weeks.  The Garda Authorities have also provided the following table with the number of Garda motorcycles currently deployed for Roads Policing duties and the proportion this represents of the overall Roads Policing unit:      Vehicle      Total      % of Roads Policing fleet       Cars     186    60.59      Vans    5    1.63      Motorbikes    92    29.97      4x4    23    7.49      Other    1    0.32       Total      307      100%       ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 207. Deputy Michael Murphy asked the Minister for Justice, Home Affairs and Migration the number of Garda motorcycles assigned to road safety and speed-monitoring operations such as Operation Slow Down, National Roads Policing Days of Action, and similar initiatives; and the outcomes of these operations over the past three years. [68501/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_207",
        "questionNumber": 207
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 21 to 27, inclusive, together.  An Oversight Agreement (OA) 2023-2026 was drawn up by my Department in partnership with the Sustainable Energy Authority of Ireland (SEAI) in accordance with the 2016 Code of Practice for the Governance of State Bodies. This Agreement sets out the broad governance and accountability framework within which the SEAI operates, and defines the key roles, responsibilities and interactions that underpin its relationship with my Department.  The Performance Delivery Agreement (PDA) was introduced in 2024 as the new format for the performance contract between my Department and the SEAI. Previously, a Service Level Plan specified the level of service to be delivered by the SEAI. The PDA is in line with the structure and content outlined in the 2016 Code of Practice, allows for the adoption of both annual and multi-annual targets, and is updated annually. The OA and PDA are not routinely published.  The OA between my Department and the SEAI requires that a monthly programme meeting is held between the SEAI and my officials to provide insights into operational metrics and deliverables relative to the residential and community retrofit schemes. Specifically for the Warmer Homes Scheme, the OA requires that the monthly meeting deals with key governance matters, including spend to date, projected outturn, performance against KPIs, updates on key risks, and programme development.  The PDA provides the overall structure for the monitoring and oversight of these deliverables. A series of year-specific annexes are used to define the output including performance indicators for the scheme in relation to energy savings, greenhouse gas emissions mitigation, numbers of homes upgraded, numbers of homes upgraded to BER B2 and above, and number of heat pumps installed. These annexes form the basis of the monthly governance meetings between my Department and the respective business units in the SEAI, and allow for detailed discussions on performance. The PDA requires that pre-meeting materials must include a review of KPIs and targets.  In addition to the monthly governance meetings, there are two formal meetings (the Strategic and Oversight Meeting) per annum to review performance against the PDA targets. These meetings are chaired by the relevant Assistant Secretary from my Department and are attended by my officials and senior management in the SEAI.  Contractors operating under the Better Energy Warmer Homes Scheme are subject to the SEAI's Domestic Technical Standards and Specifications, the Better Energy Homes Contractor’s Code of Practice, and the Better Energy Homes Quality Assurance and Disciplinary Procedures for Contractors. Requirements in relation to performance, inspections, remediation and addressing non-compliance are set out in these documents. The SEAI continuously monitor the performance of all contractors operating on the Warmer Homes Scheme, including in relation to quality, level of complaints, timelines, and general administration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 21. Deputy Michael Murphy asked the Minister for Climate, Energy and the Environment if he will provide a copy of the current performance delivery agreement (PDA) between his Department and the Sustainable Energy Authority of Ireland; the specific performance indicators, reporting obligations, and governance arrangements contained within the PDA relating to the operation of the warmer homes scheme; and if he will make a statement on the matter. [67328/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_21",
        "questionNumber": 21
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 21 to 27, inclusive, together.  An Oversight Agreement (OA) 2023-2026 was drawn up by my Department in partnership with the Sustainable Energy Authority of Ireland (SEAI) in accordance with the 2016 Code of Practice for the Governance of State Bodies. This Agreement sets out the broad governance and accountability framework within which the SEAI operates, and defines the key roles, responsibilities and interactions that underpin its relationship with my Department.  The Performance Delivery Agreement (PDA) was introduced in 2024 as the new format for the performance contract between my Department and the SEAI. Previously, a Service Level Plan specified the level of service to be delivered by the SEAI. The PDA is in line with the structure and content outlined in the 2016 Code of Practice, allows for the adoption of both annual and multi-annual targets, and is updated annually. The OA and PDA are not routinely published.  The OA between my Department and the SEAI requires that a monthly programme meeting is held between the SEAI and my officials to provide insights into operational metrics and deliverables relative to the residential and community retrofit schemes. Specifically for the Warmer Homes Scheme, the OA requires that the monthly meeting deals with key governance matters, including spend to date, projected outturn, performance against KPIs, updates on key risks, and programme development.  The PDA provides the overall structure for the monitoring and oversight of these deliverables. A series of year-specific annexes are used to define the output including performance indicators for the scheme in relation to energy savings, greenhouse gas emissions mitigation, numbers of homes upgraded, numbers of homes upgraded to BER B2 and above, and number of heat pumps installed. These annexes form the basis of the monthly governance meetings between my Department and the respective business units in the SEAI, and allow for detailed discussions on performance. The PDA requires that pre-meeting materials must include a review of KPIs and targets.  In addition to the monthly governance meetings, there are two formal meetings (the Strategic and Oversight Meeting) per annum to review performance against the PDA targets. These meetings are chaired by the relevant Assistant Secretary from my Department and are attended by my officials and senior management in the SEAI.  Contractors operating under the Better Energy Warmer Homes Scheme are subject to the SEAI's Domestic Technical Standards and Specifications, the Better Energy Homes Contractor’s Code of Practice, and the Better Energy Homes Quality Assurance and Disciplinary Procedures for Contractors. Requirements in relation to performance, inspections, remediation and addressing non-compliance are set out in these documents. The SEAI continuously monitor the performance of all contractors operating on the Warmer Homes Scheme, including in relation to quality, level of complaints, timelines, and general administration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 22. Deputy Michael Murphy asked the Minister for Climate, Energy and the Environment if his Department has a formal service level agreement (SLA) in place with the Sustainable Energy Authority of Ireland specifically governing the administration, quality assurance, contractor performance, and homeowner service standards under the warmer homes scheme; if so, if he will provide the details of this SLA; and if not, the reason such an agreement is not in place. [67329/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_22",
        "questionNumber": 22
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 21 to 27, inclusive, together.  An Oversight Agreement (OA) 2023-2026 was drawn up by my Department in partnership with the Sustainable Energy Authority of Ireland (SEAI) in accordance with the 2016 Code of Practice for the Governance of State Bodies. This Agreement sets out the broad governance and accountability framework within which the SEAI operates, and defines the key roles, responsibilities and interactions that underpin its relationship with my Department.  The Performance Delivery Agreement (PDA) was introduced in 2024 as the new format for the performance contract between my Department and the SEAI. Previously, a Service Level Plan specified the level of service to be delivered by the SEAI. The PDA is in line with the structure and content outlined in the 2016 Code of Practice, allows for the adoption of both annual and multi-annual targets, and is updated annually. The OA and PDA are not routinely published.  The OA between my Department and the SEAI requires that a monthly programme meeting is held between the SEAI and my officials to provide insights into operational metrics and deliverables relative to the residential and community retrofit schemes. Specifically for the Warmer Homes Scheme, the OA requires that the monthly meeting deals with key governance matters, including spend to date, projected outturn, performance against KPIs, updates on key risks, and programme development.  The PDA provides the overall structure for the monitoring and oversight of these deliverables. A series of year-specific annexes are used to define the output including performance indicators for the scheme in relation to energy savings, greenhouse gas emissions mitigation, numbers of homes upgraded, numbers of homes upgraded to BER B2 and above, and number of heat pumps installed. These annexes form the basis of the monthly governance meetings between my Department and the respective business units in the SEAI, and allow for detailed discussions on performance. The PDA requires that pre-meeting materials must include a review of KPIs and targets.  In addition to the monthly governance meetings, there are two formal meetings (the Strategic and Oversight Meeting) per annum to review performance against the PDA targets. These meetings are chaired by the relevant Assistant Secretary from my Department and are attended by my officials and senior management in the SEAI.  Contractors operating under the Better Energy Warmer Homes Scheme are subject to the SEAI's Domestic Technical Standards and Specifications, the Better Energy Homes Contractor’s Code of Practice, and the Better Energy Homes Quality Assurance and Disciplinary Procedures for Contractors. Requirements in relation to performance, inspections, remediation and addressing non-compliance are set out in these documents. The SEAI continuously monitor the performance of all contractors operating on the Warmer Homes Scheme, including in relation to quality, level of complaints, timelines, and general administration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 23. Deputy Michael Murphy asked the Minister for Climate, Energy and the Environment whether any structured or contractual service-level metrics, such as delivery timeframes, inspection rates, defect remediation requirements, and customer service standards, exist between his Department and the Sustainable Energy Authority of Ireland in respect of the warmer homes scheme; and if not, the way in which his Department monitors and ensures performance and accountability under the scheme. [67330/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_23",
        "questionNumber": 23
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 21 to 27, inclusive, together.  An Oversight Agreement (OA) 2023-2026 was drawn up by my Department in partnership with the Sustainable Energy Authority of Ireland (SEAI) in accordance with the 2016 Code of Practice for the Governance of State Bodies. This Agreement sets out the broad governance and accountability framework within which the SEAI operates, and defines the key roles, responsibilities and interactions that underpin its relationship with my Department.  The Performance Delivery Agreement (PDA) was introduced in 2024 as the new format for the performance contract between my Department and the SEAI. Previously, a Service Level Plan specified the level of service to be delivered by the SEAI. The PDA is in line with the structure and content outlined in the 2016 Code of Practice, allows for the adoption of both annual and multi-annual targets, and is updated annually. The OA and PDA are not routinely published.  The OA between my Department and the SEAI requires that a monthly programme meeting is held between the SEAI and my officials to provide insights into operational metrics and deliverables relative to the residential and community retrofit schemes. Specifically for the Warmer Homes Scheme, the OA requires that the monthly meeting deals with key governance matters, including spend to date, projected outturn, performance against KPIs, updates on key risks, and programme development.  The PDA provides the overall structure for the monitoring and oversight of these deliverables. A series of year-specific annexes are used to define the output including performance indicators for the scheme in relation to energy savings, greenhouse gas emissions mitigation, numbers of homes upgraded, numbers of homes upgraded to BER B2 and above, and number of heat pumps installed. These annexes form the basis of the monthly governance meetings between my Department and the respective business units in the SEAI, and allow for detailed discussions on performance. The PDA requires that pre-meeting materials must include a review of KPIs and targets.  In addition to the monthly governance meetings, there are two formal meetings (the Strategic and Oversight Meeting) per annum to review performance against the PDA targets. These meetings are chaired by the relevant Assistant Secretary from my Department and are attended by my officials and senior management in the SEAI.  Contractors operating under the Better Energy Warmer Homes Scheme are subject to the SEAI's Domestic Technical Standards and Specifications, the Better Energy Homes Contractor’s Code of Practice, and the Better Energy Homes Quality Assurance and Disciplinary Procedures for Contractors. Requirements in relation to performance, inspections, remediation and addressing non-compliance are set out in these documents. The SEAI continuously monitor the performance of all contractors operating on the Warmer Homes Scheme, including in relation to quality, level of complaints, timelines, and general administration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 24. Deputy Michael Murphy asked the Minister for Climate, Energy and the Environment the governance arrangements that existed between his Department and the Sustainable Energy Authority of Ireland prior to the establishment of the current performance delivery agreement (PDA); and whether any formal agreements, contracts, or service-level frameworks applied to the warmer homes scheme before the PDA was introduced. [67331/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_24",
        "questionNumber": 24
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 21 to 27, inclusive, together.  An Oversight Agreement (OA) 2023-2026 was drawn up by my Department in partnership with the Sustainable Energy Authority of Ireland (SEAI) in accordance with the 2016 Code of Practice for the Governance of State Bodies. This Agreement sets out the broad governance and accountability framework within which the SEAI operates, and defines the key roles, responsibilities and interactions that underpin its relationship with my Department.  The Performance Delivery Agreement (PDA) was introduced in 2024 as the new format for the performance contract between my Department and the SEAI. Previously, a Service Level Plan specified the level of service to be delivered by the SEAI. The PDA is in line with the structure and content outlined in the 2016 Code of Practice, allows for the adoption of both annual and multi-annual targets, and is updated annually. The OA and PDA are not routinely published.  The OA between my Department and the SEAI requires that a monthly programme meeting is held between the SEAI and my officials to provide insights into operational metrics and deliverables relative to the residential and community retrofit schemes. Specifically for the Warmer Homes Scheme, the OA requires that the monthly meeting deals with key governance matters, including spend to date, projected outturn, performance against KPIs, updates on key risks, and programme development.  The PDA provides the overall structure for the monitoring and oversight of these deliverables. A series of year-specific annexes are used to define the output including performance indicators for the scheme in relation to energy savings, greenhouse gas emissions mitigation, numbers of homes upgraded, numbers of homes upgraded to BER B2 and above, and number of heat pumps installed. These annexes form the basis of the monthly governance meetings between my Department and the respective business units in the SEAI, and allow for detailed discussions on performance. The PDA requires that pre-meeting materials must include a review of KPIs and targets.  In addition to the monthly governance meetings, there are two formal meetings (the Strategic and Oversight Meeting) per annum to review performance against the PDA targets. These meetings are chaired by the relevant Assistant Secretary from my Department and are attended by my officials and senior management in the SEAI.  Contractors operating under the Better Energy Warmer Homes Scheme are subject to the SEAI's Domestic Technical Standards and Specifications, the Better Energy Homes Contractor’s Code of Practice, and the Better Energy Homes Quality Assurance and Disciplinary Procedures for Contractors. Requirements in relation to performance, inspections, remediation and addressing non-compliance are set out in these documents. The SEAI continuously monitor the performance of all contractors operating on the Warmer Homes Scheme, including in relation to quality, level of complaints, timelines, and general administration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 25. Deputy Michael Murphy asked the Minister for Climate, Energy and the Environment how compliance with the performance delivery agreement is monitored with respect to the warmer homes scheme; the frequency of reporting by SEAI; the KPIs relating to scheme delivery; and whether any performance concerns have been raised with SEAI in the past three years. [67332/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_25",
        "questionNumber": 25
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 21 to 27, inclusive, together.  An Oversight Agreement (OA) 2023-2026 was drawn up by my Department in partnership with the Sustainable Energy Authority of Ireland (SEAI) in accordance with the 2016 Code of Practice for the Governance of State Bodies. This Agreement sets out the broad governance and accountability framework within which the SEAI operates, and defines the key roles, responsibilities and interactions that underpin its relationship with my Department.  The Performance Delivery Agreement (PDA) was introduced in 2024 as the new format for the performance contract between my Department and the SEAI. Previously, a Service Level Plan specified the level of service to be delivered by the SEAI. The PDA is in line with the structure and content outlined in the 2016 Code of Practice, allows for the adoption of both annual and multi-annual targets, and is updated annually. The OA and PDA are not routinely published.  The OA between my Department and the SEAI requires that a monthly programme meeting is held between the SEAI and my officials to provide insights into operational metrics and deliverables relative to the residential and community retrofit schemes. Specifically for the Warmer Homes Scheme, the OA requires that the monthly meeting deals with key governance matters, including spend to date, projected outturn, performance against KPIs, updates on key risks, and programme development.  The PDA provides the overall structure for the monitoring and oversight of these deliverables. A series of year-specific annexes are used to define the output including performance indicators for the scheme in relation to energy savings, greenhouse gas emissions mitigation, numbers of homes upgraded, numbers of homes upgraded to BER B2 and above, and number of heat pumps installed. These annexes form the basis of the monthly governance meetings between my Department and the respective business units in the SEAI, and allow for detailed discussions on performance. The PDA requires that pre-meeting materials must include a review of KPIs and targets.  In addition to the monthly governance meetings, there are two formal meetings (the Strategic and Oversight Meeting) per annum to review performance against the PDA targets. These meetings are chaired by the relevant Assistant Secretary from my Department and are attended by my officials and senior management in the SEAI.  Contractors operating under the Better Energy Warmer Homes Scheme are subject to the SEAI's Domestic Technical Standards and Specifications, the Better Energy Homes Contractor’s Code of Practice, and the Better Energy Homes Quality Assurance and Disciplinary Procedures for Contractors. Requirements in relation to performance, inspections, remediation and addressing non-compliance are set out in these documents. The SEAI continuously monitor the performance of all contractors operating on the Warmer Homes Scheme, including in relation to quality, level of complaints, timelines, and general administration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 26. Deputy Michael Murphy asked the Minister for Climate, Energy and the Environment if the performance delivery agreement, or any related agreements between the Department and SEAI, specify consequences or corrective-action mechanisms for underperformance by SEAI or contracted installers under the warmer homes scheme; and if he will provide details of any such provisions. [67333/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_26",
        "questionNumber": 26
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 21 to 27, inclusive, together.  An Oversight Agreement (OA) 2023-2026 was drawn up by my Department in partnership with the Sustainable Energy Authority of Ireland (SEAI) in accordance with the 2016 Code of Practice for the Governance of State Bodies. This Agreement sets out the broad governance and accountability framework within which the SEAI operates, and defines the key roles, responsibilities and interactions that underpin its relationship with my Department.  The Performance Delivery Agreement (PDA) was introduced in 2024 as the new format for the performance contract between my Department and the SEAI. Previously, a Service Level Plan specified the level of service to be delivered by the SEAI. The PDA is in line with the structure and content outlined in the 2016 Code of Practice, allows for the adoption of both annual and multi-annual targets, and is updated annually. The OA and PDA are not routinely published.  The OA between my Department and the SEAI requires that a monthly programme meeting is held between the SEAI and my officials to provide insights into operational metrics and deliverables relative to the residential and community retrofit schemes. Specifically for the Warmer Homes Scheme, the OA requires that the monthly meeting deals with key governance matters, including spend to date, projected outturn, performance against KPIs, updates on key risks, and programme development.  The PDA provides the overall structure for the monitoring and oversight of these deliverables. A series of year-specific annexes are used to define the output including performance indicators for the scheme in relation to energy savings, greenhouse gas emissions mitigation, numbers of homes upgraded, numbers of homes upgraded to BER B2 and above, and number of heat pumps installed. These annexes form the basis of the monthly governance meetings between my Department and the respective business units in the SEAI, and allow for detailed discussions on performance. The PDA requires that pre-meeting materials must include a review of KPIs and targets.  In addition to the monthly governance meetings, there are two formal meetings (the Strategic and Oversight Meeting) per annum to review performance against the PDA targets. These meetings are chaired by the relevant Assistant Secretary from my Department and are attended by my officials and senior management in the SEAI.  Contractors operating under the Better Energy Warmer Homes Scheme are subject to the SEAI's Domestic Technical Standards and Specifications, the Better Energy Homes Contractor’s Code of Practice, and the Better Energy Homes Quality Assurance and Disciplinary Procedures for Contractors. Requirements in relation to performance, inspections, remediation and addressing non-compliance are set out in these documents. The SEAI continuously monitor the performance of all contractors operating on the Warmer Homes Scheme, including in relation to quality, level of complaints, timelines, and general administration. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 27. Deputy Michael Murphy asked the Minister for Climate, Energy and the Environment if he will publish the current performance delivery agreement, and any associated service-level or performance-monitoring documents, relating to the warmer homes scheme; and if not, the reason for withholding same. [67334/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_27",
        "questionNumber": 27
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. The Deputy may wish to note that the RSA publish detailed information on the driver testing service on the CSO website each month. This includes information on the number of test 'no shows' broken down by month, driving test centre and by driving test category.  This information is available at the following link: data.cso.ie/table/ROA30 ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 98. Deputy Michael Murphy asked the Minister for Transport if he has directed the Road Safety Authority to publish on a monthly basis; the number of learner drivers who fail to show up for their scheduled driving test appointment; by driving test centre; and if he will make a statement on the matter. [67546/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_89",
          "debateSectionId": "dbsect_89",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_98",
        "questionNumber": 98
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that this is not the first occasion that delayed reply to parliamentary questions by the Road Safety Authority (RSA) has been raised. Deputies have a legitimate expectation to receive detailed replies to any question referred to a State agency within a reasonable timeframe, and it is therefore a subject of significant concern for me as Minister when this expectation is not met.  In response to this issue being raised earlier this year, my officials requested that the RSA prepare an analysis of their PQ volumes and response times. This analysis showed that, as of the end of August, the RSA had received 312 PQs and responded to 76% within ten days. I do wish to acknowledge that the volume of PQs received by the RSA had increased from 143, or by 118%, compared to the same period in 2024.  Notwithstanding this significant increase in query volumes and improvement in response times, I believe that approximately a quarter of PQs not being replied to within ten days is an issue. While there may be certain complex queries requiring more time than the standard period, these should be the exception rather than the rule, and it is incumbent on the RSA to appropriately prioritise and resource responses to Deputies.  I thank the Deputy for raising this matter with me and will request that my officials continue to engage with the RSA and monitor their ongoing performance on this issue. Finally, I would request that Deputies continue to inform my office when responses are not received within the ten day period and my officials will follow up on any such instance. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 99. Deputy Michael Murphy asked the Minister for Transport his plans to address the long delays in the Road Safety Authority providing figures requested via Parliamentary Questions; and if he will make a statement on the matter. [67547/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_90",
          "debateSectionId": "dbsect_90",
          "showAs": "Road Safety Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_90.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_99",
        "questionNumber": 99
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  Fleet electrification is expected to continue to provide the greatest share of emissions abatement in the short-to-medium term for the transport sector. Over €100m has been allocated in 2025 to support the continued transition to electric vehicles through funding for EV grants and EV charging infrastructure. This underpins the Government’s commitment to making electric vehicles accessible to all.  Latest statistics, as provided by the Society of the Irish Motor Industry for each year since 2020 are outlined below in tabular format.            2025      2024      2023      2022      2021      2020        BEV     23,083    16,653    22,329    15,678    8,646    4,013       PHEV     18,779    12,405    10,246    7,678    7,891    2,492       Non Plug-In Hybrid     29,523    26,592    24,794    21,252    19,247    10,986      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 129. Deputy Michael Murphy asked the Minister for Transport to publish the latest statistics, as of the most recent reporting date, for the total number of electric vehicles on Irish roads, broken down by, battery electric vehicles (BEVs), plug-in hybrid electric vehicles (PHEVs), and hybrid (non-plug-in) vehicles; and if he will provide historical totals for each category for each year since 2020. [67939/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Murphy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Murphy.D.2024-11-29",
          "showAs": "Michael Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_114",
          "debateSectionId": "dbsect_114",
          "showAs": "Electric Vehicles",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_129",
        "questionNumber": 129
      },
      "contextDate": "2025-12-02"
    }
  ]
}