{
  "head": {
    "counts": {
      "questionCount": 445,
      "resultCount": 445
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 37. Deputy Naoise Ó Muirí asked the Minister for Children, Disability and Equality if she will outline the upcoming changes to the national childcare scheme for families; and if she will make a statement on the matter. [72946/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_79",
          "debateSectionId": "dbsect_79",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_79.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_37",
        "questionNumber": 37
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 92. Deputy Naoise Ó Muirí asked the Minister for Children, Disability and Equality if she will provide an update on the programme for Government commitment to provide capital investment to build or purchase State-owned childcare facilities, to create additional capacity in areas where unmet need exists; and if she will make a statement on the matter. [72947/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_136",
          "debateSectionId": "dbsect_136",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_136.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_92",
        "questionNumber": 92
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I am strongly aware of the need to support communities, businesses, and ecosystems with a whole of government approach to developing increased resilience to the impacts of climate change and I work with other Ministers, Local Authorities and Agencies to support that whole of Government response to the impacts of climate change.  Last year, Government approved Ireland’s second National Adaptation Framework (NAF). Developed under the NAF, Sectoral Adaptation Plans (SAPs) for 13 key sectors, across 8 Departments were recently approved and published by Government. Delivery of SAP actions falls under the remit of each Sectoral Minister.  Under each SAP, key adaptation priorities will be progressed for funding within budgetary parameters and the limits outlined as part of National Development Plan allocations and as part of the annual estimates process by each sectoral Minister.  One such key sector, Electricity and Gas Networks, falls under the remit of my Department. Investment in the onshore electricity grid is a key priority in the Programme for Government. Work commenced on Price Review 6 will see the Commission for Regulation of Utilities (CRU) approve investment in the grid for 2026-2030. CRU recently outlined a proposed investment of up to €19 billion in our electricity system between 2026-2030, with a €14 billion baseline investment guaranteed. This large-scale investment will assist Ireland in maintaining a reliable and resilient electricity network. To support delivery of Price Review 6, the Government is investing €3.5 billion in equity between EirGrid and ESB Networks.  Under the leadership of my Department, a new senior level Adaptation Task Force will commence work in 2026 to support enhanced accountability for, and ownership of, sectoral risks and support implementation of adaptation action on cross-cutting issues. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 138. Deputy Naoise Ó Muirí asked the Minister for Climate, Energy and the Environment his Department’s investment in climate adaptation projects, and estimates of adaptation investment needs between now and 2030; and if he will make a statement on the matter. [73226/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_170",
          "debateSectionId": "dbsect_170",
          "showAs": "Climate Change Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_170.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_138",
        "questionNumber": 138
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Ireland's ambition to become a clean energy exporter is reliant upon on the successful development of clean, indigenous energy production, reduced energy costs and the development of interconnectors with other countries to enable us to both import and export energy with Britain, France and others.  In the past few weeks we have seen the successful conclusion of the Tonn Nua offshore wind energy auction which will generate 900 megawatts (MW) of renewable energy in the first of four sites in the South Coast DMAP area. This builds on the 3.8 gigawatts (GW) which are in the pipeline from five phase one projects in the planning system on the east coast.  Officials in my Department are continuing to work on preparations for further auctions for the remaining three sites in the South Coast DMAP, including on the development of a surveying programme to support and de-risk the auction process, as well as the development of a National DMAP which will aim to designate sufficient maritime area to deliver on our target of 20 GW of offshore renewable energy by 2040.  On interconnection, this year saw the launch of the Greenlink Interconnector, a 500 MW interconnector between Ireland and Wales, which doubles the State's total interconnection capacity to 1 GW. The 700 MW Celtic Interconnector between Ireland and France is under construction and will connect us directly with mainland Europe and the Integrated EU Energy Market when integrated to the grid in 2028. The MaresConnect project is also in development and it is anticipated that it will be commissioned by 2030. We are also exploring the feasibility of additional future connections to more countries.  As our offshore generation portfolio grows, export is envisaged to become a more important route to market for Irish electricity. Ireland’s Interconnection ambitions are well set out in the National Policy Statement on Electricity Interconnection 2023.  The policy document and supporting analysis, including details of potential benefits, are available at: www.gov.ie/en/department-of-climate-energy-and-the-environment/publications/national-policy-statement-on-electricity-interconnection-2023/ ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 146. Deputy Naoise Ó Muirí asked the Minister for Climate, Energy and the Environment if his Department have forecasted the viability of Ireland becoming a net exporter of wind energy by 2040; and if he will make a statement on the matter. [73227/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "Wind Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_146",
        "questionNumber": 146
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland’s tax system supports efforts to transition to a low carbon economy, and, over the past number of years, several tax reforms have been implemented to encourage behavioural change and support emissions reductions, including carbon tax increases and vehicle tax reforms.  Government is committed to a carbon tax regime that is progressive, with revenue raised from increases in the carbon tax since 2020 being allocated for expenditure on climate action and the Just Transition. The additional revenue raised by increasing the carbon tax is ring-fenced and used to enable transitional changes and to provide targeted social welfare and other measures to prevent energy poverty. Consistently, internal Government analysis using the SWITCH model has found that the increases in the carbon tax have been progressive due to the increased social protection payments funded by the carbon tax.  The Government has allocated €1.1 billion to climate action measures and to ensure the most vulnerable are protected from the unintended impacts of the increase in the carbon tax. This is an additional €163 million on 2025’s allocation.  This €1.1 billion expenditure is comprised of:  • €566 million to the Department of Climate, Energy and the Environment for retrofitting programmes, Just Transition and ODA-Green Climate Fund (an additional €89 million on 2025);  • €350 million for the Department of Social Protection for targeted social welfare interventions ( an additional €44 million on 2025);  • €173 million for the Department Agriculture, Food and the Marine for green & sustainable farming measures (an additional €30 million on 2025);  • €20 million for the Department of Transport for continuation of carbon tax-funded programmes since 2020; and  • €5 million for the Department of Housing, Local Government and Heritage for continuation of carbon tax-funded programmes since 2020.  The existing vehicle tax structures in the State have a strong environmental rationale, with the more pollutant, fossil-fuelled cars paying higher rates of tax, while low emission cars are subject to the lowest rates of tax. The current policy approach aims to incentivise the uptake of zero to low emission vehicles, which will support the reduction in Ireland’s transport emissions, while also fostering a more sustainable transport network.  Electric vehicles (EVs) currently benefit from a number of tax incentives, including preferential rates of benefit-in-kind (BIK), Vehicle Registration Tax relief of up to €5,000, a low annual motor tax rate, and a BIK exemption on the installation of an EV charging facility by an employer at the home of a director or employee.  Government has also introduced several tax incentives to support home energy efficiency improvements. A zero rate of VAT applies to the supply and installation of solar panels on private dwellings, while heat pumps are subject to a reduced VAT rate of 9%. The accelerated capital allowances scheme also supports the uptake of energy efficient equipment, ensuring energy savings and reduced carbon emissions.  Overall, Ireland’s tax system supports climate resilience by incentivising the uptake of zero emission vehicles, lowering long-term energy costs, and supporting households most affected by increasing fuel and heating costs through targeted supports.  Tax policy measures and options with regard to behavioural change and emissions reductions are kept under review as part of the annual Tax Strategy Group and Budgetary cycle. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 187. Deputy Naoise Ó Muirí asked the Tánaiste and Minister for Finance his views on the way the taxation system could help citizens mitigate risks with regard to the impact of climate change, as identified in the Climate Change Risk Matrix, as published by his Department; and if he will make a statement on the matter. [69920/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_201",
          "debateSectionId": "dbsect_201",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_201.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_187",
        "questionNumber": 187
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  In Budget 2026, it was announced that a new Derelict Property Tax (DPT) would be introduced. The aim of this tax is to encourage the activation of derelict properties and sites. It will replace the Derelict Sites Levy and will be collected by the Revenue Commissioners.  In order for the new tax to be successful on introduction, care must be taken in its design. A key issue is that the tax must apply in a consistent manner to all residential properties and sites that are derelict. Therefore, a lead-in time will be required for local authorities to identify all the relevant derelict properties in their area for inclusion on a register in a consistent manner.  I intend to legislate for the DPT in 2026. This is dependent on engagement from stakeholders and will also be influenced by any advice I receive from the Attorney General. This timeline is necessary to allow local authorities to prepare and publish a preliminary register of derelict properties in 2027, with the tax coming into effect as quickly as possible thereafter.  Replacing the existing levy with a new tax will be a complex process. There is much detail that remains to be worked through in relation to the operation of the tax, including the way in which the data will be collected. I will be in a position to provide further information next year, in advance of the tax being legislated for. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 244. Deputy Naoise Ó Muirí asked the Tánaiste and Minister for Finance the timeframe for the introduction of the new derelict property tax; the way in which this data will be collected; and if he will make a statement on the matter. [65834/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_257",
          "debateSectionId": "dbsect_257",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_244",
        "questionNumber": 244
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Ireland Strategic Investment Fund (ISIF) makes significant equity and debt investments available to support high impact residential development, including for SME homebuilders, urban regeneration, real estate and infrastructure projects.  In July 2023, ISIF established a €400m equity investment fund to support housing delivery, the last tranche of this funding’s deployment is now imminent. As part of the National Housing Plan, ISIF will shortly be committing further funding to meet their target of over 25,000 homes by 2030. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 358. Deputy Naoise Ó Muirí asked the Tánaiste and Minister for Finance the role of the new equity risk capital investment programme for homebuilding; and if he will make a statement on the matter. [65835/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_356",
          "debateSectionId": "dbsect_356",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_356.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_358",
        "questionNumber": 358
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department has responsibility for coordinating the digitalisation of public services, including the release of a National Digital Wallet, which has been built by the Office of the Government Chief Information Officer (OGCIO). The Digital wallet is being developed in line with the European Digital Identity Wallet (EUDIW) framework, which places the user at the centre and ensures that individuals have full control over their personal data.  Personal Identification Data (PID) and other credentials will be securely issued to the wallet using robust protocols. Data exchange will occur through secure, authenticated connections between the user and the relevant credential issuers. The overall design ensures that data is not shared with Internet Service Providers (ISPs). ISPs will only see normal network traffic and device connections, without visibility into the nature of the wallet or the data being exchanged.  The pilot’s efficacy will be assessed through a beta launch, incorporating rigorous technical testing and user experience evaluations to safeguard user trust. This approach delivers a secure, privacy-preserving wallet that empowers citizens to manage their own identity and credentials. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 384. Deputy Naoise Ó Muirí asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation how user data is being safeguarded when the digital wallet is introduced; how it is expected that data will not be shared with ISPs; how his Department will determine the efficacy of the pilot; and if he will make a statement on the matter. [73445/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_374",
          "debateSectionId": "dbsect_374",
          "showAs": "Data Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_374.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_384",
        "questionNumber": 384
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 420 and 421 together.  As reference in Parlimentary Questions 71494/25 and 71496/25, the Education Therapy Service (ETS) has been established, in line with the programme for government, as a critical and important support for children and young people in their school environment. The ETS is an additional support for children with special education needs. It is to supplement and not replace existing children’s health and disability services. It is intended to commence initially in specials schools and rollout over time to special classes and mainstream schools.  It is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year.  The recruitment campaign for therapists to the new ETS, launched on the 28th November, campaign will initially see 90 occupational therapists and speech and language therapists consisting of staff and senior grades join their therapy team.  As this is a national service, starting with special schools, it will grow and expand to include all schools. It is envisioned that there will be rolling recruitment campaign commencing in 2026 covering all counties to meet the therapy needs of the children in the school system. It is envisioned that further recruitment campaigns will also include additional therapy grades including therapy managers, clinical specialists and therapy assistants.  As referenced in earlier parliamentary questions mentioned above, the NCSE have been developing an education -based therapy support service known as the previously as the Education Therapy Supports Service (ETSS), which will now be subsumed into the ETS. This service provides two strands of support to all schools: Sustained In-School Therapy and Regional Therapy Supports.  My Department and the NCSE are committed to ensuring, that in time, all children and young people have access to essential speech and language and occupational therapy in their school environment a timely manner. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 420. Deputy Naoise Ó Muirí asked the Minister for Education and Youth for an update on a matter (details supplied); and if she will make a statement on the matter. [73311/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_406",
          "debateSectionId": "dbsect_406",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_406.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_420",
        "questionNumber": 420
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 420 and 421 together.  As reference in Parlimentary Questions 71494/25 and 71496/25, the Education Therapy Service (ETS) has been established, in line with the programme for government, as a critical and important support for children and young people in their school environment. The ETS is an additional support for children with special education needs. It is to supplement and not replace existing children’s health and disability services. It is intended to commence initially in specials schools and rollout over time to special classes and mainstream schools.  It is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year.  The recruitment campaign for therapists to the new ETS, launched on the 28th November, campaign will initially see 90 occupational therapists and speech and language therapists consisting of staff and senior grades join their therapy team.  As this is a national service, starting with special schools, it will grow and expand to include all schools. It is envisioned that there will be rolling recruitment campaign commencing in 2026 covering all counties to meet the therapy needs of the children in the school system. It is envisioned that further recruitment campaigns will also include additional therapy grades including therapy managers, clinical specialists and therapy assistants.  As referenced in earlier parliamentary questions mentioned above, the NCSE have been developing an education -based therapy support service known as the previously as the Education Therapy Supports Service (ETSS), which will now be subsumed into the ETS. This service provides two strands of support to all schools: Sustained In-School Therapy and Regional Therapy Supports.  My Department and the NCSE are committed to ensuring, that in time, all children and young people have access to essential speech and language and occupational therapy in their school environment a timely manner. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 421. Deputy Naoise Ó Muirí asked the Minister for Education and Youth the timeline for when occupational therapists and speech and language therapists will be recruited from a recruitment drive to service children in several counties (details supplied); and if she will make a statement on the matter. [73312/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_406",
          "debateSectionId": "dbsect_406",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_406.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_421",
        "questionNumber": 421
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation over the past number of weeks under the auspices of the Workplace Relations Commission in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 439. Deputy Naoise Ó Muirí asked the Minister for Education and Youth for an update on WRC talks with a union (details supplied) involving school secretaries and caretakers; and if she will make a statement on the matter. [73444/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_418",
          "debateSectionId": "dbsect_418",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_418.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_439",
        "questionNumber": 439
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  A personalised budget is an amount of funding allocated to an eligible person with a disability to enable them to make their own arrangements to meet specified support needs. A key strength of the personalised budget model is the enhanced autonomy and flexibility it offers. Individuals’ can select services that are most relevant and meaningful to them, defining the quality, scope, and delivery of their supports.  To test the delivery of personalised budgets in an Irish context, the Personalised Budget Demonstrator Pilot was established in 2019, on a cost-neutral basis.  In May 2025, the Demonstrator Pilot commenced its evaluation phase which is expected to conclude shortly. Led by the National Disability Authority, the evaluation will provide critical insights into the barriers and facilitators to rolling out personalised budgets on a larger scale and will therefore inform next steps towards the development of an effective model of personalised budgets model in Ireland. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 598. Deputy Naoise Ó Muirí asked the Minister for Children, Disability and Equality if she will outline the current support provided for personalised budgets; her plans to expand this scheme to better support people with disabilities; and if she will make a statement on the matter. [62155/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_572",
          "debateSectionId": "dbsect_572",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_572.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_598",
        "questionNumber": 598
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  Phased dispensing support is currently available for medical card holders under the General Medical Services (GMS) Scheme for the following reasons:  1. at the request of a patient's physician.  2. due to the inherent nature of a medicinal product i.e. product stability and shelf life.  3. where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  4. in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  - Psychotropics;  - Opioids;  - Codeine; and  - Pregabalin and gabapentin.  The approved list of medications can be found in the following HSE circular: www.hse.ie/eng/staff/pcrs/circulars/pharmacy/pharmacy-circular-019-25-phased-dispensing.pdf  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse. Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  These changes, which were due to come into effect in January 2026, have now been paused till later in quarter 1 of 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 658. Deputy Naoise Ó Muirí asked the Minister for Health if phased dispensing will still be provided free of charge for patients at the request of their physician; whether the HSE expects this to take place for many existing patients; when the approved list of medications will be provided in these cases; and if she will make a statement on the matter. [73443/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_631",
          "debateSectionId": "dbsect_631",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_631.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_658",
        "questionNumber": 658
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Environmental Protection Agency’s (EPA’s) most recent emissions inventory report Ireland's Provisional Greenhouse Gas Emissions 1990-2024 , published in July of this year, confirms that Ireland has recorded overall greenhouse gas (GHG) emission reductions for a third consecutive year, with a decrease of 6.8% in 2023 followed by a further 2% reduction in 2024.  Ireland now has the lowest level of GHG emissions in 35 years which is notable given concurrent demographic and economic growth, including an increase of approximately 1.5 million people, more than one million new homes and over one million extra vehicles on our roads.  Our momentum in emissions reductions reflects the progress we are making to deliver key measures across sectors, for example:  • the 2025 target for electric vehicles sales of 195,000 was surpassed in October;  • the milestone of over 2 gigawatts of installed solar capacity was achieved in November;  • the very positive results of the offshore wind auction for the Tonn Nua site in November, which will produce enough energy to power almost one million homes; and  • Government has approved an unprecedented investment of €18 billion in Grid for the period 2026 – 2030 which is fundamental to the electrification of homes, businesses and transport.  However, the EPA's latest projections report Ireland's Greenhouse Gas Emissions Projections 2024-2055, published in May of this year, shows that even more accelerated reductions are required. To address the gap, we will need to significantly ramp up the delivery of climate action across sectors. In line with the Programme for Government commitment enhanced governance arrangements to accelerate delivery have been put in place this year to streamline structures, ensure key strategic high impact measures are enabled and that corrective action is taken on critical actions which are at risk.  I now chair the Climate Action Delivery Board (CADB), bringing all the relevant Secretaries General together, with a focus on accelerated implementation,. The Board met earlier this month. The Climate Action Programme Board (CAPPB) has also been established to provide co-ordinated oversight and strategic direction on the delivery of the Climate Action Plan, at Assistant Secretary/Taskforce chair level, and has met 3 times to date.  The CAPPB brings together the chairs of the various climate delivery taskforces from across sectors to bring an overall cohesion and alignment to climate action, and to provide oversight and support to taskforces in delivering their work programmes. It assesses progress on delivery, monitors risks, and proposes corrective actions for underperforming or at-risk actions and deliverables, including delivery of With Existing Measures (WEM) and With Accelerated Measures (WAM) measures. Implementation is my focus, and I will continue to push for a greater achievement of our highest impact measures. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 59. Deputy Naoise Ó Muirí asked the Minister for Climate, Energy and the Environment to provide an update on Ireland's progress towards meeting its legally binding carbon budgets, in view of the Environmental Protection Agency's confirmation of a 2% reduction in greenhouse gas emissions in 2024 following a 6.8% reduction in 2023; and if he will make a statement on the matter. [72845/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_75",
          "debateSectionId": "dbsect_75",
          "showAs": "Greenhouse Gas Emissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_75.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_59",
        "questionNumber": 59
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 274. Deputy Naoise Ó Muirí asked the Minister for Housing, Local Government and Heritage the way in which local authorities are being supported to integrate the findings of recent research on climate-driven rainfall extremes into planning and infrastructure decisions (details supplied); and if he will make a statement on the matter.  [72846/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_254",
          "debateSectionId": "dbsect_254",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_254.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_274",
        "questionNumber": 274
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable early learning and childcare is a key priority of Government.  The Programme for Government commits for the first time to provide capital investment to build or purchase state-owned early learning and childcare facilities, to create additional capacity in areas where unmet need exists. State ownership of facilities is a very substantial and significant development and offers the potential for much greater scope to influence the nature and volume of provision available and to ensure better alignment with estimated demand. This work will be supported through capital investment under the revised National Development Plan.  The total capital allocation for the Department of Children, Disability and Equality under the revised National Development Plan for the period 2026-30 is €795 million including €197 million for early learning and childcare. As announced in the context of Budget 2026, €36 million of this will be available in 2026 for early learning and childcare capital programmes. This will include investment in new buildings through the State-led early learning and childcare programme and investment in expansion of existing early learning and childcare operators through the Building Blocks scheme as well as other quality initiatives.  The focus in the State-led services will be on services to meet demand for affordable, accessible, high quality early learning and childcare that is not otherwise being delivered, including on full day provision particularly for younger children.  Preparatory work for this programme of capital investment is underway, with the multi-year programme planned to commence from 2026 onwards. As such, no decisions on prioritisation or selection of certain locations have yet been made.  The Government is already supporting the expansion of capacity through capital funding. The Building Blocks Extension Grant Scheme is designed to increase capacity in the 1–3-year-old, pre–Early Childhood Care and Education, age range for full day care. This allows existing Core Funding Partner Services to extend their existing premises or, in the case of community services, to construct or purchase new premises. The Scheme will deliver up to 1,500 full-day care places for 1- to 3-year-olds which will begin coming on stream from 2026. Two services in North Kildare are working to complete the legal formalities for the scheme.  The Department funds 30 City/County Childcare Committees, which provide support and assist families and early learning and childcare providers. The network of 30 City/County Childcare Committees across the country can assist in identifying vacant places in services for children and families who need them and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need.  Parents experiencing difficulty in relation to their early learning and childcare needs should contact their local City/County Childcare Committee for assistance. Contact details for the Kildare County Childcare Committee may be found at www.kccc.ie. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 362. Deputy Naoise Ó Muirí asked the Minister for Children, Disability and Equality when locations will be prioritised under the forthcoming childcare capital investment programme; whether towns in Kildare North will be considered; and if she will make a statement on the matter. [72843/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_317",
          "debateSectionId": "dbsect_317",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_317.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_362",
        "questionNumber": 362
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable early learning and childcare is a key priority of Government.  Despite substantial growth in the capacity of the sector in recent years, demand for Early Learning and Care and School Age Childcare remains higher than available supply in certain parts of the country, particularly for younger children.  The development of a forward planning model to analyse childcare supply and demand nationally is currently underway. The model seeks to identify the nature and volume of different types of early learning and childcare places across the country and how that aligns with the numbers of children in the corresponding age cohorts at local area level.  An extensive data analysis and cleaning exercise has been undertaken to map available publicly subsidised supply. This involves combining data from multiple administrative sources, including child population data, using GIS (Geographical Information System) mapping tools.  The analysis of the Forward Planning model will provide a key input into the approach to the capital programme to be resourced through the allocation in the revised National Development Plan 2026-30.  The analysis of the forward planning model will be one of a number of factors that will be considered when selecting and prioritising capital investments in childcare. Other factors will also be taken into account, including demographic trends at a local level. Local areas will be analysed to assess the likely future demographic outcomes for the area using data sources such as planning applications, local area plans and statistical population projections.  The Forward Planning model is being designed primarily as a tool for internal analysis. The maps and data that the model will produce will contain protected categories of data and will therefore not be made generally available in full. As the model is further developed along with accompanying policy work related to supply, aggregated statistics, including statistics broken down by geographical area, may be made available if this is deemed compliant with data protection obligations.  Current data on childcare capacity at county level is available at www.pobal.ie/childcare/capacity. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 363. Deputy Naoise Ó Muirí asked the Minister for Children, Disability and Equality when the outputs of the childcare forward planning model will be published; the way in which local population growth projections will be incorporated; and if she will make a statement on the matter. [72844/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_318",
          "debateSectionId": "dbsect_318",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_318.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_363",
        "questionNumber": 363
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 414. Deputy Naoise Ó Muirí asked the Minister for Health the full list of funding options available to Tiglin Lighthouse Project in Dublin north city, given the significant engagements it delivers each year and rising staff costs; and if she will make a statement on the matter.  [73074/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_365",
          "debateSectionId": "dbsect_365",
          "showAs": "Homeless Persons Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_365.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_414",
        "questionNumber": 414
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 3. Deputy Naoise Ó Muirí asked the Taoiseach when the Cabinet committee on housing will next meet. [67523/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_3",
        "questionNumber": 3
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 16 to 24, inclusive, together.  I attended the leaders’ summit at COP30 in Belém, Brazil, on 6 and 7 November. Coming a decade after the Paris Agreement and during a period of enhanced geopolitical turbulence, my attendance at the summit was an important opportunity to show Ireland’s continuing commitment to the objectives of the UN Framework Convention on Climate Change and the Paris Agreement to limit emissions in order to avoid the worst impacts of climate change. I delivered Ireland’s national statement on 6 November, highlighting the reality that climate change is no longer a distant threat and pointing to the remarkable litany of record-breaking climate events in the 12 months since COP29 in Azerbaijan, including Storm Éowyn which brought the strongest wind gusts ever recorded in Ireland and the highest storm surges on the western seaboard. We saw the damage that Storm Bram caused last week to counties all over the country. I also argued that the sharpest impacts of climate change are felt by the world’s most vulnerable people and countries and noted that no country can successfully address the crisis of climate change alone.  I participated in two thematic round tables with my fellow leaders to discuss climate issues of common concern. The first focused on \"Climate and Nature: Forests and Oceans\". I reiterated Ireland’s strong support for the agreement reached at COP15 to protect at least 30% of land and oceans by 2030. The second thematic session took the form of a panel discussion on \"Energy transition and ten years of the Paris Agreement: NDCs and financing\". I expressed Ireland’s commitment to ensuring a just and inclusive energy transition pathway for all nations. I also shared Ireland’s focus on accelerating the delivery of renewable generation. I also participated in a small round table hosted by President Lula da Silva and attended also by the United Nations Secretary General, António Guterres, on climate adaptation and resilience. I spoke of Ireland’s commitment in this area with 80% of our climate finance concentrated on adaptation.  I also attended an event launching the Tropical Forest Forever Fund, hosted by President Lula. This global initiative aims to finance the conservation of tropical forests. I reaffirmed Ireland’s commitment to the preservation and sustainable use of the Amazon rainforest. I announced Ireland’s commitment to provide €15 million over the next three years to the Amazon fund, with the aim of preventing and combating deforestation.  While in Belém, I also took the opportunity to visit the offices of the United Nations High Commission for Refugees, where I met with representatives of some of the refugees they work with, including indigenous people from the Amazon displaced by climate change. To date in 2025, Ireland has provided over €25.5 million in funding to UNHCR. \n Deputy Malcolm Byrne  I welcome the fact that the Taoiseach attended the COP in Brazil as head of Government. It is appropriate that he did so. I welcome his remarks while there. I ask the Taoiseach to consider that Ireland might consider hosting a future COP to raise awareness of the important issues he has outlined.  I do want to express concern that if we are going to reduce our own dependence on fossil fuels and get people out of cars, we have to provide them with a realistic public transport alternative. I am passionate about rail travel but unfortunately the M11 is increasingly becoming a car park every morning. The problem for those travelling along the M11 into the capital, unlike a number of other commuter routes, is that we do not have a realistic rail alternative. We have fewer services, worse rolling stock and more overcrowding than any other rail service. What particularly annoys me is the fact that yesterday, the rail project prioritisation strategy made no commitments whatsoever about improvements for the Rosslare rail line and further looked at abandoning the proposals to develop and reopen the Rosslare to Waterford rail line. If we are to provide a real alternative and reduce our dependence on fossil fuels and car use, there has to be a real public transport alternative. I want assurances that the Department of Transport has not abandoned the rail commuters along the Rosslare rail line. \n Deputy Naoise Ó Cearúil  I note that, following the Taoiseach's attendance at COP in Belém, the EU made a significant decision to permanently stop Russian gas imports and phase out Russian oil. Similar to Deputy Byrne, I wish to highlight the issue of reducing our reliance on fossil fuels in the context of significant investment in public transport, in terms of DART+ West, for example, going to Maynooth and then Kilcock. The prioritisation of DART+ South West was not announced. There is significant traffic and build-up on the N7, M7, N4 and M4, particularly the N7 coming from Naas, Sallins and Celbridge. Indeed, Deputy Shane Moynihan has raised it previously. We need to ensure that these key pieces of infrastructure are prioritised along the commuter line that is causing the greatest amount of traffic. \n Deputy Darren O'Rourke  One of the most effective ways we can reduce emissions is by encouraging people on to public transport. I want to raise the lack of public transport in Bellewstown, County Meath. A 13-year-old boy, James Black, has started a campaign there and has hundreds of petition signatures calling for a public bus services for the village of Bellewstown. Fair play and well done to him for that. He has got an amount of media attention about it. He is very articulate and very clear in what he is trying to achieve.  The connecting Ireland scheme in the Department of Transport is a very good one but it is underfunded and Bellewstown is not included in it. Will the Taoiseach increase funding to the connecting Ireland scheme and will he include Bellewstown, County Meath in it? \n Deputy Liam Quaide  We heard a lot during the last Government about how much more investment went into the National Parks and Wildlife Service but in east Cork and Waterford, the level of under-resourcing has been baffling. In east Cork, we have had no ranger for approximately 12 of the last 15 years. There has been no district conservation officer for 18 months and no regional manager in place for years over east Cork and Waterford. It is difficult to give precise figures for these vacancies, because the Department has been incredibly opaque in response to questions I have submitted on recruitment to the NPWS. In one response, the Minister referred to \"perceived vacancies\", as if we were all imagining those roles being vacant. Also, bizarrely, the Department will not give details of staffing by geographical area for \"operational security reasons\". This is akin to An Garda Síochána not sharing numbers of gardaí employed in a given division. The Department also will not give any information on recruitment campaigns being undertaken. Meanwhile, hedgerows and trees are being trashed with impunity and the whole idea of habitat protection looks more like a bad joke in this country. When are we going to see more transparency from the Department of heritage on staffing of the NPWS? When are we going to see those crucial roles in east Cork and Waterford filled? \n Deputy Peadar Tóibín  Today the Minister of State, Deputy Thomas Byrne, stated that the Mercosur deal held many benefits for the Irish farmers and the wider economy. He said that for Ireland, Mercosur could be a significant beneficiary. This is incredible. It is the Minister of State putting up the white flag of surrender in terms of Mercosur. It comes just a few days after the Government put up the white flag in terms of the Irish fishing industry. Make no mistake about it, the Mercosur trade agreement will damage the livelihoods of hundreds of thousands of farmers in this country. All the fine words about COP mean nothing if we are going to facilitate or allow Mercosur to go through. It beggars belief that at a time of climate crisis, we will be bringing in Brazilian beef, which is produced in an environmentally unfriendly way, by which forests are burnt down and land is overgrazed, not to mention the environmental cost of transporting all that beef from South America to Europe. Will the Government stop speaking from both sides of its mouth in terms of Mercosur? \n Deputy Ruairí Ó Murchú  It is difficult to believe that we are talking about rail services being cancelled. These are proposed new services that make complete sense because we want people to move to public transport. We know the advantages that exist in that regard. One of the new rail services that was being proposed between Clongriffin and Drogheda has been mothballed. This would have allowed for further express services to Dundalk, Drogheda, Newry and Belfast. Such services are absolutely necessary because they are allowed to skip slower services. What is happening does not make any sense at this point. Will the Taoiseach seek some clarity in respect of this matter? I other colleagues in expressing absolute anger if this is the road we are going to take. No pun intended. \n The Taoiseach  I thank Deputy Byrne for acknowledging that it was important to attend the COP, even though it was a long distance to go. We needed to send a signal given that we are at a point at which the issue of climate change is receding in terms of political prioritisation. This is a real concern. Some people are pulling back from their commitments.  On hosting a future COP in Ireland, next autumn we will have the largest ever political meeting held in Ireland. There will be over 40 states represented. It is a ginormous undertaking to host a COP, but it is something the country should aspire to do in the future. It depends on the shape and nature of a COP. In some ways it has become very big. Maybe it is has gone too far in some respects in the context of how it has evolved. We need to get back to the more fundamental origin and idea around COP, which was countries coming together to make decisions on global agreements in respect of sustainability, the future of the planet and the impact of climate change.  I will look at the matter of rail project prioritisation. I take on board what the Deputy said. We have a lot of projects that are needed. We do not have commensurate capital, but I will have a look at where the Rosslare railway line is. We put a lot of money into Rosslare on the custom side and all of that in the context of Brexit. We did it in double-quick time. Rosslare to Waterford is an important link. I will have a look at that to see what we can do and where we are. \n Deputy Malcolm Byrne  There is nothing on the roster----- \n An Ceann Comhairle  This is not a back-and-forth. \n The Taoiseach  I said I am going to have a look at it. The Deputy asked me to have a look at it, so I am telling him that I am going to have a look at it.  Deputy Ó Cearúil is correct on the moves we made in terms of dependency on Russian oil and gas. On public transport, it is key. I have spoken to the Ministers for public expenditure and Transport in respect of DART+ South West. That has gone through all the planning and is shovel ready. The county council has zonings for between 10,000 to 18,000 houses. It feels that this is essential infrastructure. I am seeing if we can do something to make that we progress the project. That is work I am engaged in at the moment with the relevant Ministers.  Deputy O'Rourke referred to public transport more generally and to a young person named James Black. I pay tribute to him for his civic initiative, participation and being involved in something like that in terms of public service for Bellewstown. I will talk to the Minister and make him aware of that. On Connecting Ireland, I take on board the Deputy's views.  Deputy Quaide referred to the National Parks and Wildlife Service, NPWS. There has been huge investment in recruitment. The investment in the NPWS has more or less doubled since 2020. I took a personal interest in this. I worked previous with the then Minister, Malcolm Noonan, on it and continue to work on it with the Minister of State, Deputy Christopher O'Sullivan. Recently, we announced a €700,000 lifeline for Fota Wildlife Park through the NPWS because of the understanding work that Fota does in respect of conservation of particular species and so forth. I will engage with NPWS in respect of the issues the Deputy has raised to see if we can throw some light on the situation.  Deputy Tóibín referred to Mercosur. There was no agreement on that. It was not put to COREPER last Friday. I do not have the up-to-date information, but it seems unlikely now that it will put before COREPER before Christmas. What we have undertaken to do is work with like-minded countries, particularly France and Italy----- \n Deputy Peadar Tóibín  What is our position? \n The Taoiseach  -----in terms of securing additional safeguards. Quite a significant number of safeguards have been secured. That is contrary to what was there a year ago. They are taking the form of legal instruments that the Commission has committed to.  We succeeded in securing the nitrates derogation. It is a significant advancement that we now have that for a further three years. It was challenging and difficult. We worked hard with the Commission to get it over the line. Approximately 200,000 tonnes of Mercosur beef come into Europe on an annual basis as it stands. The new initiative under Mercosur would allow 99,000 of those to be brought in under a reduced tariff preference. The Minister of State, Deputy Thomas Byrne, spoke about the wider issues around Mercosur. All trade agreements bring benefits and losses. There is no any heresy in saying that. The Canada deal was tremendous for Ireland in terms of the increased exports for SMEs and so on. I accept that every agreement is different. At the moment, there is no sense of any breakthrough or agreement in respect of Mercosur. That is where we are at present.  Deputy Ó Murchú referred to the Clongriffin to Drogheda service. Capital is not limitlessness. \n Deputy Ruairí Ó Murchú  I get that. I was just wondering. \n The Taoiseach  If we were to add up the figures from everybody's contributions, I would guess that we would arrive at another €50 billion. We have to try keep things moving with planning in the context of progressing as many projects as we possibly can and to make sure that we have sustainability, financing and all of that. I will have to look at the rail prioritisation strategy that emerged on Friday. \n An Ceann Comhairle  I thank the Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 19. Deputy Naoise Ó Muirí asked the Taoiseach to report on his attendance at the Conference of the Parties summit in Brazil. [67524/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Taoiseach's Meetings and Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_19",
        "questionNumber": 19
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Thank you Deputy for your question, and the opportunity to outline some of the achievements of my Department this year.  As Minister, I am deeply committed to the transformation of the Defence Forces into a modern, fit for purpose organisation to defend the State and meet the challenges of today and the future.  Since the publication of our Programme for Government:? Securing Ireland’s Future , in January of this year, a great deal has been achieved, including the following;  In Quarter One  • The blanket exclusion of the Defence Forces from the Working Time Directive has been removed.  • Revised ATCP priorities, structures and resources have been implemented.  • Regular climate and continuous attitude surveys have been conducted and continue on an ongoing basis.    In Quarter Two  • A Non-financial ‘labour hours budget’ was introduced.  • Phase 1 of the Sub Sea Domain Awareness (SSDA) Contract was awarded  • A public consultation on Ireland’s first Maritime Security Strategy was launched, as part of the preparation of the Strategy this year.  In Quarter Three  • Additional Civil and Military assignments were made to the Capability Development Unit, deepening the knowledge and experience within the unit for delivery of key projects.    In Quarter Four  • The delivery of a third C295 aircraft  • The increased use of Direct Entry Recruitment into Specialist Posts in the Permanent Defence Forces  • The establishment of the Office of Veteran Affairs  The Programme for Government commits to increased investment in Defence, providing the funding and political support necessary to achieve Level of Ambition 2 (LOA 2), and move as quickly as possible to Level of Ambition 3 (LOA 3).  Last week, during a visit to the Defence Forces Training Centre (DFTC) at the Curragh Camp, I launched the Defence Sectoral National Development Plan (NDP) 2026-2030.  This plan sets out the Government’s record €1.7 billion  capital investment in Defence over the next five years, an increase of €600 million, or 55%, on the previous baseline.  Key features include:  • Record multi-annual investment rising from €300m in 2026 to €360m in 2029–2030.  • Major capability upgrades across land, air, maritime and cyber domains.  • Full delivery of the Military Radar Programme by 2028, with phased rollout beginning in 2026.  • €19m accelerated investment in Counter-UAS systems ahead of Ireland’s 2026 EU Council Presidency.  • Air Corps modernisation, including:  • Four Airbus H145M helicopters (2027–2028)  • Progress on acquiring eight Super Medium Helicopters  • Delivery of a new Falcon 6X strategic aircraft  • Replacement of the PC-9M fleet by 2029/2030  • Naval Service upgrades, including Towed Array Sonar, a Sonobuoy project, and the P60 Fleet Extension Programme.  • Army capability improvements, including:  • Midlife upgrade of 80 MOWAG Piranha III vehicles  • Progression of the Armoured Fleet Replacement  • Acquisition of RPAS/drones  • Rollout of Software Defined Radios  • €400 million investment in Defence Forces infrastructure, including accommodation, offices, gyms, aircraft hangars and naval berthage.  • €175 million for IT, transport, engineering and ordnance systems.  • Strong governance structure, including updated Equipment Development and Infrastructure Development Plans and rigorous procurement oversight.  The Defence Sectoral Plan outlines how this investment will tackle capability gaps, modernise infrastructure and support the Defence Forces in delivering Government commitments under Level of Ambition 2 (Enhanced Capability), in line with this Government's commitment in its adoption of the recommendations of the Commission on the Defence Forces. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 108. Deputy Naoise Ó Muirí asked the Minister for Defence the progress made to date on reaching her Department’s Programme for Government commitments; and if she will make a statement on the matter. [72032/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_48",
          "debateSectionId": "dbsect_48",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_48.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_108",
        "questionNumber": 108
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 121, 151 and 155 together.  A widely reported incident occurred on Monday, 1st December, regarding drones operating in the vicinity of a Naval Service vessel in the Irish sea. Notwithstanding some suggestions, at no stage was the flight of President Zelensky compromised and the security operation, led by An Garda Síochána was successfully deployed through multiple means ultimately leading to a safe and successful visit to Ireland by President Zelensky. As previously mentioned, I would ask Deputies to reflect that ongoing speculation in respect of this incident is neither accurate nor helpful to our reputation.  I have been fully briefed in my capacity as Minister for Defence as part of the National Security Committee on the initial findings and I am reassured that both the Defence Forces and An Garda Síochána have and are examining this matter extensively.  One of my key priorities as Minister is to ensure that Defence Forces capabilities are maintained, developed and enhanced so that the organisation can meet all Government-assigned roles, including those that may arise as a result of drone incursions. The Defence Forces’ work in this space aligns with broader national security planning.  In this context, work is well underway on the Military Radar Programme, which is a significant capability enhancement. Full delivery of the Programme will be complex; but has been prioritised with elements of this capability being rolled out in phases, from 2026, two years ahead of the scheduled delivery for the full suite of Radar capability. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 155. Deputy Naoise Ó Muirí asked the Minister for Defence to provide details of the drone threat identified on the day of President Zelenskyy’s visit; the way in which her Department plans to combat future incursions; and if she will make a statement on the matter. [72031/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_60",
          "debateSectionId": "dbsect_60",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_60.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_155",
        "questionNumber": 155
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 432 and 433 together.  In line with the programme for government, the Education Therapy Service (ETS) has been established as an additional support for children and young people in their school environment. It is not a replacement for existing children’s services from which provision will continue. It will commence in specials schools and rollout in time to special classes and mainstream school.  It is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year.  The selection process to identify schools for inclusion in the initial phase is ongoing and being informed by engagement with our colleagues in the HSE and the National Council of Special Education (NCSE). It is anticipated that school selection for the initial phase will be complete early in 2026 to ensure that selected schools have the opportunity to engage with the ETS prior to therapist assignment.  The recruitment campaign for therapists to the new ETS, launched on the 28th November, campaign will initially see 90 occupational therapists and speech and language therapists consisting of staff and senior grades join their therapy team. As this is a national service which will grow and expand to include all schools, it is envisioned that there will be rolling recruitment campaign commencing in 2026 covering all counties to meet the therapy needs of the children in the school system. It is envisioned that further recruitment campaigns will also include additional therapy grades including therapy managers, clinical specialists and therapy assistants.  Engagement with stakeholders across the health and education sectors, professional bodies and advocacy groups representing families, and parents is ongoing and will continue, through a number of focus groups and working groups focusing on the design and delivery of the ETS. This vital feedback will continue to inform service development and ensure alignment with existing children’s services, aiming to provide a comprehensive service for children in their school environments.  In addition, the NCSE have been developing an education -based therapy support service known as the previously as the Education Therapy Supports Service (ETSS), which will now be subsumed into the ETS. This service provides two strands of support to all schools: Sustained In-School Therapy and Regional Therapy Supports.  Sustained in-school support (SIT) is provided to schools for a defined period of 18-24 months in line with the School Inclusion Model. 22 schools in the Eastern region and 28 schools in the Western region are receiving support under SIT in the 2025/2026 school year.  Regional therapy support provides Teacher Professional Learning (TPL) with follow on/implementation support by NCSE therapists. The focus of this support is to build the capacity of schools and to embed the learning from TPL into their teaching practice, through In-school coaching and co-facilitation of interventions, strategies and resources. Regional Therapy Supports are available nationally for the 2025/2026 school year.  My Department and the National Council for Special Education (NCSE) are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 432. Deputy Naoise Ó Muirí asked the Minister for Education and Youth the level of engagement her Department has had with special schools in relation to the Education Therapy Service recruitment campaign run by the HCSE; and if she will make a statement on the matter. [71494/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_326",
          "debateSectionId": "dbsect_326",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_432",
        "questionNumber": 432
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 432 and 433 together.  In line with the programme for government, the Education Therapy Service (ETS) has been established as an additional support for children and young people in their school environment. It is not a replacement for existing children’s services from which provision will continue. It will commence in specials schools and rollout in time to special classes and mainstream school.  It is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year.  The selection process to identify schools for inclusion in the initial phase is ongoing and being informed by engagement with our colleagues in the HSE and the National Council of Special Education (NCSE). It is anticipated that school selection for the initial phase will be complete early in 2026 to ensure that selected schools have the opportunity to engage with the ETS prior to therapist assignment.  The recruitment campaign for therapists to the new ETS, launched on the 28th November, campaign will initially see 90 occupational therapists and speech and language therapists consisting of staff and senior grades join their therapy team. As this is a national service which will grow and expand to include all schools, it is envisioned that there will be rolling recruitment campaign commencing in 2026 covering all counties to meet the therapy needs of the children in the school system. It is envisioned that further recruitment campaigns will also include additional therapy grades including therapy managers, clinical specialists and therapy assistants.  Engagement with stakeholders across the health and education sectors, professional bodies and advocacy groups representing families, and parents is ongoing and will continue, through a number of focus groups and working groups focusing on the design and delivery of the ETS. This vital feedback will continue to inform service development and ensure alignment with existing children’s services, aiming to provide a comprehensive service for children in their school environments.  In addition, the NCSE have been developing an education -based therapy support service known as the previously as the Education Therapy Supports Service (ETSS), which will now be subsumed into the ETS. This service provides two strands of support to all schools: Sustained In-School Therapy and Regional Therapy Supports.  Sustained in-school support (SIT) is provided to schools for a defined period of 18-24 months in line with the School Inclusion Model. 22 schools in the Eastern region and 28 schools in the Western region are receiving support under SIT in the 2025/2026 school year.  Regional therapy support provides Teacher Professional Learning (TPL) with follow on/implementation support by NCSE therapists. The focus of this support is to build the capacity of schools and to embed the learning from TPL into their teaching practice, through In-school coaching and co-facilitation of interventions, strategies and resources. Regional Therapy Supports are available nationally for the 2025/2026 school year.  My Department and the National Council for Special Education (NCSE) are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 433. Deputy Naoise Ó Muirí asked the Minister for Education and Youth the special schools in Mayo which will be supported under the current Education Therapy Service recruitment campaign; the levels of supports from OT, and speech and language therapists; and if she will make a statement on the matter. [71496/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_326",
          "debateSectionId": "dbsect_326",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_433",
        "questionNumber": 433
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Work by my department and the National Council for Special Education (NCSE) to plan for the provision of further new special class and special school places for the 2026/27 school year and beyond is progressing.  As you are aware parents were asked to notify the NCSE of their requirement for a special educational placement for the 2026/27 school year by 1 October 2025. The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that these special classes will be sanctioned in the coming weeks.  The NCSE will assess what additional provision is required in local areas and what schools have capacity to accommodate required provision. In order to ensure new special classes can open as quickly as possible the NCSE prioritise working with medium and larger primary schools who do not already have a special class and have available accommodation to accommodate new special class. This approach maximises the use of existing space which can be reconfigured efficiently while also ensuring that new provision continues to be established. It also increases number of schools with special classes providing parents with greater choice and reducing the distances that some children are travelling to access a special class place.  However, as in other years where schools have no available accommodation, particularly at post-primary level and there is known demand in a local area, my department will continue to provide additional classroom accommodation to provide necessary places.  The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will be become available through the normal movement of children leaving primary or post-primary school.  The school referred to by the Deputy already has 3 special classes and any school willing to open further new special classes is to be commended. I can confirm that a request to meet with this school has been received by my office and remains under consideration.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to assess the requirement for new specialist provision. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 465. Deputy Naoise Ó Muirí asked the Minister for Education and Youth her views on a matter (details supplied); and if she will make a statement on the matter. [71930/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_355",
          "debateSectionId": "dbsect_355",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_355.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_465",
        "questionNumber": 465
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Naoise Ó Muirí  My question relates to the recently published Government infrastructure plan and the steps that will be taken by Government to work more closely with housing developers and builders, big and small, on essential infrastructure for housing. What reforms will be introduced under the accelerated infrastructure delivery plan to enable developer-led infrastructure? \n Deputy Jack Chambers  The accelerating infrastructure report and action plan includes targeted reforms to certain types of developer-led infrastructure as set out under action 15. This action recognises that alongside record public investment under the national development plan, private sector delivery models may play a complementary role in certain circumstances. Specifically under action 15, the Government has committed to progressing regulatory reforms that allow developers to deliver certain types of electricity and water infrastructure, where this may result in faster or more efficient development with no degradation of standards.  In relation to electricity, this means advancing regulations to enable private wire electricity connections in line with the Government's private wires policy statement. In relation to water, it means bringing forward measures for developers to deliver new, stand-alone wastewater treatment plants to bolster the service provided by Uisce Éireann to support increased levels of housing. Both of these activities are planned for completion in quarter two of 2026. It is explicitly committed to that any developer-led infrastructure will comply with environmental and technical standards and integrate with public systems, where appropriate.  The Department of housing will lead on reforms relating to water infrastructure while the Department of Climate, Energy and Environment will lead on energy-based measures. Both Departments will work closely with utilities, local authorities, regulatory bodies and planning authorities to ensure that developer-led delivery is integrated effectively with statutory processes and national priorities. \n Deputy Naoise Ó Muirí  I thank the Minister for that update. I welcome the progress the Government is making on accelerating this infrastructure, particularly from a wastewater perspective. Standards are essential, but this is a way for these housing estates and these developments to get on the blocks, get done and get moving quickly rather than having to wait for Uisce Éireann, local authorities, the ESB, etc., to get that work done. It is very important that standards are clear and, for that reason, that Uisce Éireann takes all that stuff on when the developer is finished and the work is built out to standard. Those standards are really important. I look forward to hearing a bit more about their development, alignment, monitoring and implementation. \n Deputy Jack Chambers  The Deputy will have heard from the Minister, Deputy Browne, about wastewater treatment plants and the work on advancing that, which will be critical to improving overall housing supply. It will not be solely Irish Water but it will be something that will enhance wider water infrastructure across the State. Similarly, there is the work the Minister, Darragh O'Brien, is doing in respect of private wires, again ensuring we broaden and enable infrastructure development across the State, which will help. I am working with both Ministers in order that these reforms are advanced in 2026. Both will help in terms of overall housing supply but also in building greater investment in job opportunities across the State. \n Deputy Naoise Ó Muirí  As Chair of the climate committee, I am acutely aware of this. We hear a lot at that committee about the pressures on the energy grid, its ability to move energy around the country and to take additional houses, and how important that is. I welcome private wires, investment in the grid and anything else that will help relieve that pressure and put capacity in place in the network to allow residential units to connect as quickly and as reliably as possible. With forthcoming regulations that will allow developers to deliver that electricity infrastructure independently, the deployment of renewable generation and storage can certainly be accelerated. A good co-ordinated approach across government will be essential to make that possible. I welcome the progress the Minister has made on the action plan. I know he has put a lot of time and effort into its delivery. The proof will be in the pudding in the delivery and its implementation. \n Deputy Jack Chambers  I appreciate the Deputy's remarks. We can make a serious impact next year in terms of the legal reforms, the regulatory reforms, and the co-ordination and delivery changes we are making while also making the case for greater public acceptance of infrastructure across the State, in particular across those critical areas of water, energy and transport. Part of that is reflected in the questions the Deputy has asked in terms of enabling developer-led infrastructure as well. I look forward to working with him next year on driving delivery. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 17. Deputy Naoise Ó Muirí asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the reforms that will be introduced under the Accelerating Infrastructure Delivery plan to enable developer-led infrastructure; and if he will make a statement on the matter. [70468/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_17",
          "debateSectionId": "dbsect_17",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_17.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_17",
        "questionNumber": 17
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week Government published the Accelerating Infrastructure Report and Action Plan. This sets out 30 high-impact reforms targeted at the most significant barriers to the delivery of critical infrastructure. The actions contained in the report are grouped into four pillars.  Pillar 1 focuses on Legal Reform. While Ireland’s legal system is widely considered to be effective and fair, current regulatory and legal processes are acting as significant barriers to the timely delivery of infrastructure. In particular, the number of judicial reviews continues to rise, increasing by 43% in 2024 compared to 2023. Judicial review is vital tool for transparency and accountability, but growing administrative complexity means these challenges increasingly delay critical infrastructure projects, imposing real costs on taxpayers and society.  Reforms to the legal system will give better balance towards the common good by addressing the incentives that drive a disproportionate reliance on the courts. These reforms will reduce incentives for excessive litigation, clarify rules on standing and remedies, and introduce fast-track pathways for nationally significant projects that are in the common good through the development of new legislation.    Specifically, in relation to the reform of judicial review, the following actions are planned:  Introducing secondary legislation to implement a scale of fees and capping costs for environmental planning judicial reviews as per Part 9 of the Planning and Development Act.  Implementing the process and procedural enhancements outlined in Chapter 1 of Part 9 of the Planning and Development Act 2024.  Investigating and introducing further reforms, including:  • Commencing new standing requirements under the Planning and Development Act 2024,  • Reviewing fee structures, including “no foal, no fee”, and examining own-costs rules, and  • Reforming court procedures to allow expedited hearings.  Introducing additional legislation as required to give effect to agreed reforms, and  Monitoring the impact of these changes and recommending further improvements where necessary.  These changes will ensure that the legal system continues to safeguard rights but does so without becoming a bottleneck for progress, enabling critical infrastructure to proceed with greater certainty and pace. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 40. Deputy Naoise Ó Muirí asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the reforms that will be introduced under the Accelerating Infrastructure Delivery plan to overhaul judicial reviews; and if he will make a statement on the matter. [70467/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_80",
          "debateSectionId": "dbsect_80",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_80.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_40",
        "questionNumber": 40
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Policy for Irish-medium Education Outside of the Gaeltacht was launched on 6 November 2025. A key action under this policy is the establishment of a Taskforce on Models of Provision of Irish-Medium Education. The taskforce will provide a platform for collaboration between my department and key stakeholders on this issue. The taskforce has already met twice and it is anticipated that it will continue to meet monthly over the next twelve months.  The taskforce will make recommendations to my department, setting out:  • the models needed to provide Irish-medium education at primary and post-primary level, including a discussion of the need for changes to existing models if necessary  • definitions of all models of provision, including related language-based criteria  • how inclusive, high-quality Irish-medium education can be provided within each model  • what supports schools may need to implement the models effectively  • how to effectively assess the demand for Irish-medium education  • criteria for establishing new Irish-medium education provision through the various models identified, including consideration of the need for changes to the patronage process  • procedures to support schools in the effective transition from an English-medium to an Irish-medium model  • procedures and criteria for how schools can transition from one model to another, in order to increase the provision of Irish-medium education, and the supports they may need to do so  • mechanisms to be put in place to facilitate the expansion of Irish-medium provision.  A range of organisations and stakeholders whose input will be important in identifying recommendations in this area have nominated members to the taskforce. I am grateful to the members of the taskforce for their time and commitment in contributing to its body of work over the coming year. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 106. Deputy Naoise Ó Muirí asked the Minister for Education and Youth if she will provide an outline of the objectives of the Taskforce on Models of Supply for Irish-Medium Education; and if she will make a statement on the matter. [70465/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_128",
          "debateSectionId": "dbsect_128",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_128.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_106",
        "questionNumber": 106
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  In November 2025, my colleague the former Minister, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme (CASWS). 297 projects were approved to proceed across a spread of primary, post primary and special schools, which included projects across all counties and all categories of works. The investment in the first tranche of applications is in the region of €90m.  Under this scheme, approved applications from schools that were not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Under this scheme, approved applications from schools that were not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  A major element of the first tranche of approvals is the modernisation of science laboratories in post-primary schools, all of which prioritised lab refurbishment in their applications. €30 million of the 2026 funding allocation will be directed towards upgrading these facilities, supporting the department’s ongoing curricular redevelopment programme.  Full details of the Climate Action Works Scheme including details of the first tranche of approvals can be found at [ gov.ie - Summer Works Scheme ]  28 Schools across North Dublin received approval over a number of different categories in the first tranche of approvals. A full list of schools and the categories for which they were approved can be found below:      County      School Name      Town/Area      Roll Number      School Category      Category of Works       Dublin    Blessed Oliver N S    Balbriggan    17569E    Primary    1: Climate Action      Dublin    Scoil Mhuire Mxd    Howth    18080A    Primary    2: Climate Action & Roof Works      Dublin    S N Naomh Feargal Boys Senior    Finglas West    18137D    Primary    9: Fabric Defects      Dublin    S N C Naomh Padraig    Donabate    18412W    Primary    7: Climate Action & Windows Projects      Dublin    St Malachys B N S    Raheny    18968A    Primary    4: Climate Action & Mechanical Works      Dublin    St Eithnes Senior Girls Ns    Raheny    18969C    Primary    4: Climate Action & Mechanical Works      Dublin    S N Cholmille B    Swords    18976W    Primary    9: Fabric Defects      Dublin    St Kevins B N S    Finglas West    19197D    Primary    9: Fabric Defects      Dublin    Scoil An Tseachtar Laoch    Baile Átha Cliath 11    19430G    Primary    10: External Environment Projects      Dublin    Scoil Bhride    Donaghmede    19473B    Primary    9: Climate Action & Fabric defects      Dublin    Manor House School    Raheny    60300B    Post-Primary    5: Climate Action & Science Labs      Dublin    St Pauls C.B.S.    Dublin 7    60430O    Post-Primary    5: Climate Action & Science Labs      Dublin    St. David's College    Artane    60471F    Post-Primary    5: Climate Action & Science Labs      Dublin    St Kevins College    Finglas    60581M    Post-Primary    2: Climate Action & Roof Works      Dublin    Dominican College    Drumcondra    60690R    Post-Primary    5: Climate Action & Science Labs      Dublin    St Dominics College    Cabra    60731F    Post-Primary    8: Curricular Requirement      Dublin    St Michaels Secondary School    Finglas    60741I    Post-Primary    5: Climate Action & Science Labs      Dublin    St Marys Secondary School    Killester    60791A    Post-Primary    5: Climate Action & Science Labs      Dublin    St Josephs Secondary School    Stoneybatter    60843Q    Post-Primary    5: Climate Action & Science Labs      Dublin    Our Lady Of Mercy College    Beaumont    60870T    Post-Primary    4: Climate Action & Mechanical Works      Dublin    Rath Dara Community College    Blanchardstown Road North    70081V    Post-Primary    8: Climate Action & Curricular Requirements      Dublin    St Finians Community College    Swords    70120F    Post-Primary    5: Climate Action & Science Labs      Dublin    Fingal Community College    Swords    70121H    Post-Primary    5: Climate Action & Science Labs      Dublin    Skerries Community College    Skerries    76078Q    Post-Primary    8: Climate Action & Curricular Requirements      Dublin    Luttrellstown Community College    Clonsilla    76130P    Post-Primary    10: External Environment Projects      Dublin    Blakestown Community School    Blanchardstown    91316Q    Post-Primary    5: Climate Action & Science Labs      Dublin    The Donahies Community School    Dublin 13    91318U    Post-Primary    8: Curricular Requirement      Dublin    Hartstown Community School    Clonsilla    91339F    Post-Primary    8: Curricular Requirement      ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 188. Deputy Naoise Ó Muirí asked the Minister for Education and Youth the schools in north Dublin that have received approval under the 2026 climate action summer works scheme; and if she will make a statement on the matter. [70466/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_212",
          "debateSectionId": "dbsect_212",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_212.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_188",
        "questionNumber": 188
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I thank the Deputy for this important and timely question. I am delighted to advise the House that, on 26 November last, I launched the INSPIRE research infrastructure programme with my colleague Minister Chambers. This is a landmark moment for Ireland’s national research and innovation system.  It implements the Programme for Government commitment on this issue and the report of the expert Working Group that I established for this purpose earlier this year. To coincide with the launch, I published the Working Group’s report.  Their analysis and findings underpinned the proposal for a major research infrastructure investment programme that was a core component of my Department’s submission to the National Development Plan review this year. I secured an overall capital allocation of €4.55bn through that review process, €2.45bn of which I am allocating to research and innovation, reflecting the priority that I place on it as a driver of Ireland’s economic performance.  INSPIRE is a €750m research infrastructure investment package over the lifetime of the NDP. As well as support for Ireland’s High-Performance Computing capability and Tyndall National Institute, at least €500m will be invested in two funding streams: firstly, local institutional infrastructure, i.e. research equipment that is used routinely within a higher education institution for both teaching and research purposes and, secondly, shared advanced infrastructures, i.e. bigger-ticket equipment that is appropriately shared across a number of institutions and, critically, with external users. A central access portal will be built to maximise accessibility and utilisation.  The Programme will be implemented in two Phases, Phase Two building progressively and strategically on Phase One. It will be administered by the Higher Education Authority and Research Ireland, under the coordination of my Department. The process for applications from the higher education institutions will be opened by the agencies in the first quarter of next year. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 222. Deputy Naoise Ó Muirí asked the Minister for Further and Higher Education, Research, Innovation and Science the investment that will be delivered under the INSPIRE Programme; and if he will make a statement on the matter. [67785/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_234",
          "debateSectionId": "dbsect_234",
          "showAs": "Research and Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_234.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_222",
        "questionNumber": 222
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My department is working with government to support national ambition on Climate Action activity. This work is being led by the Department of the Environment, Climate and Communications.  In terms of my remit and research that supports our climate goals, Taighde Éireann – Research Ireland is completing actions under the Government Climate Action Plan.  In 2024, Research Ireland Centres BiOrbic10 and VistaMilk were successful in securing a second phase of government investment of approximately €44 million, supporting sustainable development and more efficient food systems.  Three Co-Centres have been established in the last year, the first research centres to bring researchers from across Ireland, Northern Ireland and the UK together at scale. The Co-Centre for Sustainable Food Systems and the Co-Centre for Climate and Biodiversity and Water will each facilitate multi-disciplinary programmes which support sustainable development, biodiversity, and climate goals.  The Clean Energy Transition Partnership 2023 transnational funding call closed in March 2024, with funding commitments from Sustainable Energy Authority, Research Ireland and Geological Survey of Ireland across a range of clean energy topics. These projects commenced in 2025.  Taighde Éireann – Research Ireland has partnered with Impact Laboratories/My Green  Lab to implement a Sustainable Laboratory Certification Programme, positioning Ireland as leader in sustainability in research.  Research and Innovation is playing a critical role in informing our understanding of climate change, identifying mitigants and solutions to support a transition to a new climate reality into the future. My department also drives innovation to support modern methods of construction and the green transition. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 225. Deputy Naoise Ó Muirí asked the Minister for Further and Higher Education, Research, Innovation and Science the progress his Department is making in supporting research that assists in meeting climate goals; and if he will make a statement on the matter. [67786/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_237",
          "debateSectionId": "dbsect_237",
          "showAs": "Research and Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_237.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_225",
        "questionNumber": 225
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high capacity public transport across the GDA.  DART+ South West will extend DART services from the City Centre to Hazelhatch and Celbridge including four-tracking from Park West to Heuston. A Railway Order was approved for DART+ South West by An Coimisiún Pleanála in November 2024. In addition, procurement for DART+ South West and West is progressing with pre-qualification questionnaires (PQQ) notices for Design and Build works advertised in May 2025.  The NDP Sectoral Investment Plan, published by the Department in November, sees the allocation of €22.3 billion in Exchequer resources to Transport, along with an additional allocation of €2 billion from the country's Infrastructure, Climate and Nature Fund to support the development of MetroLink. Of this total allocation, funding of circa €10 billion for public transport infrastructure is earmarked from 2026 to 2030, in addition to the €2 billion for MetroLink, primarily in line with the Department’s NIFTI intervention hierarchy of Maintain, Optimise, Improve, and New. This approach involves prioritising investment in the protection and renewal of existing assets before investing in new ones, on economic and environmental grounds.  The funding under the NDP Sectoral Investment Plan will see significant advancements made in a number of public transport projects, including DART+ West. This funding will also allow Compulsory Purchase Orders to progress for DART+ South West starting next year and provide for procurement progress for the project, with some of the framework contracts being established in common for DART+ West and DART+ South West.  The Department of Transport will continue to explore opportunities for additional funding, including through funding streams such as the European Union Connecting Europe Facility (CEF), to compliment national Exchequer funding which may allow some projects to proceed to construction earlier than currently anticipated, including DART+ South West.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days.   ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 324. Deputy Naoise Ó Muirí asked the Minister for Transport the rationale for the delay of the DART+ South West project; if there is flexibility in bringing forward the timeline; and if he will make a statement on the matter. [71017/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_337",
          "debateSectionId": "dbsect_337",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_324",
        "questionNumber": 324
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR or Naturalisation.  Due to the complex nature of FBR applications, involving verification of documents across many jurisdictions and generations, the current processing time for fully complete applications is approximately 9 months. The processing time begins when the physical application form and supporting documents are received by the FBR office. Applications that require further supporting documents will take longer to process.  With regard to the specific application about which the Deputy has enquired, this application was generated online and the fee paid on 25/03/2023. The application form and supporting documents were received in the FBR office on 24/10/2025.  Therefore, this application is currently queuing to be examined by the FBR Entitlement team. An entitlement officer will be in contact with the applicant again should any further clarification be required. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 90. Deputy Naoise Ó Muirí asked the Minister for Foreign Affairs and Trade when a person (details supplied) who applied to the foreign birth register will have their application processed; and if she will make a statement on the matter. [70641/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_73",
          "debateSectionId": "dbsect_73",
          "showAs": "Foreign Birth Registration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_90",
        "questionNumber": 90
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 177. Deputy Naoise Ó Muirí asked the Minister for Enterprise, Tourism and Employment if there is development funding for a project (details supplied); and if he will make a statement on the matter. [70642/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_140",
          "debateSectionId": "dbsect_140",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_140.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_177",
        "questionNumber": 177
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department works closely with school patrons in order to ensure that there are sufficient school places available for all children in Westport each September. In order to cater for Westport’s longer-term educational provision at post primary level, my Department is investing in two substantial capital projects in the town. A large-scale major capital project was approved for Sacred Heart Secondary School which will provide a new replacement school for 600 pupils including special educational provision. Rice College was approved a significant additional school accommodation project to provide appropriate accommodation for 600 pupils also including special education provision.  My Department’s ongoing engagement with the patron bodies of the post-primary schools in Westport will ensure that there are sufficient post-primary school places across the two schools and to support the sustainable provision of high-quality post-primary education in the town. Enrolment pressures can be driven by duplications of applications, applications from outside an area, and school of choice factors. My Department's main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places and that existing capacity is optimised and sustainably managed to avoid unsustainable enlargement of one school at the expense of another in an area.  I wish to advise the Deputy, both schools opened their admissions processes in October and my Department requested information on applications to both schools for first-year places for 2026/2027 to aid its understanding of capacity requirements in Westport for next September. The Department has received the requested enrolment data from both schools which highlights that there are more places available across the two schools than children seeking first year places in the town.  Furthermore, in order to plan for school provision and analyse the relevant demographic data, my Department divides the country into 314 school planning areas including Westport and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level. In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan (NDP). My Department expects to publish its own NDP Implementation Plan shortly. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. This approach is reflected in the large investment which the Department is making in both existing post primary schools in Westport.  While some applicants may not yet have received an offer of a school place for 2026/2027, families can be assured that all children who require a school place will be provided with one. My Department will continue to work with, and support, schools to ensure that there are sufficient places for all students. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 200. Deputy Naoise Ó Muirí asked the Minister for Education and Youth for an update on a matter regarding school places (details supplied); and if she will make a statement on the matter. [70751/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_164",
          "debateSectionId": "dbsect_164",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_164.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_200",
        "questionNumber": 200
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My Department works closely with school patrons in order to ensure that there are sufficient school places available for all children in Westport each September. In order to cater for Westport’s longer-term educational provision at post primary level, my Department is investing in two substantial capital projects in the town. A large-scale major capital project was approved for Sacred Heart Secondary School which will provide a new replacement school for 600 pupils including special educational provision. Rice College was approved a significant additional school accommodation project to provide appropriate accommodation for 600 pupils also including special education provision.  My Department’s ongoing engagement with the patron bodies of the post-primary schools in Westport will ensure that there are sufficient post-primary school places across the two schools and to support the sustainable provision of high-quality post-primary education in the town. Enrolment pressures can be driven by duplications of applications, applications from outside an area, and school of choice factors. My Department's main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places and that existing capacity is optimised and sustainably managed to avoid unsustainable enlargement of one school at the expense of another in an area.  I wish to advise the Deputy, both schools opened their admissions processes in October and my Department requested information on applications to both schools for first-year places for 2026/2027 to aid its understanding of capacity requirements in Westport for next September. The Department has received the requested enrolment data from both schools which highlights that there are more places available across the two schools than children seeking first year places in the town.  Furthermore, in order to plan for school provision and analyse the relevant demographic data, my Department divides the country into 314 school planning areas including Westport and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level. In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan (NDP). My Department expects to publish its own NDP Implementation Plan shortly. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. This approach is reflected in the large investment which the Department is making in both existing post primary schools in Westport.  While some applicants may not yet have received an offer of a school place for 2026/2027, families can be assured that all children who require a school place will be provided with one. My Department will continue to work with, and support, schools to ensure that there are sufficient places for all students. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 201. Deputy Naoise Ó Muirí asked the Minister for Education and Youth for an update on a matter regarding school places (details supplied); and if she will make a statement on the matter. [70752/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_165",
          "debateSectionId": "dbsect_165",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_165.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_201",
        "questionNumber": 201
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter my department’s pipeline for a project under the Additional School Accommodation Scheme. The project will provide three SET rooms, one Music room, one Science Lab & prep area, one Home economics room, two Art rooms, one Graphics room, one Engineering room, and a two classroom special educational needs base. The project was devolved to the school authority for delivery.  This project is currently in Stage 1 (Preliminary Design), and my Department is awaiting the school authority’s submission of the Stage 1 report for review. It is now within the remit of the school to progress this project.  The length of time a project takes to deliver depends on several factors, including scale and complexity and is subject to the time it takes to progress through the various design stages, and the statutory approval process. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 202. Deputy Naoise Ó Muirí asked the Minister for Education and Youth for an update on a school project (details supplied); and if she will make a statement on the matter. [70753/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_202",
        "questionNumber": 202
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Tailte Éireann is an independent Government agency under the aegis of my Department. Tailte Éireann provides a property registration system, property valuation service, and national mapping and surveying infrastructure for the State. Under Section 8(6) of the Tailte Éireann Act 2022. Tailte Éireann is independent in the performance of its functions.  In 2023, a request for a planned increase in the pay-bill subhead of Tailte Éireann’s Vote was supported by my Department and subsequently granted in the Estimates for 2024. As part of Tailte Éireann’s resourcing strategy, the Accelerated Recruitment Programme was launched in early 2024 to address the high volume of vacancies and strengthen operational capacity in response to increasing service demands.  The programme introduced standardised recruitment processes, across internal, external, and mobility routes, to ensure consistent and efficient staffing. Since its launch in February 2024, the Tailte Éireann resourcing team have focused on filling 147 priority roles and a further 321 vacancies (including 182 within the Registration function) have been filled across Tailte Éireann through a combination of new hires, promotions, and mobility placements. The remaining active Tailte Éireann vacancies are currently progressing through various stages of the recruitment cycle, with a target to reduce overall vacancy levels across Tailte Éireann to approximately 3% by end Q4 2025. Tailte Éireann has advised that there are currently 1,014 officers within the organisation as of 5 December 2025.  Outside of recruitment, every effort is being made by Tailte Éireann to further reduce application processing times including implementation of the following efficiency driving measures:  • Revised procedures for more efficient handling of the large volume of applications which are lodged that are not in order to proceed to registration.  • Targeted approach to reduce the age profile of applications pending registration.  • Revised internal processes aimed at reducing the volume of applications on hand which are not in order to proceed.  • An organisation-wide focus on reducing processing times with business process improvements now implemented across the organisation.  The continued increase in applications received for registration by Tailte Éireann year over year, and challenges in recruitment for some time now, have resulted in longer processing times for certain application types. It is understood from Tailte Éireann that where an application is lodged fully in order for registration, the application will be registered without any long delay.  Applications for registration which involve a transfer, charge or release of registered lands, where no change to the registry map is required, are in the main processed within 15 working days where the application is lodged in order.  eRegistration applications account for approximately 18% of all applications. eDischarges are typically processed within 2 working days, while other eRegistration applications, such as eCharging Orders (under the Nursing Home Support Scheme), eTransfers, and eCharges are generally processed within 10 working days, provided the application is in order.  Processing times for applications which do require a change to the map, and those requiring first registration of property, are improving due to implemented process improvements and targeted recruitment campaigns outlined above.  It is not possible to provide an average wait time for each registration type as each application is different, and processing times vary as a result. It is also not possible to determine whether any delay in a particular case is, or is not, reasonable without knowing the history of progression of the case. In cases where any delay in registration could have a potential impact, Tailte Éireann makes every effort to expedite applications which are in order, where valid grounds exist, and where doing so does not impose a conflict in regard to priority given to any prior lodged dealing.  As Minister, I am confident that as the required complement of staff is successfully trained, Tailte Éireann will be in a position to achieve its goal of reducing waiting times across all registration services. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 231. Deputy Naoise Ó Muirí asked the Minister for Housing, Local Government and Heritage the average wait time for each land registration involving Tailte Éireann; the number of staff working under the agency; and if he will make a statement on the matter. [70559/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_181",
          "debateSectionId": "dbsect_181",
          "showAs": "Land Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_231",
        "questionNumber": 231
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Local authorities are under a statutory obligation to levy rates on any property used for commercial purposes in accordance with the details entered in the valuation lists prepared by Tailte Éireann under the Valuation Acts 2001 to 2020. Tailte Éireann has responsibility for valuation matters, including the revaluation of properties. Tailte Éireann is independent in the performance of its functions under the Valuation Acts.  The amount of rates liable on a property is determined by multiplying the valuation of the property set by Tailte Éireann by the Annual Rate on Valuation (ARV) set by the local authority. The ARV is decided by the elected members of each local authority in their annual budget and its determination is a reserved function of a local authority.  Commercial rates income makes a significant and stable contribution to the funding of local government, providing between 13% and 43% of total funding for local services at individual local authority level, averaging 24% nationally. Rates income is a very important contribution to the cost of services provided by local authorities such as roads, footpaths, the public realm, litter management, public lighting, development control, parks and open spaces; all essential elements to create the environment in which businesses can prosper.  As with all local charges, the invoicing and collection of rates is a matter for the local authority concerned to manage in the light of prevailing local circumstances and in accordance with normal credit control procedures. My Department encourages local authorities to engage with ratepayers. In practice, it is understood that most local authorities promote the use of direct debit payment facilities and work with businesses to put in place flexible payment options that reflect capacity to pay.  The Local Government Rates and Other Matters Act 2019 which was commenced in late 2023, adds to the suite of options already available to local authorities to support local businesses and ratepayers. Local authorities are levying and collecting rates under this new legal framework since 1 January 2024.  Section 15 of the Act provides for local authorities to make schemes to support local and national policy objectives, by waiving rates in certain circumstances. The elected members have discretion to introduce waiver schemes that support objectives outlined in either county development plans, local area plans, local economic and community plans or indeed the National Planning Framework. Regulations to support the making of rates waiver schemes require a local authority to consult with the public in its administrative area in relation to its consideration of the making of (or change to an existing) rates waiver scheme.  It is open for each local authority to design waiver schemes as they see fit as long as they support any of the above policies. The budgetary impact of any waiver decision will also have to be managed by the elected members when making budget decisions for the following year; any reduction in income coming from rates will need to be factored into the overall budget planning.  This provision increases the capacity of local authorities and elected members to address important issues and challenges particular to their local areas in a flexible manner and to enable them to support specific objectives to promote community, social and economic development, urban planning or rural regeneration. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 232. Deputy Naoise Ó Muirí asked the Minister for Housing, Local Government and Heritage if local authorities are empowered to design and implement local rates waiver schemes; and if he will make a statement on the matter. [70560/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_182",
          "debateSectionId": "dbsect_182",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_232",
        "questionNumber": 232
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 357. Deputy Naoise Ó Muirí asked the Minister for Health for an update on a matter (details supplied); and if she will make a statement on the matter. [70754/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_303",
          "debateSectionId": "dbsect_303",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_303.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_357",
        "questionNumber": 357
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 358. Deputy Naoise Ó Muirí asked the Minister for Health for an update on a matter (details supplied) regarding insulin delivery systems. [70755/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_304",
          "debateSectionId": "dbsect_304",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_304.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_358",
        "questionNumber": 358
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Deputy Naoise Ó Muirí  An leagfaidh an tAire amach na tionscnaimh atá á gcur ar bun ag Gaois in DCU, and will he make a statement on the matter? \n Deputy Dara Calleary  Go raibh maith ag an Teachta. Mar is eol dó, is grúpa eolais é Gaois i bhFiontar agus Scoil na Gaeilge in Ollscoil Chathair Bhaile Átha Cliath. It comprises lecturers, researchers and postgraduate students. Gaois has received funding from my Department since 2027. I visited DCU just last month to see the great work it is doing. I was delighted to announce just over €4 million for Gaois for the next four years to help to significantly develop its major projects.  The projects developed by Gaois are research and reference resources of an exceptionally high standard, which provide a comprehensive facility to the Irish-language community focused on the development of innovative resources to sustain the language and the learning of Irish. Students, teachers, journalists, translators and the wider public can, depending on their areas of research, easily access the contents through searching some of the following sites: dúchas.ie , which entails digitisation of the Irish folklore collection; logainm.ie , the Irish placenames database; corpas.ie , the national corpus of the Irish language, which includes both written and oral material; canúint.ie , a repository of Irish dialects; and ainm.ie , the national database of Irish-language biographies. The sites will be of interest not only to ourselves but also to daoine i ngach chuid den domhan a bhfuil suim acu sa Ghaeilge agus i stair agus cultúr an oileáin freisin.  I am very conscious that the funding my Department is providing will enable Gaois to develop greater integration between the sites, provide more powerful search facilities and ensure a structured supply of information in a measured way to artificial intelligence models.  Additionally, it will advance the Gaois working groups, develop the next generation of technicians and researchers, and sustain the resources' userbase. Previous projects undertaken by Gaois with the assistance of funding received from my Department include the LEX Project, which has provided terminology support for the EU institutions from 2008 onwards, and an líonra saineolaithe a bhí forbartha with the aim of providing high-quality technical advice to Irish-language translators and terminologists in the European institutions. I look forward to continuing work with Gaois sna blianta atá romhainn. \n Deputy Naoise Ó Muirí  As the Minister mentioned, the €4 million investment is a very substantial commitment from the Department and I welcome it. Gaois's building in DCU is a big northside institution right on the edge of Dublin Bay North, my constituency, and it serves that entire area well. Tá sé iontach go bhfuil an infheistíocht seo ag tarlú ach go bhfuil sé lonnaithe sa tríú leibhéal. Tá an cumas acadúil ag na hinstitiúidí tríú leibhéal an taighde ar fad a tharraingt le chéile agus na huirlisí seo a chur ar fáil. Luaigh an tAire dúchas.ie , logainm.ie , corpas.ie agus canúint.ie . They are some of the big projects that are being expanded. They are great tools for students of all levels, for researchers and for the Irish-language community across the country and abroad. They are a great reference and can really bring people in. There is significant potential for these projects for the next generation of Irish-language speakers. A renewal is happening which is huge and is great to see. I ask the Minister to continue on the investment track, build these projects and invest in third level so we can build out those tools for generations to come. \n Deputy Barry Heneghan  Gabhaim buíochas as sin. Is infheistíocht an-mhór é €4 milliún. Táim fíorbhuíoch as sin. Tá an tAire ag cur go leor airgid i mBaile Átha Cliath thuaidh so tá sé iontach é sin a fheiscint. Is iarmhac léinn mé de chuid Ollscoil Chathair Bhaile Átha Cliath. Bhí mé ann dhá bhliain ó shin. Tá sé iontach. Bhí mé sa Chumann Gaelach ann. Tá mé fíorbhuíoch as sin. Mar a dúirt an tAire, tá mic léinn a thagann go Baile Átha Cliath ó gach tír in ann an Ghaeilge a fhoghlaim. Tá sé sin iontach a fheiceáil. Táim fíorbhuíoch as sin. Gabhaim míle buíochas le mo constituency colleague, Deputy Ó Muirí. \n Deputy Naoise Ó Muirí  Gabhaim buíochas leis an Teachta. \n Deputy Dara Calleary  Gabhaim buíochas leis an Teachta Ó Muirí agus an Teachta Heneghan as an deis a thabhairt dom caint faoi Gaois. Bhí an mhaidin sin coicís ó shin in Ollscoil Chathair Bhaile Átha Cliath iontach. Bhí fuinneamh agus suim sa seomra sin agus súil ar an ábhar freisin. Bhí siad ag úsáid na websites sin, dúchas.ie , logainm.ie , corpas.ie , canúint.ie agus ainm.ie . Tá siad ag cur súil ar an todhchaí agus tá tuiscint acu faoi chúrsaí intleacht shaorga, go háirithe na deiseanna atá ann le AI agus an teanga, agus na dúshláin atá ann freisin. Tá a lán oibre ar siúl i Gaois faoi na dúshláin ach faoi na deiseanna freisin. Tá muinín agam san obair atá ar siúl ansin. Tá muinín agam go mbeidh an Roinn in ann obair le Gaois chun cláir eile a chur ar siúl. I am confident that we will be co-operating further with Gaois. I am always happy to invest in the north side of Dublin. \n Deputy Naoise Ó Muirí  Bím breá sásta i gcónaí ardán a thabhairt don Teachta Heneghan. Bíonn sé liom gach uile áit a dtéim. Nach bhfuil sé sin fíor? Gabhaim buíochas leis an Aire. Tá an-fháilte roimh an infheistíocht i dtuaisceart Bhaile Átha Cliath. Tá an institiúid sin thar cionn. Déanann Dáire Keogh agus an grúpa ansin an-jab. Tá na fréamhacha leagtha acu ó thaobh an obair a dhéanamh. Ar aghaidh linn leis an tionscnamh. \n Deputy Dara Calleary  Cuirfidh mé nóta go dtí an Teachta McGuinness. Tá sé láidir sa troid sin. Bhí an ócáid sin iontach. Mar a dúirt an Teachta, tá an togra seo tábhachtach ní hamháin do na mic léinn ollscoile ach freisin do mhuintir na teanga anseo agus go hidirnáisiúnta. Tá siad in ann staidéar a dhéanamh ar dúchas.ie , logainm.ie , corpas.ie , canúint.ie agus ainm.ie cibé cén áit ina bhfuil siad. Tá an LEX Project an-tábhachtach le haghaidh chúrsaí an EU ionas go mbeimid in ann na seirbhísí a chur ar fáil san EU, including translation services. I met Irish MEPs last week, including Cynthia Ní Mhurchú and Seán Kelly, who are very frustrated at the slow progress of full translation services at EU level. The work we are doing at DCU and under Gaois is very much central to our case. Gabhaim buíochas le gach duine i Gaois agus san ollscoil, ina measc uachtarán na hollscoile, Dáire Keogh, agus an foireann bainistíochta as a suim i gcúrsaí teanga. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 13. Deputy Naoise Ó Muirí asked the Minister for Rural and Community Development and the Gaeltacht if he will outline the projects developed by Gaois in DCU; and if he will make a statement on the matter. [68148/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Irish Language",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_13",
        "questionNumber": 13
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  My Department's Community Services Programme (CSP) supports community-based organisations, to provide local services through a social enterprise model. In 2024, the Programme supported the delivery of 451 local services via 431 organisations, with a total allocation of almost €52.4m. Some 3,302 individuals were employed in a mix of management and full-time equivalent (FTE) roles during 2024.  Following an Open Call process for organisations to join the Programme, 14 new organisations were successful, with 13 manager positions and 23 FTE positions being supported from January 2024.  In June 2024, following an applications process open to existing CSP-supported organisations to apply for additional resources, 42 new CSP-supported roles were announced across 32 organisations.  Furthermore, following the increase of €1.40 per hour to the minimum wage level from 1st of January 2024, my Department reviewed the likely impact to CSP organisations and responded accordingly, increasing contributions to the high and medium rates of funding for both manager and FTE posts supported under the CSP Programme.  Last week, I officially launched the CSP Programme 2024 Annual Report, which highlights the significant achievements and progress made during 2024, highlighting its impact on communities across the country. The report is available on my Department’s website.  The Programme for Government contains a commitment to hold an open call for organisations to join the CSP Programme. Following the budget process, a provision of €59.4m has been allocated to the CSP Programme in 2026. The scope to hold an open call is currently being reviewed by my department, in the context of relevant considerations such as the funding needs of existing CSP-supported organisations, organisations waitlisted from the previous call and those who wish to join the Programme. The outcome of these considerations is anticipated in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 61. Deputy Naoise Ó Muirí asked the Minister for Rural and Community Development and the Gaeltacht if he will outline the achievements of the Community Services Programme last year; the outlook for next year; and if he will make a statement on the matter. [68147/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_96",
          "debateSectionId": "dbsect_96",
          "showAs": "Community Welfare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_96.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_61",
        "questionNumber": 61
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence is a core priority for me and for Government. The Zero Tolerance Strategy sets out our determination to ensure that those affected by these crimes receive strong protection, clear pathways to justice and the supports they need.  Strengthening the legislative framework is an essential part of delivering on these commitments. In October, I secured Government approval to progress the Criminal Law (Sexual Offences, Domestic Violence and International Instruments) Bill 2025 which includes measures to allow perpetrators of domestic violence be included on a new register of domestic violence judgments, administered by the courts. This new law, Jennie's Law, named after Jennifer Poole, will allow those convicted of domestic violence against a partner or former partner, to be included on this public Register of Judgments.  The General Scheme is being referred to the Justice Committee for pre-legislative scrutiny and, when its report is received, work on finalising the Bill will be prioritised. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 124. Deputy Naoise Ó Muirí asked the Minister for Justice, Home Affairs and Migration the progress his Department is making in establishing a domestic violence register, under ‘Jennie’s Law’; and if he will make a statement on the matter. [68146/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_148",
          "debateSectionId": "dbsect_148",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_124",
        "questionNumber": 124
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Ensuring that our justice system can respond effectively to domestic, sexual and gender-based violence (DSGBV) is a key priority for the Government. It is important that frontline professionals across the sector, including the judiciary, have the skills and understanding of DSGBV to equip them with the necessary expertise they require.  Cuan, the Domestic, Sexual and Gender Based Violence Agency, has worked with the Judicial Council to develop an action on judicial training under the Prosecution Pillar of the Zero Tolerance Strategy to combat DSGBV.  As part of its statutory remit, the Judicial Council will provide continuous professional learning to judges to include DSGBV and family law throughout 2025 and 2026; and will engage where appropriate with relevant agencies. Currently, the Judicial Council delivers training to judges on domestic and sexual violence, including on trauma-informed approaches, and coercive control. The Judicial Council is also responsible for developing relevant education and training to meet the emerging requirements of Family Court judges and DSGBV.  In addition to training for the judiciary, the 2025-2026 Zero Tolerance Implementation Plan outlines a programme of mandatory DSGBV training for those working in family law, including technical skills and further specialist training depending on the role. It is intended that this action will develop and train the family justice workforce to ensure it is trauma-informed, empathetic and responsive to the needs of all users of the family justice system, including children and survivors of DSGBV.  As Minister, it is my priority to ensure that the courts are adequately resourced to administer justice efficiently and effectively. In 2023, the Government approved and appointed an additional 24 judges as proposed by the Judicial Planning Working Group. Following an impact assessment of these appointments, Government approval was secured to increase judicial numbers by a further 20 judges to meet the growing demands on the justice system and to further reduce long waiting times across the courts. This second tranche of judicial appointments will involve two additional judges for the Court of Appeal and six each for the High, Circuit and District Courts.  In September, I received Government approval to amend the legislation to increase the number of judges and on 30 September the Joint Committee on Justice, Home Affairs and Migration waived Pre-Legislative Scrutiny of the General Scheme of Bill.  Taken together, these two sets of appointments represent an increase of approximately 25% in the number of Judges in Ireland. These reforms will ensure that Ireland's family justice system begins to work better for everyone engaging with it. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 141. Deputy Naoise Ó Muirí asked the Minister for Justice, Home Affairs and Migration if he will outline his Department’s progress in introducing specialised judges to handle domestic, sexual, and gender-based violence cases; and if he will make a statement on the matter. [68145/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_163",
          "debateSectionId": "dbsect_163",
          "showAs": "Domestic, Sexual and Gender-based Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_163.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_141",
        "questionNumber": 141
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including the creation of regulations governing the requirement to fit and operate specified equipment in vehicles, is a matter for the independent transport regulator, the National Transport Authority (NTA) under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  Both my Department and the NTA remain committed to increasing the accessibility of SPSV services and have introduced a number of initiatives to increase accessibility in the SPSV sector. For example, new entrants to the SPSV sector are required to operate a wheelchair accessible vehicle (WAV) by Regulations introduced by the NTA in June 2010. This was introduced in order to increase the number of WAVs in the SPSV fleet nationwide (taxis, hackneys, and limousines). This measure has increased the WAV penetration in the SPSV fleet from 4% in 2014 to over 22% at the end of October 2025.  This regulation has been accompanied by the WAV Grant, which provides financial support towards the acquisition or conversion of suitable vehicles to operate as WAVs in the SPSV fleet, and has been funded by my Department annually since 2014. Under the WAV Grant, applicants can avail of up to €17,500 in grant funding. The 2025 iteration of this grant scheme is closed to new applications but may reopen in early 2026, subject to the provision of funding.  Given the NTA's responsibility in this area, I have referred your question to the NTA for further information. Please advise my private office if you have not received a response within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 207. Deputy Naoise Ó Muirí asked the Minister for Transport if the NTA has considered piloting audio technology in taxis to assist the visually impaired; the steps being taken to improve accessibility in taxis; and if he will make a statement on the matter. [68612/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_213",
          "debateSectionId": "dbsect_213",
          "showAs": "Taxi Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_207",
        "questionNumber": 207
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA will triple the length of the electrified rail network from circa 50km to 150km and double city centre rail capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high-capacity public transport across the GDA.  Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 212. Deputy Naoise Ó Muirí asked the Minister for Transport when the new DART carriages will be rolled out; the expected additional capacity they will provide; and if he will make a statement on the matter. [68671/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_218",
          "debateSectionId": "dbsect_218",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_218.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_212",
        "questionNumber": 212
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 213. Deputy Naoise Ó Muirí asked the Minister for Transport if the NTA have examined the reliability and punctuality of the 15 Dublin Bus route; the process in place for when a bus is cancelled; and if he will make a statement on the matter. [68672/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_219",
          "debateSectionId": "dbsect_219",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_219.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_213",
        "questionNumber": 213
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The EU Short Term Rental (STR) Regulation was adopted by the EU on 11 April 2024 and is applicable from 20 May 2026. This Regulation lays down harmonised rules on the collection and exchange of data on short-term rental services for member states, hosts providing short-term accommodation rental services, and online platforms that offer services to hosts providing short-term accommodation rental services within the EU.  The Department of Enterprise, Tourism and Employment (DETE) has drafted the Short Term Letting and Tourism (STLT) Bill General Scheme in full alignment with the STR Regulation. The introduction of the STLT Bill will provide a more effective legal and administrative basis to regulate short-term lettings. The proposed STLT Bill will provide the statutory basis for the establishment of a register for short-term lets in Ireland and for the implementation of the new EU STR.  To ensure that there is a clear view, both at national level and local authority level, as to the overall policy approach to determining planning applications for short-term lets, my Department is currently developing a National Planning Statement (NPS) for the short-term letting sector to supplement and support the introduction of the STLT Bill. It will consider a variety of factors, such as existing planning legislation, the long term housing need in the local authority area, the location of the proposed short-term let and balancing housing need with the potential impact on tourism and economic development.  A NPS will contain two distinct elements that have a different status in terms of the obligations attaching to each element and the particular planning function being exercised. The first element - ‘national planning policies and measures’ - will be a high-level statement to be integrated into regional and local plan making. The second element - ‘national planning policy guidance’ - will be more discretionary practical guidance that will afford flexibility to planning authorities as to how to implement the principles of national planning policy and measures.  My Department has also established a Working Group, consisting of members from my Department, Department of Enterprise Tourism and Employment, and the County and City Management Association, in advance of finalising the NPS on short-term letting. The group will provide a forum for input into proposed policy formulation and guidance documentation development by my Department.  In advance of the publication of the NPS, local authorities can continue to make decisions on applications for change of use in respect of short-term letting properties. The decision of the local authority will be informed by local policy contained in the City and County Development Plans and Local Area Plans where applicable.  On issuance of the NPS on short-term letting, the decision making of local authorities in respect of material change of use applications for short-term let properties will be informed by the policy contained within the NPS. This will allow for consistency in decision making throughout all local authorities areas, including in respect of the general preclusion of permission for short-term lettings in large towns and cities. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 318. Deputy Naoise Ó Muirí asked the Minister for Housing, Local Government and Heritage the discretion local authorities will have to develop policies under the Short Term Letting and Tourism Bill 2025; when local authorities will be expected to publish these policies; and if he will make a statement on the matter. [68613/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_299",
          "debateSectionId": "dbsect_299",
          "showAs": "Tourism Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_299.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_318",
        "questionNumber": 318
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 254. Deputy Naoise Ó Muirí asked the Minister for Health the progress of licensing the drug luthera, which is required for the treatment of grade 4 neuroendocrine cancer; the expected timeline for approval; and if she will make a statement on the matter. [68274/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Muirí.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Muirí.D.2024-11-29",
          "showAs": "Naoise Ó Muirí"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_217",
          "debateSectionId": "dbsect_217",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_254",
        "questionNumber": 254
      },
      "contextDate": "2025-12-03"
    }
  ]
}