{
  "head": {
    "counts": {
      "questionCount": 6500,
      "resultCount": 6500
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 78. Deputy Louise O'Reilly asked the Minister for Children, Disability and Equality the commitments she has made to provide community childcare in multi-purpose community hubs and centres; and if she will make a statement on the matter. [73015/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_122",
          "debateSectionId": "dbsect_122",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_122.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_78",
        "questionNumber": 78
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  We are moving on to a grouping of Questions Nos. 108, 112 and 119. \n Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  I understood it was Questions Nos. 98, 102 and 109. \n An Leas-Cheann Comhairle  Can I clarify that with the clerk that it is the grouping of Questions Nos. 108, 112 and 119? \n Deputy Réada Cronin  I am taking Question No. 108 on behalf of Deputy Louise O'Reilly. \n An Leas-Cheann Comhairle  Yes. The questions are in the names of Deputies O'Reilly, Séamus McGrath and Deputy Neville. \n Deputy Réada Cronin  We wish to ask the Minister for Climate, Energy and the Environment if he intends to implement a socially just phase-out action plan for the replacement of fossil fuels by sustainable energy sources, and if he would make a statement on the matter please. \n Deputy Timmy Dooley  Perhaps the Leas-Cheann Comhairle will give me guidance as to which of the three have an opportunity now or what way does he want it. \n An Leas-Cheann Comhairle  I could not give the Minister of State guidance, for God's sake. You would not take it anyway. \n Deputy Timmy Dooley  That disappoints me greatly as you have been a mentor of mine for many years here and I depend on your guidance in many other fora as well.  I propose to take Questions Nos. 108, 112 and 119.  The programme for Government commits to ramping up the achievement of retrofit targets through continued delivery of the Sustainable Energy Authority of Ireland's residential and community energy upgrade schemes. This includes revising and improving the provision of grants and financing models for homeowners who wish to retrofit to enhance energy efficiency and reduce costs, supporting group retrofitting projects and area-based approaches to retrofitting, targeting older homes still using oil to switch to renewable heating systems and considering the use of sustainable bioliquids to reduce emissions from existing home boilers where deep retrofits are not possible in the short term. These commitments are framing the work under way by my Department on continued delivery and development of the SEAI's residential and community energy upgrade schemes and the development of a heat policy statement and a roadmap to phase out fossil fuel heating systems. The SEAI has a number of schemes in place to support homeowners to upgrade their properties and move to renewable heating systems, thereby allowing homeowners to choose the best home upgrade option to suit their particular needs. These include a number of part-funded schemes and the fully funded warmer homes scheme.  Ensuring fairness to all and supporting a just transition are key principles underpinning the National Retrofit Plan. As an example of delivering on this, over the period 2022 to 2024, 64% of the total Government spend on residential and community retrofitting across our Department and the Department of Housing, Local Government and Heritage's schemes was invested in upgrading home energy performance for households at risk of energy poverty across privately owned, local authority and approved housing body homes. The Department continues to build on the progress achieved in recent years. Since 2019 there has been a record level of about €1.6 billion invested in SEAI schemes to support almost 240,000 home energy upgrades, including over 81,000 to BER B2, 18,000 heat pump installations and over 32,000 fully-funded upgrades for households at risk of energy poverty under the warmer homes scheme, which many of us are familiar with through the representations we get in our constituencies. In addition, the Department funded a further 14,300 local authority upgrades, including over 7,250 heat pumps, between 2019 to 2024.  Changes introduced to the SEAI schemes in recent years aimed at increasing the number of homes retrofitted as part of the Government's retrofitting schemes include: enhanced SEAI grant schemes, including expanded eligibility and higher grants; simplified application processes with faster approvals and a greater focus on heat pumps; an increased number of one-stop shops - there were 24 registered at the start of 2025 and a further two were added this year, bringing the overall total to 26 at the end of September 2025; a reformed warmer homes scheme for homeowners in energy poverty with expanded eligibility, increased depth of retrofit, a prioritisation of the worst performing homes and a higher number of homes supported; enhanced supports for retrofitting apartment buildings and flat complexes; new supports for area-based retrofit projects for mixed-ownership estates aimed at encouraging homeowners, regardless of requirements or means, to get a retrofit; a new pilot scheme to support the retrofitting of traditionally built homes; two pilot schemes aimed at informing approaches to increase the number of heat pumps installed; the new home energy upgrade loan scheme, launched last year with new lenders joining in 2025, is now enabling homeowners to avail of retrofit loans with interest rates as low as 2.99%; a tax incentive to encourage small-scale landlords to undertake retrofitting works while the tenant remains in situ ; a reduction in the VAT rate for heat pumps to 9% and a 0% rate for solar panels - we all see how that has expanded the amount of solar energy that is now being captured on rooftops.; expanded obligations on energy companies to support homeowners and energy poor households to reduce energy use; measures to increase the number of workers with retrofit skills; and a procurement process to establish a new €1.2 billion contractor panel for the warmer homes scheme to be in place in by quarter 2 next year. This will support continued growth with a focus on scale, quality and output under the scheme.  Budget 2026 has provided record funding of €558 million for SEAI residential and community energy upgrade schemes next year. This is an increase of almost €89 million on the budget 2025 allocation. This funding is expected to be further supplemented with additional funding, such as an allocation from the European Regional Development Fund, which will provide for an increase in the allocation for the warmer home scheme. These allocations will be published as part of the Revised Estimates Volume later. This allocation will support even more home energy upgrades to make homes warmer, healthier and more comfortable, with lower emissions and lower bills. Increasing the uptake of energy efficiency upgrades and measures among homeowners is a key priority for our Department and as such, our officials, in partnership with their counterparts in the SEAI, continue to work to deliver in line with the National Retrofit Plan and the programme for Government commitments. \n Deputy Réada Cronin  It is really important we get a just transition. The Minister of State will recall how Sinn Féin tried to get a proper definition of that when we were working on the 2021 climate Act and he and I were on the climate committee. As we move away from fossil fuels and transition to a greener economy, we have to ensure we do not leave anybody behind. The SEAI grants have been made available to people for them to retrofit their homes but it has been shown that tenants and the Travelling community cannot do so. It is not working for them or for people living in older homes. Clare O'Connor from Friends of the Earth was before the climate committee last week. She said those living in the least efficient homes cannot afford to upgrade them. What specific accommodation will the Government make to ensure households such as these are not left behind as we transition to a sustainable economy? \n Deputy Séamus McGrath  I thank the Minister of State for his response. I think we all agree reducing energy consumption at home is a critically important part of reducing our overall carbon output as a nation and of course reducing the costs for households of their energy use. Many households find the grants to be quite rigid and it is a case of perfection being the enemy of the good. For example, if a household wants to upgrade their windows and doors they have to undertake a full energy upgrade under the one-stop shop system. That can be very inaccessible for many households due to the cost involved, so I ask these grants be reformed in such a way they become more accessible and user friendly. I welcome the measures announced in the simplified process, a reduce loan cost and so on. They are all very important but especially with windows and doors, which are critical parts of reducing energy consumption in a household, the grants need to be looked at so there is not a requirement for a full-blown energy upgrade to avail of them. \n Deputy Timmy Dooley  Both Deputies show regular interest in this and have spoken on it in the past. The point about not leaving anybody behind is really important and it has been the focus. Deputy Cronin and I, and her party, are aligned on lots of issues. I sat with Deputy Stanley, a former member of her party, on that committee for years and certainly Sinn Féin was very committed to the transition, but we disagreed ultimately on how to pay for it. We sided with the idea of the carbon tax, the hypothecation of that fund and using that to assist people in moving forward. Sinn Féin had a different view but nonetheless recognised the importance of ensuring nobody was left behind. I felt at the time, and still do, that the carbon charge was a way of discouraging the long-term use of fossil fuels and taking that as a methodology to assist exactly the people the Deputy spoke about. What I outlined to her indicates, particularly with the warmer homes scheme, what we have done for people with low incomes, namely, classifying them as in the energy poverty category and targeting that.  The issue Deputy McGrath described has been raised with me, the Minister and the Minister of State, Deputy Dillon, on a very regular basis. Deputy McGrath and others have mentioned it in the House. The Minister is very cognisant of that and my understanding is he is working towards bringing some reforms in this area.  We would all like to do a deep retrofit that would get us in line. Most of us cannot afford it. We are paying our mortgages or are working our way through that. Windows and doors and a little bit of insulation can have a massive impact on emissions from homes, on reducing the cost of energy and on reducing the burden on society generally from the emissions and the generation of electricity and the difficulties around that. I will certainly take that point back to the Minister but he has already begun a process there. \n Deputy Réada Cronin  The European Commission's 2025 country specific report stated that energy poverty has increased in Ireland and we now have the third highest household or consumer electricity prices in the EU when the add-ons are included. Much of that is down to our reliance on fossil fuels, which makes us susceptible to global price shocks beyond our control. Some 300,000 people are in energy arrears at the moment, with price hikes coming down the road with the PR6. The Minister of State mentioned carbon taxes. It was shown at the Committee of Public Accounts that carbon taxes are not being ring-fenced as was promised. We are meant to be climate neutral by 2050. The Climate Change Advisory Council said that by 2039 we should not be reliant on fossil fuels. How does the Government envision a complete phase-out of fossil fuels in Ireland? We are not getting there. \n An Leas-Cheann Comhairle  I call Deputy Séamus McGrath. \n Deputy Timmy Dooley  I thank the Deputy----- \n An Leas-Cheann Comhairle  No, the Minister of State should hold on. \n Deputy Réada Cronin  There he goes again. \n Deputy Timmy Dooley  I am eager. \n An Leas-Cheann Comhairle  He is very anxious. \n Deputy Timmy Dooley  I am very anxious. I am nervous. \n Deputy Séamus McGrath  I thank the Leas-Cheann Comhairle.  I thank the Minister of State for his response. As I said earlier, the importance of reducing energy consumption for domestic households is critical, for carbon achievements and to reduce costs for households and our dependence on international energy importation. That is also an important part. Therefore, I welcome the reforms the Minister of State announced that are in the pipeline for these home energy grants. They need to be less rigid and become more accessible and the requirement for full-blown upgrades needs to be changed. It is critical that any improvement to home energy efficiency should be welcomed. We should not be putting unnecessary requirements, conditions and criteria in place, which can prevent people from accessing these grants. I welcome that and I urge the Minister of State to redouble his efforts to bring about these reforms as soon as possible so the grants are accessible to households and so we subsidise and welcome any improvement to the energy efficiency of homes. \n Deputy Timmy Dooley  Deputy Cronin highlighted the significant cost of energy and the impact it is having on households. We have certainly seen that. The Government has taken action, as the Deputy will be aware, by increasing the fuel allowance from the beginning of the year. We reduced the VAT, which is a help in addressing the burden, but we have to get to the core cost.  I answered a question earlier about the efforts that have to be made in terms of the wholesale energy markets and the price of gas. The Commission for Regulation of Utilities, CRU, on the direction of the Minister, is carrying out an investigation to establish whether there are issues with the market and whether there is potential for failures in the market. The International Energy Agency, IEA, indicated that the difference between the wholesale and retail cost is considerable and widening, particularly in the gas market and that sets energy prices generally. We are therefore looking at it from that perspective. However, the long-term approach is to try to ensure we move away from fossil fuels altogether and reduce the amount of energy needed in homes. I have already outlined the kind of approach we are taking to ensure people who are not in a position to do that upgrade get the State's support.  I thank Deputy McGrath for his comments. It is twofold. It is about having people in healthier, warmer homes that are less dependent on fossil fuels or even on renewable energy. If we can make the homes lose less energy, they will use less electricity and there will be less cost regardless of whether the energy is clean or otherwise. That is why the Minister, Deputy O'Brien, takes the view that this can be done incrementally and we can make progress. It cannot be that people have to do everything at once, because that is a turn-off for people financially. When they get to other side, having paid their mortgage, they often do not want to take on more debt so we will continue with that. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 108. Deputy Louise O'Reilly asked the Minister for Climate, Energy and the Environment if he intends to implement a socially-just phase out action plan for the replacement of fossil fuels by sustainable energy sources; and if he will make a statement on the matter. [73018/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_26",
          "debateSectionId": "dbsect_26",
          "showAs": "Just Transition",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_26.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_108",
        "questionNumber": 108
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The NTMA have informed me that the Ireland Strategic Investment Fund (ISIF) is a universal owner, meaning its long-term returns are dependent on the economy’s overall health, and therefore integrating Environmental, Social and Governance (ESG) factors are core to its investment approach. ESG consideration benefits ISIF not just through each individual investment, but also at an overall portfolio level, ultimately enhancing the long-term value of the Fund.  ISIF’s overarching approach to Sustainability and Responsible Investment (S&RI) includes the following key tools that ISIF uses to implement ESG in a broadly consistent manner across its portfolios:  Integration: ESG & Climate Framework tool used to assist in the identification, monitoring and mitigation of material ESG risks across the Irish Portfolio. Throughout its investment decision making process, ISIF aims to mitigate and manage ESG issues.  Active Ownership: ISIF has a long history of active ownership and EOS at Federated Hermes provides Active Ownership services for the Global Portfolio and all voting records are reported quarterly on ISIF's website.  Analysis: ISIF uses the services of ISS-ESG to conduct detailed portfolio analytics including carbon foot printing and impact analysis aligned with the UN Sustainable Development Goals (SDG’s).  Divestment & Exclusions: As of May 2024, in accordance with its obligations under the Fossil Fuel Divestment Act 2018, ISIF had developed a list of 247 fossil fuel companies in which it will not invest. In addition, ISIF also maintains an exclusionary strategy around cluster munitions and antipersonnel mines (which are prohibited investments under the Cluster Munitions and Anti-Personnel Mines Act 2008), coal production and processing, tobacco manufacturing and direct investment in companies involved in the manufacture and testing of nuclear weapons or their critical component parts.  The Deputy may be aware of the UN Human Rights Council Database (the UN Database) identifying businesses involved in specific activities which was first issued in 2020, updated in June 2023 and most recently updated to include 158 companies in September 2025 as mandated by the UN Human Rights Council.  ISIF has taken an investment decision to divest from six companies, all of which remain on the updated UN Database, with a total value at the time of the divestment decision of approximately €2.95m. The six companies are Bank Hapoalim BM; Bank Leumi-le Israel BM; Israel Discount Bank Ltd; Mizrahi Tefahot Bank Ltd; First International Bank Ltd and Rami Levi Chain Stores Ltd.  I understand that ISIF will continue to monitor its holdings to ensure that investments remain aligned with its risk profile and investment parameters. ISIF does not comment on individual investments, however a list of ISIF investments are available in the 2024 NTMA Annual Report.  Neither the Future Ireland Fund nor the Infrastructure Climate and Nature Fund have any current investments in the occupied Palestinian territories. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 206. Deputy Louise O'Reilly asked the Tánaiste and Minister for Finance the ethical guidelines used to determine whether or not the State will invest in companies with links to the illegal occupied territories; and if he will make a statement on the matter. [73047/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_220",
          "debateSectionId": "dbsect_220",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_220.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_206",
        "questionNumber": 206
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme and stations along the DART line.  The DART+ Coastal North project will benefit the existing rail station at Balbriggan, increasing train capacity and frequency. Planning approval for DART+ Coastal North was granted by An Coimisiún Pleanála in August 2025.  The NDP Sectoral Implementation Plan, which was published by my Department in November, notes that there is potential to commence works on elements of DART+ Coastal North, including supporting infrastructure such as track passing loops and a new platform at Drogheda station over the period 2026-2030, in advance of works on Overhead Line Equipment (OHLE) .  DART+ Fleet provides a ten-year procurement framework for electric and battery-electric train fleet. Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027, including Balbriggan.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 316. Deputy Louise O'Reilly asked the Minister for Transport if future planning for a new train station namely the reopening of Ardgillan/Balbriggan south train station, will be considered to accommodate the future development by the Land Development Agency of Castlelands, Balbriggan; if he is aware that the development of the site will see an increase in population of up to 2,000 people to the existing population of 29,000, as part of investment in public transport in north Fingal; and if he will make a statement on the matter. [73436/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_320",
          "debateSectionId": "dbsect_320",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_320.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_316",
        "questionNumber": 316
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  There are a range of protections under employment law for employees facing redundancy.  Redundancy is where an employee loses their job because their employer is closing their business or reducing the number of staff. It occurs when a job no longer exists, an employee is let go and they are not replaced.  Where an employee has been made redundant, they may be entitled to a redundancy payment. Under the Redundancy Payments Act 1967, it is the employer’s responsibility to pay statutory redundancy to eligible employees.  In order to qualify for a statutory redundancy payment, an employee must have 104 weeks' continuous employment, have been an employed contributor in employment which was insurable for all benefits under the Social Welfare Acts, and be over the age of 16.  The requisite period of 2 years continuous service is to ensure the employee has a reasonable attachment to the employer that is making them redundant. There are no plans to make changes to the eligibility criteria to receive a statutory redundancy payment.  An employee with more than one year’s service is protected under the Unfair Dismissal Act 1977, as amended. In such cases, an employer must be able to demonstrate that the dismissal is both substantively and procedurally fair.  In general, dismissal of an employee due to redundancy is not deemed to be an unfair dismissal. However, in such cases, an employer must be able to demonstrate that the redundancy is genuine and the selection criteria and redundancy process adopted are fair.  Where an employee believes their employer has breached their employment rights, they can make a complaint to the WRC. In most cases, complaints must be made within 6 months of the alleged breach. The WRC can extend this to 12 months if the employee demonstrates reasonable cause. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 396. Deputy Louise O'Reilly asked the Minister for Enterprise, Tourism and Employment if he is aware that statutory redundancy pay is only required after two years of service; if he is aware that due to this, some companies hire large numbers of staff and then dismiss them shortly before they reach the two-year mark, only to hire some of the same people again soon after; if he has considered that while legally, this practice is allowed, this practice causes immense hardship for workers whose lives are disrupted repeatedly; if he has considered that Ireland’s current employment protection laws can be easily bypassed and leave vulnerable people especially pregnant workers and those with short service without real security; if he has any plans to remedy this issue; the actions he will take to address it; and if he will make a statement on the matter. [73438/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_384",
          "debateSectionId": "dbsect_384",
          "showAs": "Redundancy Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_384.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_396",
        "questionNumber": 396
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 541. Deputy Louise O'Reilly asked the Minister for Social Protection the way a particular welfare payment (details supplied) was calculated as regards furnishing social housing; and if he will make a statement on the matter. [73433/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_513",
          "debateSectionId": "dbsect_513",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_513.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_541",
        "questionNumber": 541
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 542. Deputy Louise O'Reilly asked the Minister for Social Protection if he has given any consideration to a cost-of-disability payment.; and if he will make a statement on the matter. [73434/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_514",
          "debateSectionId": "dbsect_514",
          "showAs": "Social Welfare Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_514.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_542",
        "questionNumber": 542
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 543. Deputy Louise O'Reilly asked the Minister for Social Protection if he will review the one-payment-per-household rule for the fuel allowance scheme whereby adult children on low incomes are living in the family home due to the housing crisis and are refused support based on parental income alone, despite individually qualifying for the scheme; and the plans to allow eligibility to be assessed on an individual basis in such circumstances. [73435/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_515",
          "debateSectionId": "dbsect_515",
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_515.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_543",
        "questionNumber": 543
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 544. Deputy Louise O'Reilly asked the Minister for Social Protection if he is aware that workers are protected from redundancy only once maternity leave has officially begun; if he is aware that this means that even if a pregnant woman has only a few days left before her leave starts, she can still be made redundant; if he is aware of the difficulties for someone who is two months away from giving birth to find a new job in this situation; if he is aware of the material difference between jobseeker’s benefit and continuing stable employment while preparing for childbirth and caring for a newborn; if he has considered that this uncertainty alone brings enormous stress to an expectant mother; if he will consider examining the UK and the rest-of-EU approach, where there are stronger protections for pregnant employees facing redundancy, when looking into this matter; if will consider strengthening protections in this area; and if he will make a statement on the matter. [73437/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_516",
          "debateSectionId": "dbsect_516",
          "showAs": "Employment Rights",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_516.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_544",
        "questionNumber": 544
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 545. Deputy Louise O'Reilly asked the Minister for Social Protection if he is aware that domestic abuse rent supplement is available for three months without a means test; if he understands that a victim of domestic abuse in some circumstances is working and required to pay the mortgage on the property where the children live; if this payment is considered as part of the means test in the case where the person cannot live in the family home; if there are any circumstance in which this supplement can be accessed for more than three months without a means test; and if he will make a statement on the matter. [73440/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_517",
          "debateSectionId": "dbsect_517",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_517.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_545",
        "questionNumber": 545
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 546. Deputy Louise O'Reilly asked the Minister for Social Protection if he has considered implementing a ‘saver clause’ similar to that used when someone transitions from disability allowance to the State pension (non-contributory) for those in receipt of carer’s allowance when they transition to the State pension (non-contributory); and if he will make a statement on the matter. [73441/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_518",
          "debateSectionId": "dbsect_518",
          "showAs": "Social Welfare Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_518.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_546",
        "questionNumber": 546
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Deputy's question relates to service matters, I have referred it to the HSE for direct reply. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 656. Deputy Louise O'Reilly asked the Minister for Health to provide a breakdown of the wait times to see a consultant at all HSE fertility hubs across the country, in tabular form; the measures taken to ensure the waitlists for childless couples in particular do not increase; and if she will make a statement on the matter. [73432/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_629",
          "debateSectionId": "dbsect_629",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_629.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_656",
        "questionNumber": 656
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  The matter raised by the Deputy is a matter for the Department of Children, Disability and Equality. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 657. Deputy Louise O'Reilly asked the Minister for Health if she is aware of any scheme or funding stream for the provision of guide dogs for a visually impaired person living in a rural area who is no longer working but who still wants to be able to leave the house and cannot do so safely without the assistance of a guide dog; and if she will make a statement on the matter. [73439/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_630",
          "debateSectionId": "dbsect_630",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_630.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_657",
        "questionNumber": 657
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the distribution and stationing of Garda personnel throughout the State.  In the interest of transparency, An Garda Síochána publishes information in relation to the allocation of Gardaí nationally. This includes a breakdown of Gardaí assigned to Garda stations in the Dublin Metropolitan Region North Division. This can be found at the following link:  [ https://www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ ]  The Deputy should select the most recently available date and then select the file titled ‘Garda Members by division district station to the most recent date \" to access a breakdown of Garda members.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 751. Deputy Louise O'Reilly asked the Minister for Justice, Home Affairs and Migration the annual number of Gardaí for the past three years in north County Dublin, in tabular form; and if he will make a statement on the matter. [72358/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_597",
          "debateSectionId": "dbsect_597",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_597.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_751",
        "questionNumber": 751
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Taxation is a matter for the Revenue Commissioners. Carer’s Allowance and Carer's Benefit are and have been a taxable source of income.  Earlier this year, it was agreed between my Department and the Revenue Commissioners that, from 01 January 2026, information on Carer's Allowance/Benefit payments will be included in the Taxable Payments Report shared directly with Revenue. This equitable solution removes the onus that was previously on carers to contact Revenue themselves to inform them that they are in receipt of a Carer's Allowance/Benefit payment. The carer’s representative groups were informed of this in April and were satisfied that this equitable solution removes the onus that was previously on carers to contact Revenue themselves to inform them that they are in receipt of a Carer's Allowance payment, thereby making the process simpler for carers in the future.  I can confirm that no historical or past-year payment information is being supplied to Revenue. The provision of real-time information to Revenue from 1 January is a forward looking arrangement and will make the process simpler for carers in the future.  If Carer's Allowance/Benefit is a person's only source of income, they are unlikely to have to pay tax. This is because their tax liability may not exceed their tax credits.  Disability Allowance is not a taxable source of income.  I hope that this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 532. Deputy Louise O'Reilly asked the Minister for Social Protection the way in which carer's allowance and disability allowance will be taxed from 1 January 2026 onwards; the differences which will be between tax procedures in 2025 and 2026; the impact this will have on welfare recipients; and if he will make a statement on the matter. [69130/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_462",
          "debateSectionId": "dbsect_462",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_462.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_532",
        "questionNumber": 532
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Bíonn plé éagsúil ag mo Roinnse le stádas na n-Oifigigh Gaeilge sna húdaráis áitiúla agus ábhair níos leithne.  Thar ceann na Roinne, cuireann Foras na Gaeilge tacaíocht mhaoinithe ar fáil go rialta do Chumann na nOifigeach Forbartha Gaeilge (COFG). Is líonra tacaíochta agus urlabhra é seo d’Oifigigh Forbartha Gaeilge san Earnáil Phoiblí & Stáit ar oileán na hÉireann. Mar chuid dá ndualgais, tacaíonn siad lena n-eagraíochtaí seirbhísí a chur ar fail trí Ghaeilge, i gcomhréir le riachtanais Achtanna na dTeangacha Oifigiúla, 2003 agus 2021 agus eile.  Tugadh cuireadh d’ionadaithe ó COFG teacht le cur i láthair a dhéanamh don Choiste Comhairleach um Sheirbhísí Gaeilge, a bunaíodh faoin Acht céanna, chun ionchur a bheith acu in obair an Choiste sin – go háirithe in ullmhú an chéad Phlean Náisiúnta um Sheirbhísí Poiblí Gaeilge, a foilsíodh anuraidh.  Ag eascairt ón gcruinniú seo, mar aon le taighde eile a rinneadh don Phlean, áiríodh Cuspóir 1 (Earcaíocht) faoi Mhór Théama Straitéiseach 4 den Phlean sin, a luann:   Go mbreathnófaí ar dheiseanna ailíniú a dhéanamh idir róil nua a luaitear san Acht agus róil reatha, de réir mar is cuí   Is é an ról nua a bhfuiltear ag déanamh tagartha dó anseo go príomha ná an dualgas atá ar gach comhlacht poiblí anois oifigeach sinsearach, ag leibhéal comhionann le Príomhoifigeach Cúnta nó níos airde, a cheaptha chun críche chur i bhfeidhm an Achta (Alt 4B(a)) – ar a dtugtar anois Oifigeach na dTeangacha Oifigiúla.  Ní nach ionadh gur léirigh an taighde a rinneadh don Phlean Náisiúnta, an tionchar dearfach ar féidir le hOifigeach na dTeangacha Oifigiúla agus/nó Oifigeach Gaeilge tiomanta agus tacaithe imirt ar sholáthar seirbhísí poiblí ar ardchaighdeán trí Ghaeilge mar aon le cur chun cinn na Gaeilge laistigh den eagraíocht go ginearálta. Beifear ag iarraidh tacú tuilleadh leis na róil seo mar sin faoi Chuspóir 3 de Mhór-Théama Straitéiseach 1 den Phlean Náisiúnta chomh maith, a deir:   Go mbreathnófaí ar bhealaí le tarraingt go héifeachtach ar mheicníocht Oifigeach na dTeangacha Oifigiúla (OTO) atá tagtha i bhfeidhm anois faoi Alt 4B (GA/EN) den Acht leasaithe.   B’fhiú a lua go bhfuil ionadaí gníomhach ón Gníomhaireacht Bainistíochta um Rialtas Áitiúil (GBRÁ) ar an gCoiste Comhairleach chomh maith, a bhíonn ag tabhairt airde ar cheisteanna bainteach le stádas na nOifigeach Gaeilge i gcomhthéacs na n-údarás áitiúil go sonrach freisin.  Tá dhá phlean gníomhaíochta le tacú leis an bPlean Náisiúnta, ina leagfar amach na bearta sonracha atá le tabhairt fúthu i dtreo chuspóirí straitéiseacha ardleibhéil an Phlean a bhaint amach.  Tá obair ar siúl ó foilsíodh an Plean Náisiúnta ar an gcéad cheann de na Pleananna Gníomhaíochta seo agus, tar éis comhairliúchán fairsing agus fiúntach le páirtithe trasna an Rialtais, tá sé le cur faoi bhráid an Rialtais anois go luath  I dtaca leis sin go léir, i mí an Mhárta i mbliana, d’fhógair mé maoiniú d’os cionn €4.5m in imeacht ceithre bliana (2025–2028) le haghaidh Gaeilge 365 - 50% den mhaoiniú le teacht ó mo Roinnse agus an 50% eile le teacht ó na ceithre údarás áitiúla i mBaile Átha Cliath. Is é aidhm an tionscadail seo ná dea-chleachtais a chruthú i dtaobh na modhanna is féidir le húdaráis áitiúla a úsáid le tuilleadh deiseanna labhartha Gaeilge a chruthú don phobal. Tá gealltanas áirithe i gClár an Rialtais 2025 - Todhchaí na hÉireann a Dhaingniú chomh maith, an clár nuálaíochta teanga seo a leathnú chuig na húdaráis áitiúla go léir ar fud na tíre.  Mar fhocal scoir, b’fhiú a lua gur bunaíodh Fóram Pleanála Teanga na nÚdarás Áitiúil in 2024, le deis a thabhairt do na Príomh Oifigigh Feidhmiúcháin sna húdaráis áitiúla bualadh le chéile roinnt uaireanta sa bhliain le saincheisteanna a bhaineann le pleananna teanga, cúrsaí tithíochta agus nithe ábharthacha eile a bhaineann leis an nGaeilge ina gceantair a phlé. Is Údarás na Gaeltachta agus Foras na Gaeilge a dhéanann Comh-Chathaoirleacht ar an bhFóram seo agus cuimsítear leis an mballraíocht Príomh-Oifigigh Feidhmiúcháin, agus oifigigh shinsearacha eile ó na n-údarás áitiúil a bhfuil Limistéar Pleanála Teanga, Baile Seirbhíse Gaeltachta nó Líonra Teanga ina gceantar. D’fhreastail mé féin ar an gcéad chruinniú den Fhóram seo i mí an Mheithimh i mbliana (2025). ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 51. D'fhiafraigh Deputy Louise O'Reilly den Minister for Rural and Community Development and the Gaeltacht cén cineál rannpháirtíochta atá aige leis na húdaráis áitiúla, leis an Aire Tithíochta, Rialtais Áitiúil agus Oidhreachta, agus leis an nGníomhaireacht Bainistíochta Rialtais Áitiúil (GBRÁ) maidir le stádas Oifigigh Gaeilge na n-údarás áitiúil. [68471/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_88",
          "debateSectionId": "dbsect_88",
          "showAs": "Údaráis Áitiúla",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_51",
        "questionNumber": 51
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The LEADER programme is co-financed by the European Commission under the Common Agricultural Policy (CAP), through the European Agriculture Fund for Rural Development. It is a multi-annual programme, with allocations being linked to a programming period set at EU level, rather than an annual basis.  The total amount of funding allocated to LEADER for the period of 2021-2027 is €250 million. This funding is made up of €70 million for the Transitional LEADER programme for the years 2021 and 2022, and €180 million for the 2023-2027 LEADER programme, maintaining the level of funding at €250 million for the 7 year period, in line with the previous 2014-2020 LEADER programme.  The funding allocations for each sub-regional area are provided to Local Action Groups (LAGs) at the outset of each programme to provide them with greater flexibility managing their budgets over the programming period. Funding is then paid out by my Department as costs are incurred and claims for payment are submitted.  Given the structure of the LEADER programme, it is expected that the pattern of expenditure would not be evenly spread over each year. For example, certain years can include expenditure in respect of more than one programming period. In other years expenditure can be lower as LAGs focus on engaging with applicants throughout the country to develop and progress high quality project applications.  The original €180 million budget for the 2023-2027 LEADER programme has not been reduced and will be made available by my department as projects are completed over the programming period. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 56. Deputy Louise O'Reilly asked the Minister for Rural and Community Development and the Gaeltacht the reason for the cut in LEADER funding for 2026; and the breakdown of the reductions. [68472/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_93",
          "debateSectionId": "dbsect_93",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_93.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_56",
        "questionNumber": 56
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of the Taoiseach  The At Risk of Poverty (AROP) rate is derived from the EU Survey on Income and Living Conditions (EU-SILC) and measures the proportion of people whose equivalised disposable income is below 60 per cent of the national median income. In Ireland, the AROP indicator is a key national poverty measure and is calculated before housing costs, in line with Eurostat requirements, to ensure comparability between Member States.  In addition to the standard measure of at risk of poverty, the Central Statistics Office (CSO) produces a supplementary national indicator known as the At Risk of Poverty rate after Rent and Mortgage Interest. This indicator adjusts disposable income to account for housing payments that are directly linked to housing tenure, namely rent and mortgage interest. It provides an additional perspective on poverty by reflecting the impact of these housing costs on household disposable income.  The At Risk of Poverty after Rent and Mortgage Interest indicator is defined as the proportion of people whose equivalised net disposable income, after the deduction of rent and mortgage interest payments, falls below 60 per cent of the median equivalised net disposable income. It is published annually by the CSO alongside the main SILC results. The indicator is not part of the harmonised EU set of social inclusion indicators but is recognised nationally as an important supplementary measure for understanding poverty in Ireland.  In constructing the At Risk of Poverty after Rent and Mortgage Interest indicator, only rent and mortgage interest are deducted from disposable income. Rent is included because it is a regular, essential and measurable expense directly related to securing accommodation. Mortgage interest is included because it represents the recurring cost of housing for owner-occupiers with a mortgage. Mortgage capital (principal) repayments are excluded because they represent asset accumulation rather than consumption expenditure. Other housing-related expenses such as utilities, insurance or maintenance are not deducted.  The At Risk of Poverty after Rent and Mortgage Interest indicator is conceptually similar to the broader At Risk of Poverty after Housing Costs measure used in other countries, such as the United Kingdom. The broader At Risk of Poverty after Housing Costs, deduct a wider set of housing costs from net disposable income before calculating the risk of poverty. This indicator is currently not published by the CSO. The CSO is committed to meeting the data needs of users and if At Risk of Poverty after Housing Costs is requested the CSO will endeavour to develop such a measure and make it available to the public. Once developed, the At Risk of Poverty after Housing Costs could be utilised to produce a national estimate of Consistent Poverty after Housing Costs and made available to the public.  Eurostat publish estimates of At Risk of Poverty rates after housing costs for member states based upon EU-SILC on their database. This indicator is available for Ireland using Eurostat’s income definitions, which differ slightly from our national income definitions. The Consistent Poverty rate after Housing Costs is not however produced by Eurostat.  Oversight of indicator developments from EU-SILC in Ireland takes place through the Technical Advisory Group (TAG). Members of the TAG include the CSO and representatives from the Department of Social Protection, the Department of Public Expenditure, NDP Delivery and Reform, the Department of Children, Equality, Disability, Integration and Youth, the Economic and Social Research Institute, academics and other experts as required. The group provides technical and policy advice on survey content, indicator definitions, and methodological issues. It also reviews proposals for new or supplementary indicators to ensure national relevance and compliance with EU-SILC standards. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 80. Deputy Louise O'Reilly asked the Taoiseach if it would be possible for the CSO, drawing on SILC data, to create a new measurement of ‘consistent poverty (after housing costs)’, which would combine households at risk of poverty after housing costs and households in material deprivation, in the same fashion as the existing measurement ‘consistent poverty. [62184/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_73",
          "debateSectionId": "dbsect_73",
          "showAs": "Poverty Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_80",
        "questionNumber": 80
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Carer’s Support Grant is an annual payment made to carers who get Carer's Allowance, Carer's Benefit or Domiciliary Care Allowance. It can also be paid to certain other carers providing full-time care, provided they meet age, residency and employment conditions, and are not in receipt of Jobseeker's Allowance or Jobseeker's Benefit.  The number of recipients of the Carer's Support Grant in June 2025 was 139,351. Of these, 5,730 were not in receipt of Carer's Allowance, Carer's Benefit, or Domiciliary Care Allowance.  Table 1 - Recipients of the Carer's Support Grant and other schemes, June 2025.     Scheme    Recipients      Carer's Support Grant - Total    139,351      Carer's Support Grant and Carer's Allowance    98,983      of which Carer's Support Grant, Carer's Allowance and Domiciliary Care Allowance    27,278      Carer's Support Grant and Carer's Benefit    4,011      of which Carer's Support Grant, Carer's Benefit and Domiciliary Care Allowance    1,695      Carer's Support Grant and Domiciliary Care Allowance    30,627      Carer's Support Grant Only    5,730      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 389. Deputy Louise O'Reilly asked the Minister for Social Protection the number of individuals who received the carers support grant in June 2025 and who are not also in receipt of carer’s allowance or carer’s benefit. [68017/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_348",
          "debateSectionId": "dbsect_348",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_348.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_389",
        "questionNumber": 389
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Local Government Superannuation Scheme (LGSS) is the pre-2013 retirement scheme open to all pensionable local authority employees. Any employee who became pensionable after 1 January 2013 became a member of the Single Public Service Pension Scheme.  Prior to 2008, members of the Retained Fire Service, being part-time non-pensionable employees were not members of the LGSS. However, on retirement or resignation from the Retained Fire Service, they were entitle to receive a retirement gratuity.  My Department does not hold employment histories, pensions and payroll information for individual employees. Therefore, it is not possible to give a more detailed reply to the query as submitted. If the person concerned wishes to receive more information, they should first raise the query through their local HR, who can engage with both MyPay and my Department, as necessary. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louise O'Reilly",
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_305.xml"
            }
          },
          "debateSectionId": "dbsect_305",
          "showAs": "Fire Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_305"
        },
        "questionNumber": 355,
        "date": "2025-11-27",
        "showAs": " 355. Deputy Louise O'Reilly asked the Minister for Housing, Local Government and Heritage if a fire fighter who transferred from the Retained Fire Service to the Dublin Fire Brigade in 2007 can retrospectively have their service recognised on a year-for-year basis, as it is for post-2013 transferees; the details of the way in which this can be done; the resources and supports that are in place to support fire fighters to ensure that they maximise their entitlements for their retirement; and if he will make a statement on the matter. [66842/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_355"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  New Social Welfare Appeals Regulations came into effect on 28 April 2025, these regulations increased the time limit for lodging an appeal from 21 to 60 days, with provision for the Chief Appeals Officer to accept late appeals up to 180 days in certain circumstances. This change allows customers a longer period to prepare their appeal and gather any relevant documentation prior to submitting an appeal. At any time during the appeals process, up to and including an oral hearing, if applicable, an appellant can submit additional information, which affords them the opportunity to strengthen their case.  Appeals functionality on MyWelfare means that appellants can now easily transmit documentation and evidence to the relevant scheme area and the Appeals Office electronically via MyWelfare at any time during the appeal process. In cases where the MyWelfare site cannot be accessed by an appellant, additional information may be submitted via post or email directly to the Social Welfare Appeals Office.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louise O'Reilly",
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_339.xml"
            }
          },
          "debateSectionId": "dbsect_339",
          "showAs": "Social Welfare Appeals",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_339"
        },
        "questionNumber": 397,
        "date": "2025-11-27",
        "showAs": " 397. Deputy Louise O'Reilly asked the Minister for Social Protection if he is aware that information relevant to an appeal of a refusal to award DCA to a parent can take time to obtain; if he is further aware that sometimes, parents need to submit additional information while the appeal is submitted and pending; if he can advise whether this can be done right up to the decision on the appeal being made; and if he will make a statement on the matter. [66839/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_397"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  When a DCA claim is awarded, it is paid from the month following the date of receipt of the most recent application, and the decision is based on the care requirements of the child at that date of application. However, under Social Welfare legislation, a case can be made to have the payment backdated up to a maximum of 6 months.  It is open to applicants who have withdrawn an appeal of an earlier application for DCA to request a review by a Deciding Officer with any extra evidence they think is relevant to the care needs of the child from the earlier date.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louise O'Reilly",
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_341.xml"
            }
          },
          "debateSectionId": "dbsect_341",
          "showAs": "Social Welfare Appeals",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_341"
        },
        "questionNumber": 398,
        "date": "2025-11-27",
        "showAs": " 398. Deputy Louise O'Reilly asked the Minister for Social Protection if, when a person withdraws an appeal against the refusal to award DCA and re-submits their application again, and this is awarded, if any backdating will be to the date of the first submission or the second; and if he will make a statement on the matter. [66840/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_398"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Benefit Payment for 65-Year-Olds, provided for under the Jobseeker’s Benefit scheme, was introduced in line with the Programme for Government commitment to address the position of people who are required to or choose to retire at age 65 before the State pension age of 66. The payment is designed to bridge the gap for people who retire from employment or self-employment at age 65 until they qualify for the State Pension at age 66. To be eligible for the payment a person must satisfy the qualifying conditions of the scheme including the PRSI social insurance contribution requirements, which demonstrates a recent attachment to the workforce.  Jobseeker’s Benefit Payment for 65-Year-Olds is a PRSI-based insurance, it is not means tested and may be paid for one year from the date of the person’s 65th birthday until the date of person’s 66th birthday, as long as they continue to satisfy the conditions for this payment. It is paid at the standard jobseeker's rate and is not pay-related.  Jobseeker’s Pay-Related Benefit is an income support for a person who becomes unemployed and is directly linked to their previous earnings. It is paid for a maximum of 6 months or 9 months depending on the amount of qualifying social insurance contributions paid. It is a different scheme to Jobseeker’s Benefit Payment for 65-Years-Old due to the differing contingency it is designed for, specifically loss of employment rather than retirement at age 65.  I trust that this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Louise O'Reilly",
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_342.xml"
            }
          },
          "debateSectionId": "dbsect_342",
          "showAs": "Fire Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_342"
        },
        "questionNumber": 399,
        "date": "2025-11-27",
        "showAs": " 399. Deputy Louise O'Reilly asked the Minister for Social Protection if fire fighters with the Dublin Fire Brigade with a preserved pension age of 55 are entitled to the same benefit payment that 65 year-olds are entitled to on retirement; if this benefit is the same or equivalent to the pay related job seeker’s benefit; the length of time this is paid without means testing; and if he will make a statement on the matter. [66841/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_399"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 15. Deputy Louise O'Reilly asked the Minister for Housing, Local Government and Heritage if he plans to expand access to a remediation and compensation scheme for homes built with defective blocks in Skerries; and if he will make a statement on the matter.  [65211/25] ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_42",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_42",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_42.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "memberCode": "Louise-O'Reilly.D.2016-10-03"
        },
        "questionNumber": 15,
        "answerText": " Deputy Eoin Ó Broin  There was a protest outside today by homeowners affected by defective concrete blocks from Mayo and Donegal, but also from Fingal.  The homeowners in Fingal met the Minister's predecessor in 2022 and applied to the Housing Agency in 2023. The Housing Agency's report has been on the Minister's desk since June or July of this year. Can he tell us when he is going to make a decision because these homeowners desperately need some certainty about whether hey are going to be included in what is a very imperfect scheme? \n Deputy James Browne  One thing I note is how often somebody tells there is something is on my desk when my desk is empty. It seems to be a term of art that something has arrived at the Department of housing somewhere. I can assure the Deputy that the Housing Agency received test results from the properties sampled in Fingal. I have received the final report from the Housing Agency. It literally was on my desk this week. On the basis of the recommendations made by the agency, I intend to shortly bring the matter to Government seeking approval for the making of an order designating the relevant parts of Fingal County Council as being part of the defective concrete blocks scheme so it will literally be within days. \n Deputy Eoin Ó Broin  Will the decision be made before or after Christmas? \n Deputy James Browne  I reiterate it will be literally within days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_15",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 289. Deputy Louise O'Reilly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation whether the €10 million allocated towards the relaxation of the carer’s means test comes under €1,152 million for key policy adjustments, or from the €390 million 'increase in pension and illness, disability, carers scheme recipients; and if he will make a statement on the matter. [65197/25] ",
        "debateSection": {
          "showAs": "Budget 2026",
          "debateSectionId": "dbsect_285",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_285",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_285.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "memberCode": "Louise-O'Reilly.D.2016-10-03"
        },
        "questionNumber": 289,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 289, 290 and 291 together.  As set out in Table D on page 128 of the Budget 2026 Expenditure Report, an additional €2,036 million will be allocated to the Department of Social protection in 2026. This represents an increase of 7.6% on 2025 and will provide for both the continued funding of existing schemes as well as a series of new measures.  Table D sets out funding for existing schemes of €390 million for an “ Increase in pension and IDC scheme recipients ” to cover demographic-related changes including ageing and population growth, increased disability incidence as well as other recipient increases across these schemes. The estimates are based on a projected increase in recipients of c.30,000 across Pension and Illness, Disability and Carers schemes in 2026. This recipient growth is broken down as follows:      Programme Area      Recipient change 2026   (Before Impact of New Developments)      Pensions    Approx. 21,500      Illness, Disability and Carers    Approx. 8,500     Separately, €1,152 million was allocated to the Department of Social Protection in 2026 for Key Policy Adjustments . This expenditure category covers increases in social welfare payment rates, the expansion of eligibility for schemes and the introduction of new supports to deliver enhanced services for citizens.  This allocation will fund the planned increase in the Carer’s Allowance income disregard to €1,000 per week for a single person and €2,000 per week for a couple from July 2026. The Department of Social Protection costed this measure at €10 million in 2026. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_289",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 290. Deputy Louise O'Reilly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation whether funding for new recipients of the carer’s allowance, who would not have qualified under the current income disregards but will qualify on foot of the Budget 2026 measure, is allocated from the €390 million' increase in pension and illness, disability, carers scheme recipients or elsewhere; the amount he plans to allocate to this; and if he will make a statement on the matter. [65198/25] ",
        "debateSection": {
          "showAs": "Budget 2026",
          "debateSectionId": "dbsect_285",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_285",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_285.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "memberCode": "Louise-O'Reilly.D.2016-10-03"
        },
        "questionNumber": 290,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 289, 290 and 291 together.  As set out in Table D on page 128 of the Budget 2026 Expenditure Report, an additional €2,036 million will be allocated to the Department of Social protection in 2026. This represents an increase of 7.6% on 2025 and will provide for both the continued funding of existing schemes as well as a series of new measures.  Table D sets out funding for existing schemes of €390 million for an “ Increase in pension and IDC scheme recipients ” to cover demographic-related changes including ageing and population growth, increased disability incidence as well as other recipient increases across these schemes. The estimates are based on a projected increase in recipients of c.30,000 across Pension and Illness, Disability and Carers schemes in 2026. This recipient growth is broken down as follows:      Programme Area      Recipient change 2026   (Before Impact of New Developments)      Pensions    Approx. 21,500      Illness, Disability and Carers    Approx. 8,500     Separately, €1,152 million was allocated to the Department of Social Protection in 2026 for Key Policy Adjustments . This expenditure category covers increases in social welfare payment rates, the expansion of eligibility for schemes and the introduction of new supports to deliver enhanced services for citizens.  This allocation will fund the planned increase in the Carer’s Allowance income disregard to €1,000 per week for a single person and €2,000 per week for a couple from July 2026. The Department of Social Protection costed this measure at €10 million in 2026. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_290",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 291. Deputy Louise O'Reilly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the breakdown of the estimated 30,000 additional recipients across the pension, illness, disability and carers schemes respectively, in tabular form; and if he will make a statement on the matter. [65199/25] ",
        "debateSection": {
          "showAs": "Budget 2026",
          "debateSectionId": "dbsect_285",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_285",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_285.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "memberCode": "Louise-O'Reilly.D.2016-10-03"
        },
        "questionNumber": 291,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 289, 290 and 291 together.  As set out in Table D on page 128 of the Budget 2026 Expenditure Report, an additional €2,036 million will be allocated to the Department of Social protection in 2026. This represents an increase of 7.6% on 2025 and will provide for both the continued funding of existing schemes as well as a series of new measures.  Table D sets out funding for existing schemes of €390 million for an “ Increase in pension and IDC scheme recipients ” to cover demographic-related changes including ageing and population growth, increased disability incidence as well as other recipient increases across these schemes. The estimates are based on a projected increase in recipients of c.30,000 across Pension and Illness, Disability and Carers schemes in 2026. This recipient growth is broken down as follows:      Programme Area      Recipient change 2026   (Before Impact of New Developments)      Pensions    Approx. 21,500      Illness, Disability and Carers    Approx. 8,500     Separately, €1,152 million was allocated to the Department of Social Protection in 2026 for Key Policy Adjustments . This expenditure category covers increases in social welfare payment rates, the expansion of eligibility for schemes and the introduction of new supports to deliver enhanced services for citizens.  This allocation will fund the planned increase in the Carer’s Allowance income disregard to €1,000 per week for a single person and €2,000 per week for a couple from July 2026. The Department of Social Protection costed this measure at €10 million in 2026. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_291",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "showAs": " 83. Deputy Louise O'Reilly asked the Minister for Climate, Energy and the Environment the facilities that are in place for persons to ensure that they are getting the best value or are on the best plan for their energy usage; if he understands that people are paying more for their energy bills when discounts may be available, but they are not informed of them; if he has plans to improve this situation; and if he will make a statement on the matter. [64259/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_62.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_62",
          "showAs": "Energy Prices",
          "debateSectionId": "dbsect_62"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_83",
        "answerText": " Minister for Climate, Energy and the Environment  The electricity and gas retail markets in Ireland operate within a European Union regulatory regime wherein electricity and gas markets are commercial and liberalised. Operating within this overall EU framework, responsibility for the regulation of the electricity and gas markets, including the matters raised by the Deputy, is solely a matter for the independent regulator, the Commission for Regulation of Utilities (CRU). In line with long standing policy on deregulating price setting, CRU ended its regulation of retail prices in the electricity market in 2011, and in the gas market in 2014.  The Programme for Government acknowledges the increased energy cost pressures on households and businesses and commits to bringing forward additional measures to help contain energy costs. According to Eurostat, in the first half of 2025, Ireland had the fifth highest domestic electricity prices among European countries and eighth highest household gas prices. When comparing across countries using the Purchasing Power Standard (PPS), which adjusts for national price levels, Ireland ranks as the twelfth most expensive for both electricity and gas.  Switching energy providers in Ireland's competitive market can lead to households potentially saving hundreds of euros annually by switching from standard tariffs to the cheapest deals. Greater levels of switching between electricity providers increases competitiveness in the market which in turn pushes prices down as suppliers compete for customers. Regular switching, ideally every 12 months, helps customers access discounted rates and avoid the higher standard rates offered after introductory periods.  The CRU’s 2023 Energy Monitoring Report found that consumer switching rates were 12% for electricity customers and 14% among gas customers. This compares with average switching rates of 7.15% for electricity consumers in the EU25. That report highlighted the savings potential offered by consistent switching, finding that customers who had switched supplier each of the preceding four years could have saved €946 on electricity, €775 on gas or €2,018 on their dual fuel costs, in total over the period. The CRU monitors and publishes switching reports monthly and runs an information campaign each year to promote switching. Growing public awareness of the cost savings associated with switching, and of the potential to save money through switching to a time-of-use tariff and switching consumption to off-peak periods, has the potential to reduce a households’ energy bills.  My Department has established a Cross Government National Energy Affordability Taskforce (NEAT) to identify, assess and implement measures that will enhance energy affordability for households and businesses while delivering key renewable commitments and protecting security of supply and economic stability.  The first item in the taskforce work programme was the development of an interim report, which included measures for consideration to support customers in the coming Winter, to inform Budget 2026 discussions. This report is available on gov.ie. The taskforce will now proceed with further work to develop the Action Plan, including a programme of public consultation and stakeholder engagement. The Action Plan will be published in 2026. ",
        "questionNumber": 83
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "showAs": " 157. Deputy Louise O'Reilly asked the Minister for Housing, Local Government and Heritage when people in Skerries will be able to access a scheme for remediation and compensation for homes built with defective blocks; if he is aware that they have been waiting a considerable number of years for this scheme; and if he will make a statement on the matter. [64255/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_131.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_131",
          "showAs": "Defective Building Materials",
          "debateSectionId": "dbsect_131"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_157",
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) was commenced on 22 June 2023 which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023.  The scheme is now open to applications in five counties: Clare, Donegal, Limerick, Mayo and Sligo with comprehensive information of all aspects of the Scheme available on my Department’s website at the following link: www.gov.ie/en/service/8002e-enhanced-defective-concrete-blocks-grant-scheme/.  When a local authority that is not designated under the Scheme determines through the established mechanisms that homes within their functional area have been damaged by defective concrete blocks, they can seek to have the scheme extended to include any such county or part of such county.  Section 5 of the Act contains details on this process. This statutory designation process can commence upon a request by a local authority or by myself, as Minister, to the Housing Agency. The Agency thereafter carries out technical testing of dwellings in a given local authority administrative area. As soon as practicable after the completion of any testing, the Housing Agency shall make a recommendation to me whether an order to designate the whole or part of a local authority's administrative area should or should not be made by the Government.  I understand that Fingal County Council, in accordance with Section 5(7) of the Act submitted a request to the Housing Agency on 21 September, 2023 for inclusion in the scheme- this related to a small number of areas and properties in their administrative area. The Housing Agency appointed a Chartered Engineer from their existing framework panel to assist in their investigations and consultations. The investigations (including concrete block sampling and testing) and consultations required under the Act started in December 2023.  Subsequently, the Housing Agency received the concrete block test results from the properties sampled within the administrative area of Fingal County Council which showed that these properties were presenting signs of damage as a result of defective concrete blocks.  These test results provided the Housing Agency with the information required to appoint their Chartered Engineer to commence investigations and consultations.  The Housing Agency has confirmed to my Department that its investigations and consultations have now been completed.  I have received the report from the Housing Agency and I am currently considering the recommendations made. ",
        "questionNumber": 157
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "showAs": " 182. Deputy Louise O'Reilly asked the Minister for Social Protection if he can provide details of his Department’s involvement in the Letterkenny gift card scheme; if he can also provide details of similar schemes including, any cross-Border initiatives; and if he will make a statement on the matter. [64256/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_155.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_155",
          "showAs": "Cross-Border Co-operation",
          "debateSectionId": "dbsect_155"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_182",
        "answerText": " Minister for Social Protection  There is no such scheme in the Department of Social Protection, however, we believe Letterkenny Chamber runs a gift card scheme around this time each year to encourage shopping in the town. ",
        "questionNumber": 182
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "showAs": " 329. Deputy Louise O'Reilly asked the Minister for Children, Disability and Equality if she is aware of an ongoing industrial relations dispute in a State agency (details supplied); if she is aware that while this dispute remains unresolved, the State agency in question has put out tender for a contract to commission a report into said industrial dispute; if she has any plans to intervene; and if she will make a statement on the matter. [64260/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_210.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_210",
          "showAs": "Industrial Disputes",
          "debateSectionId": "dbsect_210"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_329",
        "answerText": " Minister for Children, Disability and Equality  Given that the entity in question does not fall under the remit of my Department, it would be inappropriate for me to comment on the issue the Deputy has raised. ",
        "questionNumber": 329
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03"
        },
        "showAs": " 380. Deputy Louise O'Reilly asked the Minister for Rural and Community Development and the Gaeltacht if he can provide details of the regulations governing Gael Coláistí, specifically, the procedures for making a complaint in the situation where parents are unhappy about the treatment of their children; and if he will make a statement on the matter. [64257/25] ",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_258.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_258",
          "showAs": "Irish Language",
          "debateSectionId": "dbsect_258"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_380",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  As I understand it, the Deputy's question relates to Coláistí Gaeilge, or Irish language colleges in the context of my department's Scéim na bhFoghlaimeoirí Gaeilge or the Irish Language Learners Scheme. This scheme exists in order to foster language acquisition and enrichment opportunities in the Gaeltacht outside of the post-primary education system for learners of the language. Under the scheme, my Department provides a subsidy payable to qualifying Gaeltacht households who provide accommodation for those attending an Irish course in any one of the c. 40 Irish language colleges operating under the scheme.  The Irish colleges' sector is essentially commercial in nature which differentiates it from the state education system. In light of this, any complaints regarding the manner in which a college operates  should be referred to the Directors of the college concerned.  A copy of my Department's regulations governing the operation of Scéim na bhFoghlaimeoirí Gaeilge can be obtained at the following link: www.gov.ie/ga/an-roinn-forbartha-tuaithe-agus-pobail-agus-gaeltachta/foilseachain/earn%C3%A1il-na-gcol%C3%A1ist%C3%AD-gaeilge-2/. ",
        "questionNumber": 380
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Louise O'Reilly  My question, as is often the case, is very straightforward. I am looking for information about the provisions that have been made concerning agencies and organisations which deliver services on behalf of the State, are funded by the State and have workers who want to be part of the auto-enrolment scheme but are concerned they are not funded to be able to do that. The Minister will well know the last time there was a cut to the budget of these agencies, they were told to find the savings from within their own envelope. That really did not work out well. \n Minister for Social Protection (Deputy Dara Calleary)  Gabhaim buíochas as an gceist. The auto-enrolment savings system, known as My Future Fund, will commence on 1 January 2026. My Department has had extensive engagement with employers, including those in the community and voluntary sector, and with Government Departments, since the release of the automatic enrolment strawman public consultation in 2018. Its impending implementation has been well flagged to all those groups since the enactment of the auto-enrolment Act in 2024 and extensively throughout this year. Therefore, employers have been given a substantial lead-in period to budget appropriately for its introduction, including through budget negotiation with sponsors where appropriate.  It is worth mentioning that, in response to feedback from that consultation, the design of the auto-enrolment system provides for phasing in of contribution rates over a decade. Employees will be required to make initial contributions of 1.5% of gross earnings, rising by 1.5% every three years until they reach a maximum contribution rate of 6% in year ten. These contributions will be matched on a one-for-one basis and on the same timeline by employer contributions and topped up by the State at a rate of €1 for every €3 contributed by the employee. That phased approach has arisen as a consequence of the consultations the Department has undertaken in the design of the system. For community and voluntary groups and employers generally, this approach gives clear certainty on the rates that will be applicable so as to facilitate the gradual absorption of labour costs.  My Department has been very proactive throughout this year - and indeed previously - in advising other Departments, including the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, about this issue.  I will be taking the opportunity again to remind my Cabinet colleagues in coming days. Automatic enrolment is starting on 1 January and no worker should be disadvantaged as a consequence. \n Deputy Louise O'Reilly  However, they are going to be disadvantaged if the Government does not fund them. Bearing in mind the hands-off approach that the Government takes to these agencies, we should remember that although it caused the homelessness crisis with its policies, it has asked people to come in to shore it up. Some of the agencies are funded only by the State, and if they do not have additional funding – I have checked in the budget and I do not see that there is any – it will simply mean they will have to try to find it from within their existing budgets, which means either pay cuts or cutting back on services. Neither of those options is viable.  I would like to hear from the Minister confirmation that he believes all those funded by the State will be in the desired position. As the Minister said, the contributions from the worker have to be matched by employer contributions. They have no capacity to raise money on their own. Therefore, is the State going to fund it, and can the Minister confirm that this morning? \n Deputy Dara Calleary  The position is that automatic enrolment is a legal requirement. Therefore, the employers will have to give access to My Future Fund to employees aged between 23 and 60 and earning over €20,000 who do not have an existing payroll-connected pension.  We have made it very clear in the Department that this is happening. The point has been made at official level, including to the Department of public expenditure, that this is happening on 1 January and that people need to make provision. We have also made the point to all employers across the State.  We have worked closely with groups such as ICTU in relation to this. I attended a really good seminar with ICTU a few weeks ago, on 23 October. ICTU is fully behind this and is very aware of it. In fact, it was very frustrated that we did not introduce this in September. It has been engaging with its members across the country to get ready for it.  I want to make it very clear that this is not an opt-in for employers, regardless of who they are. If there is an employee who fulfils the criteria and who is not linked through payroll to a pension at the moment, he or she will be covered. \n Deputy Louise O'Reilly  The Minister and I know they are covered, but my question is on whether they are funded. The Minister of State says he has had extensive engagement, and I absolutely do not doubt that for a moment. I would say his engagement was exceedingly extensive; however, as a result of his engagement, have his Department and other Departments confirmed that the agencies they fund to deliver services will be in a position to meet their obligations to all of their workers without having to cut back on services or wages? If they have not been given extra money and do not have the capacity to generate money, we are back to where we were at the time the Minister’s party crashed the economy, when it gave the instruction to people that they did not necessarily have to cut pay but had to cut back. The Government told them not to cut services, so in the end they did cut pay.  We can imagine that people who were burned before are very anxious to know if they are going to be in a capacity to join the scheme. The employers are anxious to know if they are going to be funded. My fear is that they are not funded at the moment and that we are going to end up in a situation where some people may be excluded or some agencies may have to make decisions that we do not want them to have to make. \n Deputy Dara Calleary  All employers have had seven years to get ready for and get used to this. We listened to their feedback on stepping the contributions and not introducing big contributions from the beginning.  I confirm that in the Department of Social Protection, the Estimates in respect of payments to the organisations do include costs for, say, community employment and Tús where they arise. We have engaged at senior official level and with the Secretaries General of other Departments advising them that automatic enrolment was coming in on 1 January and that they needed to ensure provision. I cannot account for every other Department, but, on the back of this discussion, I will be reminding all my colleagues this afternoon that this is happening.  It is a huge event for 750,000 to 800,000 workers who currently have no pension provision. This is not a silver bullet. I want to be very clear that My Future Fund is not going to be the answer to everybody’s problems, but it is happening on 1 January. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_71",
        "debateSection": {
          "debateSectionId": "dbsect_18",
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_18",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_18.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 71,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 71. Deputy Louise O'Reilly asked the Minister for Social Protection the provisions that have been made to ensure that agencies, organisations, charities and service providers funded by his Department will be able to meet their obligations under the new auto-enrolment scheme. [62181/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Louise O'Reilly  This relates to the commitment given in the programme for Government to phase out the means test for the carer’s allowance. I am genuinely struggling to understand the timeline the Minister has in his head. He told me, via a parliamentary question, that it will cost more than €600 million. He has only budgeted €10 million for next year, which is a partial year, so it works out at €20 million. By that logic, it would take 30 years to get to €600 million. I am interested in finding out how many additional people will benefit from the 2026 measures so that we can have an idea of how it is going to work going forward. \n Deputy Dara Calleary  The programme for Government, as the Deputy knows, commits to increasing the carer’s allowance disregard, with a view to phasing it out over the lifetime of the Government, which is another four years. Removing the means test is a significant shift in policy direction and, therefore, this is a prudent and sustainable approach for us to take.  I announced further improvements in budget 2026 to the carer’s allowance means test. They will be introduced in July 2026. For carers who work, the weekly income disregard will increase by 60% from €625 to €1,000 for a single person and from €1,250 to €2,000 for carers who are part of couple. This means, for example, that a carer in a two-adult household with an income of approximately €110,000 will still retain their full carer’s payment. Even those with an income of €138,000 will gain a partial payment.  There have been a number of changes to the scheme in recent years that have resulted in significant growth. The number of carers on the scheme has increased by 65% in the past ten years and the expenditure on the scheme has doubled to over €1.2 billion. The scheme is demand-led and it is also likely that many people who are currently outside the means threshold may not have previously applied for the carer’s allowance. On that basis, it is difficult to estimate potential inflow from this measure. I assure Deputy O’Reilly and other Deputies that the number of payments being made under the scheme is not budget capped. We are looking at a range of figures, including census figures and other declarations as to who is a carer, to monitor the potential inflow into the scheme. We will consistently publish data on take-up in quarterly statistical releases.  As in previous years, when there has been an increase to the disregard, if people are on a reduced rate of carer's allowance due to their means, they are due an increase in their weekly payment. Their rate of payment will be automatically increased.  The change of the disregard will come into effect in July 2026. This gives my Department ample time to raise awareness of the changes and give the kind of detail ahead of the changes the Deputy is looking for. \n Deputy Louise O'Reilly  Forgive me but I am still none the wiser. Following on from the budget announcement, I submitted a parliamentary question to the Department. It told me that the budgeted €10 million only covers existing recipients. By implication, the 3,000 people the Department estimates will benefit from the measure are people who are already in receipt of carer’s allowance. Am I right on that?  Presumably, the 53,000 people the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation says could potentially be eligible will all have to be brought in the system when the means test is abolished. How many of them will come into the net? How is the Minister going to do that over the next four years? Has he set a target? What the Minister is telling me is that the €10 million is not a fixed amount and, somehow, it can be expanded upon. That is not budgeted for, however. Can he explain, given that the 3,000 people coming in as part of this tranche are already in receipt of carer’s allowance, how many of the 53,000 who are not in receipt of it, will come in and in what year will they do so, from now until the end of the Government’s term? \n Deputy Dara Calleary  I cannot give the Deputy that breakdown immediately but I will try to get it to her. I think she is just looking for a breakdown. It is hard to know because many people, who are not currently in receipt of carer’s allowance and never submitted an application because they did not qualify, will now apply. As I said, expanding the threshold to include couples with an income of €104,000 means there will be a lot of people, who never engaged with my Department before, engaging with it for the first time. We will give the Deputy an estimate of the number we expect to come from that.  We will also be able to give the Deputy an estimate towards the end of this year as to how many extra people have come in as a consequence of the changes introduced in July 2025. It is difficult to estimate potential inflow with precision, but we will give the Deputy the figures based on the changes to date. I will try to give the Deputy as much information as I can regarding that figure. I am not fully sure where she is getting that figure of 53,000. I did not hear it. \n Deputy Louise O'Reilly  It is from the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation. \n Deputy Dara Calleary  I will engage with the Deputy in that regard. I want to abolish the means test over the course of this Government and during my time in this Department. I am also focused on those existing payments and ensuring those who are existing carers are properly rewarded for their extraordinary work. I am trying to reach a balance. If I have four years in this Department, I will abolish it, but I am also trying to work with the carers’ organisation on those existing carers. \n Deputy Louise O'Reilly  I know the Minister’s ambition is to abolish the means test. I am not disputing that but if he cannot tell me how he is going to do it, he will forgive for being somewhat sceptical about the commitment. It is a little bit like the however many thousand houses the Government was going to build. That was an ambition as well. Ambition is not going to put money in the bank account of carers or bring those carers who are not currently eligible into the net.  I welcome the fact that the Minister has said he will provide me with some of the information. The figure of 53,000 comes from the Department of public expenditure and reform. The question those 53,000 people currently not in receipt of carer’s allowance, who may potentially benefit, would like me to ask is when they will be included. They are currently not getting compensation for the care and work they do. I know the ambition is to abolish the means test by the end of the Government’s term, but there has to be a plan. It cannot simply be the case that everyone suddenly comes into the net five minutes before midnight on the day before the Government ends. There is a need for a plan, targets and figures. I am asking for them to be shared with me and the House. \n Deputy Dara Calleary  This is not just words and ambition. There was a 60% increase in the budget for the carer’s allowance income disregard. That has never been seen before. That means that households with an income of €110,000, and up to €138,000, become eligible for a social protection payment. That is actually happening. It will happen from 1 July next year. That is real and I want to continue with those kinds of levels of increases.  As I said, I also have an eye to existing carers. I wish to ensure they are properly regarded. That is why we work closely with the carers’ organisation in relation to this and other issues. That is why we have a carer’s forum every year well in advance of the budget process. First, it helps alert people to the fact these changes have happened because we want to ensure people have the information. Second, it allows us to work with the carers’ organisations in a partnership way as to how we get this done.  An increase of 60%, combined with the fact that people with an income of €138,000 are now eligible for a payment under the Department of Social Protection, shows my seriousness and intent. It is not just ambition; this is actually happening. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_73",
        "debateSection": {
          "debateSectionId": "dbsect_20",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_20",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_20.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 73,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 73. Deputy Louise O'Reilly asked the Minister for Social Protection for an estimate of the number of new people who will be eligible to receive carer’s allowance following budget 2026; if he will explain to carers who are currently excluded by the means test exactly when they will be made aware of when they will become eligible; the amount his Department is prepared to spend on the relaxation of the carer’s means test, given that this was not made clear in the budget 2026; and if he will make a statement on the matter. [62427/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The microsimulation model, Simulating Welfare, Income Tax, Childcare and Health policies (SWITCH) is produced and managed by the Economic, Social and Research Institute (ESRI), based on data drawn from the Central Statistic Office's Survey on Income and Living Conditions (SILC).  While the ESRI provides user access to SWITCH to a number of Government Departments, including the Department of Social Protection, it is the ESRI who develop, update and make any changes to SWITCH, and who have access to the detailed underlying SILC data.  The SWITCH version used by my Department is that provided by the ESRI.  As the developer of SWITCH, the ESRI is best placed to answer questions regarding variables and any potential differences in the ESRI SWITCH model and that provided to Government Departments.  My Department uses the SWITCH model provided by the ESRI primarily to undertake distributional impact assessments, which provide an analysis of the change in disposable income for different household types and income quintiles following any potential changes in social welfare measures.  This analysis enables my Department to make evidence informed decisions on potential social welfare Budget measures and to see the indicative impact of confirmed Budget measures. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_106",
        "debateSection": {
          "debateSectionId": "dbsect_128",
          "showAs": "Departmental Policies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_128",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_128.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 106,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 106. Deputy Louise O'Reilly asked the Minister for Social Protection the reason his Department uses a different model of SWITCH compared to that of the ESRI; the reason for the choice to use a simplified model; if he will provide a breakdown of the specific differences between the SWITCH models used by the Department and the ESRI; to provide a breakdown of variables available in the ESRI SWITCH model that are not available to the Department, in tabular form; if he is aware of the impact this has or the limitations it could impose on Department poverty and child poverty targets; and if he will make a statement on the matter. [62183/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  Energy credits are a matter for the Minister for Climate, Energy and the Environment.  The Government is committed to protecting vulnerable households from the impact of energy costs through a combination of financial supports, energy efficiency awareness initiatives and investment in programmes to improve the energy efficiency of the housing stock.  In this regard as part of Budget 2026 the Government has provided significant targeted support to those people who most require help with their energy costs.  From January the Fuel Allowance will be increased by €5 per week to €38.  This will support over 450,000 households who most require Government support with their energy costs.  Also, in recognition of the importance of helping low paid working families, the Fuel Allowance is extended to Working Family Payment recipients.  This will benefit over 43,000 families and is a significant measure in tackling child poverty.  This measure will be paid from March next year but their entitlement to the Fuel Allowance scheme will be backdated to January.  Also, from September 2026, those who move from Disability Allowance or Blind Pension to Employment will be able to retain the Fuel Allowance for 5 years.  The supports provided by the Government are cross-departmental and, in this regard, my Department is represented on the Energy Poverty Action Group, with the overall strategy to combat Fuel Poverty and Energy Poverty under the remit of the Department of Climate, Energy and the Environment.  Finally, my Department provides Additional Needs Payments as part of the Supplementary Welfare Allowance scheme to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources.  Any person who considers that they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service.  There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  In addition, applications can be made online via www.mywelfare.ie.  I hope this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_108",
        "debateSection": {
          "debateSectionId": "dbsect_130",
          "showAs": "Fuel Prices",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_130",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_130.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 108,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 108. Deputy Louise O'Reilly asked the Minister for Social Protection in view of his withdrawal of energy credits and the steady increase in households seeking financial support with energy costs, the additional supports or measures he will provide above what has already been committed to in Budget 2026 to address this rising need; and if he will make a statement on the matter. [62185/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  Carer's allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that, as a result, they require that level of care.  There are currently 103,696 people in receipt of CA and the projected expenditure for 2025 is approximately €1.24 billion.  In general, social welfare schemes with a number of complex qualifying conditions such as CA can take longer to process.  For example, to qualify for CA the carer must show that they are habitually resident in the State, that they are providing full-time care and attention to a person who requires this level of care, and that their means are less than the statutory limit.  The time taken to process an application is also dependent on the information available.  Some applications require more detailed investigation and interaction with the customer and this can further lengthen the timeframe for processing.  As a result of the many variables outlined above, the information requested by the Deputy is not available.  I hope this clarifies the position for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_139",
        "debateSection": {
          "debateSectionId": "dbsect_161",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_161",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_161.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 139,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 139. Deputy Louise O'Reilly asked the Minister for Social Protection the number of hours spent implementing the means-test for carer’s allowance; the cost of this work to implement the means test; and if he will make a statement on the matter. [62182/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System.  The aim of introducing AE is to address the employee pension coverage gap that exists in Ireland and to provide employees with greater comfort and security regarding their retirement income.  The new system - to be known as My Future Fund - will commence from 1 January 2026.  The implementation of My Future Fund will pave the way for around 750,000 employees to be brought into a retirement savings scheme for the first time and I look forward to its implementation.  As the focus of My Future Fund is on providing employees with a retirement savings scheme, it is designed on the basis of an employer-employee relationship and the contributions are also defined in terms of that relationship.  The automatic enrolment and re-enrolment processes of My Future Fund are designed around an employer's operation of a payroll system (either manual or automatic and either by themselves or by an agent).  Accordingly, it will not apply to the self-employed as currently designed and implemented.  That is because there isn't an employer-employee relationship and so some different design around contributions would be required.  Payments to self-employed individuals do not usually follow normal payment cycles and do not usually occur through a payroll system, and so finding a mechanism for automatically enrolling such individuals would need to be developed.  Additionally, payments to self-employed individuals can be very varied and can change dramatically over years - where people take little money in the early years of their business and so may not meet eligibility thresholds, and where they take considerable amounts in later years and seek to maximise their contributions, which may be in excess of the thresholds in My Future Fund.  In the Department's analysis of auto-enrolment systems in other countries, it wasn't evident that the self-employed were successfully included in their designs because of these considerable differences.  Accordingly, an entirely different type of system would be needed for self-employed individuals.  Self-employed people usually engage with financial matters more readily than employees, and quite often, pension planning is a part of the overall financial planning of their enterprise.  In that context, it's worth noting that the self-employed already have access to supplementary pension coverage in the commercial market, e.g., through Personal Retirement Savings Accounts, and can avail of generous tax reliefs from the State when contributing to such personal pension products.  The current focus is on implementing and bedding in the system for approx. 750,000 employees.  In publishing the \"Design Principles for Ireland’s Automatic Enrolment Retirement Savings System\" in 2022, the Government set out how the system may evolve in the future, and as part of that, included consideration of broadening the system to include those outside the ‘employee’ cohort such as the self-employed and the non-working while noting that both may require different models of contributions.  These matters will, in time, be considered by NAERSA, as part of its analysis and research role, and may form part of any recommendations it may make to the Minister accordingly.  I hope this clarifies matters for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_142",
        "debateSection": {
          "debateSectionId": "dbsect_164",
          "showAs": "Pensions Reform",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_164",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_164.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 142,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 142. Deputy Louise O'Reilly asked the Minister for Social Protection whether he has any plans to adapt auto-enrolment to cater for self-employed people; if he has any plans to provide an alternative for them; if he will outline the options of unemployed people; and if he will make a statement on the matter. [62186/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 162 and 163 together.  There are no agencies under the aegis of the Department of Foreign Affairs and Trade.  My Department works with a number of civil society organisations in the realisation of key foreign policy priorities, including in the delivery of Irish Aid, the Government of Ireland's international development programme.  A full list of civil society partners funded by Irish Aid is available in its annual reports which can be found here:  Annual reports | Ireland.ie www.ireland.ie/en/irish-aid/news-and-publications/annual-reports/.  In addition to Irish Aid funding, other schemes operated by my Department to support the delivery of our priorities at home and abroad include:  • Emigrant Support Programme  • Reconciliation and Shared Island Funding  • Communicating Europe Initiative  Further information on these schemes may be found at: Department of Foreign Affairs and Trade funding www.gov.ie/en/department-of-foreign-affairs/services/department-of-foreign-affairs-and-trade-funding/.  My Department has a Memorandum of Understanding with the Charities Regulatory Authority which provides a framework for sharing information on Irish NGOs in receipt of such funding.  Finally, my Department works closely with a number of domestic and international partners to provide guidance and support to Irish citizens in difficulty or distress abroad and who are in need of consular assistance in cases such as deaths, arrests, imprisonments, serious injuries, missing persons, citizens with mental health difficulties, and other emergencies. Civil society partners in Ireland include Crosscare, Safe Home Ireland, the Kevin Bell Repatriation Trust and the Samaritans. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_162",
        "debateSection": {
          "debateSectionId": "dbsect_182",
          "showAs": "Departmental Expenditure",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_182",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_182.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Foreign"
        },
        "questionNumber": 162,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 162. Deputy Louise O'Reilly asked the Tánaiste and Minister for Foreign Affairs and Trade the provisions which have been made to ensure that agencies, organisations, and charities funded by his Department will meet their obligations under the new AE scheme. [62468/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 162 and 163 together.  There are no agencies under the aegis of the Department of Foreign Affairs and Trade.  My Department works with a number of civil society organisations in the realisation of key foreign policy priorities, including in the delivery of Irish Aid, the Government of Ireland's international development programme.  A full list of civil society partners funded by Irish Aid is available in its annual reports which can be found here:  Annual reports | Ireland.ie www.ireland.ie/en/irish-aid/news-and-publications/annual-reports/.  In addition to Irish Aid funding, other schemes operated by my Department to support the delivery of our priorities at home and abroad include:  • Emigrant Support Programme  • Reconciliation and Shared Island Funding  • Communicating Europe Initiative  Further information on these schemes may be found at: Department of Foreign Affairs and Trade funding www.gov.ie/en/department-of-foreign-affairs/services/department-of-foreign-affairs-and-trade-funding/.  My Department has a Memorandum of Understanding with the Charities Regulatory Authority which provides a framework for sharing information on Irish NGOs in receipt of such funding.  Finally, my Department works closely with a number of domestic and international partners to provide guidance and support to Irish citizens in difficulty or distress abroad and who are in need of consular assistance in cases such as deaths, arrests, imprisonments, serious injuries, missing persons, citizens with mental health difficulties, and other emergencies. Civil society partners in Ireland include Crosscare, Safe Home Ireland, the Kevin Bell Repatriation Trust and the Samaritans. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_163",
        "debateSection": {
          "debateSectionId": "dbsect_182",
          "showAs": "Departmental Expenditure",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_182",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_182.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Foreign"
        },
        "questionNumber": 163,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 163. Deputy Louise O'Reilly asked the Tánaiste and Minister for Foreign Affairs and Trade for a breakdown of every agency, not-for-profit organisation, charity or service provider directly funded by his Department; and the details of each specific directly funded post in each body, in tabular form. [62473/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Climate, Energy and the Environment  My Department does not directly fund any not-for-profit organisation, charity or service provider. With regards to agencies under my Departments aegis, the following are directly funded:-  • Environmental Protection Agency (EPA)  • Sustainable Energy Authority of Ireland (SEAI)  • Inland Fisheries Ireland (IFI)  • Loughs Agency (North South Body funded on a 50:50 basis between Ireland and Northern Ireland)  • Maritime Area Regulatory Authority (MARA).  Funding provided directly to agencies and bodies under aegis of my Department funds the operations, including all associated posts. The details of each specific post funded in this way is an operational matter for each agency, and as such the Deputy may wish to contact those agencies directly. Contact details are set out in the attached document for ease of reference.  List of Agencies under the aegis of Department of Climate, Energy and the Environment     Agency    Email      Bord na Mona    oireachtas@bnm.ie      CRU    oireachtas@cru.ie      Eirgrid    oireachtas@eirgrid.ie      EPA    oireachtasqueries@epa.ie      ESB    oireachtas@esb.ie      IFI    oireachtas@fisheriesireland.ie      INPC    enquiries@nora.ie      Loughs Agency    oireachtasqueries@loughs-agency.org      MARA    oireachtas@mara.gov.ie      NORA    enquiries@nora.ie      SEAI    oireachtas@seai.ie      ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_171",
        "debateSection": {
          "debateSectionId": "dbsect_189",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_189",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_189.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Climate"
        },
        "questionNumber": 171,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 171. Deputy Louise O'Reilly asked the Minister for Climate, Energy and the Environment for a breakdown of every agency, not-for-profit organisation, charity or service provider directly funded by his Department; and the details of each specific directly funded post in each body. [62474/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Finance  The introduction of the Automatic Enrolment Retirement Savings System, known as AE, is a landmark reform, and important Programme for Government Commitment, designed to get people to save for their retirement earlier, thereby helping them to sustain a reasonable standard of living in their old age. It is also designed to support the long-term sustainability of the pension system more generally.  As the Deputy is aware the operation of AE is a matter for the Minister for Social Protection. It will be administered by the National Automatic Enrolment Retirement Savings Authority (NAERSA). Responsibility for employer compliance with the scheme lies with NAERSA. Revenue, will provide payroll data to NAERSA who will then use this in identification and enrolment of eligible employees.  With regard to the Bodies under the Aegis of my Department, the Credit Union Advisory Committee (CUAC), Credit Union Restructuring Board (ReBo), and Disabled Drivers Medical Board of Appeal (DDMBA), which come under the Department of Finance Vote 7, do not have any employees.  The Minister for Finance has no involvement in the payroll or pension decisions of the remaining Bodies under the Aegis. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_228",
        "debateSection": {
          "debateSectionId": "dbsect_240",
          "showAs": "Pensions Reform",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_240",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_240.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Finance"
        },
        "questionNumber": 228,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 228. Deputy Louise O'Reilly asked the Minister for Finance the provisions that have been made to ensure that agencies, organisations and charities funded by his Department will be able to meet their obligations under the new AE scheme. [62454/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I wish to advise the Deputy that a deferred reply will be issued to her in respect of this Parliamentary Question, in line with Standing Order 52(1)(b). ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_233",
        "debateSection": {
          "debateSectionId": "dbsect_245",
          "showAs": "Pensions Reform",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_245",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_245.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Public Expenditure"
        },
        "questionNumber": 233,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 233. Deputy Louise O'Reilly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the provisions which have been made to ensure that agencies, organisations, and charities funded by his Department will meet their obligations under the new AE scheme. [62478/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I wish to advise the Deputy that a deferred reply will be issued to her in respect of this Parliamentary Question, in line with Standing Order 52(1)(b). ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_234",
        "debateSection": {
          "debateSectionId": "dbsect_246",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_246",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_246.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Public Expenditure"
        },
        "questionNumber": 234,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 234. Deputy Louise O'Reilly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for a breakdown of every agency, not-for-profit organisation, charity or service provider directly funded by his Department; and the details of each specific directly funded post in each body. [62481/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Education and Youth  The Department of Education and Youth welcomes the upcoming commencement of the Auto-Enrolment Retirement Savings System in January 2026, which will be administered by the National Automatic Enrolment Retirement Savings Authority (NAERSA).  Responsibility for employer compliance with the scheme lies with NAERSA. Revenue, will provide payroll data to NAERSA who will then use this in identification and enrolment of eligible employees.  Employers will be required to complete their profile on the MyFutureFund employer portal using their Revenue Online Services (ROS) credentials before January 2026 to ensure they are compliant with their obligations under the legislation. They must ensure that their payroll systems are capable of calculating and submitting contributions, and that employee contributions are matched in accordance with the scheme’s requirements.  It is important to note that all employers, to comply with the legislation underpinning MyFutureFund, regardless of their status or funding arrangements. This also includes where employees are on short term contracts or working multiple part-time jobs.  As part of the 2026 Budgetary process, additional funding has been provided to support auto-enrolment costs arising in organisations funded through the Department. This funding will be allocated across the education and youth sectors as part of the Revised Estimates process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_272",
        "debateSection": {
          "debateSectionId": "dbsect_280",
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_280",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_280.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 272,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 272. Deputy Louise O'Reilly asked the Minister for Education and Youth the provisions which have been made to ensure that agencies, organisations and charities funded by her Department will meet their obligations under the new AE scheme. [62467/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Education and Youth  I am attaching a list of the bodies under the aegis of my Department and a list of the organisations recorded on the financial management system of my Department as having charitable status that are in receipt of direct funding from my Department. The system does not record payees as being not-for-profit organisations and it is, therefore, not possible to provide information in relation to this.  My Department does not hold information in respect of directly funded posts in charities or not for profit organisations. Details of staff employed in bodies under the aegis of my Department will be supplied directly by the bodies to the Deputy.  CHARITIES:     ABILITY WEST      ARDEE CONCERT BAND      ASSOCIATION OF COMMUNITY AND COMPREHENSIVE SCHOOLS      BANNA CLUAIN MEALA      BELONG TO YOUTH SERVICES      BROTHERS OF CHARITY SERVICES CLARE      BROTHERS OF CHARITY SERVICES GALWAY      BROTHERS OF CHARITY SERVICES IRELAND WEST REGION      BROTHERS OF CHARITY SOUTHERN SERVICES      CHILDVISION LIMITED      COMBINED SERVICES THIRD WORLD FUND      COPE FOUNDATION      CRAOBH OSRAI COMHALTAS      CROSS BORDER ORCHESTRA OF IRELAND      CULLEN PIPE BAND      DAUGHTERS OF CHARITY DEVELOPMENT CENTRE DUBLIN      DUBLIN CHORAL FOUNDATION CLG      DYSLEXIA IRELAND      EDMUND RICE TRUST LTD      ENNIS BRASS BAND      FERMOY CONCERT BAND      FIGHTING WORDS      GAISCE - THE PRESIDENTS AWARD      HEANET      IRISH ARCHITECTURE FOUNDATION      IRISH GUIDE DOGS FOR THE BLIND      IRISH PIPE BAND ASSOCIATION      IRISH PRIMARY PRINCIPALS NETWORK      IRISH SCIENCE OLYMPIAD      JIGSAW      KERRY TRAVELLERS HEALTH AND COMMUNITY DEVELOPMENT PROJECT      LEARGAS      MUSIC GENERATION      NABMSE      NALA      NATIONAL ASSOCIATION FOR THE DEAF      NATIONAL IRISH SAFETY ORGANISATION      NEWBRIDGE VTC - KARE      NEWTOWNMOUNTKENNEDY COMMUNITY CENTRE LTD.      NORTHSIDE PARTNERSHIP LTD      ORDER OF MALTA      PRESENTATION BROTHERS SCHOOL TRUST      PUBLIC SERVICE FRIENDLY SOCIETY      SISTERS OF CHARITY      SOCIETY OF THE HOLY CHILD JESUS      SPRAOI AGUS SPORT FAMILY CENTRE CLG      ST AGNES COMMUNITY CENTRE FOR MUSIC AND THE ARTS      ST GABRIELS CENTRE      ST HILDAS SERVICES      ST RAPHAELS VTC      STATISTICAL AND SOCIAL INQUIRY SOCIETY OF IRELAND      STEWARTS CARE LIMITED      THE SANCTUARY      WATER SAFETY IRELAND      YOUNG SOCIAL INNOVATORS LTD      YOUTH WORK IRELAND       AEGIS BODIES:     An Chomhairle um Oideachais Gaeltachta agus Gaelscolaíochta (COGG)      Educational Research Centre (ERC)      National Council for Curriculum and Assessment (NCCA)      State Examinations Commission (SEC)      Teaching Council      National Council for Special Education (NCSE)      CARANUA - Residential Institutions Statutory Fund      The Commission to Inquire into Child Abuse      Residential Institutions Redress Board (RIRB)      Residential Institutions Review Committee (RIRC)      ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_273",
        "debateSection": {
          "debateSectionId": "dbsect_281",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_281",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_281.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 273,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 273. Deputy Louise O'Reilly asked the Minister for Education and Youth for a breakdown of every agency, not-for-profit organisation, charity or service provider directly funded by her Department; and the details of each specific directly funded post in each body, in tabular form. [62472/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders.   Replies not received from the Department for Questions Nos. 314 and 315.  ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_313",
        "debateSection": {
          "debateSectionId": "dbsect_306",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_306",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_306.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 313,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 313. Deputy Louise O'Reilly asked the Minister for Housing, Local Government and Heritage the breakdown of every agency, not-for-profit organisation and charity or service provider directly funded by his Department; and the breakdown of each specific directly funded post in each body, in tabular form. [62458/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The report quoted as part of the question was published by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitilisation and is the responsibility of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitilisation to address. The Minister for Social Protection cannot comment on a report published by another Minister. Officials in the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitilisation have indicated that they will answer the question, if and when it is re-submitted. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_353",
        "debateSection": {
          "debateSectionId": "dbsect_342",
          "showAs": "Departmental Budgets",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_342",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_342.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 353,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 353. Deputy Louise O'Reilly asked the Minister for Social Protection whether the €10 million euro allocated towards the relaxation of the carer’s means test comes under €1,152 million for 'Key policy adjustments' or from the €390 million 'increase in pension and illness, disability, carers scheme recipients'; and if he will make a statement on the matter. [62428/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The report quoted as part of the question was published by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitilisation and is the responsibility of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitilisation to address. The Minister for Social Protection cannot comment on a report published by another Minister. Officials in the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitilisation have indicated that they will answer the question, if and when it is re-submitted. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_354",
        "debateSection": {
          "debateSectionId": "dbsect_343",
          "showAs": "Departmental Budgets",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_343",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_343.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 354,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 354. Deputy Louise O'Reilly asked the Minister for Social Protection whether funding for new recipients of the carer’s allowance, who would not have qualified under the current income disregards but who will qualify on foot of the budget 2026 measure, is allocated from the €390 million 'increase in pension and illness, disability, carers scheme recipients' or elsewhere; and the amount he plans to allocate to this; and if he will make a statement on the matter. [62429/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The report quoted as part of the question was published by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitilisation and is the responsibility of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitilisation to address. The Minister for Social Protection cannot comment on a report published by another Minister. Officials in the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitilisation have indicated that they will answer the question, if and when it is re-submitted. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_355",
        "debateSection": {
          "debateSectionId": "dbsect_344",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_344",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_344.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 355,
        "by": {
          "memberCode": "Louise-O'Reilly.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Louise-O'Reilly.D.2016-10-03",
          "showAs": "Louise O'Reilly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 355. Deputy Louise O'Reilly asked the Minister for Social Protection for a breakdown of the estimated 30,000 additional recipients across the pension, illness, disability and carers schemes respectively, in tabular form; and if he will make a statement on the matter. [62430/25] "
      }
    }
  ]
}