{
  "head": {
    "counts": {
      "questionCount": 9757,
      "resultCount": 9757
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Children in the care of the State are some of the most vulnerable individuals in our society. The Department and Tusla are committed to promoting safe and high-quality practice in all areas of alternative care, including in relation to protecting this vulnerable cohort from the risk of sexual exploitation and child trafficking.  The Child Sexual Exploitation Procedure was developed in 2021 to assist Tusla social workers, care workers in recognising indicators of child sexual exploitation, making appropriate referrals where such concerns exist and responding to cases where children may be at risk of sexual exploitation.  The procedure sets out the pathways for reporting concerns of child sexual exploitation to An Garda Síochána, for children who are in the care of Tusla, under Operation Cosnaím, and for children who reside in a community setting, through the local Garda District.  As part of “Operation Cosnaím” all concerns of suspected child trafficking and/or child sexual exploitation regarding a child who is in the care of Tusla, must be notified to a centralised point in the Garda National Protective Services Bureau.  Since early 2022, Tusla has partnered with MECPATHS, a non - profit organisation which focuses specifically on the issue of child trafficking in Ireland. This collaboration is intended to raise awareness and provide frontline staff across Tusla services with training on Child Trafficking in Ireland, thus increasing the agency’s capacity to respond to this evolving area of need.  As of our last update, over 900  Tusla staff, including those working in State Care including Residential Care, Fostering and Adoption, intake and duty, and the Unaccompanied Minors and Separated Children’s Team (SCSIP Service) have participated in MECPATHS workshops.  I am aware of a recent meeting request from MECPATHS to discuss their important and vital work, and I am currently seeking an opportunity to meet this request.  The Department and Tusla have previously met with An Garda Síochána on child human trafficking and labour exploitation and the implementation of the National Referral Mechanism under the Criminal Law (Sexual Offences and Human Trafficking) Act 2024. This Act places the identification and protection of victims of human trafficking on statutory footing and expands the number of bodies that can identify a victim beyond An Garda Síochána.  The National Referral Mechanism is a framework through which States fulfil their obligations to protect and promote the human rights of trafficking victims, working in partnership with civil society. Ireland’s new National Referral Mechanism will make it easier for victims of trafficking to come forward, be identified and access advice, accommodation, and support. The National Referral Mechanism, which is yet to commence, will name Tusla as a ‘Competent Authority.’  The establishment of the National Referral Mechanism and the timeframe for its implementation, rests with the Minister for Justice, Home Affairs and Migration.  In relation to child trafficking and exploitation, coordination and co-operation, across Government and in the best interests of children, is essential.  I have recently published the Child Care (Amendment) Bill 2025. The Bill will revise and update the Child Care Act 1991 and is aimed at reflecting changes in child welfare and protection services in Ireland, and capturing current legislative, policy and practice developments.  The Bill will provide for greater cooperation and coordination across agencies and departments, promoting a more agile response across the State in keeping children safe from harm. Some of the key features of the bill include:  • The introduction of a duty to cooperate between relevant bodies, such as Tusla, government departments and others. This will require organisations to cooperate proactively in performing their existing functions relevant to the development, welfare and protection of a child.  • A clear basis for the sharing of information between agencies and organisations when they are working together on child protection and child welfare matters under the new duty to cooperate.  Tusla continues to take the issue of potential Child Sexual Exploitation and Child Trafficking very seriously, and are committed to promoting safe and high quality practice in all areas of Alternative Care, including working with An Garda Síochána as required. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 5. Deputy Peadar Tóibín asked the Minister for Children, Disability and Equality the steps her Department is taking to tackle the rate of exploitation by criminal gangs of children in the State care system; if she will meet with an advocacy group (details supplied) which is working to reduce child trafficking in Ireland; and if she will make a statement on the matter. [71834/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_55",
          "debateSectionId": "dbsect_55",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_55.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_5",
        "questionNumber": 5
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 35. Deputy Peadar Tóibín asked the Minister for Children, Disability and Equality the number of children in State care or known to child protection services who died as a result of suspected foul play, homicide, murder and manslaughter in each of the past 15 years; and if she will make a statement on the matter. [71660/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_35",
        "questionNumber": 35
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question relates to operational information held by Tusla, the Child and Family Agency, the question has been referred to the Agency to reply directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 41. Deputy Peadar Tóibín asked the Minister for Children, Disability and Equality the number of children in State care who have died in the past fifteen years, by the breakdown of the cause of death; and if she will make a statement on the matter. [71661/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_83",
          "debateSectionId": "dbsect_83",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_41",
        "questionNumber": 41
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question relates to operational information held by Tusla, the Child and Family Agency, the question has been referred to the Agency to reply directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 62. Deputy Peadar Tóibín asked the Minister for Children, Disability and Equality the number of children who have reported they were victims of human trafficking while in State care in each of the past five years. [71659/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_105",
          "debateSectionId": "dbsect_105",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_62",
        "questionNumber": 62
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 89. Deputy Peadar Tóibín asked the Minister for Children, Disability and Equality the number of children currently missing from Tusla’s care; and the longest length of time any one child has been missing. [71657/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_133",
          "debateSectionId": "dbsect_133",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_89",
        "questionNumber": 89
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 91. Deputy Peadar Tóibín asked the Minister for Children, Disability and Equality the total number of children who have been reported missing from Tusla’s care since the agency was founded; the number located; and the number whose whereabouts remains unknown. [71658/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_135",
          "debateSectionId": "dbsect_135",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_135.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_91",
        "questionNumber": 91
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 141, 143 and 290 together.  The Climate Action Plan sets out policies, measures and actions to be taken to achieve sectoral emissions ceilings for the residential sector. These measures include the retrofit of existing homes and installation of heat pumps to support the achievement of the required emissions reductions.  The National Retrofit Plan sets out the Government’s approach to delivering on these targets. The plan itself is built on four key pillars of demand, supply, financing and governance, with actions and initiatives flowing from each.  A range of measures has been introduced under the National Retrofit Plan across recent years to support continued growth, including simplifying application processes, expanding eligibility, prioritising worst performing homes, expanding deep retrofits, growing the numbers of One Stop Shops, as well as progressing projects piloting new supports.  The measures introduced are translating into delivery. SEAI data show that in the ten years since 2015 almost 274,000 home energy upgrades were supported and, of these, almost 60,500 were to a BER B2 or better energy efficiency rating, representing sustained and significant increases each year. This is despite the significant interruption across most of 2020 and 2021 due to the COVID-19 pandemic. Regarding 2025, data from SEAI to end November show the number of home energy upgrades at 52,416 of which 23,304 were to a BER rating of B2 or higher.  Budget 2026 announced a record Exchequer funding allocation of €558 million from the carbon tax for SEAI residential and community energy upgrades, including the Solar PV Scheme. This is an €89 million increase on last year’s carbon tax allocation and means that more funding than ever will be available to make homes warmer, healthier and less expensive to heat.  Increasing the uptake of energy efficiency measures among homeowners continues to be a key priority for my Department working in partnership with the SEAI. Further policies and measures will be introduced on an annual basis to support the achievement of our retrofit and heat pump targets.  The most recently published statistics for SEAI residential and community energy retrofit programmes by scheme, county, measure type, and more can be found on the SEAI website at: www.seai.ie/grants/home-energy-grants/home-upgrades ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 143. Deputy Peadar Tóibín asked the Minister for Climate, Energy and the Environment the number of homes which have been deep retrofitted in each of the past ten years, and to date in 2025; and if he will make a statement on the matter. [71619/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_143",
        "questionNumber": 143
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 222 and 229 together.  I can confirm that I met the chair of the Irish Fiscal Advisory Council, Seamus Coffey, within my first week of appointment as Minister of Finance last month, to discuss some of the key economic and fiscal issues facing Government.  The Council plays a key role in our budgetary process. Engagement has been ongoing with the Council throughout my time as Minister of Finance, most recently when I appointed Professor Karina Doorley as the latest member to join the board of the Irish Fiscal Advisory Council.  The Fiscal Assessment Report was published on 26th of November by the Council in relation to Budget 2026 . This publication is in fulfilment of the Council's legal mandate to assess the Government's budgetary forecasts.  Budget 2026 was framed to protect jobs, maintain our competitiveness and address the infrastructure deficit in an environment of unprecedented uncertainty in the global economy.  My formal response to the Fiscal Assessment Report will address several of the key issues raised by the Council. This response will be published on my Department’s website in due course. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 222. Deputy Peadar Tóibín asked the Tánaiste and Minister for Finance the engagement he has had with the Irish Fiscal Advisory Council since he took office. [71608/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_236",
          "debateSectionId": "dbsect_236",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_222",
        "questionNumber": 222
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 222 and 229 together.  I can confirm that I met the chair of the Irish Fiscal Advisory Council, Seamus Coffey, within my first week of appointment as Minister of Finance last month, to discuss some of the key economic and fiscal issues facing Government.  The Council plays a key role in our budgetary process. Engagement has been ongoing with the Council throughout my time as Minister of Finance, most recently when I appointed Professor Karina Doorley as the latest member to join the board of the Irish Fiscal Advisory Council.  The Fiscal Assessment Report was published on 26th of November by the Council in relation to Budget 2026 . This publication is in fulfilment of the Council's legal mandate to assess the Government's budgetary forecasts.  Budget 2026 was framed to protect jobs, maintain our competitiveness and address the infrastructure deficit in an environment of unprecedented uncertainty in the global economy.  My formal response to the Fiscal Assessment Report will address several of the key issues raised by the Council. This response will be published on my Department’s website in due course. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 229. Deputy Peadar Tóibín asked the Tánaiste and Minister for Finance if his attention has been drawn to recent remarks by the Irish Fiscal Advisory Council (details supplied); and if he will make a statement on the matter. [71609/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_236",
          "debateSectionId": "dbsect_236",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_229",
        "questionNumber": 229
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Victims of Crime Fund provides funding to partner organisations delivering services to multiple victim cohorts; including victims of sexual exploitation, violent crime and human trafficking. Funding is allocated on the basis of services provided and victim needs, rather than by reference to a specific offence category. The funding enables the provision of services supporting victims at different stages of the criminal justice system. This includes the provision of emotional and practical support, information and advice on the rights of victims, court accompaniment services, specialised counselling services, helplines and accompaniment to Garda interviews for those who have experienced traumatic incidents; including victims of trafficking.  As a result, it is not possible to provide an itemised breakdown of expenditure attributable solely to human trafficking for the years 2023, 2024 and 2025, nor to disaggregate funding by offence type across civil society organisations, academic institutions, training providers or service providers. In addition, a number of actions relevant to combating human trafficking, including training, awareness-raising, operational activity and international engagement, are delivered within the existing budgets of statutory bodies such as An Garda Síochána, the HSE, Tusla and other Departments.  Funding under the Victims of Crime Fund is awarded through an open, transparent and competitive application process. Applications are assessed against set criteria, including governance standards, service delivery capacity, value for money and alignment with Government priorities. Grant allocations are published annually, and funded organisations are subject to rigorous reporting, monitoring and audit requirements. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 559. Deputy Peadar Tóibín asked the Minister for Justice, Home Affairs and Migration for an itemised breakdown on Anti-Trafficking Expenditure for 2023, 2024, 2025 and funds disbursed to civil society agencies, academic institutes, training providers, service providers and all other organisations and-or agencies in the State and outside of the State for education, awareness raising, service delivery, victim engagement, training and-or any other relevant associated costs; and if he will outline the transparent public-facing application processes involved in applying for funding and discretionary funding provided by the State; and if he will make a statement on the matter. [73342/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_532",
          "debateSectionId": "dbsect_532",
          "showAs": "Human Trafficking",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_532.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_559",
        "questionNumber": 559
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I can advise the Deputy that Tusla, the Child and Family Agency, reported a total of 5,866 children in care at the end of October 2025. Compared with the same period in 2024, this represents a 2% increase in the number of children in the care of the State.  5,054 , or 86% of those children were in foster care, either relative foster care or general foster care. 598 children, or just over 10% , were in a residential care placement. The remaining 222 children were reported as being in \"other\" placements, for example in supported lodgings, or a disability unit, or a special emergency arrangement.  In respect of protecting children in care from harm, the Child Care Act 1991 is the primary piece of legislation governing the alternative care system. The Act is a wide-ranging piece of legislation, which, at its core, seeks to promote the welfare of children who may not be receiving adequate care and protection.  Consequently, the Act sets out a detailed statutory framework, which includes but is not limited to provisions requiring Tusla to have regard to the best interests of the child, the thresholds for bringing children into care, the types of placements where they may be cared for, and the responsibilities of the State in respect of looking after these children.  It is worth noting that the child protection and welfare landscape in Ireland has changed greatly since the Act’s commencement, and like any other piece of legislation it requires updating from time to time. In the case of the 1991 Act, it is important to reflect changes in the child welfare and protection sector in Ireland and capture current legislative, policy and practice developments.  As Minister for Children, I recently sought and received cabinet approval to publish the Child Care (Amendment) Bill 2025. This Bill will better align Ireland’s legislation with the requirements of the UN Convention on the Rights of the Child and give further effect to Article 42A of the Constitution on the rights of the child. It contains new measures to strengthen inter-agency co-operation and national coordination on child protection. Designated public bodies will be required to proactively collaborate and share information to deliver more coordinated and effective services. This will strengthen to State’s ability to keep children in care safe from harm, and ensure that they have the supports they need to achieve their potential.  The placement of children in alternative care is also governed by Regulations and Standards for Foster Care, Residential Care, and Special Care. These Regulations and Standards set out the detailed criteria against which Tusla is inspected in its provision of alternative care services. The application of these Regulations and Standards promotes safe and high-quality practice in alternative care.  I will continue to work closely with Tusla and with other stakeholders to improve the delivery of high-quality care to children and young people. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 597. Deputy Peadar Tóibín asked the Minister for Children, Disability and Equality the current number of children in State care; and the steps her Department is taking to protect them from harm. [71835/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_571",
          "debateSectionId": "dbsect_571",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_571.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_597",
        "questionNumber": 597
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 14. Deputy Peadar Tóibín asked the Taoiseach when the Cabinet committee on housing will next meet. [71606/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_14",
        "questionNumber": 14
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 16 to 24, inclusive, together.  I attended the leaders’ summit at COP30 in Belém, Brazil, on 6 and 7 November. Coming a decade after the Paris Agreement and during a period of enhanced geopolitical turbulence, my attendance at the summit was an important opportunity to show Ireland’s continuing commitment to the objectives of the UN Framework Convention on Climate Change and the Paris Agreement to limit emissions in order to avoid the worst impacts of climate change. I delivered Ireland’s national statement on 6 November, highlighting the reality that climate change is no longer a distant threat and pointing to the remarkable litany of record-breaking climate events in the 12 months since COP29 in Azerbaijan, including Storm Éowyn which brought the strongest wind gusts ever recorded in Ireland and the highest storm surges on the western seaboard. We saw the damage that Storm Bram caused last week to counties all over the country. I also argued that the sharpest impacts of climate change are felt by the world’s most vulnerable people and countries and noted that no country can successfully address the crisis of climate change alone.  I participated in two thematic round tables with my fellow leaders to discuss climate issues of common concern. The first focused on \"Climate and Nature: Forests and Oceans\". I reiterated Ireland’s strong support for the agreement reached at COP15 to protect at least 30% of land and oceans by 2030. The second thematic session took the form of a panel discussion on \"Energy transition and ten years of the Paris Agreement: NDCs and financing\". I expressed Ireland’s commitment to ensuring a just and inclusive energy transition pathway for all nations. I also shared Ireland’s focus on accelerating the delivery of renewable generation. I also participated in a small round table hosted by President Lula da Silva and attended also by the United Nations Secretary General, António Guterres, on climate adaptation and resilience. I spoke of Ireland’s commitment in this area with 80% of our climate finance concentrated on adaptation.  I also attended an event launching the Tropical Forest Forever Fund, hosted by President Lula. This global initiative aims to finance the conservation of tropical forests. I reaffirmed Ireland’s commitment to the preservation and sustainable use of the Amazon rainforest. I announced Ireland’s commitment to provide €15 million over the next three years to the Amazon fund, with the aim of preventing and combating deforestation.  While in Belém, I also took the opportunity to visit the offices of the United Nations High Commission for Refugees, where I met with representatives of some of the refugees they work with, including indigenous people from the Amazon displaced by climate change. To date in 2025, Ireland has provided over €25.5 million in funding to UNHCR. \n Deputy Malcolm Byrne  I welcome the fact that the Taoiseach attended the COP in Brazil as head of Government. It is appropriate that he did so. I welcome his remarks while there. I ask the Taoiseach to consider that Ireland might consider hosting a future COP to raise awareness of the important issues he has outlined.  I do want to express concern that if we are going to reduce our own dependence on fossil fuels and get people out of cars, we have to provide them with a realistic public transport alternative. I am passionate about rail travel but unfortunately the M11 is increasingly becoming a car park every morning. The problem for those travelling along the M11 into the capital, unlike a number of other commuter routes, is that we do not have a realistic rail alternative. We have fewer services, worse rolling stock and more overcrowding than any other rail service. What particularly annoys me is the fact that yesterday, the rail project prioritisation strategy made no commitments whatsoever about improvements for the Rosslare rail line and further looked at abandoning the proposals to develop and reopen the Rosslare to Waterford rail line. If we are to provide a real alternative and reduce our dependence on fossil fuels and car use, there has to be a real public transport alternative. I want assurances that the Department of Transport has not abandoned the rail commuters along the Rosslare rail line. \n Deputy Naoise Ó Cearúil  I note that, following the Taoiseach's attendance at COP in Belém, the EU made a significant decision to permanently stop Russian gas imports and phase out Russian oil. Similar to Deputy Byrne, I wish to highlight the issue of reducing our reliance on fossil fuels in the context of significant investment in public transport, in terms of DART+ West, for example, going to Maynooth and then Kilcock. The prioritisation of DART+ South West was not announced. There is significant traffic and build-up on the N7, M7, N4 and M4, particularly the N7 coming from Naas, Sallins and Celbridge. Indeed, Deputy Shane Moynihan has raised it previously. We need to ensure that these key pieces of infrastructure are prioritised along the commuter line that is causing the greatest amount of traffic. \n Deputy Darren O'Rourke  One of the most effective ways we can reduce emissions is by encouraging people on to public transport. I want to raise the lack of public transport in Bellewstown, County Meath. A 13-year-old boy, James Black, has started a campaign there and has hundreds of petition signatures calling for a public bus services for the village of Bellewstown. Fair play and well done to him for that. He has got an amount of media attention about it. He is very articulate and very clear in what he is trying to achieve.  The connecting Ireland scheme in the Department of Transport is a very good one but it is underfunded and Bellewstown is not included in it. Will the Taoiseach increase funding to the connecting Ireland scheme and will he include Bellewstown, County Meath in it? \n Deputy Liam Quaide  We heard a lot during the last Government about how much more investment went into the National Parks and Wildlife Service but in east Cork and Waterford, the level of under-resourcing has been baffling. In east Cork, we have had no ranger for approximately 12 of the last 15 years. There has been no district conservation officer for 18 months and no regional manager in place for years over east Cork and Waterford. It is difficult to give precise figures for these vacancies, because the Department has been incredibly opaque in response to questions I have submitted on recruitment to the NPWS. In one response, the Minister referred to \"perceived vacancies\", as if we were all imagining those roles being vacant. Also, bizarrely, the Department will not give details of staffing by geographical area for \"operational security reasons\". This is akin to An Garda Síochána not sharing numbers of gardaí employed in a given division. The Department also will not give any information on recruitment campaigns being undertaken. Meanwhile, hedgerows and trees are being trashed with impunity and the whole idea of habitat protection looks more like a bad joke in this country. When are we going to see more transparency from the Department of heritage on staffing of the NPWS? When are we going to see those crucial roles in east Cork and Waterford filled? \n Deputy Peadar Tóibín  Today the Minister of State, Deputy Thomas Byrne, stated that the Mercosur deal held many benefits for the Irish farmers and the wider economy. He said that for Ireland, Mercosur could be a significant beneficiary. This is incredible. It is the Minister of State putting up the white flag of surrender in terms of Mercosur. It comes just a few days after the Government put up the white flag in terms of the Irish fishing industry. Make no mistake about it, the Mercosur trade agreement will damage the livelihoods of hundreds of thousands of farmers in this country. All the fine words about COP mean nothing if we are going to facilitate or allow Mercosur to go through. It beggars belief that at a time of climate crisis, we will be bringing in Brazilian beef, which is produced in an environmentally unfriendly way, by which forests are burnt down and land is overgrazed, not to mention the environmental cost of transporting all that beef from South America to Europe. Will the Government stop speaking from both sides of its mouth in terms of Mercosur? \n Deputy Ruairí Ó Murchú  It is difficult to believe that we are talking about rail services being cancelled. These are proposed new services that make complete sense because we want people to move to public transport. We know the advantages that exist in that regard. One of the new rail services that was being proposed between Clongriffin and Drogheda has been mothballed. This would have allowed for further express services to Dundalk, Drogheda, Newry and Belfast. Such services are absolutely necessary because they are allowed to skip slower services. What is happening does not make any sense at this point. Will the Taoiseach seek some clarity in respect of this matter? I other colleagues in expressing absolute anger if this is the road we are going to take. No pun intended. \n The Taoiseach  I thank Deputy Byrne for acknowledging that it was important to attend the COP, even though it was a long distance to go. We needed to send a signal given that we are at a point at which the issue of climate change is receding in terms of political prioritisation. This is a real concern. Some people are pulling back from their commitments.  On hosting a future COP in Ireland, next autumn we will have the largest ever political meeting held in Ireland. There will be over 40 states represented. It is a ginormous undertaking to host a COP, but it is something the country should aspire to do in the future. It depends on the shape and nature of a COP. In some ways it has become very big. Maybe it is has gone too far in some respects in the context of how it has evolved. We need to get back to the more fundamental origin and idea around COP, which was countries coming together to make decisions on global agreements in respect of sustainability, the future of the planet and the impact of climate change.  I will look at the matter of rail project prioritisation. I take on board what the Deputy said. We have a lot of projects that are needed. We do not have commensurate capital, but I will have a look at where the Rosslare railway line is. We put a lot of money into Rosslare on the custom side and all of that in the context of Brexit. We did it in double-quick time. Rosslare to Waterford is an important link. I will have a look at that to see what we can do and where we are. \n Deputy Malcolm Byrne  There is nothing on the roster----- \n An Ceann Comhairle  This is not a back-and-forth. \n The Taoiseach  I said I am going to have a look at it. The Deputy asked me to have a look at it, so I am telling him that I am going to have a look at it.  Deputy Ó Cearúil is correct on the moves we made in terms of dependency on Russian oil and gas. On public transport, it is key. I have spoken to the Ministers for public expenditure and Transport in respect of DART+ South West. That has gone through all the planning and is shovel ready. The county council has zonings for between 10,000 to 18,000 houses. It feels that this is essential infrastructure. I am seeing if we can do something to make that we progress the project. That is work I am engaged in at the moment with the relevant Ministers.  Deputy O'Rourke referred to public transport more generally and to a young person named James Black. I pay tribute to him for his civic initiative, participation and being involved in something like that in terms of public service for Bellewstown. I will talk to the Minister and make him aware of that. On Connecting Ireland, I take on board the Deputy's views.  Deputy Quaide referred to the National Parks and Wildlife Service, NPWS. There has been huge investment in recruitment. The investment in the NPWS has more or less doubled since 2020. I took a personal interest in this. I worked previous with the then Minister, Malcolm Noonan, on it and continue to work on it with the Minister of State, Deputy Christopher O'Sullivan. Recently, we announced a €700,000 lifeline for Fota Wildlife Park through the NPWS because of the understanding work that Fota does in respect of conservation of particular species and so forth. I will engage with NPWS in respect of the issues the Deputy has raised to see if we can throw some light on the situation.  Deputy Tóibín referred to Mercosur. There was no agreement on that. It was not put to COREPER last Friday. I do not have the up-to-date information, but it seems unlikely now that it will put before COREPER before Christmas. What we have undertaken to do is work with like-minded countries, particularly France and Italy----- \n Deputy Peadar Tóibín  What is our position? \n The Taoiseach  -----in terms of securing additional safeguards. Quite a significant number of safeguards have been secured. That is contrary to what was there a year ago. They are taking the form of legal instruments that the Commission has committed to.  We succeeded in securing the nitrates derogation. It is a significant advancement that we now have that for a further three years. It was challenging and difficult. We worked hard with the Commission to get it over the line. Approximately 200,000 tonnes of Mercosur beef come into Europe on an annual basis as it stands. The new initiative under Mercosur would allow 99,000 of those to be brought in under a reduced tariff preference. The Minister of State, Deputy Thomas Byrne, spoke about the wider issues around Mercosur. All trade agreements bring benefits and losses. There is no any heresy in saying that. The Canada deal was tremendous for Ireland in terms of the increased exports for SMEs and so on. I accept that every agreement is different. At the moment, there is no sense of any breakthrough or agreement in respect of Mercosur. That is where we are at present.  Deputy Ó Murchú referred to the Clongriffin to Drogheda service. Capital is not limitlessness. \n Deputy Ruairí Ó Murchú  I get that. I was just wondering. \n The Taoiseach  If we were to add up the figures from everybody's contributions, I would guess that we would arrive at another €50 billion. We have to try keep things moving with planning in the context of progressing as many projects as we possibly can and to make sure that we have sustainability, financing and all of that. I will have to look at the rail prioritisation strategy that emerged on Friday. \n An Ceann Comhairle  I thank the Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 23. Deputy Peadar Tóibín asked the Taoiseach if he will report on his recent attendance at COP30. [71607/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Taoiseach's Meetings and Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_23",
        "questionNumber": 23
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I intend to meet with representatives of PDFORRA early in the New Year. I am very proud to be Minister for Defence and I know that the dedication, duty and patriotism demonstrated by members of our Defence Forces is second to none.  As you know, I launched the Defence Sectoral National Development Plan(NDP) 2026-2030 last week, which is worth €1.7 billion and is the most significant investment package in the Defence Forces in the history of the State. I am determined to ensure that members of our Defence Forces have the equipment, infrastructure and capabilities they need to operate safely and effectively, at home and abroad. The global geopolitical situation is more volatile today than at any time since the end of the Second World War.  I look forward to engaging with the Representative Associations, including PDFORRA and getting further insight into the issues of interest to them. I know a lot of progress has been made in recent years on pay and conditions. I am interested to hear the key issues currently affecting their members. I am also interested to hear PDFORRA's views on the implementation of the Working Time Directive. In short, I am committed to constructive and meaningful engagement with the Associations in the months and years to come. I very much appreciate the work of the Representative Associations on behalf of our personnel in the Defence Forces. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 99. Deputy Peadar Tóibín asked the Minister for Defence if she has had any engagement with an organisation (details supplied) since he took office. [71603/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_41",
          "debateSectionId": "dbsect_41",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_41.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_99",
        "questionNumber": 99
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My priority as Minister for Defence is to ensure that the operational capability of the Army, Air Corps and Naval Service is maintained and developed. This is to enable the Defence Forces to carry out the roles assigned by Government.  The capital funding of €1.7 billion allocated to Defence in the latest National Development Plan covering the period 2026 to 2030 represents an increase of €600 million on the previous baseline of €1.1 billion. The revised capital allocations will enable targeted progression on key elements of Government commitments within LOA 2 objectives.  The Commission on the Defence Forces recommended a programme of naval vessel replacement under Level of Ambition 2, to ensure a balanced fleet of a modern ships is reached early in the next decade, this has been accepted in principle by Government.  I intend to develop and finalise a long-term Capability Development Programme 2028 to 2040 which will identify and cost, at a high level, the capability requirements for the Defence Forces out to 2040 across all domains of operation including the maritime and subsea domain.  I also intend to bring a Regeneration Plan for the Naval Service to Government in the new year. This will address the challenges they faced in recent years. In finalising these plans, I as Minister and the Government will make evidence informed decisions on what the balanced fleet of modern ships should be, including decisions regarding the Multi-Role Vessel, and the greater use of technologies. These decisions will also be informed by other relevant information, including the new National Maritime Security Strategy which is expected shortly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 107. Deputy Peadar Tóibín asked the Minister for Defence the progress being made towards purchasing a ship to replace the LÉ Eithne, which was the former flagship of the Naval Service; and if she will make a statement on the matter. [71605/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_47",
          "debateSectionId": "dbsect_47",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_47.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_107",
        "questionNumber": 107
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Following the passing of resolutions in Dail Éireann and Seanad Éireann, the Defence Forces Tribunal of Inquiry was established by Statutory Instrument (S.I. 304 of 2024), on 20 June 2024.  The Tribunal of Inquiry will examine the effectiveness of the complaints processes in the Defence Forces concerning workplace issues relating to discrimination, bullying, harassment, sexual harassment and sexual misconduct. The Tribunal will also investigate the response to complaints made regarding the use of hazardous chemicals within Air Corps’ headquarters at Casement Aerodrome, Baldonnel.  The Terms of Reference provide that the Tribunal shall endeavour to complete its work within a three-year timeframe.  The Tribunal is entirely independent in its functions and information in relation to the work of the Tribunal can be found on its website at www.toidf.ie. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 125. Deputy Peadar Tóibín asked the Minister for Defence when it is expected that the tribunal examining the complaints process in relation to sexual abuse and discrimination in the Defence Forces will complete its work. [71604/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_64",
          "debateSectionId": "dbsect_64",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_64.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_125",
        "questionNumber": 125
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  At the outset, I wish to recognise the outstanding contribution made to the State by our ex-service personnel. As a reflection of the deep respect the Government has for our Veterans, the Office of Veterans Affairs was formally established on 10th November 2025.  The intention of the Office is to engage within Government on matters pertaining to veterans. This will have a particular focus on the development of supports for veterans as a group and involve consulting other Government Departments who may be able to contribute to enhancing veterans’ access to benefits. The OVA will play a key role going forward in coordinating matters relating to veterans and understanding the veteran community.  The primary areas of responsibility for the office will be on partnership with the Veterans Associations, advocacy on behalf of veterans as a group, research into the issues affecting veterans and consideration of the issues involved in drafting a Veterans Policy.  The Office will continue to facilitate financial support by way of annual subvention provided by the Department of Defence through ongoing engagement with two recognised Veterans Associations, the Organisation of National Ex-Service Personnel (ONE) and the Irish United Nations Veterans Associations (IUNVA). Under the Service Level Agreements, the subvention currently stands at €173,000 to ONE and €40,000 to IUNVA per annum.  Dormant Accounts funding is also made available to assist both ONE and IUNVA with specific special projects. To date, €1,100,000 in funding has been allotted to the Veterans Associations and further funding will continue to be made available in 2026. I recently had the pleasure of opening a new Veteran Training Centre for IUNVA which was funded in part by Dormant Account Funding and will ensure that Veterans can continue to train and connect after they leave active service. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 128. Deputy Peadar Tóibín asked the Minister for Defence if she will report on the work of the new office of veteran affairs. [71601/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_128",
        "questionNumber": 128
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  SAFE (Security Action for Europe) is an EU instrument designed to provide Member States with up to €150 billion of loans backed by the EU budget to provide financial assistance to Member States to support their urgent public investments in defence industrial production, aiming to increase production capacity, improve the availability of defence products and address capability gaps.  In terms of the funding mechanism a decision was taken in conjunction with the Department of Finance and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation not to draw down funding via the loan mechanism at this time, but we will continue to engage constructively on the SAFE instrument.  I see significant value in the SAFE Regulation as an instrument to enhance the capabilities of Member States. Where appropriate, the Department of Defence will leverage the joint procurement opportunities offered under the SAFE Regulation to progress delivery of our capability requirements. By procuring jointly, we can achieve lower prices than we could alone. In addition, we won’t be competing against other Member States for limited resources. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 129. Deputy Peadar Tóibín asked the Minister for Defence if her Department is committed to the aims and objectives of the new European Union instrument-the SAFE (Security Action for Europe) Regulation; and if she will make a statement on the matter. [71602/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "European Union",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_129",
        "questionNumber": 129
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The right to freedom of thought, conscience and religion (more commonly referred to as freedom of religion or belief) is regarded as a fundamental freedom, provided for under Article 18 of both the Universal Declaration of Human Rights and the International Convention on Civil and Political Rights.  The promotion of freedom of religion or belief is a priority for Ireland’s international human rights engagement.  We advance this freedom both in our multilateral and bilateral engagements. Most recently, at the UN General Assembly’s Third Committee in October, Ireland restated our concern for the persecution of people on the basis of their religion. In particular, we condemned all acts of hatred during the interactive dialogue with the Special Rapporteur on Freedom of Religion or Belief.  Ireland is a member of the International Contact Group of Freedom of Religion or Belief and the International Holocaust Remembrance Alliance. We continue to work within the EU to address the persecution of persons on the basis of their religion or belief. The current EU Action Plan for Human Rights and Democracy 2020 – 2024 (now extended to 2027) includes an express reference to stepping up action to combat discrimination on any ground, including religion or belief.  Ireland is not a member of the International Freedom of Religion or Belief Alliance though this is a matter we keep under active review. However, we are committed members of the related groups to which Ireland already belongs. Ireland has an unwavering and strong commitment to the promotion of freedom of religion or belief.  In regards to the Special Envoy for the Promotion of Freedom of Religion or Belief at the EU, this is a position which is filled by the European Commission. It is our understanding that the position has been without a representative since December 2024. We note that the President of the European Commission, Ursula von der Leyen, has committed to filling the position and we look forward to working with the new Special Envoy once appointed. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 169. Deputy Peadar Tóibín asked the Minister for Foreign Affairs and Trade the consideration given for Ireland to join the International Freedom of Religion or Belief Alliance; and the work that has been undertaken to secure the appointment of a Special Envoy for the Promotion of Freedom of Religion or Belief at the EU. [71637/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_169",
        "questionNumber": 169
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Getting more Gardaí on our streets to improve community safety and to prevent and detect crime is my first priority as Minister. This Government is committed to ensuring that An Garda Síochána has the resources it needs, and I was very pleased to secure unprecedented funding in Budget 2026 of €2.59 billion to support recruitment and staffing.  Recruitment into An Garda Síochána is now gathering real momentum. Overall, 794 trainees have entered the Garda College this year, the highest number since 2018. There was also significant interest in two Garda recruitment competitions, with over 11,100 people applying to join An Garda Síochána in 2025. This demonstrates that there is a strong and sustained interest in a career as a Garda amongst the public.  In the interest of transparency, An Garda Síochána publishes information in relation to the allocation of Gardaí nationally. This includes a breakdown of Probationer Gardaí assigned by Division and training station nationwide, and this can be found at the following link: www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ .  The Deputy should select the most recently available date and then select the file titled ‘Allocation of Probationer Garda by Division and Station to the most recent date\" to access a breakdown of Garda members.  A total of 1218 Gardaí have attested from the Garda College in 2024 and 2025 (including the most recent November attestation). ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 670. Deputy Peadar Tóibín asked the Minister for Justice, Home Affairs and Migration the number of Gardaí recruited in each of the past 24 months, in tabular form. [71359/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_531",
          "debateSectionId": "dbsect_531",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_531.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_670",
        "questionNumber": 670
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Under Section 33 of the Policing, Security and Community Safety Act 2024 the Garda Commissioner is responsible for the management and administration of Garda business, which includes all internal HR matters, such as retirements and resignations. Furthermore, under Section 34(1) of the same Act, the Garda Commissioner is independent in the performance of his functions.  I am advised by the Garda authorities that the following table outlines the number of Gardaí who have retired and resigned from An Garda Síochána in 2023, 2024 and 2025 as of 31 October. Figures include Voluntary, Compulsory and Cost Neutral Early Retirements, Resignations, Resignations not suitable for appointment and Resignation in lieu of dismissal. It has not been possible to collate a breakdown by month within the timeframe available.     Year    Number      2023    486      2024    379      2025    293*      Total    1158     *Figures as of 31 October 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 671. Deputy Peadar Tóibín asked the Minister for Justice, Home Affairs and Migration the number of Gardaí who left the force in each of the past 24 months, in tabular form. [71360/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_532",
          "debateSectionId": "dbsect_532",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_532.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_671",
        "questionNumber": 671
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The State Claims Agency (SCA) has a statutory remit to manage personal injury and third-party property damage claims on behalf of State authorities including the Health Service Executive (HSE). The SCA has provided me with the information set out below  The information contained within this response was extracted from the National Incident Management System (NIMS) and is correct as at the 15/12/2025.  The SCA has received 78 wrongful death claims, in respect of COVID-19, recorded across hospitals, nursing homes, HSE locations including community healthcare locations, COVID-19 vaccine programme locations and HIQA. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 963. Deputy Peadar Tóibín asked the Minister for Health the number of cases taken against the HSE by people whose family members died from Covid-19 in HSE run nursing homes and hospitals. [71781/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_774",
          "debateSectionId": "dbsect_774",
          "showAs": "Departmental Legal Cases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_774.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_963",
        "questionNumber": 963
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 964. Deputy Peadar Tóibín asked the Minister for Health the five-year survival rates for those diagnosed in public hospitals, private hospitals and designated cancer centres; and if she will make a statement on the matter.  [71782/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_776",
          "debateSectionId": "dbsect_776",
          "showAs": "Mortality Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_776.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_964",
        "questionNumber": 964
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The National Cancer Registry of Ireland (NCRI) has a statutory obligation to collate information in relation to national cancer incidence across all tumour types. This information will typically only be made available 2 to 3 years after the year of incidence, in keeping with international standards.  In answer to the Deputy's queries, a graph is set out in the link below outlining the age-standardised five-year net survival for breast cancer in Ireland for the period 2018-2022 which has been provided by the NCRI along with information on the most recent and comparable figures available in Europe.  The Government is committed to improving cancer care, ensuring better prevention, maintaining improvements in cancer survival rates, and timely access to treatments.   Five-year survival rate data  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 965. Deputy Peadar Tóibín asked the Minister for Health the details of Ireland's five-year survival rate for breast cancer; and if her Department holds data on the way in which this compares with Britain and other European standards. [71783/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_777",
          "debateSectionId": "dbsect_777",
          "showAs": "Mortality Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_777.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_965",
        "questionNumber": 965
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 966. Deputy Peadar Tóibín asked the Minister for Health the five-year survival rate for breast cancer in each county in the State; if a breakdown on survival rates is available across various social classes and incomes; and if she will make a statement on the matter.  [71784/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_778",
          "debateSectionId": "dbsect_778",
          "showAs": "Mortality Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_778.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_966",
        "questionNumber": 966
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The National Cancer Registry of Ireland (NCRI) has a statutory obligation to collate information in relation to national cancer incidence across all tumour types. This information will typically only be made available 2 to 3 years after the year of incidence, in keeping with international standards.  In response to the Deputy's queries, the table at the following link outlines the number of people diagnosed with cancer in each county in the State from 2013 to 2022, the most recent 10-year period for which complete incidence data is available, as provided by the NCRI.  The Government is committed to improving cancer care, ensuring better prevention, maintaining improvements in cancer survival rates, and timely access to treatments.   Number of people diagnosed with cancer 2013 to 2022  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 967. Deputy Peadar Tóibín asked the Minister for Health the number of people who have been diagnosed with cancer in each county in the State in each of the past ten years, in tabular form. [71785/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_779",
          "debateSectionId": "dbsect_779",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_779.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_967",
        "questionNumber": 967
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Central Statistics Office (CSO) publishes official statistics on deaths in Ireland through Vital Statistics publications. Vital Statistics reports are prepared by the CSO for the Minister for Social Protection in accordance with the provisions of Section 2 of the Vital Statistics and Births, Deaths and Marriages Registration Act, 1952 and Government Order SI 831 of 2007.  Data on deaths by date of occurrence is published by the CSO in the Vital Statistics Annual Report where all figures are classified by year of occurrence (available here: www.cso.ie/en/statistics/birthsdeathsandmarriages/vitalstatisticsannualreport). Information on deaths is only available for deaths which have been registered with the General Registers Office (GRO).  Deaths not registered during the year of occurrence or in the subsequent 22 months are not available for the Annual Report. The latest Annual Report with data on deaths by date of occurrence is for deaths occurring in 2023.  Deaths classified as unnatural deaths must be referred to the local Coroner for investigation. Investigations can take a protracted length of time to complete for various reasons which delays the registration of such deaths in time for inclusion in the Vital Statistics Annual Report. The exclusion of these cases can have a relatively more significant effect on the number of deaths classified to some external causes.  To account for late registered deaths (deaths registered after the publication of the Vital Statistics Annual Report i.e. registered more than 22 months after year-end of the year of occurrence), the CSO also publishes ‘Revised Deaths Occurring’ data.  The ‘Revised Deaths Occurring’ tables were created to take account of late registered deaths and update figures published at the time of previous Annual Reports. The CSO will continue to revise these figures over time to take account of further late registrations.  The data at the link below on deaths from cancer by county is sourced from the CSO PxStat Table VSA112: Revised Deaths Occurring (data.cso.ie/table/VSA112) for the years 2015 to 2022 to take account of revised data. For deaths occurring in 2023 the data is sourced from the Vital Statistics Annual Report 2023 (CSO PxStat Table VSA101: Deaths Occurring (data.cso.ie/table/VSA101).  Data is provided at the link below for the number of deaths with a cause of death of Malignant Neoplasm (C00-C99) for both sexes, by administrative area of residence (CSO publishes data by local authority administrative areas rather than counties) for the years 2015-2023.  In addition, data is set out at the link below for the standardised death rate per 1,000 population from Neoplasms by administrative area of residence for 2015-2023 (sourced from CSO PxStat Table VSD12: Standardised Death Rates (data.cso.ie/table/VSD12). The (age) standardised death rate is a weighted average of age-specific mortality rates. The weighting factor is the age distribution of a standard reference population. Standardised death rates at local authority level are calculated using the total population of the State for the reference year. Standardised Deaths Rates take account of differences in population structure across counties.  For the years 2015-2017 data is presented separately for North Tipperary and South Tipperary, from 2018 onwards data is presented for Tipperary.  The National Cancer Registry of Ireland publishes extensive information on cancer incidence, survival and mortality (www.ncri.ie/en).   Table 1    Table 2  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 968. Deputy Peadar Tóibín asked the Minister for Health the number of people who have died from cancer in each county in the State in each of the past ten years, in tabular form. [71786/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_781",
          "debateSectionId": "dbsect_781",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_781.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_968",
        "questionNumber": 968
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  I have asked the HSE to reply directly to the Deputy on this matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 969. Deputy Peadar Tóibín asked the Minister for Health the number of assaults on ambulance workers reported nationally in each of the past ten years. [71787/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_782",
          "debateSectionId": "dbsect_782",
          "showAs": "Ambulance Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_782.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_969",
        "questionNumber": 969
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 970. Deputy Peadar Tóibín asked the Minister for Health the number of adverse incidents reported through the National Incident Management System NIMS in each of the past ten years; the number of which were extreme, major, and the number which resulted in death or incapacity, in tabular form. [71788/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_783",
          "debateSectionId": "dbsect_783",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_783.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_970",
        "questionNumber": 970
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The State Claims Agency (SCA) has a statutory remit to manage personal injury claims on behalf of Delegated State Authorities including the Health Service Executive (HSE).  The table below sets out the budget allocations from the Health Vote to the HSE for payments to the SCA for each year since 2015 for the management and settlement of health related claims, including those relating to medical compensation.      Year      Amount allocated under the Health Vote to the Health Service Executive for payments to the State Claims Agency (€000)       2015    189,000      2016    198,000      2017    274,000      2018    320,000      2019    370,000      2020    400,000      2021    410,000      2022    530,000      2023    510,000      2024    485,000      2025    427,000       Budget allocation for health related claims from the Health Vote to the HSE for payments to the State Claims Agency.  The above figures include supplementary estimates provided, where relevant. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 971. Deputy Peadar Tóibín asked the Minister for Health the compensation budget for the HSE for each of the past ten years. [71789/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_784",
          "debateSectionId": "dbsect_784",
          "showAs": "Departmental Budgets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_784.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_971",
        "questionNumber": 971
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The State Claims Agency (SCA) has a statutory remit to manage personal injury and third-party property damage claims on behalf of State authorities including the Health Service Executive (HSE). The SCA has provided me with the information set out below.  The table at the following link shows amounts paid by the SCA in damages (including VAT where applicable) on associated claims, as well as a small number of incidents and inquests, from 01/01/2015 to 31/12/2024 against the HSE. Please note that, following the Sláintecare changes, the CHO Areas no longer exist within the HSE structure, and we are responding in respect of the six HSE Regions as set out below.  This data covers both the Clinical Indemnity Scheme (CIS) and the General Indemnity Scheme (GIS) and excludes claims recorded under other designated schemes.  The information contained within this response was extracted from the National Incident Management System (NIMS).   HSE Compensations 2015-2025  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 972. Deputy Peadar Tóibín asked the Minister for Health the amount paid out in compensation by the HSE in each of the past ten years, by each CHO area. [71792/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_785",
          "debateSectionId": "dbsect_785",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_785.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_972",
        "questionNumber": 972
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 973. Deputy Peadar Tóibín asked the Minister for Health the total amount owed to the HSE by patients or former patients who have not paid their hospital bills. [71793/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_786",
          "debateSectionId": "dbsect_786",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_786.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_973",
        "questionNumber": 973
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 974. Deputy Peadar Tóibín asked the Minister for Health the total amount paid by the HSE to debt collector companies in each of the past ten years. [71794/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_787",
          "debateSectionId": "dbsect_787",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_787.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_974",
        "questionNumber": 974
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The CervicalCheck Tribunal was established on 27 October 2020 under the CervicalCheck Tribunal Act 2019.   The number of claims made to the CervicalCheck Tribunal   Twenty-six [26] claims (of which two were combined) were lodged with the Tribunal.  Twenty [20] claims were lodged by women and six [6] claims were lodged by or on behalf of the statutory dependants of women.   The number of claims resolved by the Tribunal   All twenty-six [26] claims made to the Tribunal were processed.  Eighteen [18] claims were resolved on the basis of a settlement reached between the parties.  Seven [7] cases were resolved on the basis of a Notification issued pursuant to s.12 of the CervicalCheck Tribunal Act, 2019. This means that the claimants were notified by the Tribunal that it was not in a position to hear and determine the claim for want of either respondent or third-party consent in circumstances where such consent was either not forthcoming or had been withdrawn.  One [1] case was struck out when an ‘Unless Order’ came into effect.   Payments   The Tribunal did not make any payments.  Some of the 25 cases were settled between the parties, some were withdrawn and went to the High Court, and some were abandoned completely.  None went to a full hearing and, therefore, no awards were made by the Tribunal.  In a letter dated 31 July 2023, the Tribunal Chairperson informed the Minister for Health that all claims had been processed, and that as such the Tribunal’s core statutory functions had been completed.  Having completed its required administrative work and discharging any remaining obligations conferred upon the Chairperson, Judge Power submitted her resignation as Chairperson of the Tribunal on 18 April 2024. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 975. Deputy Peadar Tóibín asked the Minister for Health the number of persons who have availed of the CervicalCheck Tribunal to date; and the amount which has been paid out under the tribunal. [71795/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_788",
          "debateSectionId": "dbsect_788",
          "showAs": "Tribunals of Inquiry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_788.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_975",
        "questionNumber": 975
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The State Claims Agency (SCA) has a statutory remit to manage personal injury and third-party property damage claims on behalf of State authorities including the Health Service Executive (HSE). The SCA has provided me with the information set out below.  The information contained within this response has been extracted from the National Incident Management System (NIMS) and is accurate as of 10/12/2025.  The State Claims Agency (SCA) has received 409 CervicalCheck claims between 01/01/2015 and 09/12/2025, including 86 psychological claims brought by family members. Note, claim numbers may differ slightly from previous reports due to claim reclassifications in the intervening period.  Table 1 : Cervical Cancer NSS Claims Received between 01/01/2015 – 09/12/2025      Year Claim Created      Number of Claims       2015    0      2016    2      2017    1      2018    86      2019    52      2020    95      2021    103      2022    39      2023    14      2024    10      2025 (YTD)    7       Grand Total      409       ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 976. Deputy Peadar Tóibín asked the Minister for Health the number of cases which have been taken against the HSE over the alleged misreading of smear tests in each of the past ten years. [71796/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_789",
          "debateSectionId": "dbsect_789",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_789.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_976",
        "questionNumber": 976
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The health service was targeted by a criminally motivated cyber-attack in May 2021. The impact of this serious incident varied depending on the extent to which services relied upon technology, but in the main the ransomware attack had a devastating impact on the delivery of health services generally and specifically for patients who relied on them.  The HSE has invested significantly in cyber remediation since the cyberattack in 2021. An independent post incident report (PIR) commissioned by the board of the HSE following the attack, highlighted areas that needed to be addressed. The HSE have been very effective in addressing all issues highlighted since the publication of that report. Recommendations from that report were ranked such that the ones that would have the most immediate impact and could be implemented soonest, were pursued first.  There are multiple ongoing programmes of work focused on addressing all issues highlighted in the wake of the attack, reducing risk, building cyber resilience, and building additional cyber security capability and capacity through the establishment of a dedicated cyber security function under the leadership of a Chief Information Security Officer (CISO) within the HSE.  The cost of remediation of services in the aftermath of the 2021 cyberattack was estimated by the HSE to be €102m (as of Nov 2024). The costs of the cyber-attack will be updated to take account of individual settlements resulting from the outcome of legal cases taken against the HSE and that featured in the media this week.  The HSE continues to invest significantly in multi-layered cyber defences, including technology, processes, and people, in order to reduce the likelihood and impact of cyberattacks. The HSE allocated funding for specific actions within the voluntary sector also.  In order to address the ongoing risks associated with cyberattack and the need to build cyber resilience, the Government has provided additional, dedicated funding in recent years. There was an additional non-core funding of €40m in 2023, an additional allocation of non-core funding of €55m in 2024, and in 2025, the ICT & Cyber programme was allocated a total of €70m as part of core funding under the HSE National Service Plan. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 977. Deputy Peadar Tóibín asked the Minister for Health the total cost to the State associated with the cyber-attack on the HSE and her Department in recent years; and if she will make a statement on the matter. [71797/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_790",
          "debateSectionId": "dbsect_790",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_790.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_977",
        "questionNumber": 977
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 978. Deputy Peadar Tóibín asked the Minister for Health the number of persons who have contacted the HSE's drug and alcohol helpline in each of the past ten years. [71798/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_791",
          "debateSectionId": "dbsect_791",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_791.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_978",
        "questionNumber": 978
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 979. Deputy Peadar Tóibín asked the Minister for Health the number of persons who have undergone the HSE's suicide prevention training in each of the past ten years. [71799/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_792",
          "debateSectionId": "dbsect_792",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_792.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_979",
        "questionNumber": 979
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Department of Health is not responsible for the publication of statistics on the number of suicides in the State. The Central Statistics Office (CSO) publishes Vital Statistics for the Minister for Social Protection in accordance with the provisions of Section 2 of the Vital Statistics and Births, Deaths and Marriages Registration Act, 1952 and Government Order SI 831 of 2007. Vital Statistics include statistics on deaths by cause of death.  The CSO publishes quarterly Vital Statistics on all registered deaths as well as a Yearly Summary (available at: www.cso.ie/en/statistics/birthsdeathsandmarriages/vitalstatistics/). These reports record the number of deaths registered in that quarter or year by cause of death. Information on deaths is only available for deaths which have been registered with the General Registers Office (GRO).  Data on deaths by date of occurrence is published by the CSO in the Vital Statistics Annual Report where all figures are classified by year of occurrence i.e. the year in which the death occurred (available at: www.cso.ie/en/statistics/birthsdeathsandmarriages/vitalstatisticsannualreport/). Deaths not registered with the GRO during the year of occurrence or the subsequent 22 months are not available for the Vital Statistics Annual Report.  All deaths attributable to external causes are referred to the Coroner. Investigations can take a protracted length of time to complete. As such, these deaths are registered after the standard three-month time period, and can be later than the 22-month deadline for CSO annual Vital Statistics publications.  Data on deaths registered with a cause of death of ‘intentional self-harm’ are reported in all the CSO’s quarterly and annual Vital Statistics publications. However, as deaths due to external causes are reported to the Coroner's Office for further investigation, the number of registrations for any given period will likely underrepresent the number of deaths which have occurred due to suicide, accidents or other external causes of mortality. Given the impact of late registrations, the CSO introduced a range of additional tables for ‘Revised Deaths Occurring’ to take account of late registered deaths.  The CSO also publish a dedicated annual release on Suicide Statistics (available at: www.cso.ie/en/releasesandpublications/ep/p-ss/suicidestatistics2022/). The latest release was published in November 2025 and includes data on deaths occurring in 2022. In this release, the CSO indicates that ten years ago, in 2012, the number of deaths due to suicide stood at 585, noting that the 500 deaths due to suicide in 2022 represents a decrease of 14.5%. However, they underline that late registrations impact comparability across years. This provides an indication of a downward trend in suicides over the ten-year period 2012-2022, the latest year for which official CSO statistics on suicide are available.  The CSO-Suicide Mortality Statistics Liaison Group (see: www.cso.ie/en/aboutus/lgdp/cgt/ocg/csogroups/smslg/) works with a range of stakeholders, including the Department of Health, to improve the quality and timeliness of suicide statistics and their dissemination.  In response to the question, please find at the link below data extracted from the CSO’s PxStat database Table VSA35 (data.cso.ie/table/VSA35) Revised Deaths Occurring on the number of deaths with a cause of death of ‘X60-X84 Intentional self-harm’ for the ten years 2013-2022, the most recent available. These data will continue to be updated and revised by the CSO as a result of late registrations.  Data is not available on suspected suicides from the CSO’s Vital Statistics data.  In the last year, the Department of Health have established the National Probable Suicide Monitoring System (NPSMS) within the Health Research Board (HRB). The NPSMS is a new database which will collect and publish data on deaths by probable suicide in Ireland. As researchers will collect data from coronial files, including on probable suicides, i.e. not solely where the Coroner has determined a verdict of suicide, the NPSMS will provide data on more deaths than those recorded in the CSO data, and will have more in-depth information on the characteristics of people who have died by probable suicide.  Connecting for Life (CfL), Ireland’s national suicide reduction strategy, which came to an end in 2024, has guided suicide reduction efforts for the last decade.  Reducing deaths by suicide is a very complex task, but evidence and experience internationally shows that measurable improvements in suicide prevention can be achieved through effective cross-governmental work. Connecting for Life adopted this approach and suicide reduction initiatives have been advanced in many areas, including health, local government, justice, media, and agriculture.  Work to develop a successor suicide reduction strategy is well advanced. Connecting for Life has been formally evaluated, and the Department of Health has run a public consultation survey, which received approximately 1,900 submissions, and held 7 in-person consultation sessions. The significant response by the public to this consultation demonstrates the strength of feeling to reducing lives lost to suicide in our country. The voices of those with lived experience will be central to shaping our next national strategy.  The reports arising from the various aspects of the public consultation were recently published and these, along with the findings from the evaluation of Connecting for Life, will be invaluable in the development of Ireland’s next suicide reduction strategy.   Intentional Self-Harm  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 980. Deputy Peadar Tóibín asked the Minister for Health the number of suicides or suspected suicides in the State in each of the past ten years; if her Department holds data to indicate whether the suicide rate in increasing or decreasing; and if she will make a statement on the matter. [71800/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_793",
          "debateSectionId": "dbsect_793",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_793.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_980",
        "questionNumber": 980
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The repair of the Four Courts Dome is a complex conservation project which has been undertaken in two phases. The repair works to the Dome became and urgent requirement after a section of one of the stone capitals, which support the Dome, fell onto the roof below. The OPW immediately undertook a first phase of very detailed investigations and surveys of the entire Dome of the Four Courts and urgent repairs. For this first phase of works, from 2015 to 2021, the Office of Public Works entered into a specific contract for the design, erection, maintenance and regular redesign and alteration of the scaffolding structure as inspection, assessment and urgent repair requirements developed and progressed. The total direct cost of the scaffolding was €1,444,379.67 ex VAT.  Based on these investigations, and the external professional assessments undertaken, it was deemed essential that most of the stone capitals be replaced or repaired, as deemed necessary and that the perimeter steel support band be replaced. A second phase of major conservation and repairs was developed.  The Four Courts Dome Final Phase of Repairs - Main Contract was awarded in June 2023. This contract incorporated the provision of custom-designed scaffold access and structural propping to the entire Dome drum. The stone capitals have either been repaired or replaced, depending upon their structural condition. 18 top stone capitals and 16 bottom stone capitals have been replaced and 3 top stone capitals and 5 bottom stone capitals have been repaired. The perimeter steel support band has also been replaced. The tender award sum of the stone capitals carving contract was €626,800.00 (ex VAT). The tender award sum of the main works contract was €4,498,781.21 (ex VAT). The scaffolding works requirements are included in the overall works requirements and are not contracted, charged nor paid for separately. Contractor pricing of individual elements of a tender is commercially sensitive information and cannot be released.  It is anticipated that the works will be substantially completed by end of January 2026. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 67. Deputy Peadar Tóibín asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the costs of maintaining scaffolding that has been positioned around the dome of the Four Courts for the past number of years; and if he will make a statement on the matter. [70373/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_106",
          "debateSectionId": "dbsect_106",
          "showAs": "Court Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_106.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_67",
        "questionNumber": 67
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy, that the decision-making authority for any change of status, including school closures, is the patron/trustees of the school concerned, and it is open to any patron to submit proposals to the Department for consideration.  Any proposed change involves extensive consultation at local level and must be well planned and managed in a manner that accommodates the interests of students, parents, teachers, local communities and contributes to an inclusive education system.  The Patron and relevant stakeholders are also advised to consider the implications that any change of status proposal may have on factors such as school accommodation, funding, staffing and school transport so that an informed decision can be made.  As referred by the Deputy, in the past ten years two Gaelscoileanna have closed. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 116. Deputy Peadar Tóibín asked the Minister for Education and Youth the number of Gaelscoileanna which have closed in each of the past ten years. [70362/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_138",
          "debateSectionId": "dbsect_138",
          "showAs": "Schools Administration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_138.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_116",
        "questionNumber": 116
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Primary School Survey, which was launched on 4 November, is due to close on Tuesday 16 December.  The survey – the largest of its kind ever undertaken in Ireland – is school specific and aims to assess demand and preferences for different types of primary school provision including patronage/ethos, co-education or single-sex school provision and language of instruction (English or Irish).  Through the survey, my department is seeking clear information on the preferences of parents and guardians about the primary schools which their children currently attend, or will attend in coming years, on a number of important areas of primary school provision. The results of the survey will help my department plan how education is provided at primary level.  Parents, guardians, primary school staff and primary school Board of Management members have been invited to complete a survey.  I encourage all parents and guardian with children in primary school and all parents and guardians of children not yet in primary school to take this opportunity to complete a survey and “Have Your Say” about the primary school that your children attend now or will attend in the future. I also encourage all primary school staff and Board of Management members to complete a survey on your primary school.  The survey is not a final step. Where there is clear support for change to be considered, a further process of inclusive dialogue will begin.  The survey can be completed on [ www.gov.ie/primaryschoolsurvey ]  My department has robust arrangements in place to ensure the integrity and security of the primary school survey process. Arrangements for validating survey returns operate after survey returns are received as this facilitates ease of use for survey users.  Information regarding the survey can be accessed on [ www.gov.ie/primaryschoolsurvey ]. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 123. Deputy Peadar Tóibín asked the Minister for Education and Youth the purpose of the new primary school ethos survey announced in recent weeks. [70363/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_123",
        "questionNumber": 123
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  Improving the rate of participation of the Traveller community in third level education is one of the key priorities under the National Access Plan (NAP) 2022-2028.  The NAP identifies several key priority groups that are currently under-represented in higher education, including Irish Travellers and the Roma community.  The NAP target is for 150 new entrants from the Traveller and Roma communities each year to higher education by 2028. According to the Equal Access Survey, there were 40 self-declared Traveller new entrants to higher education in 2023/24.  The Programme for Access to Higher Education (PATH) is the main funding stream that supports the implementation of the NAP. PATH 5 was established as a three-year pilot to support access, participation and success for students from the Traveller and Roma communities with a dedicated sustainable funding stream of €1.35m, projects are currently ongoing.  In addition, Travellers, who are a named core target group in the NAP, are included in all strands of PATH programmes. I announced earlier this year that I was providing €2.8m for the Inclusive Environment fund to further build this fund includes funding ring fenced to support anti racism measures in Higher Education Institutions for Traveller and Roma students.  Together with the Department of Education and Youth and the Department of Children, Disability and Equality, my Department co-launched the Traveller and Roma Education Strategy in 2024. The strategy outlines the strategic direction for Traveller and Roma education policy for the next six years, covering education pathways from early years to higher education.  The strategy is guided by four  strategic pillars:  • Pillar 1. Participation and experience: Improve the learning experience of Travellers and Roma at all levels of the education system.  • Pillar 2. Outcomes: Ensure equity of access, opportunity and outcome for Travellers and Roma to fulfil their potential through our education system.  • Pillar 3. Partnership: Working together across the system and with the Traveller and Roma communities, including Traveller and Roma organisations, to support the delivery of this strategy.  • Pillar 4. Delivering Change: Drive the implementation of this strategy and implementation plan, monitor progress and evaluate the outcomes.  A Traveller and Roma Strategy Oversight Group was established to monitor progress. The group consists of representatives from relevant Departments and agencies, and the Traveller and Roma organisations.  The National Traveller and Roma Inclusion Strategy II (NTRIS) 2024 – 2028 is a whole of Government inclusion strategy to improve the lives of Travellers and Roma in areas such as Health, Housing, Education, and Employment.  The aims of NTRIS include:  • Achieving equality of education outcomes.  • Supporting an inclusive school community.  • Promoting a positive culture of respect and protection for the cultural identity of Travellers and Roma in education.  A pilot Student Accommodation Bursary was introduced last year to support students from the Traveller and Roma communities who are struggling to meet the costs associated with accommodation while attending Higher Education. Last academic year 68 students received supports under this scheme.  Other financial supports such as the SUSI grant and the 1916 Bursary are also available to eligible students from the Traveller and Roma communities.  Census 2022 revealed that 312 Travellers obtained a third-level qualification, which was almost double the Census 2016 figure of 167.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 246. Deputy Peadar Tóibín asked the Minister for Further and Higher Education, Research, Innovation and Science the steps his Department is taking to increase participation in higher education by members of the Travelling community; and if he will make a statement on the matter. [67803/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_259",
          "debateSectionId": "dbsect_259",
          "showAs": "Traveller Community",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_246",
        "questionNumber": 246
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy James Lawless  The Central Applications Office (CAO) is an independent private body, and as such, it is not within the remit of the department or the Minister.  The CAO publishes data on the number of applicants and acceptance of CAO offers on their website as a part of their annual media pack. The table below contains data on the acceptance of offers between 2015 and 2024.  For 2025, the CAO has advised that there were 89,308 applicants as of 1 July 2025. There were 54,032 net acceptances by the end of CAO Round 5, of which 47,634 were at Level 8 and 6,398 were at Level 6/7. 2025 figures may change slightly as the final audit processes are not yet completed.   Table 1. The Growth of the CAO System 2015 – 2024  ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 251. Deputy Peadar Tóibín asked the Minister for Further and Higher Education, Research, Innovation and Science the number of persons who did not take up their CEO offer of a university course in each of the past ten years; and if he will make a statement on the matter. [67804/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_251",
        "questionNumber": 251
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 11, inclusive, together.  The Government is committed to the delivery of a national security strategy and work is ongoing in finalising the strategy, co-ordinated by the national security secretariat in my Department and integrating inputs from a range of relevant stakeholders, including the Department of Foreign Affairs and Trade, the Department of Defence, the Department of Justice, Home Affairs and Migration, An Garda Síochána, the Defence Forces and the National Cybersecurity Centre.  The programme for Government, securing Ireland's future sets out a number of national security commitments, acknowledging that this is a time of upheaval, in particular geopolitical upheaval, with threats and challenges arising from a rapidly changing global geopolitical landscape. The preparation of a draft strategy covers a broad range of national security issues. There is necessarily a focus on the State’s internal security, including the evolving challenges we face from terrorism and extremism and from cyber threats, and a focus on the need to increase our investment in security and to modernise our legislation in the security field, notably in the investigatory powers available to our services. It will include also the implications of recent security, defence and international developments and their related impacts, notably the deteriorating security situation in Europe given Russia's ongoing war in Ukraine and the growth in cyber and hybrid threats in Europe. It will combine an enhanced maritime domain awareness with a prioritised focus on ensuring protection of critical maritime infrastructure, especially critical undersea infrastructure. The ongoing implementation of the report of the Commission on the Defence Forces and the modernisation of aspects of our defence legislation is also included in the preparations.  The National Cyber Security Centre has been placed under the remit of the Minister for Justice, Home Affairs and Migration. This is an important element of the realignment of our national security infrastructure, and a project has been initiated to establish this new statutory national security authority, led by the Department of Justice, Home Affairs and Migration. Earlier this year, I established the Ministerial Council on National Security, which comprises me as chair, the Tánaiste, the Minister for Foreign Affairs and Trade and for Defence, and the Minister for Justice, Home Affairs and Migration. The council will ensure that at the highest level there is a structured, ongoing review of our strategic national security interests and systematised monitoring of progress on delivering the Government’s commitments over the coming months, including the finalisation of the draft national security strategy. \n Deputy Tom Brabazon  As the Taoiseach is aware, drone sightings in Dublin Bay during the recent Zelenskyy visit underline and underscore the scale of our vulnerabilities and the urgency and need for preparing a strategic national security package. There are reports that international anti-drone units were deployed to Dublin during the visit to assist the emergency response unit. While we welcome the assistance of other states, we should not have to rely on others for our own defence. We should be self-reliant in the first instance. It should be expected that such activity will continue when Ireland takes over the EU Presidency next year, and a national security strategy would allow us to assess risks facing the State, including emergency aerial and technological threats, and set clear goals to guide Government and law makers. Can the Taoiseach provide an update to the House on the development of Ireland's national security strategy and an update on the drone sightings during the Zelenskyy visit? \n Deputy Albert Dolan  When we are talking about national security, it is vital we also give people confidence at a local level in our local security, particularly with regard to An Garda Síochána. In Galway East we have towns that are booming, thriving and growing such as Gort, Loughrea, Tuam and Athenry. Those towns are all feeding into Galway city. They have seen massive population increases and for those people to feel secure in those towns, we need an increase in our gardaí allocation and our gardaí numbers. More importantly, as the populations continue to grow in these towns, we need gardaí that become community gardaí, that the people know and connect with and can build relationships with into the future. These gardaí will serve the area. Our gardaí on the ground right now are working really hard but they need to be supported to handle the large caseloads right across the country but particularly in Galway East, we need additional gardaí. \n Deputy Paul Murphy  Does the Taoiseach think there is any national security implications for the significant decline in basic civil liberties that is happening in Britain, such as the proscription of organisations of Palestine protestors like Palestine Action, the denial of the right to a jury in the vast majority of trials and what is happening with the Palestine protesters who are charged with nothing more than property damage and who have been held for over a year without trial and without access to bail? The consequence is there are now eight protesters on hunger strike for over 30 days. This is the longest, most significant hunger strike since the H-block hunger strikers. Their demands are minimal, namely, the right to a fair trial, the right to access bail, the right to access medical care in prison and for the ending of the proscription of Palestine Action. There is an almost total media blackout on this in Britain, leading people to suspect there is a so-called D-notice in relation to this. Is the Taoiseach concerned about the decline of civil liberties and the fact that people are forced to go on hunger strike in Britain? \n Deputy Ryan O'Meara  Next year we will hold the Presidency of Europe. During that time, as the Taoiseach is more than aware, our national security will be of paramount importance. Given what has happened with drone activity and interference in Denmark, there is a fear the same will happen in Ireland. With President Zelenskyy's visit last week, we saw drones off the coast of Dublin. It is one thing for us to be a militarily neutral country, and that is right, but it is another thing for us to be able to say whether we can patrol our own skies and protect our own airspace. In light of the Presidency coming up in the middle part of next year, what will our national security strategy do? When will we see it? What will be in it regarding the protection of our skies and airports from rogue actors operating drones? \n Deputy Rose Conway-Walsh  The very serious incident of five drones endeavouring to intercept the plane carrying President Zelenskyy last week brought our unpreparedness on defence and national security into sharp focus. Was the C70 form completed to ensure that a Garda defence co-ordinated response was put in place? Were all protocols followed? Why did the navy ship not have drone-disabling equipment? Why were airlines not informed that there was drone activity in the vicinity into which they were flying?  Lieutenant General Rossa Mulcahy told John Mooney of The Sunday Times that the military needs more personnel, intelligence and high-tech capabilities to navigate these uncertain times. Why is the Taoiseach so reluctant to allow the defence and national security committee to do what its title suggests and have oversight of national security? \n Deputy Peadar Tóibín  Can the Taoiseach categorically say that the Government is able to protect all of the EU leaders who will come to this country during the EU Presidency? Who launched the drones that were seen off Dublin Bay during the Zelenskyy visit? Why were those drones not dealt with? Where did these drones come from? Where did they retreat to? How come none of that information is known at this stage? Who was behind the drones? We have heard statements that it is likely that they may have come from Russia, but what evidence is there of this? One of the more memorable answers the Taoiseach gave to a question on national security in the previous Dáil, when the issue of the so-called Russian spy was discussed, was that he did not receive those briefings. He quite pointedly said he did not receive the information he should be receiving on that. How can people in Ireland have confidence, given the fact that our Defence Forces have been run down for so long and we can only staff one ship on the seas at any given time? \n Deputy Paul Lawless  The national security strategy consultation launched in 2019 was intended to guide our strategy on security for the past five years, from 2020-25. Despite this, no strategy was published during this timeframe. During that timeframe we had a huge ransomware attack on the HSE which put a significant number of people's lives and health in jeopardy and cost the State several million euro. What is happening on this? When will the strategy be published? It is costing the State a significant amount of money. \n Deputy Ruairí Ó Murchú  We need some sort of detail and we need to know there is a plan to address cybersecurity and hybrid warfare. The HSE attack brought to light what was probably happening to a lot of businesses which did not provide information. There has been increased funding for the National Cyber Security Centre, NCSC, but we need to get down to brass tacks. There have been drone attacks over the past while and we need to make sure that we have the capacity and technological know-how to be able to deal with these issues. There has been a failure to date in respect of funding to ensure we have the full capacity required. \n Deputy Richard Boyd Barrett  One of the biggest atrocities and national security breaches was the Dublin-Monaghan bombing carried out by the Glenanne gang. There were headlines yesterday stating that there was no collusion in the Dublin-Monaghan bombing. First, the Kenova report yesterday dealt with Stakeknife, not the Dublin-Monaghan bombing. The Denton report will not be published until January. \n The Taoiseach  It was a summary of Denton. \n Deputy Richard Boyd Barrett  The report states that the British Army had the names of the killers on the night of the bombing but nobody was ever arrested. The representatives of the families think that smacks of collusive behaviour. The authors were also extremely critical of the Irish authorities, including the Garda, and the British authorities for destroying much of the files and evidence so that the people compiling the report could not gather conclusive evidence. The whole thing stinks to high heaven. The representatives of the families have asked for a public inquiry. Will the Taoiseach listen to them? \n The Taoiseach  I thank all Deputies who raised issues in terms of national security and the national security strategy. It reflects a growing awareness and engagement with this House, not before time, in respect of security and defence issues. There has been a wilful ignoring of these issues for far too long in the House. Particular perspectives have been taken on this. Even this morning, there were references to the United Kingdom, Europe or America as being threats. The clear threats right now in this era include a Russian threat to our security and security infrastructure. We have had engagement between Iran and Russia and North Korea and Russia. North Korean soldiers have been on European soil during a period of war, seeking to violate the territorial integrity of Ukraine and its sovereignty. These are the realities we face. We wish we were not facing these realities and we would prefer a Continent at peace and so on.  The strategy will be completed. Deputy Brabazon was the first to speak and referred to self-reliance. We will develop radar capacity, and that is very close to action in terms of procurement – a lot of work has gone into that. We need to co-operate and co-ordinate with other member states in the European Union and the United Kingdom in respect of all of these issues because a pattern has developed in terms of the emergence of these drones and the violation of the airspace of EU member states. The most notable incident occurred in Copenhagen at the time of the European Political Community meeting. Denmark sought help and advice from other EU member states at that time. There were incidents in Belgium, France, Poland, in terms of train tracks and so on, and in the Baltic Sea. We are agreed that, on the drone issue, disabling technology is important.  The visit of President Zelenskyy was very effective from a security perspective. I want to make it clear to everybody that an incident did occur on that night. A small number of unidentified drones were observed in the vicinity of a Naval Service vessel on patrol off the coast of Dublin. The drones were not a threat to President Zelenskyy's aircraft - that needs to be clear - because it had safely landed quite some time prior to the incident, nor were they a threat to his departure. An operational response was put in place that was appropriate to the circumstances by the commander of the naval vessel at the time and, subsequently, by the police and military authorities working in close co-operation. They worked closely together in advance of the visit and so on.  The Garda liaised with its Ukrainian partners throughout the visit of the President on the security arrangements, including with regard to this incident. The Garda special detective unit is carrying out an investigation of the circumstances of the incident with input from the Defence Forces. It is a very concerning incident, as I said, like other similar incidents in other European states. The circumstances are suggestive of this being part of an ongoing Russian-inspired hybrid campaign against European Union and Ukrainian interests. \n Deputy Paul Murphy  I would like the Taoiseach to present some evidence. He said the circumstances are suggestive----- \n The Taoiseach  Of course the Deputy would. Could I say to Deputy Brabazon----- \n Deputy Paul Murphy  The circumstances are contested. It might well have been the Russians but I would like to see some evidence if this will be used as an agenda to undermine our neutrality. \n An Ceann Comhairle  We just cannot have this, Deputy Murphy. \n The Taoiseach  The gardaí----- \n An Ceann Comhairle  We cannot have this interaction. \n The Taoiseach  I will come back to the Deputy. \n Deputy Paul Murphy  I thank the Taoiseach. \n The Taoiseach  An Garda Síochána is substantively enhancing and has enhanced its anti-drone capabilities. It has significant capabilities on land, and the navy likewise. The military generally has the capabilities throughout all three strands: air, sea and land. We will continue to enhance that and harness all technology available in the country, both private sector but also on our university campuses that can assist in that regard.  All politics is local and Deputy Dolan asked about gardaí in east Galway and the expanding towns. We have seen good progress in the recruitment of gardaí through Templemore. It has seen its highest intake this year. The Commissioner has been allocating significant numbers to given areas. Dublin benefited initially. Cork is benefiting now, to be quite frank, in terms of the city centre. The idea is to get around to the rest of the country but to do it in significant numbers so it really has impact. I understand we are pleading for patience on the Deputy's behalf and others but we are making progress. Funding is there to keep the throughput at the level it currently is in Templemore.  On the remarks made by Deputy Murphy, the United Kingdom does not present a national security threat to Ireland. \n Deputy Paul Murphy  The Taoiseach should have read the Denton report. \n The Taoiseach  On the issue he raised in terms of the civil liberties issue within the UK, it is an issue the UK has to challenge and deal with. I noted his comment, \"nothing more than property damage\". That was interesting. I do not believe people should be----- \n Deputy Paul Murphy  Interned for property damage. \n The Taoiseach  No one should be interned and there should be trials. I love the Deputy's casual approach to property damage. It is fine. It is grand. Do not worry about it. Let us continue doing it. \n Deputy Paul Murphy  That is not what I said. \n The Taoiseach  It is what he implied. \n Deputy Paul Murphy  No, it is not. \n The Taoiseach  Ah, come on. \n Deputy Paul Murphy  The point I was making is it is not normal to hold people----- \n The Taoiseach  We discussed this----- \n An Ceann Comhairle  Deputy Murphy made his point already. \n Deputy Paul Murphy  -----without trial for over a year for property damage. \n An Ceann Comhairle  We are not doing this, Deputy Murphy. We are not doing this. \n Deputy Paul Murphy  That is the point I was making and the Taoiseach knows it. \n An Ceann Comhairle  There are other Members to be regarded. \n The Taoiseach  Can I just say to Deputy Murphy that Deputies in this House have had their property damaged. I do not believe that should lead to internment or anything like that. \n Deputy Paul Murphy  Exactly. \n The Taoiseach  No, no. \n An Ceann Comhairle  Allow the Taoiseach to answer. \n The Taoiseach  Let us be very clear. In dealing with protest, there are different levels of protest. The right to protest and to free speech is absolutely inviolable. It has to be allowed and facilitated in any true democracy. When protests get too extreme, you then impact on other people's rights to personal safety, life and property. I respectfully suggest that is something the Deputy does not pay much attention to. \n Deputy Paul Murphy  Israeli weaponry property? No. \n The Taoiseach  In terms of the other issue Deputy O'Meara raised, I have dealt with some of the aspects of what happened on the night and so forth. In terms of the EU Presidency, which people have raised, there is a lot of work under way to prepare for that. An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office, led by the deputy commissioner of policing operations to oversee all aspects of operational planning, logistics and inter-agency engagement. There is ongoing interdepartmental engagement through a whole range of forums. Close co-operation with European policing and security partners concerning the Presidency is ongoing, as per the norm.  In the modern security arena, you have to co-ordinate, co-operate and share intelligence with other agencies. That is absolutely key. Otherwise, you are at nothing in terms of protecting the State or protecting our people. I do not want to go into all of the details here. Some of this is security sensitive. I have a report about the drone situation. When we are discussing security, there has to be an understanding there are limits to what can be put into the public domain. That impacts further gathering and garnering of intelligence. It also impacts on our capacity to withstand further threats and so on like that. There will be a lot of planning for VIP protection, venue security, transport management, cyber resilience and public order contingencies. All of that is being worked on. It is a mammoth task. It is a huge operation. Other member states have had to do something similar. It is symptomatic of where we are in terms of the threats to European security and so forth.  I think I have dealt with most of the issues Deputy Rose Conway-Walsh raised and I was responding to her in respect of that. \n Deputy Rose Conway-Walsh  Sorry, the Taoiseach has not----- \n An Ceann Comhairle  Absolutely not, Deputy. The Deputy has to take the answer. \n Deputy Rose Conway-Walsh  I just want to put it on the record the Taoiseach has not answered. \n The Taoiseach  I am not finished yet. No member state yet, bar France in the past 48 hours or so, has attempted to disabled drones or bring them down, for different reasons. That is a matter we have to leave to the operational people in charge. We cannot dictate that sort of a response here. \n Deputy Rose Conway-Walsh  Do we have the capacity? \n An Ceann Comhairle  Deputy, no. \n The Taoiseach  We have the capacity. \n An Ceann Comhairle  If the Deputy needs to raise a Topical Issue, she can put one down. This is not a back and forth. \n The Taoiseach  Once again, it is a matter for those on the ground and in the theatre to decide the best and most appropriate response at the time.  I have dealt with some of Deputy Tóibín's questions. The national security council has been established. There is a clear structure emanating from that in terms of awareness, being briefed and so forth. I was briefed on this incident. I sought a briefing immediately on it and I received it. Obviously, it is something that will be discussed at the national security council later.  In terms of Deputy Lawless----- \n Deputy Peadar Tóibín  The Taoiseach has not categorically----- \n An Ceann Comhairle  No. If the Deputy is not happy with the answer, put down----- \n Deputy Peadar Tóibín  -----stated that EU leaders will be safe during the Presidency. \n An Ceann Comhairle  Deputy Tóibín, you know you are wrong. \n Deputy Peadar Tóibín  He also has not stated where those drones came from and where they went. \n An Ceann Comhairle  I am asking the Deputy to stop addressing the Taoiseach until he finishes his answers, \n Deputy Peadar Tóibín  He has not answered those questions. \n An Ceann Comhairle  The Deputy might not like the answer but it is the Taoiseach's answer. Do not interject again, please. \n The Taoiseach  I was just about to make the point in terms of the cybersecurity attacks. Sorry, we will protect those who are coming into this country. There is no question. Do not always be so fast to denigrate ourselves. Do not listen to all the noise out there. What happened during President Zelenskyy's visit was a good security operation by our Defence Forces and by an Garda----- \n Deputy Peadar Tóibín  Why will the Taoiseach not answer the question about the drones? \n An Ceann Comhairle  Deputy, please have respect for the other Members. \n The Taoiseach  Through the Chair, we need to acknowledge that and the very effective work of An Garda Síochána and our Defence Forces. There is a lot of noise which suits other interests to portray Ireland in a certain light. The Deputy should be wary of that, too.  Deputy Lawless raised the issue of cybersecurity. Cyber threats and attacks have increased significantly since the Russian invasion of Ukraine. Some have been by criminal elements, some have been by professionals. There are also third party state actors in respect of cybersecurity threats. It is a very serious issue for both public utilities and private sector companies. It is costing a lot of funding to deal with that. We have brought the National Cyber Security Centre under the Department of justice. It is a very strong centre and has grown in capacity very significantly in the past five years. I remember when we started it. It has developed a really strong capacity under Richard Browne. Credit needs to be given in respect of that.  I make the point to Deputy Ó Murchú that there is not a failure in funding, frankly, and finance will not be an issue here. What is an issue is the procurement timelines, both within the European defence industry and more generally. We are working to see if we can accelerate procurement. We are doing that with the radar. That is why we took a joint country approach to procurement - to fast track it. In other words, we use the experience and expertise of countries that have experience of procuring the radar we are now seeking. Everyone will be about how fast we can procure. It will also be about taking an intelligent approach in terms of what we procure. The nature of modern warfare or security threats has changed radically. We are all witnessing the drone technology change, as well as the cybersecurity. What can we do undersea? How do we protect cables? How do we protect gas connectors? It is a whole-of-society security approach that is required here. It is not the traditional, conventional approach to defence and security. We need to consider and explore that point more, perhaps.  On the Dublin-Monaghan bombing, Deputy Boyd-Barrett is correct insofar as the summary of the Denton report was produced yesterday. It is regrettable that we do not have the full Denton report. I think there was some legal action taken to try to prevent it being published in full. The Kenova report has been published. We should have a debate on the Kenova report in this House in the new year. It reveals very sordid activity by state actors but also by paramilitaries, including the Provisional IRA. The Kenova report does not pull its punches in saying it was a threat to its own community or attacked its own community. What went on is quite unbelievable.  The Denton report stated that 120 people were murdered by a network of loyalist paramilitaries and RUC and UDR personnel, including those killed in the Dublin-Monaghan bombings. It is a very sordid story and both the Kenova and Denton reports cover it. I pay tribute to Jon Boutcher, who is now the head of the PSNI, for his leadership on Kenova, and also to Iain Livingstone. They withstood a lot of pressure. We will have two comprehensive reports, if we can get the latter one published. \n An Ceann Comhairle  That is it, Taoiseach. We move to questions Nos. 12 to 28, inclusive. With 16 Members and a remaining 18 and a half minutes, it is highly unlikely we will get to the third group of questions. I ask Members to be brief. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 10. Deputy Peadar Tóibín asked the Taoiseach if he will report on the national security strategy. [67809/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_10",
        "questionNumber": 10
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 22. Deputy Peadar Tóibín asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [67810/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_22",
        "questionNumber": 22
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Deputy should note that the Government and I are conscious of the implications of energy costs for households and businesses.  Electricity and gas retail markets in Ireland operate within a European regulatory regime wherein these markets are commercial, liberalised, and competitive and are overseen in Ireland by the Commission for the Regulation of Utilities (CRU). Price setting by energy suppliers is a commercial and operational matter for the companies concerned.  As regards taxation of electricity, households are currently exempt from Electricity Tax, while businesses pay €1 per unit or megawatt hour for business use and non-business use.  In addition to the relief for electricity for household use, there is also relief from taxation for electricity generated from renewable sources. In most cases this is claimed at source by the supplier. This is intended to accelerate the decarbonisation of the grid and bring down the price of electricity for the consumer.  Furthermore, to help alleviate energy cost pressures for households, Budget 2026 extended the 9% VAT rate currently applied to gas and electricity until the end of 2030. The cumulative cost of this measure since it was first introduced in May 2022 is estimated to be €746 million while the estimated cost of extending the measure is €254 million in a full year.  In my view, the most effective way to reduce the cost of electricity over the longer term is to discourage the use of fossil fuels, whilst at the same time spurring innovation and increasing the uptake of cleaner sources of energy. In this regard, the Carbon Tax, as an environmental tax on fossil fuels based on the polluter pays principle, supports achievement of this objective.  The carbon tax rate trajectory, which aligns with recommendations from the Climate Change Advisory Council and scientific experts, provides a clear long-term signal to industry and society alike that our future involves a move away from fossil fuels. By maintaining the trajectory of annual carbon tax rate increases, our commitment to transitioning to a carbon neutral economy is reinforced.  A key element of the Government's approach to Carbon Tax is to ensure that those who are most vulnerable receive targeted support, making the transition fair and equitable. This is achieved through using carbon tax revenues to fund social welfare measures, agri-environmental schemes and retrofitting.  It is important to note that analysis undertaken using SWITCH, the ESRI tax and benefit model, to simulate the impact of the carbon tax increase and the compensatory welfare package estimates that the net impact of the combined measures is progressive. Half of households are better off due to the measures part-funded by additional carbon tax funds, with households in the bottom four income deciles benefitting the most.  As of Budget 2026, the Government has allocated over €4.2 billion in carbon tax revenue for climate action and Just Transition measures since 2020, with ESRI analysis showing that the lower income deciles are better off as a result of the social protection measures funded by these allocations.  Furthermore, the Government has incentives in place to promote investments in renewable and low-carbon energy products, such as HVO and other biofuels so as to lessen our dependence on fossil fuels.  Biofuels, such as HVO, are relieved from the Carbon tax. This favourable tax treatment is intended to promote a higher level of biofuel usage and supports the Government’s commitment to incentivising more environmentally friendly alternatives to fossil fuels.  Ultimately, while taxation does affect the final retail price of energy products, the best way of insulating our economy and society from energy prices shocks is to reduce our dependence on fossil fuels while providing supports for the most vulnerable households.  My Department continues to monitor energy, electricity and fuel prices. Amendments to excise duty rates on energy products are considered as part of the annual Budgetary cycle which includes the presentation of tax policy options to the Tax Strategy Group. Tax Strategy Group Papers are available online : www.gov.ie/en/department-of-finance/collections/budget-2026-tax-strategy-group-papers/. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 43. Deputy Peadar Tóibín asked the Tánaiste and Minister for Finance if he has considered altering tax rates on energy, electricity and fuel in light of the cost-of-living crisis being experienced by people in the State. [63789/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_62",
          "debateSectionId": "dbsect_62",
          "showAs": "Cost of Living Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_43",
        "questionNumber": 43
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 174 and 231 together.  The Road Safety Authority (RSA) has a statutory remit to report on fatal, serious and minor injury collisions on public roads. The RSA receives both coronial data and collision data from An Garda Síochána for this purpose and produces official statistics to help develop evidence-based road safety interventions.  Given the RSA's responsibility in this matter, I have referred the Deputy's questions to the RSA for direct, detailed reply. I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 174. Deputy Peadar Tóibín asked the Minister for Transport the number of traffic accidents which have been reported in Counties Cavan and Monaghan in each of the past ten years; and the number of persons who have died each year on Cavan and Monaghan roads. [69719/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_165",
          "debateSectionId": "dbsect_165",
          "showAs": "Road Traffic Accidents",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_165.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_174",
        "questionNumber": 174
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 174 and 231 together.  The Road Safety Authority (RSA) has a statutory remit to report on fatal, serious and minor injury collisions on public roads. The RSA receives both coronial data and collision data from An Garda Síochána for this purpose and produces official statistics to help develop evidence-based road safety interventions.  Given the RSA's responsibility in this matter, I have referred the Deputy's questions to the RSA for direct, detailed reply. I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 231. Deputy Peadar Tóibín asked the Minister for Transport the number of traffic accidents which have been reported in County Meath in each of the past ten years; and the number of persons who have died each year on Meath roads. [69718/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_165",
          "debateSectionId": "dbsect_165",
          "showAs": "Road Traffic Accidents",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_165.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_231",
        "questionNumber": 231
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 560, 561, 562, 563, 564 and 565 together.  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an Automatic Enrolment (AE) system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system will be called 'My Future Fund' and it will launch from the 1st January 2026.  The legislative basis for the implementation of My Future Fund is the Automatic Enrolment Retirement Savings System Act (2024). This Act provides the legal basis for the enrolment of employees aged between 23 and 60 years of age, who are earning €20,000 or above a year (across all employments), and who are not actively contributing to a supplementary pension scheme. The Act also clearly sets out the long term investments rules, the risk levels and the oversight arrangements that will govern the scheme. Information on these arrangements has been made publicly available as part of a wide ranging communications strategy, including through the Government's website AE hub available at [ www.gov.ie/autoenrolment ]. With regard to the administration fee associated with My Future Fund, this will be set out in a Statutory Instrument that is currently being finalised and which will be published later this month.  The Act also permits a participant to opt out of the the system after six months mandatory participation during a two month opt out window in months seven and eight. Those who choose to opt-out will be automatically re-enrolled after two years. Where an individual decides to opt out, they can get their personal contributions back. A participant may also suspend their contributions for a period of between one and two years, after which they will be re-enrolled. In such cases they may not access their savings, nor may their savings be accessed if a participant moves abroad. The rationale for these savings remaining in their My Future Fund account is because the objective of scheme is to provide supplementary income in retirement.  Section 61 of the AE Act sets out the contribution rates and provides for graduated increases in these rates over a ten year period. This approach set out in the legislation gives very clear certainty to employers and employees as to the rates that will be applicable and when they will be applicable.  Should a person wish to permanently opt out of My Future Fund, contribute at a different, but higher rate, or assign their funds to a different investment manager, then an alternative occupational pension provision that meets their needs should be put in place in respect of the employment concerned.  With regard to the question relating to employers being threatened with fines and prosecution before the commencement of the system, this is simply not the case. As noted above, a wide ranging communication strategy has been rolled out over many months which seeks to inform both employers and employees about the scheme. In particular, there has been extensive engagement with employers and their representative organisations to explain their duties and responsibilities under the Act and what the consequences might be for failing to meet their statutory obligations as set out in the compliance and enforcement provisions of the AE Act.  I hope this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 560. Deputy Peadar Tóibín asked the Minister for Social Protection in relation to pension auto-enrolment, the reason employees are being automatically enrolled before the public has full clarity on fees, risks, oversight, and long-term rules. [69723/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peadar-Tóibín.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peadar-Tóibín.D.2011-03-09",
          "showAs": "Peadar Tóibín"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_483",
          "debateSectionId": "dbsect_483",
          "showAs": "State Pensions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_560",
        "questionNumber": 560
      },
      "contextDate": "2025-12-09"
    }
  ]
}