{
  "head": {
    "counts": {
      "questionCount": 1430,
      "resultCount": 1430
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  The overarching aim of the National Neuro-Rehabilitation Strategy is the development of Neuro-Rehabilitation services to improve outcomes for people by providing safe, high quality, person-centred Neuro-Rehabilitation at the lowest appropriate level of complexity.  Services must be integrated across the care pathway and provided as close to home as possible.  These services are currently being configured into population based Managed Clinical Rehabilitation Networks (MCRNs). The development of networks including Community Neuro-Rehabilitation Teams (CNRTs) nationally will facilitate earlier access to specialist Neuro-Rehabilitation services, as close to home as possible.  This will improve outcomes for people, reducing the support they need as they transition back to their communities and have an overall systemic impact releasing bed days back in to the system and facilitate individuals in the community avoiding admission to hospitals to access rehabilitation.  The Rehabilitation Networks have been planned in full alignment with the Health Regions, to have 6 networks nationally. Each network will have its own larger population based Community Neuro-Rehabilitation Team (CNRT) with bases located throughout the region to manage geographical spread.  The funding allocated in Budget 2026 will provide for the expansion of Community Neuro-Rehabilitation Teams, with details to be confirmed in the forthcoming HSE National Service Plan for 2026 but it is expected that the focus will be on areas that don't currently have a community team in place.  Moving forward with the strategy the plan will be to enhance the existing community teams to full capacity as per the Disability Action Plan and to create a large population-based Community Neuro-Rehabilitation Team within each region. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 24. Deputy Eamon Scanlon asked the Minister for Children, Disability and Equality when funding will be allocated for the establishment of a community neurorehabilitation team in the north-west, in line with the Programme for Government commitment to complete the nationwide rollout of such teams; and if she will make a statement on the matter. [72805/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_24",
        "questionNumber": 24
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 55. Deputy Eamon Scanlon asked the Minister for Children, Disability and Equality to provide an update on the establishment of an MS community worker in the Sligo–Leitrim area, which is currently the only region in the State without access to this community work service; and if she will make a statement on the matter. [72806/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_98",
          "debateSectionId": "dbsect_98",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_55",
        "questionNumber": 55
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children.  In the current school year over 180,000 children and young people are being transported on a daily basis to schools throughout the country.  Close to €70m of additional permanent funding is being allocated to school transport services. This is to provide for the additional demand for pupils with special educational needs on school transport services and increased bus contractor running costs.  It will also provide for additional funding on the School Transport Scheme fleet, and to implement improved technology such as e-ticketing on school transport services. E-ticketing will enhance students’ experiences on school transport and allow for greater visibility on seat usage. With better data, this will inform future route planning and maximise the efficiency and effectiveness of the system. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 418. Deputy Eamon Scanlon asked the Minister for Education and Youth to provide a breakdown of the €69 million investment allocated to strengthen the school transport scheme; and if she will make a statement on the matter. [73295/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_403",
          "debateSectionId": "dbsect_403",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_403.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_418",
        "questionNumber": 418
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  In line with the programme for government commitment, the Education Therapy Service (ETS) has been established as a critical and important support for children and young people in their school environment. The ETS is an additional support for children with special education needs. It is to supplement and not replace existing children’s health and disability services. It is intended to commence initially in specials schools and rollout over time to special classes and mainstream schools. It is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year.  As referenced, on the 28th November the recruitment campaign for therapists to the new ETS was launched. This campaign will initially see 90 occupational therapists and speech and language therapists consisting of staff and senior grades join their therapy team.  In line with the phased approach for implementation, the current recruitment campaign has included the following counties, Carlow, Cork, Dublin, Galway, Kildare, Kilkenny, Laois, Limerick, Longford, Louth, Meath, Monaghan, Tipperary, Westmeath, Wexford & Wicklow. This ensures that supports are provided to schools aligning with the current National Council for Special Education (NCSE) regional structure for therapy. As this is a national service it will grow and expand to include all schools. It is envisioned that there will be rolling recruitment campaign commencing in 2026 covering all counties to meet the therapy needs of the children in the school system. It is envisioned that further recruitment campaigns will also include additional therapy grades including therapy managers, clinical specialists and therapy assistants.  In addition, the NCSE have been developing an education -based therapy support service known as the previously as the Education Therapy Supports Service (ETSS), which will now be subsumed into the ETS. This service provides two strands of support to all schools: Sustained In-School Therapy and Regional Therapy Supports.  Sustained in-school support (SIT) is provided to schools for a defined period of 18-24 months in line with the School Inclusion Model. 22 schools in the Eastern region and 28 schools in the Western region are receiving support under SIT in the 2025/2026 school year.  Regional therapy support provides Teacher Professional Learning (TPL) with follow on/implementation support by NCSE therapists. The focus of this support is to build the capacity of schools and to embed the learning from TPL into their teaching practice, through In-school coaching and co-facilitation of interventions, strategies and resources. Regional Therapy Supports are available nationally for the 2025/2026 school year.  My Department and the National Council for Special Education (NCSE) are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 218. Deputy Eamon Scanlon asked the Minister for Education and Youth the reason counties Sligo, Mayo, Donegal, Roscommon, Leitrim and Cavan have been excluded from the current NCSE recruitment drive for senior and staff grade occupational therapists and speech and language therapists for the National Educational Therapy Service in special schools, with a view to extending the service to special classes in mainstream schools; whether this is part of a phased roll out; when OTs and SLTs will be recruited for Sligo, Mayo, Donegal, Roscommon, Leitrim and Cavan; and if she will make a statement on the matter. [72588/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_207",
          "debateSectionId": "dbsect_207",
          "showAs": "National Council for Special Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_207.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_218",
        "questionNumber": 218
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants. The initial selection and prioritisation of works to be funded is a matter for the local authority.  My Department sought applications in September 2025 for consideration for funding of safety improvement works on regional and local roads to be carried out by local authorities during 2026. The schemes for inclusion in the application are decided by the local authorities and submitted in order of priority.  Within the overall budget available for the Safety Improvement Grant Programme, the 2026 allocations will be decided following consideration of Councils’ applications by the Department. The allocations will be notified to Councils as part of the general grant allocation process early next year. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 276. Deputy Eamon Scanlon asked the Minister for Transport to address the need for an increased allocation under the safety improvement schemes given the current funding level of €370,000 is insufficient to meet the safety needs of County Sligo; and if he will make a statement on the matter. [71775/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_191",
          "debateSectionId": "dbsect_191",
          "showAs": "Road Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_276",
        "questionNumber": 276
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works (OPW) can confirm that refurbishment works are planned on a vacant building to accommodate a new Garda station in Tubbercurry, Co. Sligo.  It was intended that another OPW Client would be co-located in the building with An Garda Síochána and a Part IX Planning application was prepared on this basis.  However the other OPW Client no longer has a need for the accommodation and An Garda Síochána are reviewing their operational requirements in light of this. Unfortunately this change of circumstances has prolonged the process, as funding and allocation of space are impacted.  Once agreement has been reached with An Garda Síochána on the space allocation the submission of the Part IX Planning application can proceed and, subject to approval, the tender process will then commence. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 34. Deputy Eamon Scanlon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation further to Parliamentary Question No. 308 of 29 May 2025, for an update on the new Garda station in Tubbercurry, County Sligo; and if he will make a statement on the matter. [70750/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_76",
          "debateSectionId": "dbsect_76",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_34",
        "questionNumber": 34
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 78. Deputy Eamon Scanlon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure plan will accelerate the delivery of critical infrastructure in the border counties; and if he will make a statement on the matter. [70623/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_78",
        "questionNumber": 78
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter the departments pipeline of school buildings for a project to provide 1 SEN Classroom and 3 SET rooms.  The Stage 2b Report was recently received by my department and is currently being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  Once this review has been completed my department will contact the school authorities regarding the progression of this project.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 206. Deputy Eamon Scanlon asked the Minister for Education and Youth the status of the planned extension for a school (details supplied) in County Leitrim, which is ready to proceed to tender; the expected timeframe for the commencement of construction; and if she will make a statement on the matter. [70840/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_171",
          "debateSectionId": "dbsect_171",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_171.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_206",
        "questionNumber": 206
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Tetra communications network was designed to provide a reliable and robust emergency network for the State's emergency personnel with the widest possible coverage and is delivered by Tetra Ireland. The coverage of Tetra is far in excess of the sum of the commercial mobile networks in Ireland.  The network offers push to talk voice services for emergency personnel throughout the state. This allows organisations such as An Garda Síochána and the National Ambulance Service to operate in remote areas with reliable communications. During extreme weather events many organisations make extensive use of the network as part of their co-ordinated response; this includes the Local Authority sector and ESB networks.  My Department acts as the Contracting Authority for the contract with Tetra Ireland and established a single supplier framework for the drawdown of services in December 2020. Any organisation that provides emergency services to the State may drawdown services from the framework.  In order to provide maximum coverage and resilience all areas in the country are covered by overlapping service from at least two base stations with battery backup in place for key sites. This level of coverage has allowed service to be provided during previous severe weather events.  As a result of the extended power outage seen in the West and Northwest of the country following Storm Éowyn there was some disruption to the Tetra network in those areas. A number of steps have been taken to increase resilience and reduce the chances of any further disruption.  A preventative maintenance inspection programme has been completed at all Tetra base station sites which included verification that battery backup units are performing as designed. Tetra Ireland has obtained additional generator units that can be deployed in the event of another sustained power outage to maintain service. A number of base station sites in the West and Northwest have also been upgraded to allow for both additional battery and generator capacity.  Tetra Ireland has established a new storm response protocol with ESB Networks that is designed to allow for rapid power restoration when outages occur. This protocol was used successfully during and after Storm Amy in October of this year. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 330. Deputy Eamon Scanlon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the efforts being made to improve TETRA system coverage; and if he will make a statement on the matter. [69007/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_295",
          "debateSectionId": "dbsect_295",
          "showAs": "Information and Communications Technology",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_295.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_330",
        "questionNumber": 330
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under the Additional School Accommodation (ASA) Scheme. The project will provide three general classrooms, a science room with preparation area, a construction room with preparation area, a home economics room, a graphic design laboratory, a music room, a project store, two SET rooms, ancillary accommodation, and a one-classroom SEN base.  The project was devolved to the Mayo Sligo Leitrim Education Training Board (MSLETB) for delivery.  The Department is awaiting the submission of the post-planning (Developed Design) report for review. Department officials have already engaged directly with the design team and MSLETB to address a planning-related query raised by MSLETB, and there are currently no outstanding queries with the Department. We will continue to work closely with MSLETB to provide guidance and support as this ASA project progresses. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 384. Deputy Eamon Scanlon asked the Minister for Education and Youth the current status of an additional needs application from a school (details supplied) in County Sligo; and if she will make a statement on the matter. [69065/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_344",
          "debateSectionId": "dbsect_344",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_384",
        "questionNumber": 384
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department approves and registers meat food businesses under the relevant EU legislation.  My Department does not currently provide any grant aid for the upgrading of meat businesses. However, I am aware that Enterprise Ireland offer a range of funding and grants to businesses. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 731. Deputy Eamon Scanlon asked the Minister for Agriculture, Food and the Marine the funding available for the upgrading of slaughterhouses and boning halls; and if he will make a statement on the matter. [69008/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_585",
          "debateSectionId": "dbsect_585",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_585.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_731",
        "questionNumber": 731
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Automated External Defibrillators (AEDs) are available in many locations across society under the management of various organisations. AEDs are among the various items eligible for funding under the Community Sport Facilities Fund.  The Community Sport Facilities Fund (formerly the Sports Capital & Equipment Programme) is operated by the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media and provides grants to assist in the development or refurbishment of sports facilities and the provision of sports equipment. Grants are available to voluntary, not-for profit sports clubs, community groups, National Governing Bodies of Sport, and local authorities. Third level colleges, Education and Training Boards (ETBs) and schools may only apply for funding jointly with sports clubs or organisations.  The programme funds the purchase of AEDs for the above-mentioned groups and many of these are also available to the wider community.  Funding is also available through the HSE’s national lottery grants schemes and other community grants schemes. At a local level, the network of local sports partnerships throughout the country delivers education and training opportunities across a broad range of areas to local sports clubs and community groups. This includes first aid workshops, which typically cover CPR and-or defibrillator training as part of the content.  From the 1st of January 2023, my Department through the Department of Finance removed VAT from AEDs to make the cost more feasible for groups, organisations or individuals looking to purchase an AED.  The National Ambulance Service (NAS) are not aware of any funding schemes that can be applied for by private companies, however large industrial estates may have access to a public AED. Public AEDs are very often funded by local charity initiatives or by local businesses. Once a defibrillator has been made publicly accessible, it can be added to the NAS database and the location can made visible to the NAS Emergency Call Takers. In the event of a 112/999 call being made to NAS for a person who may require a defibrillator, if there is a defibrillator available in the vicinity of the incident, the emergency call taker will be able to direct the caller to the defibrillator location so that it can brought to the patient. More information on NAS defibrillator locations can be found here: www.nationalambulanceservice.ie/community/. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1053. Deputy Eamon Scanlon asked the Minister for Health the funding available from her Department to support small businesses in the provision and installation of defibrillators; and if she will make a statement on the matter. [70103/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_876",
          "debateSectionId": "dbsect_876",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_876.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1053",
        "questionNumber": 1053
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Dara Calleary  I thank Deputy Scanlon. He is constantly putting pressure on. He will be pleased to know that since 2020, Sligo has been allocated in the region of €57 million and Leitrim nearly €66 million in funding from various schemes and programmes administered by my Department, which includes €7.5 million for Sligo and €8.5 million for Leitrim in 2025 alone.  Sligo and Leitrim have secured significant funding under my Department's rural regeneration and development fund, including €1.1 million for the National Surf Centre in Strandhill and €3.4 million for the Mohill public realm works, which I had the pleasure of visiting earlier this year. Just last week, I was pleased to announce CLÁR funding of just over €537,000 for County Leitrim and €502,000 for County Sligo. Successful projects included €100,000 for the Leitrim village playground and €54,000 for facilities in the Cliffoney men's shed.  In addition to these capital schemes, the social inclusion and community activation programme, SICAP, and committee services programme are providing current expenditure supports to organisations throughout both counties. I look forward to continuing to work with the Deputy on our strong record of investment in rural Ireland, including in Sligo and Leitrim. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 18. Deputy Eamon Scanlon asked the Minister for Rural and Community Development and the Gaeltacht the projects under way in Counties Sligo and Leitrim that are receiving funding under different schemes with financial support from his Department; the other projects that his Department has committed funding to; and if he will make a statement on the matter.  [68271/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_17",
          "debateSectionId": "dbsect_17",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_17.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_18",
        "questionNumber": 18
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice (Deputy Niall Collins)  I can assure the Deputy that An Garda Síochána is fully committed to tackling all forms of crime and theft everywhere in the country. The Government's first priority is to increase Garda numbers and Garda visibility so all of our communities, rural and urban, can feel safe and be safe. This is reflected in the record allocation of €2.59 billion in the Garda Vote for 2026, which will support investment in equipment and technology and, importantly, the continued recruitment of Garda personnel.  I must be clear, though, that it is the Garda Commissioner who decides where to deploy Garda personnel. Neither the Minister, Deputy O'Callaghan, nor I, nor, indeed, any official from the Department, can direct the Commissioner on where gardaí are to be stationed. I am pleased to confirm, however, that recruitment to An Garda Síochána is gathering real momentum, and we now have a steady pipeline of new recruits entering the Garda College. Some 194 new gardaí attested from Templemore in mid-November, taking the total this year to 619, the largest number of new gardaí in a single year since 2018. A total of 794 new recruits entered the college this year. We can look forward to seeing those probationer gardaí assigned throughout the country in 2026 as they pass out of Templemore.  It must also be noted that the allocation of newly attested gardaí allows for currently serving gardaí to move on transfer to other divisions across the country and into specialist units. In this regard, I understand that a number of gardaí have been transferred into the Sligo-Leitrim division during the course of 2025.  With regard to theft, the Government takes this issue extremely seriously. Thanks to the effective work of An Garda Síochána, almost all property crime types have seen decreases at a nationwide level. In the Sligo-Leitrim division, there has been a 50% reduction in reported burglaries in the year to date. In addition, thefts and related offences, thefts from shops and vehicle thefts are also down by 26%, 29% and 39%, respectively, in the first half of this year when compared to the same period last year. \n Deputy Eamon Scanlon  Earlier this year, Sligo Garda station was identified as one of several stations that experienced crime rates above pre-pandemic levels in 2024, with theft accounting for nearly one third of all incidents. It is imperative that we shine a spotlight on rural crime and the emerging trends in the north-west. In Donegal and Sligo, there has been a marked rise in theft and arson, leaving communities anxious and unsettled. County Leitrim has witnessed an increase in burglaries. Only last Friday, a property was broken into in broad daylight at 1 p.m., which is a stark reminder of the growing boldness of criminal activity.  The Minister of State said 194 gardaí and 17 reserves were sworn in last month, but none of those were assigned to the Sligo-Leitrim Garda division. It is a continuing pattern. More gardaí should be assigned to that area, when we consider the crime statistics. \n Deputy Niall Collins  It was encouraging to see that the CSO crime statistics, released last week, show that detection rates for crime incidents reported in 2024 were equal to or above those in 2023 for nine of the 14 crime offence groups.  The Department is currently progressing work to develop a retail crime strategy to tackle the complex and evolving nature of retail crime, which the Deputy mentioned. We are all too conscious that this is not just about organised retail crime, and that there is a large amount of lower level, everyday shoplifting, which has just as serious an impact on smaller retailers and their staff. The retail crime strategy will build on existing initiatives to tackle this criminality, integrating the latest national and international evidence-informed approaches for enforcement and prevention strategies, in addition to supports for retail workers.  In September, at the National Ploughing Championships, the Department published the rural safety plan for the period from 2025 to 2027. The plan’s vision is to ensure people and communities in rural Ireland feel safe and are safe in their homes, places of work and local communities. \n Deputy Eamon Scanlon  While I have the opportunity, I wish to extend an invitation to the Garda Commissioner, Justin Kelly, to visit Sligo Garda station to witness first-hand the current working conditions, and to address the ongoing staffing shortages.  The proposed Garda division headquarters at Caltragh has faced repeated delays, stemming from earlier plans to merge the Sligo-Leitrim division with Donegal. The existing station at Pearse Road is not fit for the future needs of An Garda Síochána in the region.  The OPW has confirmed refurbishment works for a vacant State-owned building adjacent to the current station in Tubbercurry. We urgently need clarification on when this building will be occupied. It is a matter of critical importance for both community safety and public confidence. The existing station, dating back to the 1960s, is wholly unfit for purpose. Tubbercurry Garda station is the third busiest station in the Sligo-Leitrim division. It requires facilities that meet the demands of a modern, functioning Garda station, yet the current building falls far short of that. There is a State-owned building. I know plans are afoot to move the Garda station into the newly refurbished building. When can that go to planning, if it needs planning? When will the new station be opened? \n Deputy Niall Collins  The Department has been informed by the Garda authorities that works are planned for Sligo Garda station in the immediate term. These works will support a scene of crime task force relocation. The project is at the tender evaluation stage. In accordance with the requirements of the infrastructure guidelines, a preliminary business case for a new Garda divisional headquarters in Sligo is also being undertaken by An Garda Síochána. Once complete, the preliminary business case will be issued by An Garda Síochána to the Department for review and approval. Following approval of that preliminary business case, An Garda Síochána will then advise the Office of Public Works regarding the prioritisation of the programme. We will convey the Deputy's invitation to visit the region to the Garda Commissioner, and the Deputy will be duly informed. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 86. Deputy Eamon Scanlon asked the Minister for Justice, Home Affairs and Migration the actions he is taking in response to increased incidents and thefts in the north west; the way in which his Department is supporting An Garda Síochána, who do excellent work locally, in providing increased visibility and resources to respond to these incidents; his views on whether the Sligo-Leitrim division is not receiving enough gardaí, given no new gardaí have been allocated to the division from the latest round of training in Templemore; and if he will make a statement on the matter.  [68267/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_27",
          "debateSectionId": "dbsect_27",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_27.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_86",
        "questionNumber": 86
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that the Motorised Transport Grant was a means-tested Health Service Executive payment for people with disabilities which closed in 2013. The development of a scheme to replace it falls within the remit of my colleague, the Minister for Children, Disability and Equality.  I can confirm that the Department of Transport is developing a new Vehicle Adaptation Scheme. The purpose of this scheme is to support necessary vehicle adaptations, as a specific individual transport measure, in the context of the need for a wider Government consideration of holistic and integrated transport supports to improve functional mobility for those with a disability. In consultation with key stakeholders, the principles and parameters of the new scheme will be agreed over the coming months. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 95. Deputy Eamon Scanlon asked the Minister for Transport the position regarding the implementation of the new transport support scheme to replace the motorised transport grant; and if he will make a statement on the matter. [67494/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_86",
          "debateSectionId": "dbsect_86",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_95",
        "questionNumber": 95
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Building Blocks Extension Grant Scheme was launched in late 2024. The closing date for applications was 30th January 2025. There were four strands to the scheme: Community Construction, Community Extension, Community Purchasing and Private Extension. A total of 78 applications were received with 50 applicants approved to progress to the next stage of the grant process. Following approval, applicants were required to finalise the legal formalities of the scheme and projects are now commencing.  As part of the NDP review, the allocation for this Department has increased to €795 million over the next five years. This increased funding will be used in part to provide additional early learning and childcare places through future capital programmes, including operating a further scheme similar to Building Blocks to support the expansion of provision by existing operators, as well as implementing my Department's commitment to capital investment in State-led early learning and childcare facilities.  Officials in the Department are currently examining options and detailed specifications for future Building Blocks schemes, and I expect to announce details in early 2026. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 504. Deputy Eamon Scanlon asked the Minister for Children, Disability and Equality when the building blocks extension scheme will open again for 2026; and if she will make a statement on the matter. [68007/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_447",
          "debateSectionId": "dbsect_447",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_447.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_504",
        "questionNumber": 504
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 118. Deputy Eamon Scanlon asked the Minister for Housing, Local Government and Heritage if planning permission will be required to convert vacant spaces above shops into residential units under the new vacant property refurbishment grant plan; and if he will make a statement on the matter. [65721/25] ",
        "debateSection": {
          "showAs": "Departmental Schemes",
          "debateSectionId": "dbsect_59",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_59",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_59.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 118,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 24, 62, 118, 133 and 547 together.  Tackling vacancy and dereliction is at the heart of the Government's housing plan Delivering Homes, Building Communities 2025-2030.  The Vacant Property Refurbishment Grant introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A review of the Vacant Property Refurbishment Grant, including the matter of staged payments, was undertaken in 2024. That review has been completed and is under consideration.  Under the Local Authority Purchase and Renovation Loan, launched in July 2024, a first-time buyer who wishes to purchase and/or renovate a Vacant Property Refurbishment Grant eligible home but who cannot get sufficient funding from commercial lenders is now able to apply to their local authority for a loan under the scheme. The Local Authority Purchase and Renovation Loan has the potential to help first time buyers and fresh start applicants to complete the purchase and renovation of a vacant or derelict property and provides an avenue to secure the necessary finance to make the project viable.  The new housing plan reinforces and expands the range of existing measures being implemented by Government to tackle the issue of vacancy and dereliction. The plan includes an action to provide additional support under the Vacant Property Refurbishment Grant for the refurbishment and conversion of above the shop vacant floors for use as homes. In recognition of the works involved, it is proposed that a package of up to €140,000 will be made available. The Department is currently progressing work to introduce the expanded and extended “Above the Shop scheme”.  S.I. No. 75/2022 - Planning and Development Act (Exempted Development) Regulations 2022 provides an exemption from the requirement for planning permission for the conversion of certain types of vacant commercial property into residential use, up to a maximum of 9 residential units and subject to specified conditions. The Regulations, which were extended in 2022 under SI 75/2022 to include an exemption for the conversion of vacant pubs, have now been further extended to the end of 2028. Accordingly, any specific works proposed in a conversion project would need to be examined in the context of fulfilling the requirements of these Regulations, to determine if planning permission is required.  My Department publishes data on applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis, which includes the number of applications, approvals and the total number and value of grants paid per local authority. This data also includes a breakdown of applications for the Vacant Property Refurbishment Grant and the Derelict Property Top-up Grant for every quarter. The Q3 2025 grant statistics were published on 17 October 2025. This data can be accessed at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/vacant-property-refurbishment-grant-statistics/#2025 ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_118",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 127. Deputy Eamon Scanlon asked the Minister for Housing, Local Government and Heritage if he will urgently authorise an increase in the number of personnel working at Tailte Éireann; to review the policy of returning paperwork to solicitors without providing reasons or context for the returns, as this is causing significant frustration and delays; and if he will make a statement on the matter. [65720/25] ",
        "debateSection": {
          "showAs": "State Bodies",
          "debateSectionId": "dbsect_143",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_143",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_143.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 127,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  Tailte Éireann is an independent Government agency under the aegis of my Department. Tailte Éireann provide a property registration system, property valuation service, and national mapping and surveying infrastructure for the State. Under Section 8(6) of the Tailte Éireann Act 2022, Tailte Éireann is independent in the performance of its functions.  In 2023, a request for a planned increase in the pay-bill subhead of Tailte Éireann’s Vote was supported by my Department and subsequently granted in the Estimates for 2024. As part of Tailte Éireann’s resourcing strategy, the Accelerated Recruitment Programme was launched in early 2024 to address the high volume of vacancies and strengthen operational capacity in response to increasing service demands.  The programme introduced standardised recruitment processes, across internal, external, and mobility routes, to ensure consistent and efficient staffing. Since its launch in February 2024, the resourcing team have focused on filling 147 priority roles. In addition, a further 321 vacancies (including 182 within the Registration function) have been filled across Tailte Éireann through a combination of new hires, promotions, and mobility placements. The remaining 78 active Tailte Éireann vacancies, 17 of which relate to the Registration function, are currently progressing through various stages of the recruitment cycle, with a target to reduce overall vacancy levels across Tailte Éireann to approximately 3% by end Q4 2025.  Arrangements have been put in place by all bodies under the aegis of my Department to facilitate the provision of information directly to members of the Oireachtas. This provides a speedy, efficient and cost effective system to address queries directly to the relevant bodies. Further information in relation to specific cases may be obtained by contacting the dedicated e-mail address in respect of Tailte Éireann at [ oireachtas@tailte.ie ]. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_127",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 227. Deputy Eamon Scanlon asked the Minister for Transport if his Department will conduct a formal review of a companies fixed pricing policy (details supplied); and if he will make a statement on the matter. [65913/25] ",
        "debateSection": {
          "showAs": "Departmental Reviews",
          "debateSectionId": "dbsect_235",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_235",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_235.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 227,
        "answerText": " Minister for Transport  The NTA is the independent transport regulator of the SPSV sector, and I am not involved in the day-to-day operations of that sector. The ongoing protests by taxi drivers concerning the taxi fixed price option on the Uber app, is not a matter for the Department of Transport or the NTA to address.  Taxi drivers, who are self-employed operators, make a business decision to sign up (or not) with a licensed dispatch operator and are not obliged by the NTA to sign up with any dispatch operator.  Dispatch operators are required to provide bookings to SPSV licenced drivers using SPSV licenced vehicles, only. Where taxi drivers choose to affiliate with a dispatch operator, they are free to contract with a dispatch operator of their choice.  I issued a letter to the NTA on 19 November last asking that they clarify the regulatory position on the Uber fixed price fare for the information of taxi operators and public representatives alike.  I have referred your question to the NTA for further information. Please advise my private office if you have not received a reply within 10 working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_227",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 791. Deputy Eamon Scanlon asked the Minister for Health to provide an update on the implementation of the new transport support scheme to replace the motorised transport grant; and if she will make a statement on the matter. [66033/25] ",
        "debateSection": {
          "showAs": "Departmental Schemes",
          "debateSectionId": "dbsect_705",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_705",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_705.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 791,
        "answerText": " Minister for Health  The matters raised in this question fall under the remit of the Department of Children, Disability and Equality. Accordingly, it is suggested that the question be redirected to that Department for reply ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_791",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 845. Deputy Eamon Scanlon asked the Minister for Health the status of the Programme for Government commitment to reduce hospital car parking charges; if she is aware of a 25% increase in car parking fees in November 2025 at Sligo University Hospital (SUH); the amount of revenue generated through parking charges within the car park at SUH in 2024 and to date in 2025; and if she will make a statement on the matter. [65462/25] ",
        "debateSection": {
          "showAs": "Hospital Charges",
          "debateSectionId": "dbsect_758",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_758",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_758.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 845,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_845",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_190",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_190",
          "showAs": "General Practitioner Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_190.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 171. Deputy Eamon Scanlon asked the Minister for Health if she will review the policy that requires GPs to prioritise GMS obligations, as this creates discrimination against individuals who do not qualify for GMS assistance, and limits GPs' capacity to provide private services; and if she will make a statement on the matter. [64068/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_171",
        "answerText": " Minister for Health  GPs are private practitioners, most of whom hold a GMS contract with the HSE for the provision of GP services without charge to medical card and GP visit card holders. As GPs are private practitioners, the scheduling of consultations is a matter for each individual practice. Where scheduling is required, GPs prioritise appointments based on urgency and health need.  The GMS contract sets out the requirements for GPs in dealing with patients who hold Medical Cards or GP Visit Cards. Under the terms of the contract GPs are not permitted to make surgery arrangements that discriminate between GMS patients and private patients. ",
        "questionNumber": 171,
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_208",
          "showAs": "Primary Care Centres",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_208.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 189. Deputy Eamon Scanlon asked the Minister for Health if funding has been secured to ensure the delivery of the new primary health care centre in Tubbercurry, County Sligo; the timeline for completion of the project; and if she will make a statement on the matter. [64067/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_189",
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionNumber": 189,
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_431",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_431",
          "showAs": "Mental Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_431.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 560. Deputy Eamon Scanlon asked the Minister for Health if she will give an update on the 15,000 free counselling sessions to men being provided as part of an integrated series of initiatives to ensure people with mental health difficulties are able to access the appropriate range of supports; and if she will make a statement on the matter. [64166/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_560",
        "answerText": "",
        "questionNumber": 560,
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_432",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_432",
          "showAs": "Tobacco Control Measures",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_432.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 561. Deputy Eamon Scanlon asked the Minister for Health her plans to regulate the sale of nicotine products for oral consumption; and if she will make a statement on the matter. [64167/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_561",
        "answerText": " Minister for Health  On the 18th of November 2025, the Government approved the addition of baseline measures on all non-medicinal nicotine containing products, including pouches, to my current draft (Public Heath Tobacco Products and Nicotine Inhaling Products) (Amendment) Bill. These measures will introduce a minimum legal age of sale, a restriction on point of sale display and a prohibition on advertising in retail outlets. They will be developed in early 2026.  Nicotine pouches are not currently subject to regulation under European Union tobacco control legislation. A harmonised EU-wide framework for regulating these products would be more effective than individual Member State action, as it prevents regulatory circumvention through cross-border purchases.  In this context, representing Ireland and several other Member States, I recently urged the European Commission to introduce new EU tobacco control legislation at the earliest opportunity. I have also advocated for the inclusion of all novel nicotine products—such as nicotine pouches—within the scope of this proposal. I have also called for a prohibition on cross-border distance sales to ensure the integrity of national regulatory measures.  Nicotine pouch use remains very low within the adult population, while 17% are current tobacco smokers. Preventing smoking initiation and encouraging its cessation remain the primary focus in relation to nicotine use. Half of all smokers will eventually die from a tobacco-related illness and each week in Ireland tobacco smoking kills over 100 people and causes over 1000 hospitalisations.   ",
        "questionNumber": 561,
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 132,
        "showAs": " 132. Deputy Eamon Scanlon asked the Minister for Transport for an update on the provision of a new bridge urgently needed to replace the existing Lennox bridge, which connects Kinlough, County Leitrim to Bundoran and Ballyshannon in County Donegal [63172/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_132",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_90",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_90",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_90.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any new road projects that seek State funding are assessed by the Department on a case-by-case basis. All projects proposed by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  Leitrim County Council presented a Preliminary Project Appraisal for the R280 Lennox Bridge Replacement Scheme in 2019. Between 2021 and 2023, Leitrim County Council received an allocation of €500,000, of which funding of €145,096 was drawn down for the scheme. An Options Report for Lennox Bridge was submitted by Leitrim County Council to the Department in 2023.  The Department responded to this report with concerns regarding the difficulty in achieving alignment with the Modal Hierarchy and Intervention Hierarchy of the National Investment Framework for Transport in Ireland (NIFTI), which was published in December 2021. As such, the Department deemed it was not in a position to approve the development of this bridge project beyond this point and communicated to Leitrim County Council its openness to future proposals that would specifically address the matter of safety at the bridge. The Department of Transport engages with Leitrim County County on a regular basis and is currently funding a number of projects, including, the development of tender documentation for a proposed new Shannon Crossing to replace Hartley Bridge, Cleaheen, Co Leitrim. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 491,
        "showAs": " 491. Deputy Eamon Scanlon asked the Minister for Education and Youth for an update on the redevelopment of a school (details supplied) in Sligo; and if she will make a statement on the matter. [63597/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_491",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_411",
          "showAs": "Schools Refurbishment",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_411",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_411.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth  The project for the school to which the Deputy refers, has been devolved to the school Board of Management for delivery, with the assistance of the Joint Managerial Body (JMB).  This major building project includes an extension, refurbishment and demolition works which will deliver 750 post primary school building.  The project is currently at Stage 2b. Stage 2b allows for detailed design/planning, obtaining the necessary statutory permissions and the preparation of tender documents.  As the project is still at an early stage in the delivery process, it is not possible at this time to give a date for its completion.  The Department is committed to ensuring appropriate accommodation is available for all pupils in Ursuline College and will in the wider context outlined, ensure that this project - as for all projects on our school building programme - is subject to the due diligence required under the public Infrastructure Guidelines.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The EU Short Term Rental (STR) Regulation was adopted by the EU on 11 April 2024 and is applicable from 20 May 2026. This Regulation lays down harmonised rules on the collection and exchange of data on short term rental services for member states, hosts providing short-term accommodation rental services, and online platforms that offer services to hosts providing short-term accommodation rental services within the EU.  The Department of Enterprise, Tourism and Employment has drafted the Short Term Letting and Tourism (STLT) Bill General Scheme in full alignment with the STR Regulation. The introduction of the STLT Bill will provide a more effective legal and administrative basis to regulate short term lettings. The proposed STLT Bill will provide the statutory basis for the establishment of a register for short term Lets in Ireland and for the implementation of the new EU STR.  Following the approval received from Government on the 15 April to generally preclude new planning permissions for STLs in large towns and cities my Department is working to give effect to this decision. This involves a review of the current Planning Acts with a view to remove references to Rent Pressure Zones in respect of short-term lets.  To ensure that there is a clear view, both at national level and local authority level, as to the overall policy approach to determining planning applications for Short-Term Lets, my Department is currently developing a National Planning Statement (NPS) for the STL sector to supplement and support the introduction of the STLT Bill. It will consider a variety of factors, such as existing planning legislation, the long term housing need in the local authority area, the location of the proposed short term let and balancing housing need with the potential impact on tourism and economic development. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_523.xml"
            }
          },
          "debateSectionId": "dbsect_523",
          "showAs": "Planning Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_523"
        },
        "questionNumber": 604,
        "date": "2025-11-12",
        "showAs": " 604. Deputy Eamon Scanlon asked the Minister for Housing, Local Government and Heritage if he will address concerns in relation to changes to the RPZ framework (details supplied); and if he will make a statement on the matter. [61268/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_604"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_971.xml"
            }
          },
          "debateSectionId": "dbsect_971",
          "showAs": "Ambulance Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_971"
        },
        "questionNumber": 1118,
        "date": "2025-11-12",
        "showAs": " 1118. Deputy Eamon Scanlon asked the Minister for Health for an update on the much-needed new ambulance and training facility base for Sligo; the stage the appraisal is at; when a design and planning application will be forthcoming; and if she will make a statement on the matter. [62217/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1118"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  My Department's Community Services Programme (CSP) supports 446 services nationally via 427 community organisations to provide local social, economic and environmental services through a social enterprise model.  It focuses on urban and rural communities where public and private sector services are lacking, either through geographical or social isolation or because of demand deficits.  The CSP Programme provides an annual co-funding contribution towards each full-time equivalent position being supported and, where warranted, towards the cost of employing a manager. The CSP contribution is not aligned with the minimum wage and is not intended to meet the full salary cost of supported posts. The contribution must be co-funded by other sources, for example, from income received from the public use of their facilities and services.  The CSP Programme currently provides funding towards 1,725 FTEs and 352 manager positions.  An allocation of €55.4m was made in Budget 2025 to support the CSP Programme for 2025, an increase of €3m from 2024. The additional funding announced for the Programme, as part of Budget 2025, was fully allocated to meet the increased employment costs of the existing CSP-funded organisations in 2025.  A further increase of €4m has been announced for 2026, bringing the total programme allocation to €59.4m for 2026.  Under the Programme for Government, a commitment was made to open the Community Services Programme for new applications.  My Department is currently examining the scope to hold an open call for the CSP Programme, in the context of the 2026 Budget announcement, having regard to both the funding needs of existing CSP-supported organisations and of organisations who wish to join the programme.  In the interim, any organisation who wishes to be contacted in the event that the Programme will open for new applicants, can provide contact details of a nominated person to the email address csp@drcdg.gov.ie.  It is also suggested that organisations may wish to make contact with their Local Development Company or Local Authority who may be able to provide some guidance on other supports available. ",
        "to": {
          "showAs": "Rural",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_1013.xml"
            }
          },
          "debateSectionId": "dbsect_1013",
          "showAs": "Community Development Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_1013"
        },
        "questionNumber": 1170,
        "date": "2025-11-12",
        "showAs": " 1170. Deputy Eamon Scanlon asked the Minister for Rural and Community Development and the Gaeltacht when the community services programme will reopen for applications; if his Department will accept expressions of interest at this time; and if he will make a statement on the matter. [62093/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1170"
      },
      "contextDate": "2025-11-12"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 15,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Report on Stakeholder Engagement and Emerging Themes on Infrastructure was published in July. The purpose of this report was to identify the most significant barriers to the timely deliver of critical infrastructure. This, in turn, is informing the development a report and action plan on accelerating infrastructure delivery that will be brought to Government in the coming weeks.  The Report on Stakeholder Engagement and Emerging Themes on Infrastructure was prepared by my Department following extensive engagement with a wide range of stakeholders. In the development of the report, officials met directly with over 50 key stakeholders involved in the development of infrastructure in Ireland and received nearly 170 formal responses to a public consultation conducted in parallel. This was complemented by engagement events, including a session at the National Economic Dialogue and a regional event in Athlone on 18 June.  The report highlights that while Ireland is investing more in infrastructure than ever before, with capital investment now at record levels, the development cycle has lengthened considerably. Twelve key barriers were identified under three broad headings:  • The regulatory environment including complex and overlapping consent processes, risk aversion, and insufficient coordination between agencies;  • The planning and legal systems, particularly the growing number and impact of judicial reviews, which create uncertainty and delay; and  • Internal Systems, such as fragmented governance, procurement challenges, and capacity constraints in the construction sector.  These barriers are interrelated and affect all stages of the infrastructure development lifecycle. The report makes clear that delays not only increase costs but also undermine housing delivery, competitiveness, and climate objectives.  The Report on Stakeholder Engagement makes a clear case for reform and sets out the evidence base for change. The forthcoming report and action plan will translate this into a targeted set of measures designed to realise that reform, ensuring Ireland’s infrastructure delivery model is fit for purpose, responsive, and capable of meeting the needs of a growing population and economy. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_51",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_51",
          "showAs": "Capital Expenditure Programme",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_51.xml"
            }
          }
        },
        "showAs": " 15. Deputy Eamon Scanlon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an overview of the report on stakeholder engagement and emerging themes on infrastructure; and if he will make a statement on the matter. [60199/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_15"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 40,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department has taken a proactive and coordinated approach to supporting the responsible and effective adoption of Artificial Intelligence (AI) across the Public Service. A key component of this was the publication of the ‘Guidelines for the Responsible use of Artificial Intelligence in the Public Service’ in May 2025, which provide a practical framework to assist Public Service Bodies in designing, developing and deploying AI in a manner that is ethical, transparent and aligned with public service values.  The Guidelines are structured around seven core principles. These are (1) human agency and oversight, (2) technical robustness and safety, (3) privacy and data governance, (4) transparency, (5) diversity, non-discrimination and fairness, (6) societal and environmental well-being, and (7) accountability. These are supported by a decision framework, an AI lifecycle model, and a practical Responsible AI Canvas tool. Together, these elements help Public Service Bodies to assess the appropriateness of AI use cases, manage risks, and embed good governance throughout the AI project lifecycle. There has been a high level of engagement across the public service, and they have been approximately 10,000 downloads since they were published online.  To build capability and ensure consistent understanding and application of these standards, my Department has worked with the Institute of Public Administration (IPA) to develop a suite of training courses, including Implementing the AI Guidelines, AI Essentials, Unlocking the Power of Microsoft Copilot for the Public Service, and an AI Masterclass for Senior Public Service Leaders. These courses are designed to meet the needs of both technical and non-technical staff and further details can be found on the IPA website www.ipa.ie. Since they were launched, over 1,700 people have completed the course on Navigating the Guidelines for the Responsible Use of Artificial Intelligence in the Public Service, and almost 4,000 have completed the bespoke course on AI in the Public Service.  In addition to this, CeADAR, Ireland’s Centre for Applied AI, acts as the European Digital Innovation Hub (EDIH) for AI, providing advice, testing facilities and technical support to both Public Service Bodies and enterprises seeking to explore or adopt AI responsibly.  Through these combined measures, my Department is ensuring a consistent, transparent and supportive approach to AI adoption across the Public Service, enabling innovation while maintaining public trust and ethical standards. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_74",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_74",
          "showAs": "Artificial Intelligence",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_74.xml"
            }
          }
        },
        "showAs": " 40. Deputy Eamon Scanlon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will report on the implementation of the ‘Guidelines for the Responsible use of Artificial Intelligence in the Public Service’; and if he will make a statement on the matter. [60200/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_40"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12"
        },
        "questionNumber": 93,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  In accordance with the requirements of the Infrastructure Guidelines, a Preliminary Business Case for a new Garda Divisional Headquarters in Sligo is being undertaken by An Garda Síochána.  Once complete, the Preliminary Business Case will be issued by An Garda Síochána to the Department of Justice, Home Affairs and Migration for their review and approval.  Following the approval of the Preliminary Business Case, An Garda Síochána will then advise the Office of Public Works regarding the prioritisation of the project. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_123",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_123",
          "showAs": "Capital Expenditure Programme",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_123.xml"
            }
          }
        },
        "showAs": " 93. Deputy Eamon Scanlon asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on the provision of a new Garda divisional headquarters in Sligo, which has been agreed by An Garda Síochána and his Department; and if he will make a statement on the matter. [54038/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_93"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 34. Deputy Eamon Scanlon asked the Minister for Education and Youth to investigate the delays related to the design and planning of the new development for a school (details supplied); and if she will make a statement on the matter. [59605/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_34",
        "questionNumber": 34,
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy will be delivered under my Department's ADAPT Programme.  The ADAPT Programme uses a professional external Programme Manager to co-ordinate and drive the Design Team to achieve the best possible timeframe for the project through the design stages of architectural planning to Tender and Construction.  The brief for this project is the development of a new 12 Classroom primary school with additional classrooms for pupils with Special Educational needs, on a green-field site.  The major building project is currently at Stage 2(a) of Architectural Planning – Developed Design, where the preferred agreed design option can be developed to a stage where the project is fully cost planned and the scheme can be prepared to lodge for statutory approvals with the local authority.  My Department has reviewed the Stage 2(a) Submission from the Design Team. The Stage 2(a) Stakeholders meeting was held on the 2nd July 2025, with representatives from the School Authorities, Design Team, Project Manager and my Department in attendance. The meeting concluded with a request for the Design Team to submit a Stage 2(a) Addendum report addressing issues raised by my Department at the meeting.  My Department has received and are currently reviewing the Stage 2(a) Addendum report. Upon review of the Stage 2(a) Addendum report, my Department will advise all Stakeholders regarding the further progression of the project.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_53",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_53.xml"
            }
          },
          "debateSectionId": "dbsect_53"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 61. Deputy Eamon Scanlon asked the Minister for Education and Youth when she will implement the recommendations of the school transport review concerning lowering the minimum distance limits in relation to the school transport scheme; and if she will make a statement on the matter. [59604/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_61",
        "questionNumber": 61,
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  As part of the recommendations of the School Transport Review, a number of School Transport pilots began in the 2024/2025 school year. These pilots are continuing for the current school year.  It was outlined at the time of the publication of the review that, given that the proposed changes to the eligibility criteria are likely to further increase demand for the scheme, it is prudent to implement the proposed changes on a phased basis.  In line with the recommendations arising from the review, the School Transport Section of my Department engaged with Bus Éireann to assess and identify where more pilots could be successfully delivered for the current school year.  A small number of new pilots have been selected, and the Department has provided sanction to Bus Éireann to review where additional capacity may be available for concessionary pupils who paid on time and would become eligible if the revised school transport scheme criteria was rolled out full. As part of these pilot routes, the distance criteria for pupils is 2km for primary and post primary and the need for a pupil to be attending their nearest school is removed.  Some of these pilots are up and running and the remainder are going through procurement. The sourcing of additional capacity can take time where a procurement process is required, and subsequent vehicle and driver safety compliance checks need to be completed.  These pilots will provide valuable insights on the impact increased demand will have on the scheme, the potential to integrate public transport services with school transport services, and the facilitation of more sustainable modes of transport.  Priority is given to provide school transport to pupils that are eligible under the current terms of the school transport scheme. Provision of additional services as pilot projects will be subject to the availability of vehicles and drivers in each area.  Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand. ",
        "debateSection": {
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_82",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_82.xml"
            }
          },
          "debateSectionId": "dbsect_82"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 339. Deputy Eamon Scanlon asked the Minister for Transport the efforts being made by the National Transport Authority on improving the reliability of Bus Éireann Route 64 between Galway and Derry via Sligo; the reasons for consistent and constant delays of up to an hour; his plans to address these; and if he will make a statement on the matter. [58932/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_339",
        "questionNumber": 339,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  Further, Bus Éireann's Expressway services, including route 64, is a commercial bus service and responsibility for the operation of the service is a matter for the company. I have, therefore, referred the Deputy's question to Bus Éireann for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_313",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_313.xml"
            }
          },
          "debateSectionId": "dbsect_313"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 706. Deputy Eamon Scanlon asked the Minister for Education and Youth further to Parliamentary Question No. 487 of 14 October 2025, to confirm the receipt of the revised plans from the architect which were submitted in response to her Department's request in relation to additional needs application from a school (details supplied) in County Sligo; if she will ensure that the project progresses as soon as possible; and if she will make a statement on the matter. [58306/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_706",
        "questionNumber": 706,
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under the Additional School Accommodation (ASA) Scheme. The project will provide three general classrooms, a science room with preparation area, a construction room with preparation area, a home economics room, a graphic design laboratory, a music room, a project store, two SET rooms, ancillary accommodation, and a one-classroom SEN base.  The project was devolved to the Mayo Sligo Leitrim Education Training Board (MSLETB) for delivery.  I can confirm that the Department granted approval for the project to proceed to the planning stage in Q3 2024. The Department is currently awaiting submission of the post-planning (developed design) report from the school for review.  Department officials have engaged directly with the design team to discuss a planning-related query raised by MSLETB. The Department will continue to work closely with the MSLETB to provide guidance and support as this ASA project progresses. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_650",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_650.xml"
            }
          },
          "debateSectionId": "dbsect_650"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 754. Deputy Eamon Scanlon asked the Minister for Education and Youth if her Department will review a concessionary ticket application for school transport in the case of a family (details supplied); and if she will make a statement on the matter. [58701/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_754",
        "questionNumber": 754,
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  Under the current terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the department/Bus Éireann, having regard to ethos and language.  Children who are not eligible for school transport, but who completed the application process on time, are considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Under the terms of the scheme, the availability of concessionary transport varies from year to year based on the capacity on the buses running on all the various routes and the number of eligible children accommodated on each route.  Bus Éireann has confirmed that the pupil, to whom the Deputy refers, is eligible for school transport. A ticket has not issued for the 2025/26 school year as payment/medical card details were received late at which time the service was operating to capacity with no seats available. ",
        "debateSection": {
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_691",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_691.xml"
            }
          },
          "debateSectionId": "dbsect_691"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 755. Deputy Eamon Scanlon asked the Minister for Education and Youth if her Department will review a concessionary ticket application for school transport in the case of a family (details supplied); and if she will make a statement on the matter. [58702/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_755",
        "questionNumber": 755,
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  Under the current terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the department/Bus Éireann, having regard to ethos and language.  Children who are not eligible for school transport, but who completed the application process on time, are considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Under the terms of the scheme, the availability of concessionary transport varies from year to year based on the capacity on the buses running on all the various routes and the number of eligible children accommodated on each route.  Bus Éireann has confirmed that the pupil, to whom the Deputy refers, is not eligible for school transport as the family do not meet the distance criteria. The pupil was not successful in receiving a concessionary ticket for the 2025/26 school year following a late application at which time the service was operating to capacity with no seats available. ",
        "debateSection": {
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_692",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_692.xml"
            }
          },
          "debateSectionId": "dbsect_692"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1290. Deputy Eamon Scanlon asked the Minister for Justice, Home Affairs and Migration the current processing times for visa appeal decisions specifically related to Long Stay (D) Join Family applications; and if he will make a statement on the matter. [58714/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1290",
        "questionNumber": 1290,
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I can advise the Deputy that visa appeals are processed in the seven overseas Visa Offices in addition to the Visa Office in Dublin. They are located in Abuja, Beijing, London, Moscow, Ankara, Abu Dhabi and New Delhi.  I can assure the Deputy that while processing times can vary across the different Visa Offices the majority of visa appeals are processed within stated target times. However, some appeals can take considerably longer. Processing times for all appeals are influenced by a number of factors. The time it can take varies depending on the type and complexity of application; individual circumstances; peak application periods; such as holidays or the start of the school year; and, crucially, the quality and completeness of the appeal lodged.  I understand that extended wait times can be frustrating for applicants, and I want to assure anyone who is appealing a visa decision that my Department is doing everything possible to progress these applications as quickly as possible.  The appeals process allows applicants, in the event of a refusal of the application at first instance, to address the factors which gave rise to that decision. All visa applicants are advised that the responsibility is on them to provide as much information in support of their application as they feel is necessary. Guidelines in this regard are posted on my Department's website. People that carefully follow these guidelines have an improved prospect of receiving a positive decision.  When making an appeal, applicants should take into account the reasons for refusal listed in their refusal letters. The appeal should include any further information or additional documentation they wish to have considered. People will find further details on the appeals process at the following link: www.irishimmigration.ie/appeal-a-negative-decision/  In 2024, approximately 6,585 visa appeals, of all types, were received by the Visa Division of my Department. This reflects an increase of 5%, compared to 2023, with over 314 additional appeals received.  In the first eight months of 2025, my Department’s Visa Division issued 3,981 decisions on appeals, this reflects an increase of 25% compared to the same period in 2024.  Visa and preclearance applications provide legal avenues for people moving to Ireland for employment, study and family reasons and also to facilitate visitors who wish to travel for business and/or tourism. It is important to recall these applications are screening processes, designed to establish that the person has a legitimate reason to come to Ireland prior to travel. Verifying an application is an important part of our immigration system and the checks involved can take time to complete.  The tables below detail information regarding processing times for join family visa appeals by the Dublin Visa Office and the overseas Visa Offices. Please note that processing times for join family appeals considered by the Moscow, Abuja and Abu Dhabi office are not available at this time.   Table 1. Join Family Appeals Dublin Visa Office       Visa Type      Date appeals received in Dublin       Join family (Sponsor is in Category B)    01July 2024      Join family (Sponsor is an Irish citizen or is in Category A)    04 December 2023          Table 2. Target join family processing times for visa appeals in the Overseas Visa Offices       Visa Category      Ankara      New Delhi      London      Beijing        Long Stay Visa Appeals (Type D) - Join Family     6 to12 Months    12 months    6 Months    4 months       The date published on the website of the Dublin Visa Office is the oldest date of appeal currently being processed. However, it should be noted that the Visa team continue to process and make decisions on appeals received after the published processing date. If a particular appeal takes longer to consider this may result in the published processing date remaining unchanged. I can assure you that this does not indicate the processing of these appeals has halted overall.  My Department is committed to providing the best possible service to applicants. To provide greater clarity, officials in my Department are currently in the process of updating the Immigration Service website for processing times for decisions on visa appeals by the Dublin Visa Office. ",
        "debateSection": {
          "showAs": "Visa Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1109",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1109.xml"
            }
          },
          "debateSectionId": "dbsect_1109"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2017. Deputy Eamon Scanlon asked the Minister for Health the services currently provided for adult patients with epilepsy at Sligo University Hospital; the number and grade of staff that are currently attached to this service at this site; the number of current staff vacancies within this service; the number of epilepsy patients currently registered with this service; the number of patients currently awaiting first consultations; and if she will make a statement on the matter. [59663/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_2017",
        "questionNumber": 2017,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1748",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1748.xml"
            }
          },
          "debateSectionId": "dbsect_1748"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 222. Deputy Eamon Scanlon asked the Minister for Health the progress of the working group on the National Hearing Care Plan; if she has received the report from the working group that was due by end of Quarter 2 as per the Terms of Reference; and if she will make a statement on the matter. [57614/25] ",
        "by": {
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "showAs": "Eamon Scanlon",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_222",
        "questionNumber": 222,
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I propose to take Question No 177, 191, 222 and 225 together.  The Minister for Health established the National Hearing Care Plan Working Group in August 2024. The Group is jointly chaired by the Department of Health and the Health Service Executive (HSE).  Membership of the Working Group is drawn from relevant stakeholders, including HSE clinicians and management, the Irish Society of Hearing Aid Audiologists (ISHAA), the Irish Academy of Audiology (IAA), and the Department of Social Protection.  The Hearing Care Plan Working Group has been tasked with developing recommendations for a holistic model of hearing care in Ireland. To support this, a structured workstream has been developed, including subgroups focused on progressing priority issues. Significant progress has been made to date. There have been 15 meetings of the Working Group and associated subgroups since formation.  The scope of the work being considered by the Group has expanded beyond initial expectations, which has impacted on the timeline of the delivery of the report. The Group is examining:  • The existing level of hearing care provision in Ireland.  • Capacity constraints and opportunities within the HSE.  • Workforce planning, including improved recruitment and retention in the public system.  • The appropriate level of regulation of the audiology profession.  • Improving referral pathways and the integration between acute and community care.  • The effective linkage between public and private care to improve patient outcomes, including reductions in waiting times.  This is wide-ranging work, and it is the intention of the Group to ensure that the final report is comprehensive in its treatment of these matters.  A public consultation will be launched soon. This will further inform the Group’s final recommendations. The revised timeline for the report to be submitted to the Minister is now Q1 2026. ",
        "debateSection": {
          "showAs": "Departmental Reports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_187",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_187.xml"
            }
          },
          "debateSectionId": "dbsect_187"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "EU Membership",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_84.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_84",
          "debateSectionId": "dbsect_84"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Ireland’s support for Ukraine’s EU perspective is steadfast and remains a key focus of my engagements with EU counterparts, both bilaterally and in Brussels.  Ukraine was granted EU candidate country status in June 2022, with negotiations opening in December 2023. Despite Ukraine meeting the necessary criteria, Hungary continues to block the opening of the first negotiating cluster with Ukraine (and Moldova), effectively vetoing their progress. Ireland supports a merit-based EU accession process and has raised at political level our serious concern and frustration at this blockage.  In discussions at Foreign Affairs Council, General Affairs Council and European Council, Ireland’s message is clear that we want to see concrete progress on Ukraine’s EU accession. At the European Council in June, leaders from 26 EU Member States, including Ireland, reiterated clear support for Ukraine’s path towards EU membership, and invited the Council to take the next steps in the accession process in line with the merit-based approach.  As a concrete signal of our position, Ireland also continues to provide financial and capacity building support for Ukraine’s EU candidacy. In September, as part of a package of €35.4 million in humanitarian assistance and stabilisation supports to Ukraine and neighbouring countries, I announced €1.5 million in funding for the Ukraine2EU initiative. This initiative supports Ukraine in coordinating and monitoring its accession process, and ensuring the harmonisation of Ukrainian legislation with EU Law. My department is also supporting the provision of capacity building supports for candidate countries, including for Ukraine, to align with EU acquis.  The European Commission’s 2025 Special Eurobarometer Survey on Enlargement and Perception surveys in candidate and potential candidate countries confirmed that over 70% of Ukrainian’s support EU membership. Ukraine’s future lies within the European Union and Ireland will continue to support Ukraine’s efforts towards EU membership. ",
        "questionType": "written",
        "showAs": " 119. Deputy Eamon Scanlon asked the Tánaiste and Minister for Foreign Affairs and Trade the action he is taking to support Ukraine in its bid for EU membership; and if he will make a statement on the matter. [56960/25] ",
        "questionNumber": 119,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_119"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_114",
          "debateSectionId": "dbsect_114"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Parliamentary elections were held in Czechia over two days on 3 and 4 October 2025, with political parties contesting all 200 seats in the lower house. At 68.95%, voter turnout was the highest since elections in 1998.  The ANO (Action of Dissatisfied Citizens/Yes) party, led by former Prime Minister Andrej Babiš, emerged as the leading party with 34.51% of the vote, winning 80 seats in the Chamber of Deputies. The SPOLU (Together) alliance, consisting of three of the outgoing governing parties, came in second place with 23.36%, followed by governing coalition party STAN (Mayors and Independents) on 11.23%. Three smaller parties exceeded the parliamentary threshold of 5% and will also have representation in the new Czech parliament.  Negotiations on forming a new government are underway. Ireland has excellent bilateral relations with Czechia, a valued EU partner, and I look forward to working with the new administration in Prague. ",
        "questionType": "written",
        "showAs": " 163. Deputy Eamon Scanlon asked the Tánaiste and Minister for Foreign Affairs and Trade his response to the recent election in Czechia; and if he will make a statement on the matter. [56961/25] ",
        "questionNumber": 163,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_163"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_221.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_221",
          "debateSectionId": "dbsect_221"
        },
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel infrastructure. The National Transport Authority (NTA) along with the relevant local authorities are responsible for the development and delivery of individual projects.  The Government is committed to promoting and enabling walking and cycling across the country with approximately €360 million provided for Active Travel and Greenways this year alone, supporting projects in every Local Authority. The vast majority of this funding is allocated to the National Transport Authority (NTA) through the Department of Transport for its Active Travel Infrastructure Programme. I was delighted to secure similar funding for Active Travel and Greenways in Budget 2026, meaning that we can continue to progress walking and cycling projects around the country into next year.  As part of the allocations determination, the NTA liaises with each local authority to fully understand the projects being proposed by the local authority and its considerations in terms of priorities.  In general, the main focus of active travel investment will be to support high quality walking and cycling infrastructure, for everyday trips, in villages, towns and cities, particularly in designated growth settlements, with a view to promoting the greatest potential modal shift to active travel.  Given the ramping up of activities over the last few years in the Active Travel area, the number of projects being progressed now exceeds the level of funding made available to the NTA. Accordingly, the NTA is unable to fully fund all proposed Active Travel projects and has to prioritise certain projects over others in order to remain within its allocated budget. While a project may not be selected by the NTA for funding in a particular year, it may be funded in subsequent years.  The 2026 allocations for the Active Travel Infrastructure Programme will be announced early in the new year. ",
        "questionType": "written",
        "showAs": " 282. Deputy Eamon Scanlon asked the Minister for Transport if funding will be provided for the provision of a cantilever footbridge alongside the river bridge over the Shannon at Rooskey, County Leitrim; and if he will make a statement on the matter. [57338/25] ",
        "questionNumber": 282,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_282"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_381.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_381",
          "debateSectionId": "dbsect_381"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  The Act defines a relevant owner as an individual who owns, whether jointly or not, a relevant dwelling and:  • became an owner of the dwelling prior to 31 January 2020,  • inherited the dwelling on or after 31 January 2020, or  • subject to Section 9(4) of the Act, purchased the dwelling on or after 31 January 2020.  Section 9 (4) states that an individual who purchased a relevant dwelling on or after 31 January 2020, other than a dwelling in respect of which a letter of assurance has been issued, shall not be a relevant owner where he or she knew or ought to have known that defective concrete blocks were used in the construction of the dwelling.  Individuals who acquire a dwelling on or after 31 January 2020 will generally not be eligible for a grant. However, in certain limited circumstances, as an exception to the general rule, a relevant local authority may consider an application from an individual applying in good faith, on the honest belief that they either did not know, or could not have known that defective concrete blocks were used in the construction of the dwelling.  Local authorities have responsibility for the administration of the Defective Concrete Blocks Grant scheme. This includes the initial validation of applications. Detailed queries of this nature surrounding individual applications should be addressed in the first instance to the relevant local authority, in this case, Sligo County Council. ",
        "questionType": "written",
        "showAs": " 464. Deputy Eamon Scanlon asked the Minister for Housing, Local Government and Heritage if a dwelling in County Sligo (details supplied) is eligible for the pyrite remediation scheme; and if he will make a statement on the matter. [56611/25] ",
        "questionNumber": 464,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_464"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_384.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_384",
          "debateSectionId": "dbsect_384"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  The Vacant Property Refurbishment Grant provides a grant of up to €50,000 to support the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The maximum grant amounts were increased in May 2023 from €30,000 to €50,000 for the Vacant Property Refurbishment Grant and from €50,000 to €70,000 for homes considered derelict.  In conjunction with the Vacant Property Refurbishment Grant, other supports and grants may be used to bring these vacant and derelict properties into use as homes.  The Conservation Advice Grant Scheme for Vacant Traditional Houses is an expanded funding scheme to provide grants for expert conservation advice to owners of vacant traditional houses who are availing of, or considering, the Vacant Property Refurbishment Grant.  A Sustainable Energy Authority of Ireland (SEAI) Better Energy Home Scheme Grant may also be used alongside the VPRG. Further information on the SEAI grants available can be found here: www.seai.ie/grants/home-energy-grants.  A comprehensive review of the Vacant Property Refurbishment Grant was undertaken in 2024 , which considered all aspects of the scheme.  The review of the grant and the commitments contained in the Programme for Government are being considered as part of the next Housing plan which will be launched over in the coming weeks. ",
        "questionType": "written",
        "showAs": " 467. Deputy Eamon Scanlon asked the Minister for Housing, Local Government and Heritage if there are plans to increase funding for the vacant property refurbishment grant (Croí Cónaithe towns fund); and if he will make a statement on the matter. [56761/25] ",
        "questionNumber": 467,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_467"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "General Practitioner Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_755.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_755",
          "debateSectionId": "dbsect_755"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 868. Deputy Eamon Scanlon asked the Minister for Health the plans in place to address the over-subscribed and closed GP waiting lists in Tubbercurry, County Sligo; the arrangements that will be made when a local GP retires in three months; whether locum GPs will provide services in HSE premises or additional clinics in local GP practices to ensure all residents have access to GP services; and if she will make a statement on the matter. [57387/25] ",
        "questionNumber": 868,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_868"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Forestry Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_64.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_64",
          "debateSectionId": "dbsect_64"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I recognise that storms Darragh and Éowyn have caused significant damage to forests around the country, and that this presents significant challenges for forestry stakeholders. I also welcome the positive progress made by the forestry sector in the mobilisation of windblown material in forests.  As part of Budget 2026 I was delighted to announce an additional €5 million allocation for forestry in Ireland compared to 2025, bringing our total investment in the area in 2026 to €93 million. This investment will include a Forestry Reconstitution Scheme for those affected by windblown sites, subject to Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation approval. Once formal approval is secured, my Department will move quickly to introduce the scheme.  This will build on the good work already undertaken. Following the storms I quickly established the Forest Windblow Taskforce and delivered an action plan created in conjunction with stakeholders from across the sector, focused on the mobilisation and processing of windblown timber.  My Department has been working hard and is using every means at its disposal to assist in the recovery of storm affected timber. This has included, in conjunction with Coillte, an extensive analysis of the windblow situation using satellite imagery. This has been useful in mapping the boundary of each area affected, which can be used by landowners and their foresters. This has simplified the process of prioritising storm-related felling and road licence applications.  To further speed up the process, we have allowed the use of both thinning and clearfell licences in removing storm damaged trees, and our data now shows that 77% of windblown trees already have a felling licence issued by the Department.  All this has meant that more than 90% of the harvesting capacity in the country is now working in windblow areas.  Finally, I wish to reassure the Deputy and forest owners that we are determined to work with all in the sector to address the effects of Storm Éowyn and to secure a future for forestry in Ireland. I also want to reassure affected forest owners that they will not be disadvantaged by undertaking works now, and if they do not currently have a felling licence, they should consult with their forester as soon as possible about applying for one. ",
        "questionType": "written",
        "showAs": " 122. Deputy Eamon Scanlon asked the Minister for Agriculture, Food and the Marine when the scheme will open for landowners to apply for funding to replant ground damaged as a result of storm Éowyn; and if he will make a statement on the matter. [54901/25] ",
        "questionNumber": 122,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_122"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_178.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_178",
          "debateSectionId": "dbsect_178"
        },
        "to": {
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  The National Development Plan Review 2025 has been published by Government. This sets out capital ceilings for transport to 2030. My department will now progress the sectoral plan for the 2026 to 2030 period, which will be published later this year and which will inform national road scheme priorities in the coming years.  I can confirm that €1,000,000 has been allocated for the N17 Collooney to Knock scheme in 2025. As with all national roads projects in the NDP, the delivery programme for the project will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply updating you as to the progression of this project. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "showAs": " 256. Deputy Eamon Scanlon asked the Minister for Transport if the N17 Collooney to Knock road project is included in the National Development Plan 2026-2035; if phases 3 and 4 of the project will be completed by the end of 2027; and if he will make a statement on the matter. [54822/25] ",
        "questionNumber": 256,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Eamon Scanlon",
          "memberCode": "Eamon-Scanlon.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Eamon-Scanlon.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_256"
      }
    }
  ]
}