{
  "head": {
    "counts": {
      "questionCount": 341,
      "resultCount": 341
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 51. Deputy Cathy Bennett asked the Minister for Children, Disability and Equality the number of children in Cavan and Monaghan who received an assessment of need within the statutory timeframe in the years 2020 to date; and the number who have not. [72968/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_94",
          "debateSectionId": "dbsect_94",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_51",
        "questionNumber": 51
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 64. Deputy Cathy Bennett asked the Minister for Children, Disability and Equality the timeframe in which she intends to bring forward a plan to achieve a reduction in the cost of childcare to €10 per day. [72967/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_107",
          "debateSectionId": "dbsect_107",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_107.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_64",
        "questionNumber": 64
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 120 and 154 together.  The Commission for the Regulation of Utilities (CRU) regularly publishes market monitoring data including:-  • the estimated annual bills for households;  • the number of households in payment arrears on their energy bills;  • the number of disconnections; and  • the number of customers switching energy supplier.  Arrears data is generally published by the CRU on a monthly basis, though it is acknowledged that there was a delay in the publication of the data in July, August and September of this year. As arrears data operates with a two-month time lag due to the way suppliers report these figures to the CRU and the need to validate the data, the latest published arrears figures are for September 2025.  The data show that there are currently 297,313 customers in electricity arrears. This is a 3.4% decrease from the August figure of 307,862. For those in arrears more than 90 days, 187,307 electricity customers were in arrears in September 2025, a slight decrease of 0.7% from August 2025 which was 188,618.  In relation to gas, 179,576 customers were in arrears in September 2025, a 3.76 decrease from 186,594 households in August. Regarding customers in arrears over 90 days, this stood at 153,658 in September, a decrease of 0.5% from August 2025.  The CRU is currently reviewing its market monitoring framework through which this data is collected and reported upon. The review aims to provide more granular information to gain a better understanding of the numbers of customers who may be in more distress and in need of support with their debt.  The Deputy may wish to engage directly with the CRU in relation to the matters raised. The CRU provides a dedicated email address, oireachtas@cru.ie, for Oireachtas members which enables them to raise questions on general energy regulatory matters. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 120. Deputy Cathy Bennett asked the Minister for Climate, Energy and the Environment the current number of consumers in arrears regarding electricity bills; and the cadence at which such data is reported to Government. [72995/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_151",
          "debateSectionId": "dbsect_151",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_151.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_120",
        "questionNumber": 120
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 153, 163 and 166 together.  In recent years, Government introduced a suite of measures to help households and businesses deal with higher energy costs. This included the provision of electricity credits to households worth €1,500 over four credit schemes, with a total cost of €3.3 billion. These universal credits were always envisaged as temporary, emergency measures because, while necessary at the time, they are not fiscally sustainable nor do they address the structural drivers of high energy costs.  The National Energy Affordability Taskforce was established in June of this year to identify, assess and implement measures that will enhance energy affordability for households and businesses. The first report of the taskforce, which was published last month, set out measures for consideration as part of the Budget 2026 process. Many of these options were reflected in Budget decisions. Examples of targeted Budget measures aimed at improving energy affordability include:  • the Fuel Allowance increasing by €5 per week to €38, supporting over 450,000 households who most require Government assistance to meet their energy costs;  • to directly support working families, the Fuel Allowance has been extended to recipients of the Working Family Payment. This will benefit over 43,000 families;  • from September 2026, those who move from Disability Allowance or Blind Pension to employment will be able to retain the Fuel Allowance for five years; and  • record funding of €558 million is being allocated for Sustainable Energy Authority of Ireland residential and community energy upgrade schemes (including the solar PV scheme) in 2026. This allocation will support the highest ever budget for the Warmer Homes Scheme, which is targeted at households in energy poverty.  In addition, the VAT reduction (from 13.5% to 9%) on electricity and gas bills has been extended to the end of 2030, saving households up to €100 per year.  It is important to note that the Department of Social Protection can also provide support through the Additional Needs Payment to help households meet expenses, including those who face difficulties with fuel bills. There are also a range of CRU customer protections are in place, including disconnection moratoria.  The National Energy Affordability Taskforce is now preparing an engagement and consultation process to inform the development of an action plan to be published mid-2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 153. Deputy Cathy Bennett asked the Minister for Climate, Energy and the Environment his proposals to support consumers financially burdened by rising energy prices. [72994/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_183",
          "debateSectionId": "dbsect_183",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_183.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_153",
        "questionNumber": 153
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  At the outset I will clarify the key roles and responsibilities across Government in relation to the EU’s Multiannual Financial Framework (MFF).  My colleague the Minister for Foreign Affairs and Trade and I in my role as Minister for Finance jointly lead the development of Ireland’s positions in relation to the EU’s Multiannual Financial Framework (MFF). As such it is my role to update Government regularly on negotiations, in close cooperation with the Minister for Foreign Affairs and Trade and the Minister of State for European Affairs.  On 16 July and 3 September 2025, the European Commission published a series of proposals under the MFF 2028 – 2034 package, which launched the beginning of negotiations on the next long-term EU budget. Since then, Ministers and their officials across Government, led by my Department and the Department of Foreign Affairs and Trade have been analysing, at pace, the complex range of proposals which seek to reshape and restructure the MFF, and which prioritise new and emerging demands within the Union such as competitiveness, security and defence.  The General Affairs Council, which is attended by the Minister of State for European Affairs, is the Council formation carrying forward MFF negotiations. It has discussed MFF at all meetings since July 2025.  ECOFIN Council, which is composed of Finance Ministers, is noted as having a particular interest in those negotiations, due to the substantial economic and financial impacts of the MFF.  Most notably, Finance Ministers hold responsibility for the Own Resources (revenue) legislation, as well as annual negotiations on that year’s EU budget. ECOFIN held an exchange of views on the own resources package in October 2025 and is expected to return to the topic in future months.  The MFF is on the agenda for the European Council meeting of 18 December, where leaders are expected to take stock of progress in negotiations to date, and look ahead to reaching a speedy agreement.  I and my colleagues across Government regularly engage with our counterparts at Ministerial level, within the European Commission, and with other important stakeholders, notably Members of the European Parliament, as part of our day-to-day work. MFF is a topic of interest to all, given its role as a catalyst for many Union policies, from the long-standing drivers of our prosperity in the Common Agricultural Policy and cohesion, to the emerging needs of international security and global competitiveness.  In all these engagements, my colleagues in Government and I stress the areas of central importance to Ireland: most notably but not limited to a strong and ring-fenced Common Agricultural Policy and Common Fisheries Policy; continued support for the PEACE PLUS programme in Northern Ireland and the border counties of Ireland; funding for competitiveness and excellent research; sustained support for Ukraine; continued development and humanitarian assistance; and a revenue system that is fair, equitable, simple and transparent, primarily based on Gross National Income. As part of the wider simplification drive, we must ensure reduced administrative burden for beneficiaries of EU funds.  Together with my colleagues across Government, I will continue my engagements with key negotiating partners, to communicate these core requirements that Ireland needs to see in the next MFF. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 189. Deputy Cathy Bennett asked the Tánaiste and Minister for Finance if he will report on his engagement regarding the EU Multiannual Financial Framework post-2027. [73034/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "European Union",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 291 and 292 together.  The Sustainable Energy Authority of Ireland (SEAI) is responsible for the administration of a range of home energy upgrade schemes funded by my Department.  These include: fully funded upgrades for households at risk of energy poverty under the Warmer Homes Scheme; individual energy upgrade grants under the Better Energy Homes Scheme; the National Home Energy Upgrade Scheme for an end-to-end service through One Stop Shops; and the Community Energy Grant Scheme for energy efficiency upgrades as part of a community project.  Different eligibility requirements apply to each SEAI scheme. Details on the eligibility rules that apply are available on the SEAI’s website: www.seai.ie/grants/home-energy-grants  The SEAI administer the schemes in line with a code of practice, technical guidance documents and the SEAI Customer Charter. They also operate a quality assurance programme to monitor and maintain contractor standards.  Under the schemes, the general principle applies that grant funding can only be issued once per measure per property. However, under the National Home Energy Upgrade scheme, a homeowner undertaking a deep retrofit on their dwelling may, in some circumstances, be permitted to avail of a second grant for a wall insulation measure where it is recommended in the One Stop Shop Home Energy Assessment to achieve the B2 and heat pump target as part of a single upgrade project. The SEAI will be happy to advise individual homeowners of the grants available in their particular circumstances.  It is important to note that the grants available through the SEAI aim to maximise emission reductions and deliver energy savings for the widest range of homeowners possible. The grants which are available, and their respective eligibility criteria, were selected as the most likely to deliver significant energy savings to homeowners as well as the best value for money for the Exchequer. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 291. Deputy Cathy Bennett asked the Minister for Climate, Energy and the Environment the process and policy that exist within the SEAI to ensure consistency and fairness in the application of grant criteria; and if he will make a statement on the matter. [73714/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_296",
          "debateSectionId": "dbsect_296",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_296.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_291",
        "questionNumber": 291
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 291 and 292 together.  The Sustainable Energy Authority of Ireland (SEAI) is responsible for the administration of a range of home energy upgrade schemes funded by my Department.  These include: fully funded upgrades for households at risk of energy poverty under the Warmer Homes Scheme; individual energy upgrade grants under the Better Energy Homes Scheme; the National Home Energy Upgrade Scheme for an end-to-end service through One Stop Shops; and the Community Energy Grant Scheme for energy efficiency upgrades as part of a community project.  Different eligibility requirements apply to each SEAI scheme. Details on the eligibility rules that apply are available on the SEAI’s website: www.seai.ie/grants/home-energy-grants  The SEAI administer the schemes in line with a code of practice, technical guidance documents and the SEAI Customer Charter. They also operate a quality assurance programme to monitor and maintain contractor standards.  Under the schemes, the general principle applies that grant funding can only be issued once per measure per property. However, under the National Home Energy Upgrade scheme, a homeowner undertaking a deep retrofit on their dwelling may, in some circumstances, be permitted to avail of a second grant for a wall insulation measure where it is recommended in the One Stop Shop Home Energy Assessment to achieve the B2 and heat pump target as part of a single upgrade project. The SEAI will be happy to advise individual homeowners of the grants available in their particular circumstances.  It is important to note that the grants available through the SEAI aim to maximise emission reductions and deliver energy savings for the widest range of homeowners possible. The grants which are available, and their respective eligibility criteria, were selected as the most likely to deliver significant energy savings to homeowners as well as the best value for money for the Exchequer. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 292. Deputy Cathy Bennett asked the Minister for Climate, Energy and the Environment the reason approval for support for works was not granted at a home (details supplied), given neighbouring homes with matching parameters were approved; and if he will make a statement on the matter. [73715/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_296",
          "debateSectionId": "dbsect_296",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_296.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_292",
        "questionNumber": 292
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  My Department collects data on Ireland’s EU Budget receipts, from relevant Government Departments, for the previous year on an annual basis for publication in the EU Transactions Reports and up until the year 2021 in the Department of Finance Budgetary Statistics. This operational data may be subject to revision and any updates which may be required are reflected in subsequent publication releases.  This table sets out Ireland’s EU budget receipts as reported by relevant Government Departments in this process, from 2019-2023, the latest year for which data is available. My Department is currently collecting the data on receipts for 2024, and this information will be published in the coming months. These figures include, but are not limited to, such programmes as the European Agricultural Guarantee Fund, the European Fund for Regional Development, and Erasmus+. They do not include funds directly managed by the European Commission; as such the figures do not provide the full picture of Ireland’s receipts from the EU budget.   Table 1: Ireland’s EU budget receipts, 2019-2023      Year    Receipts from EU Budget € billion      2019    1.8      2020    1.9      2021    2.4      2022    2.0      2023    1.7       The European Commission also publishes data on Member States’ transactions with the EU, of which the most recently available data is 2024. These figures can differ from those collected by Government Departments, reflecting differences in accounting practices and time periods.  In relation to future years, my Department does not forecast the precise levels of EU budget receipts Ireland is expected to draw down in a given future year. These figures are contingent on a number of factors, such as the status and speed of project implementation, and when individual Departments submit payment requests to the European Commission.  In relation to contributions, the annual contribution of Ireland to the EU Budget from 2019 to 2024 is as follows:   Table 2: EU Budget payments 2019-2024      Year    Payments to EU Budget (€ billion)      2019    2.4      2020    2.6      2021    3.5      2022    3.6      2023    3.7      2024    3.4       With regard to projected contributions, my Department’s most recent forecast was prepared for Budget 2026, for the remaining years of the current Multiannual Financial Framework period, which ends in 2027. My officials will continue to work on revising these forecasts as the MFF period progresses. The current projected contributions for the remaining three years are as follows:   Table 2: EU Budget payment forecast 2025-2027      Forecast Gross Payments to EU Budget    2025 (€ billion)    2026(€ billion)    2027(€ billion)      Total    3.4    4.3    4.9       Based on my Department’s forecasts, Ireland’s contributions to the EU budget will continue to grow over the remainder of the MFF period. This is directly linked to several factors, including in particular the overall level of payments in the EU budget, which Member States must finance, and Ireland’s economic performance, which drives Ireland’s share of the overall budget. A significant proportion of how Member States finance the EU budget is according to relative Gross National Income (GNI). ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 361. Deputy Cathy Bennett asked the Tánaiste and Minister for Finance the total Irish receipts or projected receipts from the EU Multiannual Financial Framework; the total Irish contribution or projected contribution to the EUMFF in each of the years 2019 to 2027, in tabular form. [69684/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_359",
          "debateSectionId": "dbsect_359",
          "showAs": "EU Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_359.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_361",
        "questionNumber": 361
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 322. Deputy Cathy Bennett asked the Minister for Justice, Home Affairs and Migration the criteria applicable to the composition of his new firearms forum; the basis of said criteria; and if he will make a statement on the matter. [72595/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_322",
        "questionNumber": 322
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 322 to 325, inclusive, 329, 330, 333, 334 and 338 to 341, inclusive, together.  My Department holds meetings with individual firearms organisations on request and engages with various firearms stakeholders, including representative firearms organisations, in various ways.  An Garda Síochána also meets with firearms stakeholder organisations in respect of relevant matters.  Officials from my Department also liaise regularly with the Firearms Policy Unit of An Garda Síochána on firearms-related matters.  Earlier this year, my Department organised a series of engagements with firearms stakeholders in Wicklow, Limerick, Carrick-on-Shannon and Mullingar.  I and officials from my Department have also met with representative organisations, including the FURG (Firearms Users Representative Group) and the NARGC (National Association of Regional Games Councils).  In these and other engagements, I have confirmed my support for more regular and structured engagement between policy makers and firearms users than has taken place since the last meeting of the Firearms Consultative Panel (FCP) in 2019.  I can advise that ongoing engagement has continued with firearms stakeholders.  The most recent engagement took place on the 1st December, where more than 20 representatives of the firearms community and firearms stakeholder organisations attended a meeting with my officials. One of these meetings also took place on the 18th September.  Due to the nature of these initial engagements, formal minutes were not taken. This approach is to ensure proceedings would be open and transparent while facilitating frank and honest exchanges of views. This was explained at the beginning of the meetings.  As these engagements evolve, consideration will be given to the question of the publication of minutes of the meetings.  The objective of these meetings is to provide a mechanism for ongoing engagement with firearms stakeholders from a broad range of areas within the firearms community, ensuring their valuable insights in specific areas of firearms can be considered in any future policy and legislative changes that may arise.  The stakeholders attending these meetings include several from representative organisations, experts in technical areas of firearms and members of An Garda Síochána’s Firearms Policy Unit. Several of the stakeholders were also members of the FCP.  Stakeholder organisations are encouraged to make submissions to the meetings, engage with other stakeholders and contribute.  It is intended to continue the proactive and open engagement that has taken place.  Any stakeholder organisation that would like to contribute to these engagements is also welcome to engage with my Department on the matter. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 323. Deputy Cathy Bennett asked the Minister for Justice, Home Affairs and Migration his response to concerns that his new firearms forum excludes certain stakeholders (details supplied); and if he will make a statement on the matter. [72596/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_323",
        "questionNumber": 323
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As Minister for Defence, I am committed to introducing legislation to reform the Triple Lock. It is not acceptable to the Government that any one of five permanent members of the U.N. Security Council have an essential veto on Ireland participating in Peacekeeping missions overseas.  The General Scheme of the Defence (Amendment) Bill 2025 was approved by Government in March of this year.  The General Scheme was subsequently referred to the Joint Oireachtas Committee on Defence and National Security for consideration under the Pre-Legislative Scrutiny process.  The purpose of this Bill is to:  (a) revise and consolidate the current legislation, including the provisions concerning the operation of the so-called 'Triple Lock' mechanism, relating to the despatch of members of the Defence Forces for service outside the State; and,  (b) give effect to recommendations pertaining to suspension and associated provisions contained within the report prepared by Mr Peter Ward, Senior Counsel, concerning the management of members of the Defence Forces charged, with or convicted of, serious criminal offences.  Prior to my recent appointment as Minister for Defence, there has been very detailed engagement on this legislation, most recently as part of the pre-legislative scrutiny process which provided the Committee with the opportunity to examine the Heads and to consult relevant stakeholders on the proposed Bill.  The Committee conducted a very thorough piece of work which reflected the views of a wide range of stakeholders I would like to take this opportunity to thank the Committee for their report, which I am now considering as part of the drafting process for the Bill.  I can perfectly understand the concerns that some people have around this legislation and I want to assure them that this Bill will not impact on Ireland’s policy of military neutrality. Ireland's policy of military neutrality is characterised by the non-membership of military alliances or common or mutual defence arrangements. However, I ask that Deputies reflect on the much- changed geopolitical landscapeover the last number of years and resulting challenges arising globally and at UN Security Council level. I believe that the Defence Forces have played a really key role in peace keeping abroad, but Deputies must also be aware that no new peacekeeping mission has been authorised in the U.N. since 2014.  Ireland has always taken an active approach to global challenges and making significant contributions to international peace and security, and will continue to do so. The proposed changes will remain fully consistent with the principles of the UN Charter and international law. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 105. Deputy Cathy Bennett asked the Minister for Defence if she will report on her engagements with regard to the impact her proposed removal of the Triple Lock neutrality protection will have on Irish neutrality. [72040/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_45",
          "debateSectionId": "dbsect_45",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_45.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_105",
        "questionNumber": 105
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I am informed by the Defence Forces that candidates applying for positions in the Defence Forces are required to meet specific standards for military service, as laid down in Defence Forces Regulations, made pursuant to the Defence Act 1954, as amended and extended. These Regulations provide for a minimum height requirement for enlistment for both male and female candidates of 157.48cm.  The determination of a minimum height standard for enlistment in the Defence Forces is based on the requirement that all members can meet the physical demands of military training and operations thereafter, with service Personal Load Carrying Equipment, whether they are at home or overseas.  While there are no plans at present to alter the height requirements for enlistment, the conditions for entry to and for service in the Defence Forces, including the methodology used for assessments, are subject to continuous review and modification having regard to the needs of the organisation, health and safety and the development of best practices. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 142. Deputy Cathy Bennett asked the Minister for Defence if she has considered altering height requirements with regard to enlistment eligibility for the Defence Forces. [72039/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_81",
          "debateSectionId": "dbsect_81",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_81.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_142",
        "questionNumber": 142
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  In advance, and since, the publication of the 2028 – 2034 Multiannual Financial Framework my Department and the Department of Finance have proactively engaged on Ireland’s overarching position on the next long-term EU budget.  As part of this engagement, Ministers and officials have advocated for Ireland’s priorities across a range of key areas, including agriculture, competitiveness, security and external action. Support for the PEACE PLUS programme, including appropriate financing, have been and will continue to be an essential priority for the Government.  It is clear that the practical and demonstrable commitments within the PEACE PLUS programme have had significant benefits to reconciliation and peace on the island of Ireland. We must not take this for granted. The programme also is a clear illustration of the strength and foresight of the Union to secure peaceful outcomes, as well as Europe's collective and continued commitment to long-lasting peace and reconciliation. Inclusion of the Fund in the proposal is therefore very welcome and I, alongside my colleagues, will continue to advocate for its continuation.  While implementation of the PEACE PLUS is under the remit of the Minister for Public Expenditure Infrastructure Public Service Reform and Digitalisation, negotiations on the Multiannual Financial Framework are conducted through the General Affairs Council. This meeting is attended by Minister for European Affairs, Thomas Byrne T.D. In the course of his engagements here, the Minister has advocated extensively for Ireland’s position on the PEACE PLUS programme.  I, alongside my officials and other responsible Ministers and Departments, will continue to engage proactively to ensure the significance of the PEACE PLUS programme to long-lasting peace and reconciliation on the island of Ireland is well understood and reflected in the budget. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 162. Deputy Cathy Bennett asked the Minister for Foreign Affairs and Trade her engagements regarding the ongoing funding of the peace plus programme as part of the EU MFF post-2027; and if she will make a statement on the matter. [71328/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_99",
          "debateSectionId": "dbsect_99",
          "showAs": "Northern Ireland",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_162",
        "questionNumber": 162
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 884. Deputy Cathy Bennett asked the Minister for Health the number of people on waiting lists to access dermatological services in Monaghan Hospital in each of the years 2019 to date, by length of time waiting, in tabular form; and if she will make a statement on the matter. [71335/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_701",
          "debateSectionId": "dbsect_701",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_701.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_884",
        "questionNumber": 884
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 885. Deputy Cathy Bennett asked the Minister for Health the number of people on waiting lists to access dermatological services in Our Lady of Lourdes Hospital, Drogheda in each of the years 2019 to date, by length of time waiting, in tabular form; and if she will make a statement on the matter. [71336/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_702",
          "debateSectionId": "dbsect_702",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_702.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_885",
        "questionNumber": 885
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 886. Deputy Cathy Bennett asked the Minister for Health the WTE within dermatological services in Monaghan Hospital in each of the years 2019 to date, by length of time waiting and the number of which were vacant, in tabular form; and if she will make a statement on the matter. [71337/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_703",
          "debateSectionId": "dbsect_703",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_703.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_886",
        "questionNumber": 886
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 887. Deputy Cathy Bennett asked the Minister for Health the WTE within dermatological services in Our Lady of Lourdes Hospital, Drogheda in each of the years 2019 to date; and the number of which were vacant, in tabular form; and if she will make a statement on the matter. [71338/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_704",
          "debateSectionId": "dbsect_704",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_704.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_887",
        "questionNumber": 887
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 88. Deputy Cathy Bennett asked the Minister for Foreign Affairs and Trade to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if she will make a statement on the matter. [70438/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_71",
          "debateSectionId": "dbsect_71",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_88",
        "questionNumber": 88
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  As my Department has been reconfigured on several occasions since 2012, the information sought by the Deputy is not readily available. I am advised that in the period since the formation of the previous and current Government, (2020 to date), the information sought in relation to my Department as currently configured is set out in the attached table.   Consultancy Firms    ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 92. Deputy Cathy Bennett asked the Minister for Climate, Energy and the Environment to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70432/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_75",
          "debateSectionId": "dbsect_75",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_75.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_92",
        "questionNumber": 92
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 100. Deputy Cathy Bennett asked the Minister for Defence to provide a breakdown of all consultants engaged with her Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if she will make a statement on the matter. [70434/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_82",
          "debateSectionId": "dbsect_82",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_100",
        "questionNumber": 100
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The information requested by the Deputy is being collated and will be forwarded to the Deputy within 10 working days, in line with the Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 108. Deputy Cathy Bennett asked the Minister for Transport to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70446/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_87",
          "debateSectionId": "dbsect_87",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_87.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_108",
        "questionNumber": 108
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I wish to advise the Deputy that the consultancy costs of the Department of Finance are available on the Department’s website, the link to the annual consultancy costs reports up to 2022 is included below for ease of reference. The 2023 and 2024 consultancy costs will be published in the coming weeks. The 2025 consultancy costs will also be published in the first quarter of 2026.  ww.gov.ie/en/department-of-finance/collections/consultancy-costs/. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 161. Deputy Cathy Bennett asked the Tánaiste and Minister for Finance to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70437/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_129",
          "debateSectionId": "dbsect_129",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_129.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_161",
        "questionNumber": 161
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I wish to advise the Deputy that a deferred reply will be issued to her in respect of this Parliamentary Question, in line with Standing Order 51(1)(b). ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 169. Deputy Cathy Bennett asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70443/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_135",
          "debateSectionId": "dbsect_135",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_135.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_169",
        "questionNumber": 169
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The information requested is currently being collated by my Department and will be forwarded directly to the Deputy as soon as it is finalised. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 172. Deputy Cathy Bennett asked the Minister for Enterprise, Tourism and Employment to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70436/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_138",
          "debateSectionId": "dbsect_138",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_138.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_172",
        "questionNumber": 172
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Information in relation to consultancy expenditure in my Department is compiled annually in respect of the previous year and published online at www.gov.ie/en/collection/department-of-education-and-skills-expenditure-on-consultancy/ The data in respect of 2025 is being compiled at present and will be published online as soon as it is available. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 183. Deputy Cathy Bennett asked the Minister for Education and Youth to provide a breakdown of all consultants engaged with her Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if she will make a statement on the matter. [70435/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_147",
          "debateSectionId": "dbsect_147",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Consultancy is defined by the Department of Finance as where a person or organisation provides intellectual or knowledge-based services (e.g. expert analysis and advice) through delivering reports, studies, assessments, recommendations, proposals, etc. that contribute to decision making or policy development.  Consultancy details are available for my Department from 2011 to 2024, they are published in tabular form by company, amount and purpose on the Gov.ie website at [ https://assets.gov.ie/static/documents/09fe3ad4/20251128_DSP_Website_2011-2024-Consultancy_IT_External_Service_Provision_Expenditure.pdf ] . The table below provides details of consultancy expenditure for 2025, which are not yet published.  I am satisfied that my Department’s expenditure on consultancy is closely monitored and only essential contracts are awarded, following a rigorous assessment of needs and where the required competencies do not exist in-house.     YEAR 2025 TO DATE              CONTRACTOR    €    PURPOSE      KPMG    €832,029    Strategic Workforce Planning      MCCP    €173,429    Review of DSP Values      Price Waterhouse Coopers    €150,522    AMD refurbishment      Derilinx Limited    €121,770    Consultancy Advice and Support Services for Open Data and Data Management      Indecon International Economic Consultants.    €54,638    Econometric Evaluations and Research under Pathways to Work      Mazars    €42,768    Outsourced IS Internal Audit Expertise      Economic and Social Research Institute    €12,434    Poverty and Social Inclusion Research Programme 2024 - 2027      Mercer (Ireland) Ltd    €4,797    Pension payments for EX Waterford Crystal Employees      Consult Hyperion    €1,767    SAFE - Expert Advice      Consultancy Total 2025    €1,394,155         ..   ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 238. Deputy Cathy Bennett asked the Minister for Social Protection to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70445/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_189",
          "debateSectionId": "dbsect_189",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_238",
        "questionNumber": 238
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  It has not been possible to collate the information requested by the Deputy in the time available. I will write to the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 253. Deputy Cathy Bennett asked the Minister for Justice, Home Affairs and Migration to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70442/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_200",
          "debateSectionId": "dbsect_200",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_200.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_253",
        "questionNumber": 253
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The information requested by the Deputy is being collated by my Department and a response will be forwarded to the Deputy as soon as it is available. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 273. Deputy Cathy Bennett asked the Minister for Agriculture, Food and the Marine to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70430/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_217",
          "debateSectionId": "dbsect_217",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_273",
        "questionNumber": 273
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Parental Leave (Amendment) Act 2019, an employee who is a relevant parent in respect of a child under the age 12 is entitled to 26 weeks’ unpaid parental leave for each child. Where a child has a disability or long-term illness, the entitlement can continue until the child is 16. A relevant parent is a parent, an adoptive parent, or a person acting in ‘loco parentis’.  Both parents have an equal, separate entitlement to parental leave. Where both parents work for the same employer and the employer agrees, one parent can transfer 14 weeks of their parental leave entitlement to the other parent.  The legislation only sets out the minimum entitlement to parental leave. Depending on the contract of employment between the employee and the organisation, the employee may have more extensive rights to parental leave, as employers have the option to offer more than the entitlement set out in the legislation.  There have been significant developments in the entitlements to family leaves for working families in recent years, and this includes the aforementioned extension of the parental leave entitlements in 2019 from 18 weeks to 26 weeks, and the extension of the time period in which the leave can be taken from when the child attains the age of 8 years to when the child attains the age of 12 years.  The Work Life Balance and Miscellaneous Provisions Act 2023 was enacted on 4 April 2023, and introduces important entitlements for workers, including leave for medical care purposes for parents of children under 12, and the right to request flexible working for parents and carers. It transposes the Work-Life Balance Directive which specifically prevents the transfer of paid leave between parents in the interests of gender equality and of encouraging fathers as well as mothers to take such leave. Otherwise, there is a risk that only mothers would take the leave, potentially creating labour market disadvantages for them and that fathers would not be encouraged to take a greater share of their caring responsibilities.  The Programme for Government - Securing Ireland's future commits to examining the extension of Parents Leave and Benefit and additional flexibilities. Additionally, the National Strategy for Women and Girls 2025 - 2030 commits to further enhancing the scope of family leaves. Any changes to family leave provision will considered within the context of these commitments whilst being cognisant of the impact on businesses. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 280. Deputy Cathy Bennett asked the Minister for Children, Disability and Equality if she will consider a change in policy for parental leave in terms of the amount of leave that can be transferred between parents; and if she will make a statement on the matter. [70540/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_225",
          "debateSectionId": "dbsect_225",
          "showAs": "Parental Leave",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_225.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_280",
        "questionNumber": 280
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality (Deputy Norma Foley)  The Department is currently collating the information requested and a reply will issue directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 281. Deputy Cathy Bennett asked the Minister for Children, Disability and Equality to provide a breakdown of all consultants engaged with her Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if she will make a statement on the matter. [70431/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_226",
          "debateSectionId": "dbsect_226",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_226.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_281",
        "questionNumber": 281
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 296. Deputy Cathy Bennett asked the Minister for Health to provide a breakdown of all consultants engaged with her Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if she will make a statement on the matter. [70440/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_241",
          "debateSectionId": "dbsect_241",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_241.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_296",
        "questionNumber": 296
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department publishes details of consultancy payments made in a given year following the close of the financial year. The published information comprises details of the nature of the consultancy work undertaken and the costs incurred.  My Department was established in July 2017, information on consultancies from that date to end 2024 is available on our website at the following link:  [ https://www.gov.ie/en/department-of-rural-and-community-development-and-the-gaeltacht/organisation-information/financial-information/#consultancies ]  Details of consultancy payments made in 2025 will published in early 2026 once the present financial year is complete. In the meantime the following table provides details of payments made to external consultants to date in 2025.      Company / Organisation      Nature of the Work Conducted      Cost (including VAT)       Governance Ireland    Review of the Public Participation Network National Advisory Group terms of reference.    €18,081      Risk and Resilience Ltd.    External Review of Risk Management within the Department of Rural and Community Development and the Gaeltacht.    €10,320      Social Justice Ireland    Public Participation Network, compilation of the Annual Report 2024.    €10,800      TASC - Think Tank for Action on social Change    Evaluation of the Empowering Communities Pilot Programme.    €21,835      National University Maynooth    Review of the eligibility for the CLÁR programme.    €16,083      ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 375. Deputy Cathy Bennett asked the Minister for Rural and Community Development and the Gaeltacht to provide a breakdown of all consultants engaged with his Department; the costs associated with their services, by year, and name of consultant, in each of the years 2012 to 2025, in tabular form; and if he will make a statement on the matter. [70444/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_310",
          "debateSectionId": "dbsect_310",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_310.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_375",
        "questionNumber": 375
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  My Department collects data on Ireland’s EU Budget receipts, from relevant Government Departments, for the previous year on an annual basis for publication in the EU Transactions Reports and up until the year 2021 in the Department of Finance Budgetary Statistics. This operational data may be subject to revision and any updates which may be required are reflected in subsequent publication releases.  This table sets out Ireland’s EU budget receipts as reported by relevant Government Departments in this process, from 2019-2023, the latest year for which data is available. My Department is currently collecting the data on receipts for 2024, and this information will be published in the coming months. These figures include, but are not limited to, such programmes as the European Agricultural Guarantee Fund, the European Fund for Regional Development, and Erasmus+. They do not include funds directly managed by the European Commission; as such the figures do not provide the full picture of Ireland’s receipts from the EU budget.   Table 1: Ireland’s EU budget receipts, 2019-2023       Year      Receipts from EU Budget    € billion       2019    1.8      2020    1.9      2021    2.4      2022    2.0      2023    1.7     The European Commission also publishes data on Member States’ transactions with the EU, of which the most recently available data is 2024. These figures can differ from those collected by Government Departments, reflecting differences in accounting practices and time periods.  In relation to future years, my Department does not forecast the precise levels of EU budget receipts Ireland is expected to draw down in a given future year. These figures are contingent on a number of factors, such as the status and speed of project implementation, and when individual Departments submit payment requests to the European Commission.  In relation to contributions, the annual contribution of Ireland to the EU Budget from 2019 to 2024 is as follows:   Table 2: EU Budget payments 2019-2024       Year      Payments to EU Budget (€ billion)       2019    2.4      2020    2.6      2021    3.5      2022    3.6      2023    3.7      2024    3.4     With regard to projected contributions, my Department’s most recent forecast was prepared for Budget 2026, for the remaining years of the current Multiannual Financial Framework period, which ends in 2027. My officials will continue to work on revising these forecasts as the MFF period progresses. The projected contributions for the remaining three years are as follows:   Table 2: EU Budget payment forecast 2025-2027       Forecast Gross Payments to EU Budget      2025 (€ billion)      2026(€ billion)      2027(€ billion)            Total     3.4    4.3    4.9         Based on my Department’s forecasts, Ireland’s contributions to the EU budget will continue to grow over the remainder of the MFF period. This is directly linked to several factors, including in particular the overall level of payments in the EU budget, which Member States must finance, and Ireland’s economic performance, which drives Ireland’s share of the overall budget. A significant proportion of how Member States finance the EU budget is according to relative Gross National Income (GNI). ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 29. Deputy Cathy Bennett asked the Tánaiste and Minister for Finance the total Irish receipts or projected receipts from the EU Multiannual Financial Framework; the total Irish contribution or projected contribution to the framework, in each of the years 2019 to 2027, in tabular form. [64449/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_48",
          "debateSectionId": "dbsect_48",
          "showAs": "EU Budgets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_48.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_29",
        "questionNumber": 29
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The Catchment-based Flood Risk Assessment and Management (CFRAM) Programme, the largest study of flood risk ever undertaken by the State, was completed by the Office of Public Works (OPW) in 2018. The CFRAM programme studied 80% of Ireland's primary flood risk and identified measures to protect over 95% of that risk. The 29 Flood Risk Management Plans were a key output of CFRAM, identifying proposed flood relief measures nationwide. The Government is committed to funding these projects through the €1.3bn available under the National Development Plan.  As it is not feasible to deliver all flood relief schemes concurrently (due to constraints on the specialised engineering skills in the OPW, local authorities, and the consultancy market), the flood-relief delivery programme was sub-divided into two tranches, focusing initially on Tranche 1 schemes and those already in the delivery pipeline. The prioritisation of the first tranche of schemes was based on three criteria including: scale of projects, capacity to deliver a national programme, and maximising return on investment by reference to property numbers. Under the national programme, work has yet to commence on the design of some 50 Tranche 2 flood relief schemes.  The OPW is piloting a new delivery model for flood relief schemes through four Tranche 2 schemes in counties Kilkenny and Donegal, which is referred to as the Tranche 2 Pilot. There are two Tranche 2 Pilot schemes in County Kilkenny (Freshford and Piltown) and two schemes in County Donegal (Donegal Town and Letterkenny). The Tranche 2 Pilot will transfer the management of data gathering, as a first step in designing a scheme, from consultant engineers for a single scheme to the local authorities for all schemes in the Pilot and, where feasible, within their areas of responsibility. The Pilot means that data gathering may be scaled up from individual communities to all schemes in a county. The Pilot will better inform the prioritisation of future schemes nationally and the scope of services required from consultants to design and facilitate construction of flood relief schemes.  Nationally, 56 schemes have been completed to date, which are providing protection to some 13,580 properties and an economic benefit to the State in damages and losses avoided estimated to be in the region of €2 billion. Consequently, work to protect 80% of all at-risk properties nationally is completed or underway.  The Minor Flood Mitigation Works and Coastal Protection Scheme (Minor Works Scheme) was introduced by the Office of Public Works (OPW) in 2009. The purpose of the scheme is to provide funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems within their administrative areas. The scheme generally applies where a solution can be readily identified and achieved in a short time frame. Applications for funding from local authorities are assessed by the OPW having regard to the specific economic, technical, social and environmental criteria of the scheme, including a cost-benefit ratio. I recently announced that an increase in funding supports are to be made available to local authorities under the Minor Works Scheme, including an increase in the upper Minor Works threshold from €750,000 to €2,000,000, subject to qualifying criteria. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 332. Deputy Cathy Bennett asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation when works on tranche 2 of CFRAM will commence; when they are expected to conclude; and if he will make a statement on the matter. [69318/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_332",
        "questionNumber": 332
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Cathy Bennett  LEADER funding, as the Minister will be aware, plays a vital role in our communities and businesses, especially in my constituency of Cavan-Monaghan. A reduction in LEADER funding would be unacceptable for rural communities that are already struggling. Can the Minister assure us that LEADER funding will not be reduced? \n Deputy Dara Calleary  For over 30 years, LEADER has delivered tangible benefits to rural communities in areas such as economic development and job creation, rural infrastructure, social inclusion, environmental sustainability and, as we discussed, rural activities. Therefore, the development of the EU regulations relating to the post-2027 Common Agricultural Policy, CAP, and the new national and regional partnership plans is a matter of significant importance to me and to my Department. Ireland will continue to advocate for a well-funded CAP that supports farm resilience, environmental ambition and, crucially, rural development measures such as LEADER.  Within the draft regulations, the inclusion of the LEADER programme as a CAP intervention is to be welcomed. As part of the ongoing negotiation process, my Department continues to emphasise the importance of a ring-fenced allocation for the LEADER Programme. Detailed discussions on the shape and operation of the new regulations are ongoing at both national and EU levels. To facilitate the current negotiation process for the post-2027 period, the Department of Agriculture, Food and the Marine has established a CAP consultative committee, which includes representation from my Department. I acknowledge the work of the Minister, Deputy Heydon, in involving my Department in this.  Separately, while in Strasbourg last week, I met with Irish MEPs, including Kathleen Funchion, to discuss a range of issues, including LEADER funding, in the context of the next EU budgetary cycle. I will continue to work with the Irish MEPs and my Government colleagues to ensure that the LEADER programme is supported and well funded into the future. \n Deputy Cathy Bennett  The LEADER programme has played a crucial role in rural development, especially in addressing and developing the rural community. It has, therefore, been a regressive move that LEADER has faced cuts in every programme for nearly 20 years. Prior to the financial crisis, the annualised budget for the LEADER programme between 2007 to 2013 was €57 million per year, reducing to €54 million post the crash. The annual allocation for the 2014 to 2020 programme was slashed by one third to €35 million. The Government signed off on a transition programme of €35 million to €36 million on average per year for 2023 to 2027. That is not only a cut in real terms. Taking account of inflation, LEADER funding must stand at half of what it once was. My question again is: does the Minister accept that the LEADER budget has been gutted and what can he do about it? \n An Cathaoirleach Gníomhach (Deputy David Maxwell)  If the Minister will hold on, Deputy McGuinness has a supplementary question. \n Deputy Conor D. McGuinness  LEADER funding has been cut in 2024 and 2025 and now it has been cut in the budget for next year. I would like to know what the rationale is for that and I would like a breakdown of what will be affected by that cut. The cut in LEADER funding for next year is in the order of €10 million.  That has to be considered in the broader reconfiguration of CAP happening at European level and the Government's failure - this is bigger than the Department only as it is being led by the Department of agriculture - to come to terms with that and to exert influence at European level to ensure that rural development funding and, indeed, other measures are protected within that reconfiguration.  This is also part of a direction of travel here in Ireland where there has been a divestment in rural communities by successive Governments from 2014 on, with changes to the LEADER programme and, as my colleague Deputy Bennett said, year-on-year cuts to funding.  It can be dressed up as being about transitional periods and an envelope of funding that lasts but in real terms, we are seeing cuts year on year. \n Deputy Dara Calleary  One cannot talk about LEADER cuts without also talking about the fact that a whole range of new programmes have been invested in, including RRDF, TVRS, RSS and CCIF. They are now in place but were not in place over many years of the LEADER programme. They fulfil many of the duties LEADER did. LEADER funding is not cut for next year. We will spend the full allocation during the programme. The remaining €180 million has been allocated for 2023 to 2027. That maintains the funding with the previous programme. I am confident we will spend that full €180 million. Approvals are currently slow, as has always been the method. We will ensure allocations are in place. I am working on a post-2027 scenario. That is why I have had meetings with MEPs. I encourage the Deputies to do the same in terms of looking at that cross-European support that we need to have a LEADER programme funded separately under the CAP measure. That is important. The MEPs left me under no illusion last week as to the challenges relating to the multiannual financial framework, MFF, and funding. \n Deputy Cathy Bennett  I am relaying the fears of my constituents. LEADER funding was cut in the immediate aftermath of the financial crash, was raided during the austerity years and it was cut further in real terms under the previous Government. The meagre increase is not enough to keep up with inflation. My fear now is the Government is seemingly not that put out about a European Commission proposal to cut CAP by nearly 25%, through which LEADER is funded, and that the European Commission, Fianna Fáil and Fine Gael will see our local development companies and rural development take the short straw once again. Will the Minister not only rule out further cuts to LEADER but commit at European level to advocating for the full restoration of LEADER funds to pre-crash levels? \n Deputy Dara Calleary  I do not have the Waterford figures but the Cavan LEADER programme for 2023 to 2027 has an allocation of €6.37 million. There is €5.985 million for Monaghan. To date, under the 2023 to 2027 programme, 45 projects have been approved, 25 in Cavan and 20 in Monaghan to the value of €1.62 million in Cavan and €1.29 million in Monaghan. That funding continues but it is also in partnership with the other projects I mentioned. We have seen some of those projects in RSS, CCIF and RRDF. I will continue to work the Deputy and the Chair on delivering projects in Cavan and Monaghan. The development companies are very important partners in developing those projects. I was in Cork last weekend with the Minister of State where we saw IRD Duhallow using other projects. The Deputy can be absolute assured that I am very focused on LEADER. That is why I was in Strasbourg last week and met MEPs. Equally, it is not the Government causing the difficulties. A debate is under way about the entire European budget. I assure the Deputy the studs are on and we will defend the interests of LEADER and I will defend the interests of rural communities. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 7. Deputy Cathy Bennett asked the Minister for Rural and Community Development and the Gaeltacht if he will report on his engagements regarding the LEADER programme under the next EU budgetary cycle. [68487/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_9",
          "debateSectionId": "dbsect_9",
          "showAs": "EU Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_9.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_7",
        "questionNumber": 7
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The current LEADER Programme, which runs to 2027, is operational across the country. It supports a broad range of enterprises and community groups to develop projects which improve the quality of life and economic activity in rural areas. It is delivered through Local Action Groups across rural Ireland, facilitating a community-led, bottom-up approach to rural development.  The LEADER programme is co-financed by the European Commission under the Common Agricultural Policy (CAP), through the European Agriculture Fund for Rural Development. The budget for the CAP for the period 2021-2027 forms part of the Multiannual Financial Framework, or the EU Budget for that period. It is therefore a multi-annual programme, with allocations being linked to a programming period, rather than an annual basis.  Table 1 below gives a breakdown on the LEADER allocations for the periods requested by the Deputy.  The total amount of funding allocated to LEADER for the period of 2021-2027 is €250 million. This funding is made up of €70 million for the Transitional LEADER programme for the years 2021 and 2022, and €180 million for the 2023-2027 LEADER programme , maintaining the level of funding at €250 million for the 7 year period, in line with the previous 2014-2020 LEADER programme.  Prior to this, the programming period covered 2007-2013. The revised allocation for that period was €376,758,090 on foot of the agreement with the EU Commission of a formal amendment to the 2007-2013 Rural Development Programme.  The Programme for Government includes a commitment to engage at EU level to increase funding for the next LEADER programme, which will form part of the post 2027 Multiannual Financial Framework.  The funding for the LEADER programme should be considered in the context of the expanding capital allocations which have been made available across the range of rural development schemes and supports under my Department's Rural Development Investment Programme in recent years.   Table 1: LEADER Programme Allocations       Programming Period      Allocation       2007-2013 (Revised)    €376,758,090      2014-2020    €250,000,000      2021-2022 (Transitional)    € 70,000,000      2023-2027    €180,000,000      ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 39. Deputy Cathy Bennett asked the Minister for Rural and Community Development and the Gaeltacht the average annual allocation to LEADER scheme, by programme; since 2007. [68486/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_39",
        "questionNumber": 39
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence is a core priority for me and for Government. The Zero Tolerance Strategy sets out our determination to ensure that those affected by these crimes receive strong protection, clear pathways to justice and the supports they need.  Strengthening the legislative framework is an essential part of delivering on these commitments. In October, I secured Government approval to progress the Criminal Law (Sexual Offences, Domestic Violence and International Instruments) Bill 2025 which includes measures to allow perpetrators of domestic violence to be included on a new register of domestic violence judgments run by the courts.  This new law, Jennie's Law, named after Jennifer Poole, will allow those convicted of domestic violence against a partner or former partner, to be included on this public Register of Judgments. The General Scheme is being referred to the Justice Committee for pre-legislative scrutiny and, when its report is received, work on finalising the Bill will be prioritised. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 107. Deputy Cathy Bennett asked the Minister for Justice, Home Affairs and Migration the timeframe in which he intends to establish a register of domestic abusers. [68506/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_131",
          "debateSectionId": "dbsect_131",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_107",
        "questionNumber": 107
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Since its establishment last year, Cuan has been working to accelerate the delivery of safe accommodation across the country.  Following a request from me, Cuan worked with services and partners to assess and review progress and identify a series of actions to accelerate delivery of safe accommodation to meet the needs of those fleeing violence.  On foot of this review, completed in spring 2025, and following agreement with me, the following will be delivered:  • 52 new family refuge units by the end of 2026  • 45 new safe homes by the end of 2026  • 50 new units under construction by the end of 2026.  Therefore by the end of 2026 it is envisaged that 94 safe homes and 193 refuge units will be completed bringing total safe accommodation to 287, with 50 further refuge units under construction.  On Tuesday, 14 October, I confirmed that a funding application for the development of a refuge in the Cavan and Monaghan region has successfully passed the first stage. The new refuge facility will include 12 independent units of refuge accommodation, along with essential ancillary services, thereby strengthening domestic violence support in the region.  The refuge’s Capital Assistance Scheme Stage 1 application was approved by the Department of Housing, Local Government and Heritage. Work is ongoing towards submitting a Stage 2 application, which will include further detail and costings on the full extent of works that will be required.  Cuan is also working with both Monaghan and Cavan County Councils to progress the delivery of Safe Homes in each county in 2026. Cuan has agreed to allocate additional resources to Safe Ireland to support it in expanding its services to provide both emergency refuge and safe home accommodation and there is a strong commitment from all partners to progress both models of accommodation in this region.  While currently almost three quarters of the population in the State is within 30 minutes of safe accommodation, Cuan is acutely aware of the need to improve on this, and to ensure that services are accessible to everyone living in rural and urban areas. Achieving this, including through the completion of a National Services Development Plan, is a core objective of Cuan’s Corporate Plan 2025-2027, which was published at the end of last year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 136. Deputy Cathy Bennett asked the Minister for Justice, Home Affairs and Migration the timeframe in which a domestic violence refuge centre will be opened in Cavan and Monaghan. [68505/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_158",
          "debateSectionId": "dbsect_158",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_158.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_136",
        "questionNumber": 136
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Teagasc is the national body for providing integrated research, advisory and training services to the agriculture and food industry and rural communities. It is an body that operates under the aegis of my Department and receives substantial funding from my Department's annual Voted allocation.  Teagasc's current and capital allocations for each of the years requested are as set out in the table below.     Teagasc Allocation    Current    Capital    Total      2026    €165,622,000    €10,000,000    €175,622,000      2025    €164,537,000    €10,900,000    €175,437,000      2024    €154,106,000    €13,871,000    €167,977,000      2023    €150,746,000    €11,450,000    €162,196,000      2022    €142,227,000    €10,450,000    €152,677,000      2021    €139,193,000    €6,600,000    €145,793,000      2020    €132,582,000    €10,950,000    €143,532,000      2019    €132,082,000    €9,150,000    €141,232,000      ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 388. Deputy Cathy Bennett asked the Minister for Agriculture, Food and the Marine the allocations in current and capital expenditure to Teagasc in each of the years 2019 to date, in tabular form; and if he will make a statement on the matter. [68692/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_356",
          "debateSectionId": "dbsect_356",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_356.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_388",
        "questionNumber": 388
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 426 and 427 together.  As this is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 426. Deputy Cathy Bennett asked the Minister for Health the number of paramedics and ENT's, including advanced paramedics in counties Monaghan and Cavan, respectively, in each of the years 2019 to date in 2025, in tabular form; and if she will make a statement on the matter. [68558/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_380",
          "debateSectionId": "dbsect_380",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_380.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_426",
        "questionNumber": 426
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 426 and 427 together.  As this is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 427. Deputy Cathy Bennett asked the Minister for Health the average ambulance response time in County Monaghan in each of the years 2019 to date in 2025, in tabular form; and if she will make a statement on the matter. [68559/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_380",
          "debateSectionId": "dbsect_380",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_380.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_427",
        "questionNumber": 427
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  In Budget 2025, it was announced that the Hot School Meals Programme would be extended to all remaining primary schools in 2025 meaning that approximately 3,200 schools are now eligible to apply supporting approximately 550,000 children for hot school meals for the 2025/2026 academic school year. In 2025 a total of 3,700 schools and 682,000 children will be eligible for the School Meals Programme.  The expenditure on School Meals Programme as requested is shown in the table below. As my Department are currently receiving and processing applications for the 2025/26 academic year which only started a few months ago the estimated expenditure to year end is €248 million.     Year    Actual Expenditure      2019    €54.3 million      2020    €53.5 million      2021    €58.4 million      2022    €77.5 million      2023    €108.7 million      2024    €181.4 million      ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 160. Deputy Cathy Bennett asked the Minister for Social Protection the amount the Government has spent on the school meals programme, by year from 2019 to date in 2025; in tabular form; and if he will make a statement on the matter. [68199/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_160",
        "questionNumber": 160
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 161, 162 and 164 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  My department provides the funding for the meals directly to the school. All schools are responsible for choosing their school meals supplier on the open market, in a fair and transparent manner in accordance with public procurement rules. These rules clearly define the successful tenderers responsibilities and obligations, including adherence to the nutritional standards. My Department does not select the suppliers.  In order to withdraw from a contract the schools have to follow the procedure regarding the termination clause in their contracts.  There are some 300 suppliers in the School Meals Programme with the majority of these supplying one to three local schools. There are eleven meals on wheels organisations supplying forty schools and there are nine large school meal providers. My officials in this Department have been working with officials in the Department of Rural and Community Development and the Gaeltacht and they have compiled a list of supports available to local community organisations who may wish to expand their operation into the school meals area. This information has been supplied to schools and a range of other community organisations.  I will continue to expand and improve the Hot School Meals Scheme and ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, reduce food waste and utilise recyclable packaging.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 161. Deputy Cathy Bennett asked the Minister for Social Protection the main providers of the school meals programme; the way in which providers are contracted; the way in which they apply; and if he will make a statement on the matter. [68200/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_161",
        "questionNumber": 161
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 161, 162 and 164 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  My department provides the funding for the meals directly to the school. All schools are responsible for choosing their school meals supplier on the open market, in a fair and transparent manner in accordance with public procurement rules. These rules clearly define the successful tenderers responsibilities and obligations, including adherence to the nutritional standards. My Department does not select the suppliers.  In order to withdraw from a contract the schools have to follow the procedure regarding the termination clause in their contracts.  There are some 300 suppliers in the School Meals Programme with the majority of these supplying one to three local schools. There are eleven meals on wheels organisations supplying forty schools and there are nine large school meal providers. My officials in this Department have been working with officials in the Department of Rural and Community Development and the Gaeltacht and they have compiled a list of supports available to local community organisations who may wish to expand their operation into the school meals area. This information has been supplied to schools and a range of other community organisations.  I will continue to expand and improve the Hot School Meals Scheme and ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, reduce food waste and utilise recyclable packaging.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 162. Deputy Cathy Bennett asked the Minister for Social Protection if he has given consideration to local providers in the school meals programme; if the Government advertises in local media for food suppliers; and if he will make a statement on the matter. [68201/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_162",
        "questionNumber": 162
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  In 2023, my Department published an independent evidence-based Evaluation of the School Meals Programme which sets out the positive impact the Programme is having in terms of children’s education and wellbeing. The key finding was an overwhelming consensus among all participants in the evaluation that the Programme is effective.  Of the respondent parents surveyed 83.44% agreed that the programme was positive. Similarly, 83.12% wanted the School Meals Programme extended to all schools, with a further 81.9% supporting the universal provision of hot meals.  The Nutritional Standards for School Meals have been in place since its inception and were developed by a technical Nutrition Subgroups comprised of:  • Dieticians from the Irish Nutrition and Dietetic Institute of Ireland,  • The HSE,  • Safefood, and  • The Food Safety Authority of Ireland.  • These standards are available to all schools, organisations and suppliers and are publicly available on gov.ie.  • Nutritional standards are a priority for me and I have directed that a review of the scheme’s nutritional standards be undertaken. This is being conducted by a dietician in coordination with the Interdepartmental Group on School Meals. I have asked for a report on the nutritional standards to be submitted to me by the end of this year.  • In the meantime, food that is high in saturated fat, sugar and salt, was removed from the school menu from September 2025. Up to now this food had been permitted, as an option, once a week at most and only when selected by the child's parents.  • I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 163. Deputy Cathy Bennett asked the Minister for Social Protection if the Government has done a review with parents in relation to the quality of the meals in the school meals programme; and if he will make a statement on the matter. [68202/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_155",
          "debateSectionId": "dbsect_155",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_155.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_163",
        "questionNumber": 163
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 161, 162 and 164 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  My department provides the funding for the meals directly to the school. All schools are responsible for choosing their school meals supplier on the open market, in a fair and transparent manner in accordance with public procurement rules. These rules clearly define the successful tenderers responsibilities and obligations, including adherence to the nutritional standards. My Department does not select the suppliers.  In order to withdraw from a contract the schools have to follow the procedure regarding the termination clause in their contracts.  There are some 300 suppliers in the School Meals Programme with the majority of these supplying one to three local schools. There are eleven meals on wheels organisations supplying forty schools and there are nine large school meal providers. My officials in this Department have been working with officials in the Department of Rural and Community Development and the Gaeltacht and they have compiled a list of supports available to local community organisations who may wish to expand their operation into the school meals area. This information has been supplied to schools and a range of other community organisations.  I will continue to expand and improve the Hot School Meals Scheme and ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, reduce food waste and utilise recyclable packaging.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 164. Deputy Cathy Bennett asked the Minister for Social Protection the way schools can withdraw from a contract for the school meals programme; and if he will make a statement on the matter. [68203/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_164",
        "questionNumber": 164
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  On Wednesday 26th November 2025, the Government agreed that a timebound scoping exercise be undertaken by an independent person in response to requests from Dignity4Patients on behalf of victims and survivors of Michael Shine.  The draft terms of reference for a scoping exercise will be finalised following engagement with Dignity4Patients and other relevant Government Departments. The Department of Health will consult closely with the Office of the Attorney General on progressing this exercise following this decision of Government.  The independent person will report to Government with their recommendations for an appropriate and bespoke response to the issues raised and the needs identified by Dignity4Patients on behalf of the victims and survivors of Michael Shine. The report may include recommendations on the most appropriate approach for engaging with survivors.  My Department and the independent person, once appointed, will engage with Dignity4Patients to finalise the terms of reference of the scoping exercise. This will include consideration of how best to engage with survivors as part of the scoping exercise. More information will be made available in the next short while when the terms of reference have been finalised. In the meantime, survivors may wish to consider contacting the Dignity4Patients victim support group at: www.dignity4patients.org/. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 256. Deputy Cathy Bennett asked the Minister for Health the manner in which a person may engage with her Department regarding a scoping exercise (details supplied); and if she will make a statement on the matter. [68313/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_220",
          "debateSectionId": "dbsect_220",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_220.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_256",
        "questionNumber": 256
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Department of Foreign Affairs has a long and proud track record of providing high quality consular services to Irish citizens abroad. This is a vital public service and a key priority of my Department.  Consular assistance was provided in 543 cases by the Irish Embassy in London and the Irish Consulate in Edinburgh since 1 January 2023. Our Embassy in London and Consulate General in Edinburgh work closely with a number of partner organisations in the Britain to provide consular assistance.  The numbers of cases recorded, disagreggated by year and the Embassy or Consulate which provided the assistance, is outlined below. To note, Embassy London carries consular responsibility for all of England and Wales. 68% of all cases recorded since 2023 are related to the death of Irish citizens.        Consulate General of Ireland, Edinburgh           Year    Cases      2025    7      2024    5      2023    5       Total      17            Embassy of Ireland, London           Year    Cases      2025    144      2024    187      2023    144       Total      526         ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 6. Deputy Cathy Bennett asked the Minister for Foreign Affairs and Trade the number of Irish citizens who have sought consular assistance from Irish embassies or consulates in Britain in each of the years 2023 to date, in tabular form; and if she will make a statement on the matter. [67325/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Consular Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_6",
        "questionNumber": 6
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs (Deputy Neale Richmond)  The Programme for Government contains specific commitments to reduce barriers for emigrants wishing to return.  Work on our new diaspora strategy is underway, and as part of its development I have led in-person meetings with community groups overseas, including in Britain, Europe, the US, Canada, the Middle East and beyond. I also hosted round-table discussions in Ireland, first to hear from my fellow Oireachtas members, and then later to hear from Ireland-based organisations that work with the diaspora. Our in-person consultations were supplemented by an online consultation, the Global Irish Survey , which received over 10,000 responses. These consultations offered an opportunity to respondents to share their views on the barriers faced by returning emigrants, which will feed directly into the new strategy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 11. Deputy Cathy Bennett asked the Minister for Foreign Affairs and Trade if he has engaged with members of the diaspora with a construction background who are disincentivised from returning home due to VAT rates applicable on the tools of their trade; if he has engaged with his Cabinet counterparts in relation to same; and if she will make a statement on the matter. [67549/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_20",
          "debateSectionId": "dbsect_20",
          "showAs": "Diaspora Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_20.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_11",
        "questionNumber": 11
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 168 and 175 together.  If tools are being brought into Ireland from another EU Member State, then no tax is payable on the tools.  If the tools are being imported into the State from a non-EU country, then Customs Duty and VAT may be chargeable on the tools. However, there are two reliefs in EU law that may allow the import of personal tools into the EU/Ireland without Customs Duty or VAT being charged on them.  There is a relief from Customs Duty and VAT associated with ‘Transfer of Business’ relief which, in certain circumstances, can apply to tools of the trade. To qualify for this relief, a tradesperson must have ceased activity outside the EU and moved to Ireland to carry on a similar activity here. A new sole trader activity must be set up in Ireland. Proofs of registration both outside the EU and on return to Ireland will be required to avail of the relief. If ‘Transfer of Business’ relief is applicable, the individual must complete a ‘Transfer of Business Activities’(C-and-E-1078.pdf) form and present it to Revenue.  There is also another relief called Returned Goods Relief (RGR) which provides relief from Customs Duty and VAT when goods are re-imported within a 3-year period into an EU Member State from a non-EU country. This relief is applicable where the tools being returned to Ireland have been exported from Ireland in the first place by the tradesperson.  Please see attached link for further information on RGR - www.revenue.ie/en/customs/businesses/relief-duty-vat/reimported-into-eu/index.aspx.  Any further queries can be sent to customsreliefs@revenue.ie. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 168. Deputy Cathy Bennett asked the Tánaiste and Minister for Finance the applicable VAT rate for tools related to the construction sector for those moving to the state; if he has considered revising such in order to encourage and facilitate the return of members of the diaspora; and if he will make a statement on the matter. [67553/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cathy-Bennett.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cathy-Bennett.D.2024-11-29",
          "showAs": "Cathy Bennett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "Construction Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_168",
        "questionNumber": 168
      },
      "contextDate": "2025-12-02"
    }
  ]
}