{
  "head": {
    "counts": {
      "questionCount": 34,
      "resultCount": 34
    }
  },
  "results": [
    {
      "contextDate": "2015-03-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-25/writtens/mul@/dbsect_60.xml"
            }
          },
          "debateSectionId": "dbsect_60",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-25/writtens/dbsect_60",
          "showAs": "Exceptional Needs Payment Eligibility"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-03-25/pq_29",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 29,
        "showAs": " 29. Deputy Joe O'Reilly asked the Tánaiste and Minister for Social Protection the assistances available to families having to bury a deceased indigent relative; the criteria used to decide on such benefit; the degrees of kinship that qualify for available assistance; if the personal means of that person is taken into account; and if she will make a statement on the matter. [12293/15] ",
        "answerText": " Minister of State at the Department of Social Protection  Under the supplementary welfare allowance (SWA) scheme, the Department may make a single exceptional needs payment (ENP) to help meet essential, once-off and unforeseen expenditure which a person could not reasonably be expected to meet out of their weekly income. The Government has provided €29 million for the ENP scheme in 2015.  An application can be made under the ENP scheme for assistance with funeral and burial expenses. In 2014, the Department supported approximately 3,000 applicants with financial assistance towards these costs, at a provisional cost of some €4.6 million.  An ENP is a means tested payment payable at the discretion of the officers administering the scheme taking into account the requirements of the legislation and all the relevant circumstances of the deceased's family and that of the deceased person including any savings, property, insurance policies, etc. The Department official will also consider if a bereavement payment is available from any other source including former employer, credit union or trade union.  There are no specific requirements as regards degrees of kinship, each application is considered in light of the circumstances presented. The primary consideration is that there is an inability to pay the costs, in part or in full, by the family of the deceased person without causing hardship.  Any person who considers that they have an entitlement to an ENP under the SWA scheme following a bereavement should contact the Department's Community Welfare Service. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-03-25",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2015-03-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-03/writtens/mul@/dbsect_432.xml"
            }
          },
          "debateSectionId": "dbsect_432",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-03/writtens/dbsect_432",
          "showAs": "Unfinished Housing Developments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-03-03/pq_544",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 544,
        "showAs": " 544. Deputy Joe O'Reilly asked the Minister for the Environment, Community and Local Government if Cavan County Council has submitted an application to his Department regarding the release of funding and the taking-over of a housing estate, known as Lisgrey Gardens, at Bailieborough, County Cavan; and if he will make a statement on the matter. [8910/15] ",
        "answerText": " Minister for the Environment, Community and Local Government  Budget 2014 contained a special provision in the form of a targeted €10m Special Resolution Fund (SRF) to assist in addressing the legacy of unfinished housing developments arising from the economic downturn. Cavan County Council did not apply for SRF funding in respect of Lisgrey Gardens, Bailieboro at that time. An application for SRF in respect of this development was received from Cavan County Council in January 2015 which was too late for the 2014 call for proposals. No further call for SRF applications is planned at this time.  In this regard, I understand that the Lisgrey Gardens development is still in the ownership of the developer who is still trading and responsible for the completion of the development. It is further understood that a development bond is in place in respect of the development. Responsibility for the resolution of unfinished housing developments ultimately rests with the developers, receivers and owners. It is a matter for local authorities, using development bonds and other securities, and working with the stakeholders, to identify funding and agree works to bring developments to a standard ready for taking in charge. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-03-03",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2015-03-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-03/writtens/mul@/dbsect_468.xml"
            }
          },
          "debateSectionId": "dbsect_468",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-03/writtens/dbsect_468",
          "showAs": "Fisheries Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-03-03/pq_585",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 585,
        "showAs": " 585. Deputy Joe O'Reilly asked the Minister for Communications, Energy and Natural Resources the position regarding the publication of photographs and postings on Facebook and other social media, which seems to suggest that there is widespread killing of freshwater fish species, contrary to fisheries regulations, particularly in counties Cavan and Monaghan (details supplied); his views that the current fisheries legislation and protection measures are sufficient, or if additional measures and resources are required; and if he will make a statement on the matter.  [8908/15] ",
        "answerText": " Minister of State at the Department of Communications, Energy and Natural Resources  It is important for the public to alert Inland Fisheries Ireland (IFI) as soon as they become aware of an incident which they believe constitutes illegal activity. To facilitate this IFI operate a 24/7 confidential hotline number that enables timely reporting of all alleged incidents and a rapid response from enforcement resources. The number of this hotline is 1890-347424.  IFI deploy significant resources on protection and conservation duties and employ modern technologies such as covert surveillance cameras, night vision equipment and rapid water based transport vehicles in combatting illegal activity. IFI Officers, as part of the on-going awareness campaign distribute copies of relevant bye-laws and IFI has made fisheries legislation available on-line across a range of languages.  Reporting of postings on social media is welcome and IFI staff are continuing to monitor the situation and, where possible, follow up. IFI advise that where legally possible efforts are made to identify and interact with the persons in question with a view to ascertaining the circumstances around the alleged incidents.  IFI report that this has resulted in a number of alleged illegal activities being proven to be within the current legal framework but also in a number of individuals being issued fines or cautions.  IFI also advise that many of the photographs reported were posted over 12 months before being reported, with some posted as far back as 2009 and it is not possible for IFI to consider action on alleged incidents outside the established legal timeframe.  In that regard, I understand that some 65% of issues reported to IFI, via social media, in 2014 related to events alleged to have occurred during the previous year. Only a small number relate to events that occurred in the previous 6 months by which timeframe the ability to take action is defined.  The timing and evidential issues arising from reporting matters posted to social media indicate that the confidential hotline is the most effective and timely method of reporting any activity and I would encourage concerned anglers and other citizens to make full use of it. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-03-03",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2015-03-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-03/writtens/mul@/dbsect_484.xml"
            }
          },
          "debateSectionId": "dbsect_484",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-03-03/writtens/dbsect_484",
          "showAs": "Tourism Promotion"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-03-03/pq_600",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 600,
        "showAs": " 600. Deputy Joe O'Reilly asked the Minister for Transport, Tourism and Sport the State agency, or agencies, responsible for promoting Ireland as a tourist angling destination; the level of funding the agency or agencies have to do this in 2015; and if he will make a statement on the matter. [8907/15] ",
        "answerText": " Minister for Transport, Tourism and Sport  Tourism Ireland Limited is the agency with responsibility for promoting the island of Ireland as a holiday destination overseas, while Fáilte Ireland is the National Tourism Development Authority. Decisions on the level of funding being used in 2015 for promotion of angling are operational matters for Fáilte Ireland and Tourism Ireland. Accordingly, I have referred the Deputy's question to the tourism agencies for direct reply. Please advise my private office if you do not receive a reply within ten working days.  In addition, Inland Fisheries Ireland (IFI) is the state agency responsible for the protection, management and conservation of Ireland's inland fisheries and sea angling resources. Accordingly, you may also wish to raise the matter in question with my colleague the Minister for Communications, Energy and Natural Resources, as IFI is an agency under the aegis of his Department. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-03-03",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "question": {
        "date": "2014-11-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-11-11/writtens/dbsect_391",
          "showAs": "Schools Building Projects Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-11-11/writtens/mul@/dbsect_391.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_391"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 462. Deputy Joe O'Reilly asked the Minister for Education and Skills the progress, to date in respect of a school (details supplied) in County Cavan; if it is on course to open in 2016; and if she will make a statement on the matter. [42990/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-11-11/pq_462",
        "questionNumber": 462,
        "answerText": " Minister for Education and Skills  The delivery of the proposed new post-primary school in Kingscourt, Co. Cavan has been devolved to Cavan and Monaghan Education and Training Board. The project is at the early stages of architectural planning and is on my Department's five year building programme to proceed to tender & construction in 2015/2016. "
      },
      "contextDate": "2014-11-11"
    },
    {
      "contextDate": "2014-11-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-11-04/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-11-04/writtens/dbsect_87",
          "showAs": "Departmental Investigations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-11-04/pq_210",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 210,
        "showAs": " 210. Deputy Joe O'Reilly asked the Tánaiste and Minister for Social Protection the reason the ESB treats meter readers as self-employed deeming them to be on a contract of service PRSI Class A and due to this, they are denied their statutory rights, that is, redundancy payments and all other social protection entitlements; and if she will make a statement on the matter. [41771/14] ",
        "answerText": " Tánaiste and Minister for Social Protection  I propose to take Questions Nos. 155 and 210 together.  This matter is the subject of ongoing investigation in the Department.  It would not be appropriate for me to comment on the likely outcome of these investigations at this stage. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-11-04",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "question": {
        "date": "2014-09-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-09-17/writtens/dbsect_542",
          "showAs": "Legal Aid Service Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-09-17/writtens/mul@/dbsect_542.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_542"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 585. Deputy Joe O'Reilly asked the Minister for Justice and Equality the overall amount of expenditure this year on free legal aid; the procedures that are in place for controlling costs; the case of persons who avail of this service more than once; the amount of money that is spent on second and subsequent cases; the steps, if any, that are made to recoup moneys spent on free legal aid clients; and if she will make a statement on the matter. [33434/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-09-17/pq_585",
        "questionNumber": 585,
        "answerText": " Minister for Justice and Equality  Expenditure on the Criminal Legal Aid Scheme for 2014 (January - August) is €33.3 million. Under the Criminal Justice (Legal Aid) Act 1962, the courts, through the judiciary, are responsible for the granting of legal aid. The nature of the Scheme is that it is demand-led, driven by the incidence of crime, detection rates and prosecutions of cases through the courts systems. This makes it difficult to anticipate and control costs. Under the Act an applicant for legal aid must establish to the satisfaction of the court that their means are insufficient to enable them to pay for legal aid themselves. The 1962 Act specifies that the court must also be satisfied that, by reason of the \"gravity of the charge\" or \"exceptional circumstances\", it is essential in the interests of justice that the applicant should have legal aid.  The Deputy will appreciate that an accused person who faces serious charges is entitled to a fair trial and the presumption of innocence and if they cannot afford to pay for legal representation there is a right to legal aid. Under the Constitution, the State is obliged to provide an accused person with the means to obtain appropriate legal representation. Moreover, the European Convention on Human Rights provides that every person charged with a criminal offence is entitled to defend themselves in person or through legal assistance of their own choosing or, if they have insufficient means to pay for legal assistance, to be given it free when the interests of justice so require.  A new Criminal Legal Aid Bill is being drafted to update and strengthen the system of granting legal aid including the transferring of responsibility for the administration of the Scheme to the Legal Aid Board. Consideration is being given to including in the Bill provisions to, inter alia, regulate better the taking of statements of means, increase the sanction for false declarations, allow the Board to verify the means of applicants and to prosecute in cases of abuse. Provisions to give power to the Legal Aid Board to recover the costs of criminal legal aid or to make application to a court to revoke a criminal legal aid certificate are also under consideration. These provisions will have regard for a person's right to the presumption of innocence, to a fair trial and to be given legal aid where appropriate.   An applicant's previous convictions are not a criterion for the granting of criminal legal aid under the Act and consequently the information sought by the Deputy in respect of the number of persons who received criminal legal aid on more than one occasion is not available. Records are not kept in a manner which would allow for the extraction of information showing the number of times a person has been granted criminal legal aid.  There is no recoupment of money from defendants under the Criminal Legal Aid Scheme. "
      },
      "contextDate": "2014-09-17"
    },
    {
      "question": {
        "date": "2014-09-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-09-17/writtens/dbsect_813",
          "showAs": "Hospital Consultant Contracts",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-09-17/writtens/mul@/dbsect_813.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_813"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 906. Deputy Joe O'Reilly asked the Minister for Health in respect of a private consultant who works in a public hospital, the percentage of their patients that can be private; the percentage of the income that they earn from private patient consultations that is given back to the hospital in which they work; the overall percentage of moneys owing by private consultants that has been collected by the general hospital sector; and if he will make a statement on the matter. [33435/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-09-17/pq_906",
        "questionNumber": 906,
        "answerText": " Minister for Health  The percentage of private patients that can be seen by a consultant in a public hospital depends on the type of consultant contract held. Type A contract holders have no access to private practice. For those consultants with access to private practice within public hospitals, the volume of private practice may not exceed 20% of the Consultants clinical workload in any of his or her clinical activities, including in-patient, day-patient and out-patient. I have referred the Deputy's other queries to the HSE for direct reply. "
      },
      "contextDate": "2014-09-17"
    },
    {
      "question": {
        "date": "2014-09-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-09-17/writtens/dbsect_815",
          "showAs": "Health Services Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-09-17/writtens/mul@/dbsect_815.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_815"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 908. Deputy Joe O'Reilly asked the Minister for Health the details and the total cost of the action plan seeking funding for inpatient and day surgery which was forwarded from Cavan General Hospital to his private office; the number of patients; the exact speciality that would benefit from this funding; and if funding is approved, how quickly can this plan be implemented; the access targets for inpatients-day cases and outpatients for the end of 2014; if Cavan-Monaghan Hospital Group is on course to achieve targets across all specialties; if this is not the case, has an alternative action plan been put in place; if it will require additional funding; if this was submitted to the Office of the National Director of Acute Hospitals; if Cavan-Monaghan Hospital Group has the necessary resources required to achieve-maintain access targets for inpatients and outpatients across all specialties on an ongoing basis in 2015; if not, the resources that are required to achieve and maintain said targets and are these additional resources factored into the budget for 2015; and if he will make a statement on the matter. [33440/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-09-17/pq_908",
        "questionNumber": 908,
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to respond directly to the Deputy. "
      },
      "contextDate": "2014-09-17"
    },
    {
      "contextDate": "2013-12-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-12-11/writtens/mul@/dbsect_221.xml"
            }
          },
          "debateSectionId": "dbsect_221",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-12-11/writtens/dbsect_221",
          "showAs": "Hospital Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-12-11/pq_197",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 197,
        "showAs": " 197. Deputy Joe O'Reilly asked the Minister for Health when a person (details supplied) in County Cavan will undergo a surgical procedure; and if he will make a statement on the matter. [53266/13] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 189 and 197 together.  The National Waiting List Management Policy, A standardised approach to managing scheduled care treatment for in-patient, day case and planned procedures, January 2013, has been developed to ensure that all administrative, managerial and clinical staff follow an agreed national minimum standard for the management and administration of waiting lists for scheduled care. This policy, which has been adopted by the Health Service Executive, sets out the processes that hospitals are to implement to manage waiting lists. In relation to the detailed information sought by the Deputies, as these are service matters, they have been referred to the Health Service Executive for direct reply. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-12-11",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-12-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-12-11/writtens/mul@/dbsect_231.xml"
            }
          },
          "debateSectionId": "dbsect_231",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-12-11/writtens/dbsect_231",
          "showAs": "Hospital Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-12-11/pq_198",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 198,
        "showAs": " 198. Deputy Joe O'Reilly asked the Minister for Health when a person (details supplied) in County Cavan will receive a hip replacement; and if he will make a statement on the matter. [53267/13] ",
        "answerText": " Minister for Health  The National Waiting List Management Policy, A standardised approach to managing scheduled care treatment for in-patient, day case and planned procedures, January 2013, has been developed to ensure that all administrative, managerial and clinical staff follow an agreed national minimum standard for the management and administration of waiting lists for scheduled care. This policy, which has been adopted by the Health Service Executive, sets out the processes that hospitals are to implement to manage waiting lists.  In relation to this particular query raised by the Deputy, I have asked the HSE to respond directly to the Deputy in this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-12-11",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-11-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-11-21/writtens/mul@/dbsect_224.xml"
            }
          },
          "debateSectionId": "dbsect_224",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-11-21/writtens/dbsect_224",
          "showAs": "Orthodontic Service Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-11-21/pq_207",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 207,
        "showAs": " 207. Deputy Joe O'Reilly asked the Minister for Health the steps being taken to expedite the orthodontic treatment for three second level students (details supplied) in County Cavan; and if he will make a statement on the matter.  [49871/13] ",
        "answerText": " Minister of State at the Department of Health (Deputy Alex White)  The HSE provides orthodontic treatment to patients based on their level of clinical need. An individual's access to orthodontic treatment is determined against a set of clinical guidelines and priority is given to patients with greatest needs. The HSE has been asked to examine the specific query raised by the Deputy and to reply to him as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-11-21",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-06-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/mul@/dbsect_206.xml"
            }
          },
          "debateSectionId": "dbsect_206",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/dbsect_206",
          "showAs": "Pupil-Teacher Ratio"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-11/pq_262",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 262,
        "showAs": " 262. Deputy Joe O'Reilly asked the Minister for Education and Skills if a school (details supplied) in County Cavan will be excluded from the proposed 23 to 1 pupil-teacher ratio in September 2015 on the grounds that it uniquely has high enrolment from areas of disadvantage in Cavan town which is its immediate hinterland and it is the only second level school with a Protestant ethos in the entire county which boasts a large Protestant population; and if he will make a statement on the matter. [26978/13] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 230, 262, 287 and 289 together.  The Government has protected frontline services in schools to the greatest extent possible in the recent budget and there will no reduction in teacher numbers in primary schools and in free second level schools for the 2013/14 school year as a result of the budget. The DEIS scheme for disadvantaged schools is also fully protected with no overall changes to staffing levels or funding as a result of the budget.  At post primary level and in order to promote fairness in funding second level schools, a two-point increase in the pupil teacher ratio in fee-charging second level schools will be introduced in September 2013. There are currently 55 schools out of 723 post-primary schools charging fees ranging from €2,550 to €10,065 for day pupils. At present, the State pays the salaries of one teacher for every 21 pupils in these schools compared with one teacher for every 19 pupils in schools in the free education scheme. A ratio of 18.25 pupils to one teacher, applies in DEIS schools. This will rise to 23:1 in fee-charging schools from September 2013. However, these schools have the resources, through fees charged, to employ teachers privately, an option which is not available to schools in the free education scheme. A report on the analysis of the tuition income of fee-charging schools carried out by the Department was recently published and shows that the schools in question have €81m in discretionary income that schools in the free scheme do not have. It is important to note that the report does not contain any policy proposals at this stage. However, even after the Budget changes are implemented, the discretionary income available to these schools will still be quite considerable. There are some concerns within the Church of Ireland community on the recent budget measure affecting fee-charging schools. This Government recognises the importance of ensuring that students from a Protestant or Reformed church background can attend a school that reflects their denominational ethos while at the same time ensuring that funding arrangements are in accordance with the provisions of the Constitution. How best to sustain education provision for widely dispersed and small local communities does present as a particular challenge, especially in any locality where enrolment is declining to single figures. The Government is intent in fostering pluralism in school provision. Supporting small communities including minorities in maintaining their schools is part of that policy.  With regard to the fee-charging Protestant schools, an arrangement exists whereby funding is provided by my Department to the Secondary Education Committee (SEC), an organisation run by the churches involved in managing the Protestant secondary schools. The SEC then disburses funds to the Protestant fee-charging schools on behalf of pupils who would otherwise have difficulty with the cost of fees and who, in the absence of such financial support, would be unable to attend a second level school of a reformed church or Protestant ethos. Funding amounts to €6.5 million annually. This fund ensures that necessitous Protestant children can attend a school of their choice. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-11",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-05-15",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-15/writtens/mul@/dbsect_61.xml"
            }
          },
          "debateSectionId": "dbsect_61",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-15/writtens/dbsect_61",
          "showAs": "Tourism Industry Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-15/pq_48",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 48,
        "showAs": " 48. Deputy Joe O'Reilly asked the Minister for Transport, Tourism and Sport his views on the tourism performance to date in 2013; his expectations for the remainder of 2013; and if he will make a statement on the matter. [22688/13] ",
        "answerText": " Minister for Transport, Tourism and Sport  I propose to take Questions Nos. 40, 46 and 48 together.  Figures published by the CSO show that there were over 6.5 million overseas visits to Ireland in 2012 representing a minor increase (0.2%) on the 2011 total. It should be noted that the number of core tourism visits grew strongly with holiday trips up by 3.8% and business trips up by 7.7% compared to 2011. While overall bednights fell in 2012, this was primarily due to a fall of nearly 10% in numbers staying with friends or relatives.  The number of overseas hotel bednights, the most valuable in terms of revenue and jobs, actually grew by 13% in 2012.  I am pleased that the positive trend has continued into 2013 suggesting that the Gathering Ireland 2013 is having a real impact. The most recent figures from the CSO show very strong growth of 7.4% for the first quarter of 2013 compared to 2012, an increase of over 86,000 extra trips. All of our main overseas markets have shown growth in the first quarter with overseas visits from Mainland Europe up 13%, visits from Great Britain up 1.4%, visits from North America up 16.7%, while visits from the rest of the world grew by 5.4%.  The overall target  for the year of The Gathering was to increase the number of overseas visits by 325,000. The figures for the first quarter suggest that we are well on target to achieve and even exceed this as the increase to date is over 25% of the total increase targeted. The overall sentiment for travel to Ireland is good  with particularly encouraging signs for visit numbers from Mainland Europe and the USA, supported by significant growth in transatlantic air access for the peak summer period. Tourism Ireland will continue to roll-out a major consumer marketing campaign to promote Ireland and \"The Gathering Ireland 2013\" in all our key markets and ensure our targets will be achieved.   Question No. 41 answered with Question No. 28.  ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-15",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-05-15",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-15/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-15/writtens/dbsect_87",
          "showAs": "The Gathering Initiatives"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-15/pq_76",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 76,
        "showAs": " 76. Deputy Joe O'Reilly asked the Minister for Transport, Tourism and Sport if he will provide an update on the Gathering 2013; and if he will make a statement on the matter. [22687/13] ",
        "answerText": " Minister for Transport, Tourism and Sport  I am pleased to report continued good progress on the Gathering Ireland 2013 - Ireland's biggest ever tourism initiative. The overall target is to attract at least 325,000 extra overseas visits to Ireland in 2013. If this target is achieved, it will generate an additional €170 million in revenue this year, based on historic spending patterns. Recent figures from the CSO show visit numbers for the first quarter of 2013 up over 86,000 compared to the corresponding period of 2012. This represents an encouraging start to 2013.  In terms of resources, the 2013 Estimates allocations to Fáilte Ireland include a special provision of €7 million which was specifically provided for The Gathering. This amount is to be used exclusively to fund the promotion, development and legacy of the event and complements support for the initiative from the tourism agencies' mainstream activities and from national and local partners.  The general response from the public and tourism stakeholders has been overwhelmingly positive. There are now over 3,500 individual gatherings confirmed on the Gathering website. These include clan gatherings, festivals, special sporting events and concerts taking place all across the country throughout the year. Along with well-established events and festivals, we are also supporting a specially targeted set of events for the Gathering, such as the very successful New Year's Eve Event in Dublin, while over 6,000 overseas visitors took part in the People's Parade in Dublin during the St. Patrick's day festivities.  Obviously the ambitious targets for overseas visits and associated revenue can only be achieved if people in our main source tourism markets are aware of the initiative. Tourism Ireland continues to mount a major consumer campaign to promote The Gathering to the people across the world that feel linked by family, friends or otherwise with Ireland. The agency is undertaking cooperative activity with the major airlines and ferry operators to highlight the value fares that are on offer. My colleague, Minister Michael Ring recently launched a brand new app for iPhones and android devices which has been specifically designed for The Gathering Ireland 2013. The \"Gathering Gestures\"  app which is free to download has been created by Tourism Ireland and offers a variety of offers to ensure our overseas visitors get even more from their holiday here.  While progress to date has been encouraging, as I have previously stated, all tourism stakeholders must continue to work hard to ensure that the full potential of the Gathering is realised. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-15",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-30/writtens/mul@/dbsect_476.xml"
            }
          },
          "debateSectionId": "dbsect_476",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-30/writtens/dbsect_476",
          "showAs": "Orthodontic Services Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-04-30/pq_563",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 563,
        "showAs": " 563. Deputy Joe O'Reilly asked the Minister for Health the steps that are being taken to expedite the orthodontic treatment for two second level students (details supplied) in County Cavan; and if he will make a statement on the matter. [20101/13] ",
        "answerText": " Minister of State at the Department of Health  The HSE provides orthodontic treatment to patients based on their level of clinical need. An individual's access to orthodontic treatment is determined against a set of clinical guidelines and priority is given to patients with greatest needs. The HSE has been asked to examine the specific query raised by the Deputy and to reply to him as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-04-30",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-30/writtens/mul@/dbsect_477.xml"
            }
          },
          "debateSectionId": "dbsect_477",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-30/writtens/dbsect_477",
          "showAs": "Health Services Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-04-30/pq_564",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 564,
        "showAs": " 564. Deputy Joe O'Reilly asked the Minister for Health the financial assistance aid available for a second level student (details supplied) in County Cavan who has severe vision problems, strabismus, and requires very expensive glasses; and if he will make a statement on the matter. [20102/13] ",
        "answerText": " Minister of State at the Department of Health  All children of primary school age are provided with an optical screening service by the HSE. Any refractive errors are treated and spectacles or other appropriate care is provided where necessary. Second level students up to 16 years are eligible for HSE eyecare services where they are named on their parents' medical cards. Other second level students up to 16 years are eligible to be seen by a HSE eye doctor when there is a medical reason for the eye condition, rather than a refractive error. Such patients may be referred for treatment after being examined by an optometrist. The HSE has been asked to examine the specific query raised by the Deputy and to reply to him as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-04-30",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-04-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-16/writtens/mul@/dbsect_885.xml"
            }
          },
          "debateSectionId": "dbsect_885",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-16/writtens/dbsect_885",
          "showAs": "Hospital Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-04-16/pq_1147",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1147,
        "showAs": " 1147. Deputy Joe O'Reilly asked the Minister for Health when it was decided to remove access to phlebotomy services at Cavan General Hospital for diabetics attending consultants but not referred specifically as a result of an appointment at the diabetic day centre; the reason for the decision; and if he will make a statement on the matter. [16221/13] ",
        "answerText": " Minister for Health (Deputy James Reilly)  In relation to the particular query raised by the Deputy, as this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy in this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-04-16",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-03-20/writtens/mul@/dbsect_35.xml"
            }
          },
          "debateSectionId": "dbsect_35",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-03-20/writtens/dbsect_35",
          "showAs": "Hospital Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-03-20/pq_147",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 147,
        "showAs": " 147. Deputy Joe O'Reilly asked the Minister for Health the measures that have been taken to tackle inpatient and day case waiting lists in Cavan General Hospital; the impact of these measures; and if he will make a statement on the matter.  [14267/13] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 17, 22, 29, 52, 53, 59, 74, 89, 97, 106, 112, 113, 116, 126, 132, 135, 138, 142, 147, 154 and 156 together.  In 2011, I established the Special Delivery Unit in my Department as set out in the Programme for Government. The aim of the SDU is to unblock access to acute services by improving the flow of patients through the system. The SDU's Scheduled Care Team focused initially on waiting times for in-patient and daycase elective surgery. For 2012, a target was set that no adult should wait longer than 9 months for inpatient or daycase treatment. By the end of December 2012, the number of adults having to wait more than 9 months for inpatient and day case surgery nationally had fallen to 86. This was down from 3,706 in December 2011, representing a 98% decrease  I am determined that the progress made in 2012 be maintained and improved upon. For 2013, the target is that no adult should be waiting longer than 8 months for inpatient or daycase treatment. It is important to recognise that the progress made in 2012 does not mean the problem is solved, and 2013 will of course be extremely challenging. For example, winter pressures in Emergency Departments have impacted on scheduled care waiting times. However, in the coming months, as winter pressures ease, the SDU will work towards re-balancing scheduled care to maintain the improvements seen in 2012 and to achieve the new 2013 target.  With regard to the specific hospitals referred to, I have asked the HSE to respond directly to the Deputies concerned. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-03-20",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-03-06",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-03-06/writtens/mul@/dbsect_136.xml"
            }
          },
          "debateSectionId": "dbsect_136",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-03-06/writtens/dbsect_136",
          "showAs": "Garda Stations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-03-06/pq_118",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 118,
        "showAs": " 118. Deputy Joe O'Reilly asked the Minister for Public Expenditure and Reform if there is an existing contractual commitment to a site at Bailieborough, County Cavan, for a proposed new Garda station; if so, when was it completed; the location of same; and if he will make a statement on the matter. [11923/13] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform  No contractual commitment has been made to purchase a site for a new Garda Station at Bailieborough, County Cavan. Acquisition of sites for Garda Stations is a matter for the Office of Public Works in conjunction with An Garda Síochána. The position at Bailieborough, County Cavan will continue to be reviewed in the context of the priority accorded to it by An Garda Síochána and subject to the availability of funding, which is extremely limited. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-03-06",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2013-01-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-01-22/writtens/mul@/dbsect_123.xml"
            }
          },
          "debateSectionId": "dbsect_123",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-01-22/writtens/dbsect_123",
          "showAs": "Product Classification"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-01-22/pq_222",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 222,
        "showAs": " 222. Deputy Joe O'Reilly asked the Minister for Finance the reason a company (details supplied) in County Cavan that has applied for a 2205 classification cannot be facilitated in obtaining this, in view of the fact that the jobs of 12 people are at stake here; and if he will make a statement on the matter. [2924/13] ",
        "answerText": " Minister for Finance  I am advised by the Revenue Commissioners that they are examining the classification of an alcoholic product presented by the company in question and have sought the assistance of the State Laboratory as part of this process. The Commissioners expect to complete this examination within the next two to three weeks and advise their classification decision to the company. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-01-22",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        }
      }
    },
    {
      "contextDate": "2012-12-05",
      "question": {
        "showAs": " 23. Deputy Joe O'Reilly asked the Minister for Education and Skills if a person (details supplied) will be considered for a continuation of the maintenance grant; and if he will make a statement on the matter. [54718/12] ",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2012-12-05/pq_23",
        "answerText": " Minister for Education and Skills  Officials in my Department have confirmed with Student Universal Support Ireland (SUSI) that in the case of the student referred by the Deputy, he appealed the decision in relation to the rate of grant awarded to the appeals officer in SUSI on the 1st December 2012. SUSI aims to issue determinations on appeals as promptly as possible and within the specified timeframes defined in the Student Support Act, 2011. Where an individual applicant has had an appeal turned down, in writing, by SUSI, and remains of the view that SUSI has not interpreted the scheme correctly in his/her case, an appeal form outlining the position may be submitted by the applicant to the independent Student Grants Appeals Board. ",
        "date": "2012-12-05",
        "by": {
          "showAs": "Joe O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "questionNumber": 23,
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-12-05/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          },
          "showAs": "Student Grant Scheme Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-12-05/writtens/dbsect_61",
          "debateSectionId": "dbsect_61"
        }
      }
    },
    {
      "contextDate": "2012-11-27",
      "question": {
        "showAs": " 705. Deputy Joe O'Reilly asked the Minister for Health if he will consider lifting the recent embargo on a promised podiatry post at Cavan Hospital, sanctioned in April 2012 in view of teh fact that the post was planned as part of the National Footcare Programme and is critical to tackling diabetes foot disease in the community and keeping persons with this complication out of hospital and promised podiatry posts have been filled in Counties Dublin, Galway and Limerick but not in Cavan; and if he will make a statement on the matter. [52951/12] ",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2012-11-27/pq_705",
        "answerText": " Minister for Health  The HSE National Clinical Programme for Diabetes - which includes the care of children and adolescents with diabetes - was established within the Clinical Strategy and Programmes Directorate. The purpose of the Programme is to define the way diabetic Clinical Services should be delivered, resourced and measured; and a clinician has been appointed to lead on the development of the programme. In relation to the specific query raised by the Deputy, as this is a local service issue, it has been referred to the HSE for direct reply. ",
        "date": "2012-11-27",
        "by": {
          "showAs": "Joe O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "questionNumber": 705,
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-11-27/writtens/mul@/dbsect_538.xml"
            },
            "pdf": null
          },
          "showAs": "Health Services Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-11-27/writtens/dbsect_538",
          "debateSectionId": "dbsect_538"
        }
      }
    },
    {
      "contextDate": "2012-10-17",
      "question": {
        "showAs": " 137. Deputy Joe O'Reilly asked the Minister for Education and Skills the reason it is not possible for a person (details supplied) in County Cavan to continue availing of school transportation; and if he will make a statement on the matter. [45359/12] ",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2012-10-17/pq_137",
        "answerText": " Minister of State at the Department of Education and Skills  The school transport schemes are operated by Bus Éireann, on behalf of my Department, and currently transport over 114,000 children, including about 8,000 with special educational needs, to and from school throughout the school year. The main objective of my Department's Primary and Post Primary School Transport Schemes is to support the safe transport to and from school of children who would have difficulty travelling, for reasons of distance, to their nearest school if transport is not supported. In this regard, children are eligible for school transport if they satisfy the distance criteria and are attending their nearest school or education centre having regard to ethos and language.The person referred to by the Deputy is not attending a recognised school and, accordingly, does not meet the eligibility criteria for receipt of a school transport service. ",
        "date": "2012-10-17",
        "by": {
          "showAs": "Joe O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "questionNumber": 137,
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-10-17/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          },
          "showAs": "School Transport Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-10-17/writtens/dbsect_143",
          "debateSectionId": "dbsect_143"
        }
      }
    },
    {
      "contextDate": "2012-10-17",
      "question": {
        "showAs": " 138. Deputy Joe O'Reilly asked the Minister for Education and Skills the reason it is not possible for a person (details supplied) in County Cavan to continue to avail of school transportation; and if he will make a statement on the matter. [45360/12] ",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2012-10-17/pq_138",
        "answerText": " Minister of State at the Department of Education and Skills  The school transport schemes are operated by Bus Éireann, on behalf of my Department, and currently transport over 114,000 children, including about 8,000 with special educational needs, to and from school throughout the school year. The main objective of my Department's Primary and Post Primary School Transport Schemes is to support the safe transport to and from school of children who would have difficulty travelling, for reasons of distance, to their nearest school if transport is not supported. In this regard, children are eligible for school transport if they satisfy the distance criteria and are attending their nearest school or education centre having regard to ethos and language.The person referred to by the Deputy is not attending a recognised school and, accordingly, does not meet the eligibility criteria for receipt of a school transport service. ",
        "date": "2012-10-17",
        "by": {
          "showAs": "Joe O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "questionNumber": 138,
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-10-17/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          },
          "showAs": "School Transport Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-10-17/writtens/dbsect_144",
          "debateSectionId": "dbsect_144"
        }
      }
    },
    {
      "question": {
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Minister for Social Protection",
          "roleCode": null
        },
        "showAs": " 227 Deputy Joe O’Reilly asked the Minister for Social Protection the action she will take to deal with the current backlog of carer’s allowance and disability allowance applications, that are currently taking almost a year to process; and if she will make a statement on the matter. \n        [22871/12] ",
        "questionNumber": 172,
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        },
        "questionType": "written",
        "date": "2012-05-08",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-05-08/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_147",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-05-08/writtens/dbsect_147"
        },
        "answerText": " Minister for Social Protection (Deputy Joan Burton)  The information sought by the Deputy is as follows:      Claims Received    Claims Cleared    Claims Awarded(1 June to 31 Dec)    Claims Disallowed(1 June to 31 Dec)      2011 (total)    14,621    10,508    Not available    Not available      1 Jan — 31 May    6,155    3,704    Not available    Not available      1 June — 31 Dec    8,466    6,804    2,107    4,697     A breakdown of claims awarded and disallowed in 2011 is available only for those claims dealt with from June to December 2011.  A breakdown of claims awarded and disallowed in the period from January to the end of May 2011 is unavailable as claims were being processed on two separate computer systems prior to migration of all invalidity pension claims to the new computer platform. \n Minister for Social Protection (Deputy Joan Burton)  The Department is committed to delivering the best possible service to its customers.  In the interests of fairness and equity applications are processed, as far as possible, in order of the date on which they were received in the Department.  A major service delivery modernisation project is underway to address the large increase in the claim-load and to improve the efficiency of administration of the carer's allowance and disability allowance schemes.  This involves the development of information technology functions and associated business process re-organisation.  It is anticipated that the new system will introduce significant processing efficiencies and a quicker and more responsive service to the customer.  Accordingly, the project is being given high priority and involves a significant level of time and commitment from the relevant staff in the Department.  This has had a short-term negative impact on claim processing times.  This essential focus of certain staff resources will continue until the completion of the modernisation projects in June of this year when all existing carer's allowance claims and by the end of this year when all existing disability allowance claims will be transferred onto the new processing system.  Accurate processing time figures are not available at present as applications are still being processed on both the old and the new computer systems.  The average time taken to award an application for disability allowance in 2011 was 17 weeks.  There are approximately 6,300 new disability allowance applications registered and awaiting a decision.  The average time to award a carer's allowance application at present is estimated at approximately 28 weeks. There are approximately 7,800 new carer's allowance applications registered and awaiting a decision.  I acknowledge that this is unsatisfactory but I am satisfied that the Department is taking all steps available to it to resolve the issue.  In addition to the deployment of new systems which should address service levels in the medium term, the Department is allocating additional resources in the form of overtime working to help reduce backlogs that have built up.  In addition, temporary staff have been assigned to the disability allowance scheme and approval has recently been given for the assignment of temporary staff for the carer's allowance scheme to expedite the reduction of the backlogs.  However, it is expected to be a significant number of months before the backlogs are reduced to an acceptable level.  In the meantime, if a person's means are insufficient to meet their needs while awaiting a decision on an application, they may apply for a means-tested supplementary welfare allowance payment from their local community welfare officer. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2012-05-08/pq_172",
        "house": {
          "showAs": "31st Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "31",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "houseCode": "dail"
        }
      },
      "contextDate": "2012-05-08"
    },
    {
      "question": {
        "answerText": " Minister for Health (Deputy James Reilly)  I am determined to address the issues which cause unacceptable delays in patients receiving treatment in our hospitals. In this regard I have established the Special Delivery Unit (SDU), which will work to unblock access to acute services by dramatically improving the flow of patients through the system, and by streamlining waiting lists, including referrals from GPs. The SDU is working closely with its partner agencies — mainly the HSE and the NTPF.  As a priority, public hospitals were instructed to ensure that, by the end of 2011, they had no patients waiting more than 12 months for treatment.  I can confirm that the vast majority of hospitals achieved this objective.  During 2012 the SDU will support hospitals in the delivery of a 9 month maximum wait time for inpatient or daycase surgery.  As this is a service matter, it has been referred to the HSE for direct reply. Should the patient's general practitioner consider that the patient's condition warrants an earlier appointment, he/she would be in the best position to take the matter up with the consultant and facility involved. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Minister for Health",
          "roleCode": null
        },
        "showAs": " 1228 Deputy Joe O’Reilly asked the Minister for Health the reason a person (details supplied) in County Cavan remains on a waiting list in Sligo General Hospital; and if he will make a statement on the matter.  \n        [17990/12] ",
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2012-04-18/pq_1218",
        "house": {
          "houseNo": "31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31"
        },
        "date": "2012-04-18",
        "questionNumber": 1218,
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-04-18/writtens/dbsect_855",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-04-18/writtens/mul@/dbsect_855.xml"
            }
          },
          "showAs": "Hospital Waiting Lists",
          "debateSectionId": "dbsect_855"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly"
        }
      },
      "contextDate": "2012-04-18"
    },
    {
      "contextDate": "2012-03-21",
      "question": {
        "questionNumber": 721,
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "houseNo": "31"
        },
        "by": {
          "showAs": "Joe O'Reilly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "answerText": " Minister for Transport, Tourism and Sport (Deputy Leo Varadkar)  The responsibility for the licensing of Public Bus Passenger Services was transferred under Statutory Instrument No. 566 of 2010 from my Department to the National Transport Authority (NTA) with effect from 1 December 2010.  In the circumstance, I have forwarded your correspondence to the NTA for its attention and direct reply. If you do not receive a reply within ten working days please notify my private office. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2012-03-21/pq_721",
        "showAs": " 733 Deputy Joe O’Reilly asked the Minister for Transport, Tourism and Sport the reason the holder of a licence (details supplied) was refused acceptance as a provider of a feeder service between Bailieborough and Virginia, County Cavan; his plans to provide, in the future, a feeder service from Bailieborough to Virginia and to the hourly bus service to Dublin; and if he will make a statement on the matter. \n        [15740/12] ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Transport, Tourism and Sport",
          "uri": null
        },
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_503",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-03-21/writtens/dbsect_503",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2012-03-21/writtens/mul@/dbsect_503.xml"
            }
          }
        },
        "date": "2012-03-21"
      }
    },
    {
      "contextDate": "2011-11-15",
      "question": {
        "showAs": " 147 Deputy Joe O’Reilly asked the Minister for Finance the number of detections of fuel laundering in 2011; the number of laundering factories that have been prosecuted and closed; the number of retail outlets that have been prosecuted for using laundered or washed diesel; the staffing levels that exist in the agencies charged with dealing with diesel laundering; and if he will make a statement on the matter. \n        [34621/11] ",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        },
        "date": "2011-11-15",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2011-11-15/pq_133",
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "showAs": "31st Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "debateSection": {
          "showAs": "Fuel Laundering",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-11-15/writtens/mul@/dbsect_131.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-11-15/writtens/dbsect_131",
          "debateSectionId": "dbsect_131"
        },
        "to": {
          "showAs": "Minister for Finance",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Finance (Deputy Michael Noonan)  I propose to take Questions Nos. 147 and 153 together.  I am informed by the Revenue Commissioners, who are responsible for the collection of mineral oil tax and for tackling the illicit trade in fuel products, that they are aware of the threat to the Exchequer posed by laundered fuel. The predominant illicit activity in the mineral oil area in both Northern Ireland and the Republic is the laundering of marked diesel and its sale through illegal outlets. In both jurisdictions the respective difference in excise rates between marked (rebated) and normal diesel offers a considerable incentive for oil laundering and this illicit activity poses a serious threat to the Exchequer and the economy on both sides of the border. The Deputies will appreciate that it is not possible to accurately estimate the loss to the national exchequer from individual activities within the shadow economy such as fuel laundering.  Revenue employs a broad range of compliance and enforcement strategies to detect and counteract illegal practices involving mineral oils. These include ongoing analysis of the nature and extent of the problem; development and sharing of intelligence with agencies on both sides of the border; the conduct of intelligence driven operations using covert surveillance to identify oil laundry locations; seizure of illicit product, laundering equipment and vehicles; physical sampling at road checkpoints; closure of unlicensed or improperly licensed outlets and seizure of stock and prosecution of those involved in illegal activities in relation to mineral oils.  So far this year, nine oil laundries have been detected, together with 327,000 litres of laundered fuel, and nine oil tankers and twenty-nine other vehicles have been seized. Sixteen persons were arrested in the course of these operations and files have been sent to the Director of Public Prosecutions, who has to date issued directions to prosecute on indictment in respect of two of these cases. The Deputies will appreciate that there is some time-span between the detection of an offence and the appearance of a defendant before the courts. So far in 2011, in addition to the 327,000 litres of fuel seized in the course of raids on oil laundries, a further 516,270 litres of illicit mineral oil has been seized, the large majority from retail outlets or in the course of delivery to such outlets. Revenue has obtained two convictions in the courts this year against the proprietors of filling stations that were found to be selling laundered mineral oil as auto diesel.  Revenue is currently engaged in a vigorous campaign targeting specific locations nationwide, with the intention of immediate closure of unlicensed outlets and the challenging of other instances of non-compliance. As part of this drive, warning letters have been issued to unlicensed retail outlets and a number of these have been effectively closed down by the actions of Revenue enforcement teams. This campaign is ongoing and Revenue is in the process of seizing illicit product and closing down a further number of unlicensed or otherwise illegal retail outlets. This month alone, in a recent targeted enforcement operation by Revenue officers, ten filling stations, one fuel depot and two private dwellings in counties Dublin, Galway and Louth were raided. A total of 158,000 litres of fuel were seized from three of these premises, including two tankers of fuel, and approximately €39,000 was detained under the Proceeds of Crime legislation.  Revenue continuously keeps under review the effectiveness of legislation and regulations in relation to combating the illicit trade in mineral oil. This includes reviewing powers, penalties, etc, and making recommendations to my Department where legislative amendments are required. The ongoing review of effectiveness includes consideration of alternative approaches, as referred to by the Deputy, to tackling the illicit removal of fuel marker. General consideration has been given, in this context, to a rebate system. However, Revenue advises me that such a system would pose different problems. It would involve the establishment of a very extensive repayment system, giving rise to a very significant administrative burden for oil traders, consumers and for Revenue and would pose significant cash-flow difficulties for those who currently use marked gas oil.  Repayment regimes are vulnerable to abuse and liable to be exploited by criminal elements, such as those currently involved in fuel laundering.  Revenue is currently reviewing its enforcement options in the context of reductions in the sulphur content of some fuels that have been introduced under recent EU environment legislation.  The matters being addressed include the potential development of an enhanced fuel marker. In this regard, close liaison has been established with HM Revenue & Customs. Revenue is also considering strengthening the Regulations governing the keeping for sale of fuel products and a renewed focus on links in the laundered fuel supply chain.  The Irish Petrol Retailers Association, which represents the majority of legitimate retail outlets in the State, is working closely with the Revenue Commissioners to counteract the threat posed by the sale and distribution of illicit mineral oil.  Revenue is an integrated tax and customs administration and staff are not allocated by function. The Deputies will be aware that Revenue's overall staff numbers have been reduced over the past two years in the context of Government policy on civil service numbers and now stand at approximately 5,940.  However, the Revenue Commissioners assure me that their staff resources deployed in anti-evasion enforcement have been maintained and are indeed augmented when specific operations are organised. ",
        "questionNumber": 133
      }
    },
    {
      "contextDate": "2011-11-08",
      "question": {
        "showAs": " 195 Deputy Joe O’Reilly asked the Minister for Public Expenditure and Reform the progress that has been made on reaching an agreement with Northern Ireland Accountable Departments DFP and DETI regarding the match funding percentage split for the Border uplands project; and if he will make a statement on the matter. \n        [33483/11] ",
        "by": {
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01"
        },
        "date": "2011-11-08",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2011-11-08/pq_188",
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "showAs": "31st Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "debateSection": {
          "showAs": "Departmental Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-11-08/writtens/mul@/dbsect_146.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-11-08/writtens/dbsect_146",
          "debateSectionId": "dbsect_146"
        },
        "to": {
          "showAs": "Minister for Expenditure",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for  Public Expenditure and Reform (Deputy Brendan Howlin)  I propose to take Questions Nos. 193 and 195 together.  As the Deputies are aware, this project is due to be implemented under the INTERREG IVA Programme 2007-13 which is co-funded by the Irish and UK (NI/Scotland) Governments and the European Regional Development Fund.  The objective of the programme is to support strategic cross-border co-operation for a more prosperous and sustainable region.  It has a total allocation of €256m and focuses on the development of a dynamic economy and provision of support to cross-border infrastructure that will improve access to services and thereby improve the quality of life for those living in the eligible region of Northern Ireland, the Border Region of Ireland and Western Scotland.   The programme is managed by the Special EU Programmes Body (SEUPB), one of the six North South Bodies established under the Good Friday Agreement.  To implement the programme, SEUPB issues calls for project applications, assesses applications received (with independent economic appraisal for projects over £500k, as per UK requirements) and presents assessed projects for final selection by Steering Committee.  Funding for the approved projects is then provided by the relevant Accountable Departments in Northern Ireland and Ireland (and Scotland partners for tripartite projects).  The INTERREG programme should take account of the overall agreed apportionment of funding from Member States for the period 2007-2013 (IRL 27.6%, UK 72.4%).  Currently, Ireland's contribution is in excess of agreed rates (in the order of 40%).  My Department, together with the Department of Finance and Personnel in NI and the SEUPB, is working closely to address this issue and ensure that the correct funding ratios are met by end of the programme.  Remaining projects will need to be funded with relatively higher UK and relatively lower Irish contributions and an approach is being agreed and finalised to facilitate this.  However, pending a resolution, all letters of offer for INTERREG IVA projects have been temporarily on hold.  We hope to have a resolution to this issue shortly so that the letter of offer for this tourism project can issue. ",
        "questionNumber": 188
      }
    },
    {
      "question": {
        "date": "2011-07-12",
        "showAs": " 77 Deputy Joe O’Reilly asked the Tánaiste and Minister for Foreign Affairs and Trade if he will raise the matter of parents in India having the sex of their young daughters changed to male from as young as one year old with the Office of the High Commissioner of Human Rights, with a view to preventing this practice from continuing; and if he will make a statement on the matter. \n        [19660/11] ",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "questionNumber": 70,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2011-07-12/pq_70",
        "questionType": "written",
        "to": {
          "roleType": null,
          "showAs": "Minister for Foreign",
          "roleCode": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade (Deputy Eamon Gilmore)  I am aware that there have been media reports that surgical procedures were carried out on young girls to change their sex to male in the Indian state of Madhya Pradesh.  I understand that the Indian National Commission for Protection of Child Rights, a statutory body, has demanded an investigation into the allegations and that the Chief Minister of Madhya Pradesh has ordered such an inquiry.  I am also aware that several human rights organisations in India are active on the issue.  Officials from my Department and our Embassy in New Delhi will continue to monitor developments in this matter.  Ireland is committed to the achievement of gender equality and the empowerment of women and is involved in a variety of initiatives at international level to this end, such as playing an active role in the negotiation and adoption of resolutions at the UN General Assembly and the UN Human Rights Council aimed at promoting the rights of women and girls.  Furthermore, Ireland actively participates in the Commission on the Status of Women under the UN Economic and Social Council.  Ireland was to the fore in promoting the establishment of UN Women, the new UN agency working for gender equality and women's empowerment, and has provided over €1.8 million since its establishment earlier this year for its work in developing countries.  Ireland acceded to the United Nations Convention on the Elimination of Discrimination Against Women (CEDAW) on 23 December 1985. Ireland signed and ratified the Optional Protocol to CEDAW on 7 September 2000. As a State Party to the Convention on the Elimination of Discrimination Against Women, Ireland is committed to implementing the provisions of the Convention and ensuring the elimination of gender based discrimination.  India is also a party to CEDAW and ratified it on 25 June 1993. ",
        "debateSection": {
          "debateSectionId": "dbsect_78",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-07-12/writtens/mul@/dbsect_78.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-07-12/writtens/dbsect_78",
          "showAs": "Human Rights Issues"
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "houseNo": "31",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "31st Dáil"
        }
      },
      "contextDate": "2011-07-12"
    },
    {
      "question": {
        "date": "2011-06-07",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "houseNo": "31",
          "showAs": "31st Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house"
        },
        "to": {
          "showAs": "Minister for Finance",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "showAs": " 26 Deputy Joe O’Reilly asked the Minister for Finance if he is satisfied that he can put adequate measures in place to ensure the maintenance of the jobs in Quinn Direct and the Quinn Group.  \n        [10026/11] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2011-06-07/pq_20",
        "answerText": " Deputy Michael Noonan  The Deputy should note that as Minister for Finance, I have had no direct dealings with Liberty Mutual in regard to this transaction, including the issue of the future of all existing job holders.  However, I have been informed by the joint administrators that aside from the redundancies in Manchester, all 1,570 jobs in Quinn Insurance Limited have been protected for at least two years.  When they gave me that commitment, they referred to \"two years\" because that was as far as they were prepared to make an estimate into the future.  There was no suggestion that any of the jobs will be at risk after two years.  I understand the jobs will be transferred to Liberty Mutual Direct Insurance Company Limited under the protection of employees rights on transfer of undertakings regulations.  That will ensure the current terms and conditions are protected.  It is important to keep in mind that in assessing the bids for the business of Quinn Insurance Limited, the joint administrators were required to consider how best the interests of policy holders could be protected and how the company could be returned to a sound commercial footing.  This was their primary responsibility, in line with the powers given to them under the Insurance (No. 2) Act 1983.  While the retention and protection of employment was important, it was subject to the aforementioned responsibilities.  In the circumstances, the proposed deal between Liberty Mutual and Anglo Irish Bank represents an excellent outcome from a jobs perspective because it provides a commitment to maintaining jobs for at least two years and achieves the primary objective of protecting policy holders.  Liberty Mutual has not given an indication of what will happen to these jobs at the end of the two-year period, but I remain hopeful that they will be maintained.  Quinn Insurance Limited has been purchased by a company with an impressive track record in the insurance industry.  It is conscious of the importance of ensuring competition in the Irish insurance market and appreciates its role in providing employment and economic development in the Border region and further afield.  Additional information not given on the floor of the House  An agreement was reached between Anglo Irish Bank and the senior lenders to the Quinn Group whereby the €1.3 billion debt of the latter is being restructured.  This will result in the removal of a long-running and significant uncertainty from these businesses, which are strong but were over-indebted.  Their lending facilities were in breach of covenant for some time.  As a result of the agreement, all or almost all manufacturing jobs will be retained.  It is important to state clearly to the House that a viable future depends to a large degree on the willingness by everybody, particularly those engaged in recent negative events, to engage wholeheartedly with the new ownership arrangements and to begin to put their energies into growing the business and contributing to getting jobs back into the local economy on both sides of the Border.  This is important.  If this does not happen, over time there is likely to be a negative impact on the performance of the group and consequences for jobs.  None of us in the House wants to see this. \n Deputy Caoimhghín Ó Caoláin  Deputy O'Reilly's question asked whether the Minister is satisfied that he is in a position to put adequate measures in place.  The Minister's reply indicated that there are no measures which he can put in place.  He indicated that he is at a remove from the real engagement in this instance.  Is that the case?  Can he be more specific?  In light of the assurances the Minister has received in the past, which he has in turn conveyed to the all-party cross-Border group — I am concerned to hear about the \"commitment\" that has been given in this case.  I recall that on the last occasion on which we met, the Minister indicated that the Quinn Insurance proposals, which are an alternative to the Anglo-Liberty proposals, had been scrutinised properly by the National Treasury Management Agency.  Since that meeting, however, I have received correspondence from the agency's senior legal adviser to the effect that the agency had no such role and carried out no such function.  Its only responsibility was to assess the proposals that were referred to it by the joint administrators for consideration.  Is it not the case, therefore, that the belief the Minister expressed on that occasion has been contradicted by the National Treasury Management Agency in the correspondence it sent me in my role as convener of the all-party group?  I suggest the position we feared most — that the Quinn-based proposals would not be given the proper, fair and full consideration they deserved — has come to pass. \n Deputy Michael Noonan  I am not aware of the letter to which the Deputy refers.  I would be grateful if he should provide me with a copy of it. \n Deputy Caoimhghín Ó Caoláin  I will. \n Deputy Michael Noonan  I have explained my position.  The Deputy understands it fully.  I am not directly a party to the sale.  The Deputy knows how it occurred.  Having met the principals in Liberty, I am confident that the jobs are secure.  According to the Liberty Group's business plan, the intention is to grow and expand the company and to increase, rather than reduce, the number of jobs.  That is what I was told by the gentleman from Armagh who is the chief executive of Liberty at present.  He gave me assurances in that regard.  I thought he was a very credible person.  I hope the jobs are secure.  I do not want to lambaste the Quinn Group.  There is enough information on the public record to suggest that the group was impaired for a considerable time as a result of unwise investments in Anglo Irish Bank.  I refer to the purchase of shares.  I am confident that the best decision was made in the interests of the future of the company.  It is in the interests of the State that the liability, in terms of the capital that will be required on an ongoing basis through the insurance fund, be reduced.  The decision that was made is in the interests of employees.  I understand fewer than 20 people will be made redundant in Manchester.  Some 1,570 jobs in the Border counties are secure.  That is a very good result.  My information is that the employees are supporting that decision now.  I suggest the Deputy should get behind it, rather than knocking it. \n Deputy Caoimhghín Ó Caoláin  I would like to ask a brief supplementary question. \n An Leas-Cheann Comhairle  The next question is in the Deputy's own name. \n Deputy Caoimhghín Ó Caoláin  Is it not possible to add a brief supplementary? \n Deputy Mary Mitchell O’Connor  Other people are interested in one of the questions that is coming up. \n An Leas-Cheann Comhairle  We need to move on. ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-06-07/debate/mul@/dbsect_13.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-06-07/debate/dbsect_13",
          "showAs": "Job Protection",
          "debateSectionId": "dbsect_13"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "questionNumber": 20,
        "questionType": "oral"
      },
      "contextDate": "2011-06-07"
    },
    {
      "question": {
        "date": "2011-06-07",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "houseNo": "31",
          "showAs": "31st Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house"
        },
        "to": {
          "showAs": "Minister for Finance",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "showAs": " 60 Deputy Joe O’Reilly asked the Minister for Finance if he is satisfied with the assurances given on job retention in the proposed Liberty Mutual/Anglo deal on Quinn Direct Insurance. \n        [10025/11] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2011-06-07/pq_58",
        "answerText": " Minister for Finance (Deputy Michael Noonan)  At the outset the Deputy should note that as Minister for Finance I have had no direct dealings with Liberty Mutual in relation to this transaction including the issue of the future of all existing job-holders.  However, I have been informed by the Joint Administrators that aside from the redundancies in Manchester, all the 1570 jobs in Quinn Insurance Ltd (QIL) have been protected for at least two years.  I also understand that they will transfer to Liberty Mutual Direct Insurance Company Ltd under the Protection of Employees Rights on Transfer of Undertakings Regulations, thereby protecting their current terms and conditions.  It is important to keep in mind that in assessing the bids for the business of QIL, the Joint Administrators were required to consider how best the interests of policyholders could  be protected and how the company could be returned to a sound commercial footing. This was their primary responsibility under the powers given to them by the 1983 Insurance (No. 2) Act.  While the retention and protection of employment was important, it was very much subject to the aforementioned responsibilities. In the circumstances therefore, the proposed Liberty Mutual/Anglo deal in my view represents an excellent outcome because it provides a commitment to maintain jobs for at least two years, as well as achieving its primary objective of protecting policyholders.  While no indication has been provided by Liberty Mutual as to what will happen at the end of the two year period in relation to jobs, I remain hopeful that they will be maintained.  The main reason is that the QIL business has been purchased by a company which has an impressive track record in the insurance industry and which is also very conscious of the importance of ensuring competition in the Irish insurance market and appreciates its role in providing employment and economic development in the Border region and further afield.  The decision to appoint the Share Receiver to the Quinn Group by Anglo was very much a commercial one, into which I had no direct input, and also gives the Group grounds for hope of a viable future.  In this regard, it should be noted that a Share Receiver is fundamentally different from a company receiver as it will not involve the sale of businesses or assets.  An agreement was also reached between Anglo and the senior lenders to the Quinn Group whereby the latter's €1.3 billion euro of debt is being restructured.  This results in the removal of a long-running and significant uncertainty over these businesses, which are very strong businesses but which were over-indebted, and their lending facilities were in breach of covenant for some time.  This will result in all or almost all manufacturing jobs being retained.  It is important to state clearly to the House that a viable future however depends to a large degree on the willingness by everybody, particularly those engaged in recent negative events, to engage wholeheartedly with the new ownership arrangements, and to begin to put their energies into growing the business and contributing to getting jobs back into the local economy on both sides of the border.  This is very important because if this does not happen then, over time there is very likely to be a negative impact on the performance of the Group and consequences for jobs.  None of us in the House want to see this. ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-06-07/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-06-07/writtens/dbsect_58",
          "showAs": "Job Protection",
          "debateSectionId": "dbsect_58"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly",
          "memberCode": "Joe-O'Reilly.S.1989-10-01"
        },
        "questionNumber": 58,
        "questionType": "written"
      },
      "contextDate": "2011-06-07"
    },
    {
      "contextDate": "2011-03-23",
      "question": {
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-03-23/writtens/dbsect_94",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2011-03-23/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_94",
          "showAs": "Health Services"
        },
        "answerText": " Minister for Health and Children (Deputy James Reilly)  As this is a service matter it has been referred to the Health Service Executive for direct reply to the Deputy. \n Minister for Health and Children (Deputy James Reilly)  I propose to take Questions Nos. 87 and 88 together.  I am considering the measures introduced by the HSE to contain expenditure on the Dental Treatment Services Scheme at the level of €63 million. ",
        "date": "2011-03-23",
        "showAs": " 87 Deputy Joe O’Reilly asked the Minister for Health and Children his plans to deal with dental procedures which have been revoked under the previous Government for medical card holders; and if he will make a statement on the matter. \n        [5469/11] ",
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-O'Reilly.S.1989-10-01",
          "memberCode": "Joe-O'Reilly.S.1989-10-01",
          "showAs": "Joe O'Reilly"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2011-03-23/pq_87",
        "to": {
          "roleType": null,
          "showAs": "Minister for Health",
          "uri": null,
          "roleCode": null
        },
        "house": {
          "houseCode": "dail",
          "houseNo": "31",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "showAs": "31st Dáil"
        },
        "questionNumber": 87
      }
    }
  ]
}