{
  "head": {
    "counts": {
      "questionCount": 1146,
      "resultCount": 1146
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Recruitment and retention of staff remain a key priority for all Children’s Disability Network Teams within Integrated Health Area Dublin North County (IHA DNC) and Integrated Health Area Dublin North City & West (IHA DNCW).  As of the end of November 2025, 66% of approved Children’s Disability Network Teams posts in Integrated Health Area Dublin North County and 75% in Integrated Health Area Dublin North City and West are filled.  A range of national and local initiatives are underway to further strengthen staffing levels and increase access to services, including targeted national and international recruitment campaigns, the availability of permanent contracts, flexible working arrangements, enhanced professional development opportunities and additional administrative supports to maximise clinical capacity.  Disability Services and Lead agencies, including the Central Remedial Clinic (CRC), St Michael’s House (SMH) and Avista, across both Integrated Health Areas are fully committed to strengthening the Children’s Disability Network Teams workforce and improving timely access to services for children and families. Staffing levels and waiting times continue to be monitored to help ensure progress achieved is sustained.  I have been advised by the HSE that progress was made during 2025 in reducing the waiting lists for the Balbriggan and Swords Children’s Disability Network Teams, for which the CRC is the lead agency.  In January 2025, 355 children were on the waiting list for the Balbriggan Children’s Disability Network Team. The number of children awaiting access to Balbriggan Children’s Disability Network Team at the end of November 2025 is circa 163, which represents an approximate 54% decrease.  Similarly, the number of children on the waiting list for the Swords Children’s Disability Network Team reduced from 508 in January 2025 to circa 254 at the end of November 2025, representing a 50% decrease.  These improvements reflect ongoing efforts by HSE Integrated Health Area Dublin North County and Integrated Health Area Dublin North City & West Disability Services with the CRC to maximise use of existing resources through the Children’s Disability Network Team model of service delivery, ensure children are on the most appropriate pathway for services  Government will continue to support the HSE in improving access to Children’s Disability Network Teams, as required, for children and their families across all Integrated Health Areas including those serving Balbriggan and Swords. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 53. Deputy Grace Boland asked the Minister for Children, Disability and Equality the progress being made in reducing the number of children on the Balbriggan and Swords CDNT waiting lists; the number of staff recruited to CDNTs in Dublin in 2025; and if she will make a statement on the matter. [72847/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_96",
          "debateSectionId": "dbsect_96",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_96.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_53",
        "questionNumber": 53
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 72. Deputy Grace Boland asked the Minister for Children, Disability and Equality the level of staff vacancies across the AON teams and CDNTs in Dublin, in tabular form; the measures the HSE has undertaken to recruit and retain more staff; and if she will make a statement on the matter. [72848/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_115",
          "debateSectionId": "dbsect_115",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_115.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_72",
        "questionNumber": 72
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  In 2022, my Department approved funding for local authorities to develop climate action plans. Almost €19m has been paid over 2022–2025 to fund climate action teams in local authorities, with annual funding of €5.815m continuing until 2028.  My Department provides €2m in annual funding to four Climate Action Regional Offices which support local authorities to deliver climate actions. It funds the Local Authority Climate Action Training Programme (€500,000 p.a.) to upskill staff and elected members in local authorities. Atlantic Seaboard North CARO is particularly focused on risks to coastal counties and has been leading several projects in that regard.  Each local authority identified a Decarbonising Zone (DZ) as part of its climate action plan. This is a spatial area where the local authority works with the community to test climate measures. We worked with the Northern and Western Regional Assembly to set up a DZ fund (€2.5m ERDF) for local authorities in that region, which is now live. This is open to nine counties, six of which are coastal.  My Department has developed a proposal, through the EU JTF Programme, to invest significant funds into the wider Midlands region to support Local Authorities as they implement their Climate Action Plans.  The proposal, approved by Government, is due for submission to the European Commission this week for its review and adoption.  In addition, my Department has been working with Cork, Dublin and Galway (three coastal cities) in the EU Climate Neutral and Smart Cities Mission, which aims to make 100 European cities climate neutral by 2030.  Actions in the local authority sector form part of a whole of Government collaborative response underpinned by the 2024 National Adaptation Framework, the National Climate Change Risk Assessment, and the new iteration of Sectoral Adaptation Plans approved by Government in November. All of these are informed by data from Met Éireann.  My Department coordinates and supports the implementation process though meetings of the National Adaptation Steering Committee, and I recently approved a new Adaptation Taskforce which, from January, will help to address crosscutting issues. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 133. Deputy Grace Boland asked the Minister for Climate, Energy and the Environment the way in which his Department is supporting local authorities to deliver on their climate action plans, particularly in rural and coastal areas vulnerable to climate impacts; and if he will make a statement on the matter. [72012/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_165",
          "debateSectionId": "dbsect_165",
          "showAs": "Climate Action Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_165.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_133",
        "questionNumber": 133
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Primary responsibility for competition policy rests with the Department of Enterprise, Tourism and Employment. The Competition and Consumer Protection Commission is the statutory body responsible for promoting compliance with, and enforcing, competition and consumer protection law in Ireland.  In addition to the work of the Competition and Consumer Protection Commission, reviews have been carried out to ensure that the Irish banking and financial services sector remains competitive.  My Department has published two such reviews in recent years: the Retail Banking Review in November 2022 and the Report of the Funds Sector 2030 in October 2024.  Competition was one area of focus under the Retail Banking Review. One of the conclusions of the Review in this regard was that, despite the level of concentration in the market following the exits of Ulster Bank and KBC, and subject to continued strong regulatory oversight, sufficient competition will remain in the short to medium term.  The review recommended that the Competition and Consumer Protection Commission and the Central Bank of Ireland build on existing arrangements and establish closer coordination to share perspectives, information and experience on the orderly functioning of markets, consumer protection and competition in the retail banking sector.  Following this, in March 2025 the Competition and Consumer Protection Commission entered into a revised co-operation agreement with the Central Bank of Ireland.  Another related recommendation was incorporated in the Provision of Access to Cash Infrastructure Act 2025. This requires the Central Bank of Ireland to carry out and publish cost-benefit analyses of business standards and regulations it proposes to make in relation to financial service providers. Any cost benefit analysis will have to consider the impact of standards or regulations, on consumers, and on fair competition.  I would also highlight the changes to recent changes to the Credit Union Act to help facilitate the sector to play a greater role in the provision of retail banking products and services. Further the Central Bank has amended credit union lending limits enable the sector lend more for mortgages and to businesses. These measures will help increase competition in the banking sector and improve consumer choice of financial provider.  The 2025 Consumer Sentiment Banking Survey was published by my Department in October. These surveys are helpful to identify trends in consumer behaviour; including product choice, competition and innovation, which in turn feeds into evidence-based policy making.  More recently new entrants have emerged in the context of the Irish banking market, including the establishment of a new Irish branch, Avant Money, by Bankinter and the recent announcement by Monzo Bank to offer retail banking products and services via its Irish based EU headquarters.  The 2025 Consumer Sentiment Banking Survey, also noted that 66% of customers in Ireland now have more than one financial provider. These include a number of digital-only banks that offer a range of financial products and services to consumers in Ireland.  At a European level, the drive to simplify regulation and reduce administrative burdens to increase competitiveness has been incorporated into many different workstreams and these processes can assist in improving the wider competitiveness of the sector. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 185. Deputy Grace Boland asked the Tánaiste and Minister for Finance if he has assessed the impact of reduced competition in the retail banking sector following recent exits; the measures being considered to encourage new entrants or alternative banking models; his views on the way to ensure consumer choice and competitive pricing; and if he will make a statement on the matter. [69883/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "Banking Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_185",
        "questionNumber": 185
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 188, 213 and 245 together.  The Deputy has asked about the taxation regime for Exchange Traded Funds (ETFs). An ETF is a collective investment fund that is traded on a regulated stock exchange. There is no separate taxation regime specifically for ETFs. The domicile of the ETF will generally determine whether the ETF falls within the domestic gross roll-up regime or the offshore funds regime.  In general, for exit taxes applying to investment funds, the investment fund calculates and deducts any exit tax due, including for deemed disposal. However, where units in an investment fund are traded and cleared on a recognised clearing system, investors are required to calculate, return and pay the income tax on the income and gains arising from their investment in the fund on a self-assessed basis, as the fund does not have the information necessary to apply an exit tax. Investors in offshore funds also have to account for tax due through Revenue’s self-assessment system. Therefore, self-assessment applies to most ETF investments.  I am aware that the current system for the taxation of investments is complex and that the requirement for self-assessment for ETFs can contribute to this. I am committed to taking the necessary action to support retail investment in Ireland and recognise the importance of this sector. The reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38% announced in Budget 2026 is an important first step in this regard. This reduction applies to ETFs that fall within these taxation regimes.  However, I am conscious of the need for continued engagement on this issue. Budget 2026 also included a commitment to publish a roadmap for the taxation of retail investment. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner, and existing legislation is being considered as part of the process of developing the roadmap.   This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 213. Deputy Grace Boland asked the Tánaiste and Minister for Finance if his Department has considered reforms to the taxation and regulatory framework to encourage individuals to invest and save through exchange-traded funds (ETFs); if measures such as simplified reporting, reduced or eliminated exit tax, or inclusion of ETFs in State-backed savings schemes are under review; and if he will make a statement on the matter. [69882/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_213",
        "questionNumber": 213
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Budget 2026 includes a record capital allocation of €558 million from carbon tax revenue for the Sustainable Energy Authority of Ireland's (SEAI) residential and community energy upgrade schemes, such as the Warmer Homes Scheme. This is an €89 million increase on the corresponding Budget 2025 allocation (€469 million). This funding is expected to be further supplemented with additional monies from the European Regional Development Fund (ERDF).  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the SEAI on behalf of my Department and is funded through carbon tax receipts and the ERDF.  Last year saw a record spend of almost €230 million under the scheme. This resulted in 7,743 upgrades being provided to low-income households, a 31% increase on 2023. This year’s budget includes an allocation of €280 million for the Warmer Homes Scheme. This represents an 11-fold increase on the 2020 expenditure figure.  For low-income households who do not qualify for the Warmer Homes Scheme, a range of supports are available through SEAI including:  • a special enhanced grant rate for attic and cavity wall insulation is also available to all households;  • schemes supporting a step-by-step approach that allows homeowners to retrofit their home in stages over a number of years;  • a new Home Energy Upgrade Loan Scheme, which will help reduce the financial challenges for many homeowners and will play a crucial role in helping homeowners to invest in energy efficiency; and  • enhanced grant rates for several measures are available to Approved Housing Bodies.  The Government also has other schemes and supports in place which may be of assistance where there is an urgent need such as the Housing Aid for Older People Scheme which is available to assist older people living in poor housing conditions to have necessary repairs or improvements carried out. The scheme is administered by Local Authorities.  My Department, together with the SEAI, continually keep grant schemes under review (this includes terms and conditions, eligibility criteria and rates), taking account of relevant factors such as demand, research, innovation and evolving technology.   ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 271. Deputy Grace Boland asked the Minister for Climate, Energy and the Environment the measures funded by carbon tax revenue to ensure low-income households can access retrofitting supports; and if he will make a statement on the matter. [64563/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_280",
          "debateSectionId": "dbsect_280",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_280.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_271",
        "questionNumber": 271
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My priority as Minister for Defence is to ensure that the operational capability of the Army, Air Corps and Naval Service is maintained and developed. This is to enable the Defence Forces to carry out the roles assigned by Government.  The capital funding of €1.7 billion allocated to Defence in the latest National Development Plan covering the period 2026 to 2030 represents an increase of €600 million on the previous baseline of €1.1 billion. The revised capital allocations will enable targeted progression on key elements of Government commitments within Level of Ambition 2 objectives.  In relation to the maritime domain, the Commission on the Defence Forces recommended a programme of naval vessel replacement under Level of Ambition 2, to ensure a balanced fleet of a modern ships is reached early in the next decade, this has been accepted in principle by Government.  My Department is preparing a long-term Capability Development Programme which will identify and cost, at a high level, the capability requirements for the Defence Forces out to 2040 across all domains of operation.  I expect to receive in the coming weeks a Regeneration Plan for the Naval Service to address the challenges they faced in recent years from the Chief of Staff of the Defence Forces.  On receipt of the Regeneration Plan and the Capability Development Programme 2028 to 2040, which I intend to bring to Government in the first half of 2026. In finalising these plans I intend to ensure that the Government can make evidence informed decisions on what the balanced fleet of modern ships should be, including decisions regarding the Multi-Role Vessel, and the greater use of technologies. These decisions will also be informed by other relevant information, including the new National Maritime Security Strategy that is expected shortly.  Other projects being progressed include the replacement of secondary armament across the fleet, the provision of 4 motor launches for the Naval Service Reserve, provision for the mid-life upgrade of the four P60 class Offshore Patrol Vessels along with enhanced sub-sea awareness and radar capabilities.  Earlier this year Government announced a new major contract with Thales DMS France for the provision of towed sonar capability. The sonar will be used for monitoring and surveillance in the subsea domain, thus significantly enhancing maritime security. Another project has commenced that aims to provide the Air Corps with the capability to detect, localise, identify, and track sub-surface objects. This capability will be used in conjunction with the new towed sonar capability planned for delivery in 2027, and also with existing Air Corps assets.  Radar capabilities for the Naval Service are being progressed as part of a wider programme of work regarding military radar. A project team comprising senior civil and military personnel has been established to progress three elements to the Military Radar Programme, namely Land based Long Range Primary Radar; Ground Based Air Defence (GBAD) systems, to include a Counter-Unmanned Aerial Systems (C-UAS) capability and Maritime (ship-borne) Radar.  In the air domain, capital investment in aircraft continues with the placing of the following contracts in recent years: two new Airbus C-295 in Maritime Patrol Aircraft delivered in 2023; one new Airbus C-295 in a Military Transport configuration delivered in October 2025; one new Dassault Falcon 6X Strategic Reach Aircraft due for delivery today and four Airbus H145M Light Utility Multi-Role Helicopters, with these aircraft in production for phased delivery in 2027 and 2028.  The Air Corps fleet includes eight Pilatus PC-9M aircraft which entered service in 2004. The replacement of these aircraft is being considered as part of the capability development planning process along with the Super-Medium Helicopter Fleet Replacement Project. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 138. Deputy Grace Boland asked the Minister for Defence the procurement plans for new naval and air assets; the timelines envisaged for their delivery; and if she will make a statement on the matter. [72015/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_76",
          "debateSectionId": "dbsect_76",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_138",
        "questionNumber": 138
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Following the establishment of the Joint Cyber Defence Command (JCDC), a Defence Forces Cyber-Defence Strategy 2024 to 2027 was published last year. This Strategy sets out a comprehensive road map to ensure that the Defence Forces achieve operational capability in this new domain.  To give effect to this Strategy, the assignment of 19 Defence Forces specialist posts has been approved for this unit. This includes the assignment of a Brigadier General to the role. My Department is engaging with the Public Appointments Service to recruit 10 civilian cyber specialists who will be embedded in this new Cyber Unit, it is intended that such posts will be filled as soon as possible. To that end, recruitment campaigns are under way to fill these roles with an initial focus on roles related to cyber threat intelligence and cyber resilience.  I am satisfied that from a Defence perspective we are developing a positive trajectory to ensure that the new Cyber Command Unit is well positioned to meet the ambitious targets set out in the Cyber Strategy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 149. Deputy Grace Boland asked the Minister for Defence the investment planned for enhancing Ireland’s cybers-security capabilities within the Defence Forces; and if she will make a statement on the matter. [72014/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_87",
          "debateSectionId": "dbsect_87",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_87.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_149",
        "questionNumber": 149
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 300, 301, 304, 306 and 307 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 300. Deputy Grace Boland asked the Minister for Transport if he is aware that Irish Rail primarily provides service disruption updates via a service (details supplied) rather than through its official website or other social media platforms; the rationale for this approach; and if he will make a statement on the matter. [71940/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_300",
        "questionNumber": 300
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 300, 301, 304, 306 and 307 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 301. Deputy Grace Boland asked the Minister for Transport if he will confirm whether Irish Rail has plans to expand its communication channels for service disruption updates beyond a service (details supplied), including its website and other social media platforms; and if he will make a statement on the matter. [71941/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_301",
        "questionNumber": 301
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators. in this case Irish Rail.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 302. Deputy Grace Boland asked the Minister for Transport the measures being taken to ensure that passengers who do not use a service (details supplied) have equal access to timely information on service disruptions; and if he will make a statement on the matter. [71942/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_213",
          "debateSectionId": "dbsect_213",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_302",
        "questionNumber": 302
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators. in this case Irish Rail.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 303. Deputy Grace Boland asked the Minister for Transport if he will provide details of guidelines or requirements issued by the National Transport Authority to Irish Rail regarding the provision of service disruption information across multiple platforms; and if he will make a statement on the matter. [71943/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_214",
          "debateSectionId": "dbsect_214",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_214.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_303",
        "questionNumber": 303
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 300, 301, 304, 306 and 307 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 304. Deputy Grace Boland asked the Minister for Transport if he is aware of the significant communication failures experienced by passengers at Pearse Street railway station on 9 December 2025 during high wind conditions, including the inability to clearly hear public address announcements; and if he will make a statement on the matter. [71994/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_304",
        "questionNumber": 304
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 305. Deputy Grace Boland asked the Minister for Transport if he has requested a report from Iarnród Éireann on the persistent failure of real time passenger information display boards at Pearse Street, Tara Street, Connolly Station and the Northern commuter railway stations; and if he will make a statement on the matter. [71995/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_215",
          "debateSectionId": "dbsect_215",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_215.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_305",
        "questionNumber": 305
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 300, 301, 304, 306 and 307 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 306. Deputy Grace Boland asked the Minister for Transport the procedures in place to ensure that front line staff at Pearse Street railway station are provided with accurate and timely service information during severe weather events, in view of reports that on 9 December 2025 staff were unable to advise passengers when trains would arrive; and if he will make a statement on the matter. [71996/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_306",
        "questionNumber": 306
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 300, 301, 304, 306 and 307 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 307. Deputy Grace Boland asked the Minister for Transport the actions which will be taken to improve the resilience and clarity of public address systems at Pearse Street and other Dublin railway stations, following widespread reports that on 9 December 2025 announcements were inaudible to passengers; and if he will make a statement on the matter. [71997/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_307",
        "questionNumber": 307
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The issue specified in the query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 308. Deputy Grace Boland asked the Minister for Transport if he is aware that Leap card validation machines were not operational at Skerries railway station on 9 December 2025, resulting in commuters being unable to tag on or tag off; and if he will make a statement on the matter. [71998/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_216",
          "debateSectionId": "dbsect_216",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_216.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_308",
        "questionNumber": 308
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. However, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has responsibility for the regulation of fares charged to passengers in respect of public transport services provided under public service obligation (PSO) contracts.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 309. Deputy Grace Boland asked the Minister for Transport the safeguards which are in place to ensure that passengers are not financially penalised through incorrect or maximum fares, where Leap card machines are unavailable due to equipment failure; and if he will make a statement on the matter. [71999/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_217",
          "debateSectionId": "dbsect_217",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_309",
        "questionNumber": 309
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 369, 370 and 371 together.  I am advised by Revenue that the changing demands of taxpayers and the need to provide an efficient and cost-effective service has resulted in the overall mix and nature of service channels evolving over time.  For taxpayers who, for a variety of reasons, may not have access to the online services, Revenue offers extensive support across its various telephone helplines, a full service for queries being received through the postal system and an appointments service which allows taxpayers to schedule either a virtual or in-person appointment at a time that suits them. Revenue is committed to providing a quality customer service on alternative channels to help those taxpayers comply with their tax obligations and claim their entitlements.  Acknowledging the challenges that some taxpayers aged 65 and over may face in engaging with our online services, Revenue host an “ Age Week ” outreach event in their public offices annually. The most recent event was held between 31 March and 9 April 2025 and the intention is run similar sessions in 2026. The aim of the event is to enhance the support available to assist these individuals in meeting their tax obligations, promote the ease of use of our online services, and to reduce the compliance burden for these taxpayers.  For details on these information sessions please see the Revenue website at the link below:  [ www.revenue.ie/en/news/articles/revenue-over65s-event.aspx ]  In-person appointments are currently available at its offices in Dublin (O’Connell Street), Cork (Revenue House), Limerick (Sarsfield House) and Galway (Geata na Cathrach), between 9.30am and 1.30pm, Monday to Friday. If a customer wishes to schedule an appointment outside of the above opening hours, or avoid waiting times, they can do so by calling the Appointment Helpline on 01 738 3660.  Taxpayers without access to an internet connection or a smart device can arrange for a “ RevConnect ” in-office virtual appointment. RevConnect is a service that allows taxpayers to attend a designated Revenue office and, using Revenue equipment, speak to a Revenue official regarding their query. This service is presently available from the Revenue offices in Castlebar, Dundalk, Letterkenny, Tralee or Waterford. It is anticipated this service will be available in other Revenue offices shortly.  To further assist customers who cannot use Revenue’s online services, an Access Supports Marker is available to customers on an “opt-in” basis. This marker will be applied where customers advise that they have a need for additional supports and assistance in managing their tax affairs and allows Revenue’s customer service staff and caseworkers to quickly and easily identify customers who cannot use Revenue’s online services, ensuring that they are not diverted to online channels, and that correspondence issues in hard-copy, paper format.  Revenue recently launched an Age Friendly Service in conjunction with local authorities which is designed to assist customers who do not use its online services. Separately, for persons with a disability or requiring additional assistance, Revenue has appointed Access Officers across its main Divisions. Access Officers are a point of contact with responsibility for providing or arranging for assistance and guidance to customers requiring additional assistance. Access Officers also assist customers by arranging services such as appointments; Irish Sign Language translations; braille documentation and other services provided by Revenue. Further details on Revenue’s Access Officer service is available at Revenue's website at the link below: [ www.revenue.ie/en/contact-us/head-office-functions/access-officer.aspx ]  Specifically regarding LPT revaluation, Revenue acknowledges that such a project and its associated compliance requirements caused challenges for older customers who do not routinely interact with Revenue and its systems. In the lead-up to revaluation during October-November this year, over 1.5 million notices were issued to property owners, including approx. 179,000 property owners who had not previously availed of online filing or payment options. Revenue provided an enhanced telephone service during this period to assist older customers who were not able to file online, and Revenue’s call centre agents helped many such customers with the return filing and the setting up of the property owners preferred payment method.  Revenue have further advised me that they provide a form ordering service for customers to order paper PAYE Income Tax Returns. The form ordering service is accessible for customers through a 24-hour automated number on 01 738 3675 or by email custform@revenue.ie. Further details on this service are available on Revenue’s website at the link below: www.revenue.ie/en/contact-us/forms/ordering-forms.aspx  Revenue operates a dedicated Oireachtas Helpline for use by members of the Oireachtas and Irish Members of the European Parliament. This provides an exclusive channel to contact Revenue on behalf of constituents, and almost all queries are resolved on the same day.  Revenue is aware that some customers, including many older people, may need a more traditional service. In addition to online services, Revenue provides a range of alternative, non-digital channels:  Revenue confirmed that since 2022 it has received two official complaints from elderly customers concerning its service offerings. Both complaints were managed within Revenue’s official complaints CS4 process. Revenue further confirms that it received feedback by way of written correspondence and by phone from a relatively small number of older customers indicating that they find using digital technology challenging. Revenue provides assistance to these customers on an individual basis and assist with alternative solutions resolving any difficulties that these customers may have in complying with their obligations.  I am advised that Revenue continuously reviews service performance and customer feedback, including call handling statistics, appointment availability and engagement with customers and representative bodies. I am advised that where issues are identified, Revenue adjusts resourcing and processes to improve access, including at peak service periods. Revenue will continue to monitor demand for non-digital services among older customers and enhance supports as necessary.  Revenue is committed to ensuring that its website and online services are accessible and user-friendly for all customers, including older people and those with limited digital skills or disabilities. Revenue consults representative groups, such as the National Disability Authority (NDA), and has appointed trained Access Officers who provide or arrange assistance for persons with disabilities and act as contact points for people wishing to access Revenue services.  Revenue’s online services are subject to the statutory monitoring framework operated by the NDA under the EU Web Accessibility Directive and S.I. No. 358/2020. Revenue provides accessibility statements, in the prescribed EU format, for each of its key online services (revenue.ie, Local Property Tax, myAccount and ROS), describing conformance, known issues, and planned improvements.  In practical terms, Revenue’s approach includes:  • Designing and testing services to meet applicable accessibility standards and the requirements of the EU Directive.  • Using plain language and step-by-step guidance to support customers with limited digital skills.  • Ensuring compatibility with assistive technologies and inclusive design practices (for example, keyboard navigation, alternative text and captions, readable layouts and sufficient contrast).  • Providing assisted digital support through telephone and appointment channels for customers who need help to complete online transactions.  • Training staff to support customers with accessibility needs and maintaining clear routes to raise accessibility issues with Revenue’s Access Officers.  Revenue continually monitors feedback from customers and the NDA’s findings and makes iterative improvements where needed. This ensures that online services remain accessible and user-friendly while alternative service channels remain available for those who cannot use digital services. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 369. Deputy Grace Boland asked the Tánaiste and Minister for Finance if his attention has been drawn to the difficulties being experienced by older people in accessing and navigating the Revenue online services; the nature and extent of any complaints or feedback received by his Department or by Revenue on this issue in the past two years; and if he will make a statement on the matter. [71918/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_269",
          "debateSectionId": "dbsect_269",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_269.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_369",
        "questionNumber": 369
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 369, 370 and 371 together.  I am advised by Revenue that the changing demands of taxpayers and the need to provide an efficient and cost-effective service has resulted in the overall mix and nature of service channels evolving over time.  For taxpayers who, for a variety of reasons, may not have access to the online services, Revenue offers extensive support across its various telephone helplines, a full service for queries being received through the postal system and an appointments service which allows taxpayers to schedule either a virtual or in-person appointment at a time that suits them. Revenue is committed to providing a quality customer service on alternative channels to help those taxpayers comply with their tax obligations and claim their entitlements.  Acknowledging the challenges that some taxpayers aged 65 and over may face in engaging with our online services, Revenue host an “ Age Week ” outreach event in their public offices annually. The most recent event was held between 31 March and 9 April 2025 and the intention is run similar sessions in 2026. The aim of the event is to enhance the support available to assist these individuals in meeting their tax obligations, promote the ease of use of our online services, and to reduce the compliance burden for these taxpayers.  For details on these information sessions please see the Revenue website at the link below:  [ www.revenue.ie/en/news/articles/revenue-over65s-event.aspx ]  In-person appointments are currently available at its offices in Dublin (O’Connell Street), Cork (Revenue House), Limerick (Sarsfield House) and Galway (Geata na Cathrach), between 9.30am and 1.30pm, Monday to Friday. If a customer wishes to schedule an appointment outside of the above opening hours, or avoid waiting times, they can do so by calling the Appointment Helpline on 01 738 3660.  Taxpayers without access to an internet connection or a smart device can arrange for a “ RevConnect ” in-office virtual appointment. RevConnect is a service that allows taxpayers to attend a designated Revenue office and, using Revenue equipment, speak to a Revenue official regarding their query. This service is presently available from the Revenue offices in Castlebar, Dundalk, Letterkenny, Tralee or Waterford. It is anticipated this service will be available in other Revenue offices shortly.  To further assist customers who cannot use Revenue’s online services, an Access Supports Marker is available to customers on an “opt-in” basis. This marker will be applied where customers advise that they have a need for additional supports and assistance in managing their tax affairs and allows Revenue’s customer service staff and caseworkers to quickly and easily identify customers who cannot use Revenue’s online services, ensuring that they are not diverted to online channels, and that correspondence issues in hard-copy, paper format.  Revenue recently launched an Age Friendly Service in conjunction with local authorities which is designed to assist customers who do not use its online services. Separately, for persons with a disability or requiring additional assistance, Revenue has appointed Access Officers across its main Divisions. Access Officers are a point of contact with responsibility for providing or arranging for assistance and guidance to customers requiring additional assistance. Access Officers also assist customers by arranging services such as appointments; Irish Sign Language translations; braille documentation and other services provided by Revenue. Further details on Revenue’s Access Officer service is available at Revenue's website at the link below: [ www.revenue.ie/en/contact-us/head-office-functions/access-officer.aspx ]  Specifically regarding LPT revaluation, Revenue acknowledges that such a project and its associated compliance requirements caused challenges for older customers who do not routinely interact with Revenue and its systems. In the lead-up to revaluation during October-November this year, over 1.5 million notices were issued to property owners, including approx. 179,000 property owners who had not previously availed of online filing or payment options. Revenue provided an enhanced telephone service during this period to assist older customers who were not able to file online, and Revenue’s call centre agents helped many such customers with the return filing and the setting up of the property owners preferred payment method.  Revenue have further advised me that they provide a form ordering service for customers to order paper PAYE Income Tax Returns. The form ordering service is accessible for customers through a 24-hour automated number on 01 738 3675 or by email custform@revenue.ie. Further details on this service are available on Revenue’s website at the link below: www.revenue.ie/en/contact-us/forms/ordering-forms.aspx  Revenue operates a dedicated Oireachtas Helpline for use by members of the Oireachtas and Irish Members of the European Parliament. This provides an exclusive channel to contact Revenue on behalf of constituents, and almost all queries are resolved on the same day.  Revenue is aware that some customers, including many older people, may need a more traditional service. In addition to online services, Revenue provides a range of alternative, non-digital channels:  Revenue confirmed that since 2022 it has received two official complaints from elderly customers concerning its service offerings. Both complaints were managed within Revenue’s official complaints CS4 process. Revenue further confirms that it received feedback by way of written correspondence and by phone from a relatively small number of older customers indicating that they find using digital technology challenging. Revenue provides assistance to these customers on an individual basis and assist with alternative solutions resolving any difficulties that these customers may have in complying with their obligations.  I am advised that Revenue continuously reviews service performance and customer feedback, including call handling statistics, appointment availability and engagement with customers and representative bodies. I am advised that where issues are identified, Revenue adjusts resourcing and processes to improve access, including at peak service periods. Revenue will continue to monitor demand for non-digital services among older customers and enhance supports as necessary.  Revenue is committed to ensuring that its website and online services are accessible and user-friendly for all customers, including older people and those with limited digital skills or disabilities. Revenue consults representative groups, such as the National Disability Authority (NDA), and has appointed trained Access Officers who provide or arrange assistance for persons with disabilities and act as contact points for people wishing to access Revenue services.  Revenue’s online services are subject to the statutory monitoring framework operated by the NDA under the EU Web Accessibility Directive and S.I. No. 358/2020. Revenue provides accessibility statements, in the prescribed EU format, for each of its key online services (revenue.ie, Local Property Tax, myAccount and ROS), describing conformance, known issues, and planned improvements.  In practical terms, Revenue’s approach includes:  • Designing and testing services to meet applicable accessibility standards and the requirements of the EU Directive.  • Using plain language and step-by-step guidance to support customers with limited digital skills.  • Ensuring compatibility with assistive technologies and inclusive design practices (for example, keyboard navigation, alternative text and captions, readable layouts and sufficient contrast).  • Providing assisted digital support through telephone and appointment channels for customers who need help to complete online transactions.  • Training staff to support customers with accessibility needs and maintaining clear routes to raise accessibility issues with Revenue’s Access Officers.  Revenue continually monitors feedback from customers and the NDA’s findings and makes iterative improvements where needed. This ensures that online services remain accessible and user-friendly while alternative service channels remain available for those who cannot use digital services. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 370. Deputy Grace Boland asked the Tánaiste and Minister for Finance the alternative non digital channels currently available for older people who are unable to access or use the Revenue online systems; if these supports are considered adequate; and if he will make a statement on the matter. [71919/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_269",
          "debateSectionId": "dbsect_269",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_269.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_370",
        "questionNumber": 370
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 369, 370 and 371 together.  I am advised by Revenue that the changing demands of taxpayers and the need to provide an efficient and cost-effective service has resulted in the overall mix and nature of service channels evolving over time.  For taxpayers who, for a variety of reasons, may not have access to the online services, Revenue offers extensive support across its various telephone helplines, a full service for queries being received through the postal system and an appointments service which allows taxpayers to schedule either a virtual or in-person appointment at a time that suits them. Revenue is committed to providing a quality customer service on alternative channels to help those taxpayers comply with their tax obligations and claim their entitlements.  Acknowledging the challenges that some taxpayers aged 65 and over may face in engaging with our online services, Revenue host an “ Age Week ” outreach event in their public offices annually. The most recent event was held between 31 March and 9 April 2025 and the intention is run similar sessions in 2026. The aim of the event is to enhance the support available to assist these individuals in meeting their tax obligations, promote the ease of use of our online services, and to reduce the compliance burden for these taxpayers.  For details on these information sessions please see the Revenue website at the link below:  [ www.revenue.ie/en/news/articles/revenue-over65s-event.aspx ]  In-person appointments are currently available at its offices in Dublin (O’Connell Street), Cork (Revenue House), Limerick (Sarsfield House) and Galway (Geata na Cathrach), between 9.30am and 1.30pm, Monday to Friday. If a customer wishes to schedule an appointment outside of the above opening hours, or avoid waiting times, they can do so by calling the Appointment Helpline on 01 738 3660.  Taxpayers without access to an internet connection or a smart device can arrange for a “ RevConnect ” in-office virtual appointment. RevConnect is a service that allows taxpayers to attend a designated Revenue office and, using Revenue equipment, speak to a Revenue official regarding their query. This service is presently available from the Revenue offices in Castlebar, Dundalk, Letterkenny, Tralee or Waterford. It is anticipated this service will be available in other Revenue offices shortly.  To further assist customers who cannot use Revenue’s online services, an Access Supports Marker is available to customers on an “opt-in” basis. This marker will be applied where customers advise that they have a need for additional supports and assistance in managing their tax affairs and allows Revenue’s customer service staff and caseworkers to quickly and easily identify customers who cannot use Revenue’s online services, ensuring that they are not diverted to online channels, and that correspondence issues in hard-copy, paper format.  Revenue recently launched an Age Friendly Service in conjunction with local authorities which is designed to assist customers who do not use its online services. Separately, for persons with a disability or requiring additional assistance, Revenue has appointed Access Officers across its main Divisions. Access Officers are a point of contact with responsibility for providing or arranging for assistance and guidance to customers requiring additional assistance. Access Officers also assist customers by arranging services such as appointments; Irish Sign Language translations; braille documentation and other services provided by Revenue. Further details on Revenue’s Access Officer service is available at Revenue's website at the link below: [ www.revenue.ie/en/contact-us/head-office-functions/access-officer.aspx ]  Specifically regarding LPT revaluation, Revenue acknowledges that such a project and its associated compliance requirements caused challenges for older customers who do not routinely interact with Revenue and its systems. In the lead-up to revaluation during October-November this year, over 1.5 million notices were issued to property owners, including approx. 179,000 property owners who had not previously availed of online filing or payment options. Revenue provided an enhanced telephone service during this period to assist older customers who were not able to file online, and Revenue’s call centre agents helped many such customers with the return filing and the setting up of the property owners preferred payment method.  Revenue have further advised me that they provide a form ordering service for customers to order paper PAYE Income Tax Returns. The form ordering service is accessible for customers through a 24-hour automated number on 01 738 3675 or by email custform@revenue.ie. Further details on this service are available on Revenue’s website at the link below: www.revenue.ie/en/contact-us/forms/ordering-forms.aspx  Revenue operates a dedicated Oireachtas Helpline for use by members of the Oireachtas and Irish Members of the European Parliament. This provides an exclusive channel to contact Revenue on behalf of constituents, and almost all queries are resolved on the same day.  Revenue is aware that some customers, including many older people, may need a more traditional service. In addition to online services, Revenue provides a range of alternative, non-digital channels:  Revenue confirmed that since 2022 it has received two official complaints from elderly customers concerning its service offerings. Both complaints were managed within Revenue’s official complaints CS4 process. Revenue further confirms that it received feedback by way of written correspondence and by phone from a relatively small number of older customers indicating that they find using digital technology challenging. Revenue provides assistance to these customers on an individual basis and assist with alternative solutions resolving any difficulties that these customers may have in complying with their obligations.  I am advised that Revenue continuously reviews service performance and customer feedback, including call handling statistics, appointment availability and engagement with customers and representative bodies. I am advised that where issues are identified, Revenue adjusts resourcing and processes to improve access, including at peak service periods. Revenue will continue to monitor demand for non-digital services among older customers and enhance supports as necessary.  Revenue is committed to ensuring that its website and online services are accessible and user-friendly for all customers, including older people and those with limited digital skills or disabilities. Revenue consults representative groups, such as the National Disability Authority (NDA), and has appointed trained Access Officers who provide or arrange assistance for persons with disabilities and act as contact points for people wishing to access Revenue services.  Revenue’s online services are subject to the statutory monitoring framework operated by the NDA under the EU Web Accessibility Directive and S.I. No. 358/2020. Revenue provides accessibility statements, in the prescribed EU format, for each of its key online services (revenue.ie, Local Property Tax, myAccount and ROS), describing conformance, known issues, and planned improvements.  In practical terms, Revenue’s approach includes:  • Designing and testing services to meet applicable accessibility standards and the requirements of the EU Directive.  • Using plain language and step-by-step guidance to support customers with limited digital skills.  • Ensuring compatibility with assistive technologies and inclusive design practices (for example, keyboard navigation, alternative text and captions, readable layouts and sufficient contrast).  • Providing assisted digital support through telephone and appointment channels for customers who need help to complete online transactions.  • Training staff to support customers with accessibility needs and maintaining clear routes to raise accessibility issues with Revenue’s Access Officers.  Revenue continually monitors feedback from customers and the NDA’s findings and makes iterative improvements where needed. This ensures that online services remain accessible and user-friendly while alternative service channels remain available for those who cannot use digital services. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 371. Deputy Grace Boland asked the Tánaiste and Minister for Finance the steps Revenue is taking to ensure that its website and online services are fully accessible and user friendly for older people, including those with limited digital skills or disabilities; and if he will make a statement on the matter. [71920/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_269",
          "debateSectionId": "dbsect_269",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_269.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_371",
        "questionNumber": 371
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department’s mission is to drive the delivery of better public services, living standards and infrastructure for the people of Ireland. The Department's overall priorities are set out in its Statement of Strategy 2025-2028. The strategy outlines how my Department will achieve its goals in the context of the Programme for Government and overarching policy frameworks. I would highlight a number of key initiatives in the context of this Question.  From an expenditure policy perspective, my Department is playing a central role in shaping Ireland’s fiscal and budgetary landscape through the publication of the Summer Economic Statement, the Medium-Term Expenditure Framework and the successful delivery of Budget 2026. Budget 2026, in particular, placed a renewed emphasis on ensuring value for money. A focus on reform was central in my Ministerial bilateral engagements as part of the Estimates process and in settling allocations. Chapter 3 of the Expenditure Report sets out a series of reform proposals to be implemented by Departments in 2026. Further detail, outlining reforms sector-by-sector, is presented in Part II of the Expenditure Report.  The forthcoming Revised Estimates Volume (REV), in addition to providing detailed spending data, will outline performance budgeting information linked to expenditure. This describes how public resources will be utilised to provide public services and the impact of public policies on peoples’ lives. This data is essential to understanding how Departments can improve programmes to make them more efficient and cost effective. It also supports with work of the Irish Government Economic and Evaluation Service (IGEES) to provide evidence and insights that can shape the efficiency and effective delivery of public services. I have also instituted a review of Public Financial Procedures, which will enhance accountability and value for money across all areas of Government.  Regarding infrastructure, my Department has strengthened its mandate by establishing a dedicated Division and Taskforce. We have published a revised National Development Plan, allocating €275.4 billion in capital investment to 2035; published a Report on Stakeholder Engagement and Emerging Themes on Infrastructure, highlighting the most impactful barriers to infrastructure delivery; and published the Accelerating Infrastructure Report and Action Plan, designed to address the key barriers to infrastructure development and drive the efficient delivery of infrastructure across Ireland. The evidence presented in the Report shows that the costs of inaction are significant and implementation of these reforms, as planned, has the potential to save the State many millions of euros via, for example, reduced project delivery timelines.  My Department is leading on the implementation of the Better Public Services Transformation Strategy. This programme is focused on providing inclusive, high quality and integrated service provision that meets the needs and improves the lives of the people of Ireland. As part of the overall strategy, my Department has recently published a new Digital Public Services Plan 2030. The plan sets a pathway to deliver two key targets: (i) 100% of key public services available online; and (ii) 90% of key public services consumed online. The plan will result in the digitalisation of 189 applicable key public services across 17 Life Events (e.g. Birth of a Child, Becoming Employed/Unemployed). Digital services have the potential to transform delivery, generate efficiencies and reduce the cost of administration.  The Government Data Centre is a digital infrastructure initiative under the Public Service ICT Strategy to provide required critical state infrastructure. The Data Centre will deliver high-quality energy efficient Data Centre facilities for Public Service Bodies. It will be more efficient than existing public service server rooms and data centre facilities, and will address operational, financial and strategic risks for the State.  Another key element of the Better Public Service 2030 transformation strategy is the vision for a public sector workforce of the future that is skilled, motivated and reflective of the people we serve. This strategy provides a framework for all public bodies to identify and implement workforce and organisations priorities and reforms that will enable the Public Service to develop and nurture the skills necessary to implement the transformation agenda and broader government priorities.  My Department is also in the process of developing a first ever National Public Procurement Strategy to build upon the national public procurement policy framework (2019). The strategy focuses on value for money, sustainability, innovation, supporting Ireland’s enterprise base, procurement as an investment lever and expenditure management tool, and simplification. In relation to efficiencies associated central procurement activity specifically, in 2024, €1.9 billion flowed through all OGP central solutions with an estimated €65m to €70m in cost avoidance and savings.  Finally, regarding shared services, the National Shared Services Office (NSSO) is delivering efficiencies and enhancements across services via major technological reforms such as Peoplesoft upgrade, centralising pensions and overpayments teams to streamline processing and implementing Robotic Process Automation (RPA) for 47 processes, handling 4.1 million transactions in 2025. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 35. Deputy Grace Boland asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the efficiency and cost-saving measures currently being implemented across the public service as part of the reform agenda under his remit; whether these measures include workforce planning, digital transformation, shared services, and procurement reforms; the projected savings associated with such initiatives; and if he will make a statement on the matter. [69892/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "showAs": "Public Sector Reform Review",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_35",
        "questionNumber": 35
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  There will be robust oversight of the achievement of these targets. Each sub-action within the Plan has been assigned to a specific body or number of bodies with a specific timeline attached to every sub-action. These named bodies will hold primary responsibility for the implementation of the action in question.  Regular reporting will underpin accountability, with Departments and Agencies providing updates to my Department on the progression of actions. The Accelerating Infrastructure Taskforce will meet monthly to review progress and highlight any delays to implementation of actions. Regular progress updates will also be provided to the Senior Officials Group on Infrastructure and to the Cabinet Committee on Infrastructure.  I note that both the Office of the Comptroller and Auditor General and the Public Accounts Committee are independent of Government in the performance of their duties and in the determination of what they examine. Similarly, as an independent body, the Irish Fiscal Advisory Council may report on any aspect of Government financial practices it so chooses. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 87. Deputy Grace Boland asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation whether the Accelerating Infrastructure Action Plan has been integrated into his broader public service reform framework, with mechanisms for cross-departmental coordination, regular Comptroller and Auditor General reporting, PAC oversight, and fiscal monitoring by the Irish Fiscal Advisory Council; his plans on strengthening transparency and long-term accountability; and if he will make a statement on the matter. [69893/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_121",
          "debateSectionId": "dbsect_121",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_121.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_87",
        "questionNumber": 87
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. This includes circa €1.66 billion invested in schools across County Dublin.  The project brief for Rush National School includes the construction of a new 2-storey, 32 classroom school along with provision for children with special educational needs. The project has experienced significant challenges to date, including a previous appeal to An Bord Pleanála and changes to building regulations that impacted on project timelines. Extended project timelines meant that a revised planning application was required and this has been lodged with the local authority. A new tender process will also be needed in respect of the new plans.  As part of the revised planning application the Design Team included new decarbonisation measures in accordance with Technical Design Guidance. The updated tender documents will also include updated Mechanical and Electrical requirements in accordance with decarbonisation measures, and compliance with any statutory requirements. The inclusion of these new climate action measures will bring significant benefits to the school.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 111. Deputy Grace Boland asked the Minister for Education and Youth for an update on a new school building (details supplied); and if she will make a statement on the matter. [70742/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_133",
          "debateSectionId": "dbsect_133",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_111",
        "questionNumber": 111
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling students with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of students with special educational needs are supported to attend mainstream classes with their peers. Where students with more complex needs require additional supports, special class and special school places are provided. This is in keeping with policy on an inclusive education, which provides that students will be supported to receive an education in the most inclusive setting possible.  At present, there are four special schools, and fourteen special classes attached to mainstream schools to support students with a specific learning disability such as severe dyslexia.  In working to develop a more inclusive education system, we want to ensure students are supported as far as possible to attend their local mainstream schools. This means that children and young people can be educated with their peers and are not required to travel long distances to attend special schools or classes. To achieve this objective, 15,000 special education teachers have been allocated to schools. In practical terms this means schools get a substantial additional teaching allocation to support students with special education needs in mainstream classes.  These additional resources are intended to support students with the greatest level of need, including those with a specific learning disability such as dyslexia, dyscalculia or dysgraphia.  To support teachers in mainstream schools to meet the needs of all students my department funds 338 places each year in post-graduate special education needs programmes. In addition, the NCSE offers dedicated professional learning opportunities for teachers supporting students with additional needs. The National Educational Psychological Service (NEPS) also provides professional learning opportunities that are available to all primary and post-primary school teachers on supporting children and young people with special educational needs.  Funding is also made available to schools for the purchase of specialised equipment to assist students. Schools can apply to the NCSE, through their local special educational needs organiser (SENO) for such support. The need for any additional provision or resources for schools to support students with dyslexia is subject to ongoing review by the NCSE.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 144. Deputy Grace Boland asked the Minister for Education and Youth the resources which are being provided to schools to support children with mild, moderate and severe diagnosis of dyslexia; and if she will make a statement on the matter. [70743/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_144",
        "questionNumber": 144
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department is currently progressing 12 projects under the FET College Major Capital programme to provide fit-for-purpose, state of the art facilities to meet the needs of learners and staff, and address existing deficits in current FET infrastructure.  In addition, under the Strategic Infrastructure Upgrade Programme 19 projects were approved to provide for high-quality teaching and learning environments, aligned with the principles of the FET College of the Future.  In 2024 expenditure of €27 million supported the provision of additional apprenticeship capacity, by way of essential building works, and significant investment in additional equipment needs, following a revalidation process carried out by QQI on a number of craft apprenticeships. Capital investment in apprenticeships in excess of €11 million has been expended in 2025. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 229. Deputy Grace Boland asked the Minister for Further and Higher Education, Research, Innovation and Science the steps being taken to accelerate delivery of new FET infrastructure given the growing demand for apprenticeships and upskilling opportunities; and if he will make a statement on the matter. [67802/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_241",
          "debateSectionId": "dbsect_241",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_241.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_229",
        "questionNumber": 229
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  Dublin and Dún Laoghaire ETB are currently being supported by SOLAS in developing their Preliminary Business Case (PBC) for a state-of-the-art further education campus in Swords under my department’s FET College Major Capital Programme. As part of the PBC stage, Dublin and Dún Laoghaire ETB will need to further develop their proposal and demonstrate how it aligns with relevant regional and national policies and strategies. Once complete, the ETB can submit their proposal to SOLAS for evaluation. The development of a robust PBC is fundamental to the requirements of the Infrastructure Guidelines.  The site preference for this new college is Swords due to its population base and future growth projections. Dublin and Dún Laoghaire ETB have identified a preferred site option and I have approved for the relevant legal and site due diligence requirements to be progressed, this work remains ongoing. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 260. Deputy Grace Boland asked the Minister for Further and Higher Education, Research, Innovation and Science the way in which his Development of the Swords FET College fit into his Department’s wider strategy for the FET College of the Future initiative; and if he will make a statement on the matter. [67801/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_273",
          "debateSectionId": "dbsect_273",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_260",
        "questionNumber": 260
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure, including the provision and upgrade of the public bus fleet, and the provision of bus depots.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 121. Deputy Grace Boland asked the Minister for Transport when the necessary charging infrastructure will be in place to support the full electrification of the Dublin Bus fleet; the timeline for completion of charging depots in the Dublin Metropolitan Area north; and if he will make a statement on the matter. [70663/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_98",
          "debateSectionId": "dbsect_98",
          "showAs": "Electric Vehicles",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_121",
        "questionNumber": 121
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure, including the provision and upgrade of the public bus fleet, and the provision of bus depots.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 122. Deputy Grace Boland asked the Minister for Transport if he will provide a breakdown of progress on charging infrastructure at individual Dublin Bus depots, including plans for depot upgrades serving the Fingal area, such as those linked to the 33 and 33X services; and if he will make a statement on the matter. [70664/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_99",
          "debateSectionId": "dbsect_99",
          "showAs": "Electric Vehicles",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_122",
        "questionNumber": 122
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Iarnród Éireann.  In light of their responsibilities in this area, I have forwarded the Deputy's question to the NTA and Iarnród Éireann for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 123. Deputy Grace Boland asked the Minister for Transport the number of reported faults or failures in real-time passenger information systems at rail stations in north County Dublin over the past 12 months; the stations with the highest number of reported issues; the measures being taken to improve the reliability and accuracy of these systems; and if he will make a statement on the matter. [70665/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_100",
          "debateSectionId": "dbsect_100",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_100.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_123",
        "questionNumber": 123
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 124. Deputy Grace Boland asked the Minister for Transport if Irish Rail has undertaken a review of the effectiveness of station audio systems, including speaker clarity, volume levels and audibility at Pearse Station and other commuter stations; the findings of any such review; if there are plans in place to upgrade or improve these systems; and if he will make a statement on the matter. [70666/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_101",
          "debateSectionId": "dbsect_101",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_101.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_124",
        "questionNumber": 124
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 125. Deputy Grace Boland asked the Minister for Transport if a service audit has been conducted by Irish Rail or the National Transport Authority in the past 12 months in relation to punctuality, cleanliness, accessibility and passenger experience on the northern commuter line; if so, to provide the findings of that audit; and if he will request that such an audit be commissioned and made available; and if he will make a statement on the matter. [70667/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_102",
          "debateSectionId": "dbsect_102",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_125",
        "questionNumber": 125
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann, Dublin Bus, and the National Transport Authority. I have, therefore, referred the Deputy's question to the agencies for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 126. Deputy Grace Boland asked the Minister for Transport if Irish Rail, the National Transport Authority or Dublin Bus conduct internal staff surveys to ascertain the proportion of their workforce who use public transport for commuting; if such data is broken down by staff grades or roles; if he will provide the most recent results of any such survey; if not, to request that such a survey be commissioned and made available; and if he will make a statement on the matter. [70673/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_126",
        "questionNumber": 126
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport (Deputy Seán Canney)  There are currently 43 vessels trading under the Irish Flag. 40 vessels on the Irish Flag are part of the Arklow Shipping Ltd fleet as follows:       ARKLOW ABBEY      ARKLOW ACCORD      ARKLOW ACE      ARKLOW ARCHER      ARKLOW ARROW      ARKLOW ARTIST      ARKLOW CAPE      ARKLOW CASTLE      ARKLOW CLAN      ARKLOW CLIFF      ARKLOW CLIPPER      ARKLOW CLOUD      ARKLOW COAST      ARKLOW COVE      ARKLOW CREST      ARKLOW FALCON      ARKLOW FERN      ARKLOW FIELD      ARKLOW FOREST      ARKLOW MANOR      ARKLOW MARSH      ARKLOW MEADOW      ARKLOW MILL      ARKLOW MOOR      ARKLOW MUSE      ARKLOW RAIDER      ARKLOW RACER      ARKLOW RALLY      ARKLOW RAMBLER      ARKLOW RANGER      ARKLOW RAVEN      ARKLOW RESOLVE      ARKLOW ROSE      ARKLOW ROVER      ARKLOW SPIRIT      ARKLOW SPRAY      ARKLOW WAVE      ARKLOW WILLOW      ARKLOW WIND      ARKLOW WOOD     Additionally, the Marine Institute operates two vessels, Celtic Explorer and Tom Crean, whilst the Granuaile is operated by Irish Lights. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 127. Deputy Grace Boland asked the Minister for Transport the current number of international trading ships on the Irish Ship Register; the names of each of these ships; and if he will make a statement on the matter. [70674/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_104",
          "debateSectionId": "dbsect_104",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_127",
        "questionNumber": 127
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours.  The DART+ fleet project provides a ten-year procurement framework for electric and battery-electric train fleet. Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027, increasing capacity on the line.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 128. Deputy Grace Boland asked the Minister for Transport the number of additional passenger places which will be provided, on a daily basis, on the northern commuter line following the deployment of the new battery electric train sets in 2027; and if he will make a statement on the matter. [70675/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_105",
          "debateSectionId": "dbsect_105",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_128",
        "questionNumber": 128
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme which comprises five different projects in and around the GDA will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours.  DART+ Costal North will provide an extension of DART services from the city centre to Drogheda. The planning approval for DART+ Costal North was granted by An Coimisiún Pleanála in August 2025.  DART+ Fleet will provide a ten-year procurement framework for electric and battery-electric train fleet. Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027, which will provide additional capacity on the line.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 129. Deputy Grace Boland asked the Minister for Transport if the deployment of the new train sets on the northern commuter line will facilitate any additional services; if not, when additional services are planned; and if he will make a statement on the matter. [70676/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_106",
          "debateSectionId": "dbsect_106",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_106.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_129",
        "questionNumber": 129
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified rail network from circa 50km to 150km and double city centre rail capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high-capacity public transport across the GDA.  DART+ Costal North will provide an extension of DART services from the city centre to Drogheda. The planning approval for DART+ Costal North was granted by An Coimisiún Pleanála in August 2025.  The NDP Sectoral Investment Plan for Transport, published by the Department last month, notes that there is the potential to commence construction on elements of the DART+ Coastal North project in the coming years, involving infrastructure such as new track on the route and a new platform at Drogheda station, in advance of works on the Overhead Line Equipment (OHLE).  Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 130. Deputy Grace Boland asked the Minister for Transport if his Department and the National Transport Authority have considered the rapid population growth along the northern commuter line corridor, including Skerries, Rush and Lusk, and Balbriggan, in planning for additional capacity and service frequency; and if he will make a statement on the matter. [70677/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_107",
          "debateSectionId": "dbsect_107",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_107.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_130",
        "questionNumber": 130
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (or NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  Following a competitive procurement process, the NTA awarded, in April 2024, an overall framework contract for the design, supply, installation and operation of a new multi-modal, ticketing system to Spanish information technology company - Indra Sistemas S.A. - who have designed, installed and operated similar systems internationally.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in recent history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device. NGT is being designed to replace Leap and provide the requisite functionality and flexibility for the next ten to twenty years in the area of transit payments.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further roll-outs thereafter.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. \n Minister for Transport  I propose to take Questions Nos. 132, 133 and 135 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area, including the National Train Control Centre or NTCC.  As the Deputy may be aware, the NTCC project is designed to deliver a modern, safe and efficient national train control system that can effectively meet the needs of a growing railway over the coming decades.  The NTCC building was completed in November 2022 but bringing it into operation has been delayed due to complexities associated with the roll-out of the Traffic Management System or TMS, which is the software system that integrates a range of railway systems such as signalling and communications.  As a result, in August I met with the NTA and the contractor, Indra Sistemas, who are responsible for the TMS project. At the meeting, I noted my dissatisfaction at the rate of progress with the TMS and emphasised the importance of project delivery.  More broadly, I will continue to have the NTA keep the NTCC project under close review, with a view to it bringing its benefits to railways users as soon as feasible.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 131. Deputy Grace Boland asked the Minister for Transport the current status of the next generation ticketing programme; the expected timeline for national implementation across all modes of public transport; and if he will make a statement on the matter. [70678/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_131",
        "questionNumber": 131
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (or NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  Following a competitive procurement process, the NTA awarded, in April 2024, an overall framework contract for the design, supply, installation and operation of a new multi-modal, ticketing system to Spanish information technology company - Indra Sistemas S.A. - who have designed, installed and operated similar systems internationally.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in recent history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device. NGT is being designed to replace Leap and provide the requisite functionality and flexibility for the next ten to twenty years in the area of transit payments.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further roll-outs thereafter.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. \n Minister for Transport  I propose to take Questions Nos. 132, 133 and 135 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area, including the National Train Control Centre or NTCC.  As the Deputy may be aware, the NTCC project is designed to deliver a modern, safe and efficient national train control system that can effectively meet the needs of a growing railway over the coming decades.  The NTCC building was completed in November 2022 but bringing it into operation has been delayed due to complexities associated with the roll-out of the Traffic Management System or TMS, which is the software system that integrates a range of railway systems such as signalling and communications.  As a result, in August I met with the NTA and the contractor, Indra Sistemas, who are responsible for the TMS project. At the meeting, I noted my dissatisfaction at the rate of progress with the TMS and emphasised the importance of project delivery.  More broadly, I will continue to have the NTA keep the NTCC project under close review, with a view to it bringing its benefits to railways users as soon as feasible.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 132. Deputy Grace Boland asked the Minister for Transport the projected operational date for the national train control centre; the current status of commissioning and software integration; and if he will make a statement on the matter. [70679/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (or NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  Following a competitive procurement process, the NTA awarded, in April 2024, an overall framework contract for the design, supply, installation and operation of a new multi-modal, ticketing system to Spanish information technology company - Indra Sistemas S.A. - who have designed, installed and operated similar systems internationally.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in recent history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device. NGT is being designed to replace Leap and provide the requisite functionality and flexibility for the next ten to twenty years in the area of transit payments.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further roll-outs thereafter.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. \n Minister for Transport  I propose to take Questions Nos. 132, 133 and 135 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area, including the National Train Control Centre or NTCC.  As the Deputy may be aware, the NTCC project is designed to deliver a modern, safe and efficient national train control system that can effectively meet the needs of a growing railway over the coming decades.  The NTCC building was completed in November 2022 but bringing it into operation has been delayed due to complexities associated with the roll-out of the Traffic Management System or TMS, which is the software system that integrates a range of railway systems such as signalling and communications.  As a result, in August I met with the NTA and the contractor, Indra Sistemas, who are responsible for the TMS project. At the meeting, I noted my dissatisfaction at the rate of progress with the TMS and emphasised the importance of project delivery.  More broadly, I will continue to have the NTA keep the NTCC project under close review, with a view to it bringing its benefits to railways users as soon as feasible.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 133. Deputy Grace Boland asked the Minister for Transport the reason for the delays to the national train control centre and associated traffic management system; the revised cost and schedule; and if he will make a statement on the matter. [70680/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_133",
        "questionNumber": 133
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified rail network from circa 50km to 150km and double city centre rail capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high-capacity public transport across the GDA.  DART+ Costal North will provide an extension of DART services from the city centre to Drogheda. The planning approval for DART+ Costal North was granted by An Coimisiún Pleanála in August 2025.  The NDP Sectoral Investment Plan for Transport, published by the Department last month, notes that there is the potential to commence construction on elements of the DART+ Coastal North project in the coming years, involving infrastructure such as new track on the route and a new platform at Drogheda station, in advance of works on the Overhead Line Equipment (OHLE).  Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027, this will provide a boost to capacity on the line.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 134. Deputy Grace Boland asked the Minister for Transport the contingency measures in place to protect rail service reliability and capacity on the northern commuter line pending the full operation of the national train control centre; and if he will make a statement on the matter. [70683/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_110",
          "debateSectionId": "dbsect_110",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_134",
        "questionNumber": 134
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (or NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  Following a competitive procurement process, the NTA awarded, in April 2024, an overall framework contract for the design, supply, installation and operation of a new multi-modal, ticketing system to Spanish information technology company - Indra Sistemas S.A. - who have designed, installed and operated similar systems internationally.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in recent history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device. NGT is being designed to replace Leap and provide the requisite functionality and flexibility for the next ten to twenty years in the area of transit payments.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further roll-outs thereafter.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. \n Minister for Transport  I propose to take Questions Nos. 132, 133 and 135 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area, including the National Train Control Centre or NTCC.  As the Deputy may be aware, the NTCC project is designed to deliver a modern, safe and efficient national train control system that can effectively meet the needs of a growing railway over the coming decades.  The NTCC building was completed in November 2022 but bringing it into operation has been delayed due to complexities associated with the roll-out of the Traffic Management System or TMS, which is the software system that integrates a range of railway systems such as signalling and communications.  As a result, in August I met with the NTA and the contractor, Indra Sistemas, who are responsible for the TMS project. At the meeting, I noted my dissatisfaction at the rate of progress with the TMS and emphasised the importance of project delivery.  More broadly, I will continue to have the NTA keep the NTCC project under close review, with a view to it bringing its benefits to railways users as soon as feasible.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 135. Deputy Grace Boland asked the Minister for Transport the impact that delays to the national train control centre will have on planned capacity enhancements on the northern commuter line; and if he will make a statement on the matter. [70684/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_135",
        "questionNumber": 135
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The position is as outlined in my response to the Deputy’s recent question - PQ69482/25. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 136. Deputy Grace Boland asked the Minister for Transport how delays to the next generation ticketing programme will affect the implementation of future fare policy reforms including zonal structures, fare caps and open payments; and if he will make a statement on the matter. [70685/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_111",
          "debateSectionId": "dbsect_111",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_111.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_136",
        "questionNumber": 136
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 137, 138, 139, 140, 141, 142 and 143 together.  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in the history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  All governance arrangements for public transport initiatives including the NGT project, which are funded through my Department, are in line with the requirements set out in the Infrastructure Guidelines. Governance arrangements are under constant consideration to ensure they reflect the scale of relevant initiatives, provide effective oversight of projects and achieve value for money.  Nothing the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 137. Deputy Grace Boland asked the Minister for Transport the measures being taken to ensure that the next generation ticketing system will be introduced on commuter rail and regional bus services at the same pace as Dublin city services; and if he will make a statement on the matter. [70686/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_137",
        "questionNumber": 137
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 137, 138, 139, 140, 141, 142 and 143 together.  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in the history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  All governance arrangements for public transport initiatives including the NGT project, which are funded through my Department, are in line with the requirements set out in the Infrastructure Guidelines. Governance arrangements are under constant consideration to ensure they reflect the scale of relevant initiatives, provide effective oversight of projects and achieve value for money.  Nothing the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 138. Deputy Grace Boland asked the Minister for Transport the governance and oversight arrangements in place to ensure that the next generation ticketing programme adheres to the requirements of the public spending code and the infrastructure guidelines; and if he will make a statement on the matter. [70687/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_138",
        "questionNumber": 138
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 137, 138, 139, 140, 141, 142 and 143 together.  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in the history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  All governance arrangements for public transport initiatives including the NGT project, which are funded through my Department, are in line with the requirements set out in the Infrastructure Guidelines. Governance arrangements are under constant consideration to ensure they reflect the scale of relevant initiatives, provide effective oversight of projects and achieve value for money.  Nothing the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 139. Deputy Grace Boland asked the Minister for Transport if it is intended that the next generation ticketing system will be integrated with existing Transport for Ireland digital services to provide one streamlined app and a single point of access for users; and if he will make a statement on the matter. [70688/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_139",
        "questionNumber": 139
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 137, 138, 139, 140, 141, 142 and 143 together.  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in the history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  All governance arrangements for public transport initiatives including the NGT project, which are funded through my Department, are in line with the requirements set out in the Infrastructure Guidelines. Governance arrangements are under constant consideration to ensure they reflect the scale of relevant initiatives, provide effective oversight of projects and achieve value for money.  Nothing the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 140. Deputy Grace Boland asked the Minister for Transport the timeline for user testing of the next generation ticketing system; when commuters will be able to trial the integrated digital platform; and if he will make a statement on the matter. [70689/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_140",
        "questionNumber": 140
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 137, 138, 139, 140, 141, 142 and 143 together.  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in the history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  All governance arrangements for public transport initiatives including the NGT project, which are funded through my Department, are in line with the requirements set out in the Infrastructure Guidelines. Governance arrangements are under constant consideration to ensure they reflect the scale of relevant initiatives, provide effective oversight of projects and achieve value for money.  Nothing the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 141. Deputy Grace Boland asked the Minister for Transport the governance arrangements in place to oversee the digital integration of the next generation ticketing system with existing public transport platforms; and if he will make a statement on the matter. [70690/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_141",
        "questionNumber": 141
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 137, 138, 139, 140, 141, 142 and 143 together.  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in the history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  All governance arrangements for public transport initiatives including the NGT project, which are funded through my Department, are in line with the requirements set out in the Infrastructure Guidelines. Governance arrangements are under constant consideration to ensure they reflect the scale of relevant initiatives, provide effective oversight of projects and achieve value for money.  Nothing the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 142. Deputy Grace Boland asked the Minister for Transport the way in which the National Transport Authority is ensuring that the next generation ticketing system will provide a consistent user experience across bus, rail and regional services; and if he will make a statement on the matter. [70691/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_142",
        "questionNumber": 142
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 137, 138, 139, 140, 141, 142 and 143 together.  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing (NGT) project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  The NGT project will represent the most comprehensive overhaul of ticketing and fare payment in the history of public transport in Ireland. NGT will transform how people travel by bus, Luas, and train and will mean that customers will be able to pay for journeys by tapping their bank card, mobile phone, or other smart device.   The scope of NGT covers all public service buses, trams, and train stations including bus validators, ticket machines, ticket vending machines, station gates, tram and train platform validators and an Account Based Ticketing (ABT) solution delivered on modern cloud hosting technologies. Each of these items of ticketing equipment, representing thousands of items, will be replaced under the new system.  It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  All governance arrangements for public transport initiatives including the NGT project, which are funded through my Department, are in line with the requirements set out in the Infrastructure Guidelines. Governance arrangements are under constant consideration to ensure they reflect the scale of relevant initiatives, provide effective oversight of projects and achieve value for money.  Nothing the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 143. Deputy Grace Boland asked the Minister for Transport if the next generation ticketing system will support real time information, journey planning, account management and payment within a single app interface; and if he will make a statement on the matter. [70692/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Grace-Boland.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Grace-Boland.D.2024-11-29",
          "showAs": "Grace Boland"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_112",
          "debateSectionId": "dbsect_112",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_143",
        "questionNumber": 143
      },
      "contextDate": "2025-12-10"
    }
  ]
}