{
  "head": {
    "counts": {
      "questionCount": 748,
      "resultCount": 748
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Social Protection  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  My Department provides a range of income support payments for disabled people. There are currently almost 231,300 recipients of disability income support payments, with estimated expenditure of €3.24 billion in 2025.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures. This contained significant targeted measures to support disabled people, including:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January.  • A Christmas bonus double payment to all persons getting a long-term disability payment, paid in December 2025.  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12.  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026.  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  These measures clearly demonstrate the Governments commitment to support disabled people by introducing permanent changes rather than relying on once-off measures.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People 2025-2030 my Department will lead a Strategic Focus Network on the Cost of Disability.  The work of this network, which will include disabled people and their advocates, will inform the approach to be taken in delivering on the Programme for Government commitment. I have asked my officials to expedite this work with a view to bringing a proposal to Government in the first half of next year.  My officials have held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. Most recently, my officials met with a number of organisations on 2nd December at my Department's Disability Consultative Forum, at which the Cost of Disability Strategic Focus Network was the main Agenda item. Officials from across government were also in attendance given that this is a whole of Government issue.  The Supplementary Welfare Allowance scheme is the safety net within the overall social welfare system in that it provides assistance to eligible people in the State whose means are insufficient to meet their needs and those of their dependents.  Under the Supplementary Welfare Allowance scheme, my department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources. These payments are available through our Community Welfare Officers and are available to anyone who needs then and qualifies, whether the person is currently receiving a social welfare payment or working on a low income.  Furthermore, under the scheme, a Heating Supplement may be paid to assist people that have exceptional heating costs due to ill health, infirmity or a medical condition and are unable to meet those costs out of household income. Heating Supplement is not restricted to the fuel season and can be paid throughout the full year.  Any person who considers that they may have an entitlement to an Additional Needs Payment or a Heating Supplement is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office. In addition, applications for Additional Needs Payments can be made online via www.mywelfare.ie.  I trust this clarifies the issue for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 313. Deputy Johnny Guirke asked the Minister for Social Protection if her Department will consider an additional emergency winter payment for disabled people, many of whom are struggling to keep up with costs to warm their homes; and if he will make a statement on the matter. [72822/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_278",
          "debateSectionId": "dbsect_278",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_278.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_313",
        "questionNumber": 313
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Government is committed to ensuring that disabled people have access to services and supports on an equal footing to all other citizens. Under the National Human Rights Strategy for Disabled People 2025-2030, there will be more coordinated action on accessibility across government, with greater awareness of good practice in Universal Design, and the built environment, and good practice in how we provide information to the public, including through information and communications technologies, and in the design and delivery of services. The Strategy commits to strengthening capacity on accessibility across Government.  There will be key deliverables, including regular monitoring of the accessibility of civil and public services in line with current statutory accessibility obligations, as provided for under the Disability Act 2005, the EU Web Accessibility Directive 2016/2102, and the implementation of the Irish Sign Language Act 2017.  Supports for private enterprise in ensuring the accessibility of their services for customers are appropriate to the remit of the Department of Enterprise, Tourism and Employment. Funding to support private enterprises to ensure accessibility for employees is the responsibility of the Department of Social Protection, through the Work and Access Scheme. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 352. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality if any funding streams are available to upgrade accessibility access into private businesses; and if she will make a statement on the matter. [72823/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_352",
        "questionNumber": 352
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 353. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality the number of people in County Meath waiting on an assessment of need; and if she will make a statement on the matter. [72824/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_308",
          "debateSectionId": "dbsect_308",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_308.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_353",
        "questionNumber": 353
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 354. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality the current average wait time for an assessment of need in County Meath; and if she will make a statement on the matter. [72825/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_309",
          "debateSectionId": "dbsect_309",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_309.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_354",
        "questionNumber": 354
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 355. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality the number of people with a disability awaiting placement into residential care in County Meath if she will make a statement on the matter. [72826/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_310",
          "debateSectionId": "dbsect_310",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_310.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_355",
        "questionNumber": 355
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 356. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality the plans to open up additional children's respite services in County Meath; and if she will make a statement on the matter. [72827/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_311",
          "debateSectionId": "dbsect_311",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_311.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_356",
        "questionNumber": 356
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 357. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality the number of children's respite services in County Meath for children with an intellectual disability; and if she will make a statement on the matter. [72828/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_312",
          "debateSectionId": "dbsect_312",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_312.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_357",
        "questionNumber": 357
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 358. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality the number of adult respite services in County Meath for individuals with intellectual disabilities; and if she will make a statement on the matter. [72829/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_313",
          "debateSectionId": "dbsect_313",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_358",
        "questionNumber": 358
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Local authorities are entirely independent corporate entities having full responsibility under law for the performance of their functions and the discharge of their governance and other responsibilities.  It is not appropriate that the Department of Children, Disability and Equality should have any co-ordinating or reporting role in relation to the range of matters that may come within the area of responsibility of another Department or State body. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 359. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality if she has any plans to instruct local authorities to make a provision of housing to companies wanting to open up additional centres for adults with intellectual disabilities; and if she will make a statement on the matter. [72830/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_314",
          "debateSectionId": "dbsect_314",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_314.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_359",
        "questionNumber": 359
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.  The 2025 scheme includes three funding streams under which project applications could be made, the Building or Land Acquisition Measure (BLAM), the Main Scheme and the Project Development Measure (PDM).  Meath County Council submitted 2 applications under the BLAM. The BLAM closed for applications on 2 May 2025, and local authorities have been informed of successful applications. For reasons of commercial sensitivity, details of individual projects receiving support under this Measure will released only after the purchase of properties or lands in question have been completed.  The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that 5 applications for the Main Scheme and 2 applications for the Project Development Measure were submitted by Meath County Council. The Scheme is heavily subscribed, and all applications received will be assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget will also be considered to maximise the impact of this funding.  The assessment process is nearing completion, and I expect to be in a position to announce the successful projects shortly. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 378. Deputy Johnny Guirke asked the Minister for Rural and Community Development and the Gaeltacht when allocations under the 2025 town and village renewal scheme will be announced; the number of projects submitted for Meath; and if he will make a statement on the matter. [70582/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_312",
          "debateSectionId": "dbsect_312",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_312.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_378",
        "questionNumber": 378
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Rural Regeneration and Development Fund (RRDF) is a major programme which seeks to support large-scale, ambitious projects that can achieve sustainable economic and social development in rural areas.  The focus of the RRDF is on rural towns and villages with a population of less than 10,000 people. To date, the RRDF has allocated over €613 million for 273 projects across Ireland.  Calls for applications to the RRDF are sought under two categories. Category 1 relates to large scale capital works projects with all necessary planning and consents in place and are ready to proceed. Category 2, which typically provides funding of up to €1m per project, relates to projects which may planning permissions and statutory consents and further development to become ready for Category 1 status.  I was delighted to recently announce successful projects under the Fourth Call for Category 2 applications, with funding of over €20.5 million being allocated to 30 landmark regeneration projects in rural communities across the country. I can confirm it is also my intention to launch a Call for Proposals for larger scale Category 1 RRDF projects in the near future.  I am committed to ensuring that the RRDF can continue to support high quality and transformational projects across rural Ireland in line with the objectives of Our Rural Future and the Town Centre First policy . ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 379. Deputy Johnny Guirke asked the Minister for Rural and Community Development and the Gaeltacht when the next round of funding for RRDF will open; and if he will make a statement on the matter. [70583/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_313",
          "debateSectionId": "dbsect_313",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_379",
        "questionNumber": 379
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Outdoor Recreation Infrastructure Scheme (ORIS) provides funding under several measures for the development of new outdoor recreational infrastructure and for the necessary repair, enhancement or promotion of existing outdoor recreation infrastructure in countryside areas across Ireland.  Applications submitted under ORIS are subject to a competitive assessment process conducted by my officials. Last month I was delighted to announce funding of over €16 million for successful projects under measures 2 and 3 of the 2024/2025 fund. This is in addition to funding of €8.7m I announced in August under the other scheme measures.  While this is the highest amount of funding approved under the scheme since it was established in 2016, not all applications were successful in being funded. My officials are available to discuss any unsuccessful project applications with the local authorities and local development companies who manage the scheme locally, and I would encourage any such applicants to contact the ORIS section in my Department in this regard. My officials are in ongoing contact with delivery partners in any case, and also host information sessions for applicants when a new round of the scheme is open. These information sessions have proved a useful forum to discuss scheme requirements and the application process directly with local authority and local development company staff who are engaged in the operational management of ORIS applications.     ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 380. Deputy Johnny Guirke asked the Minister for Rural and Community Development and the Gaeltacht when local authorities will be notified of the reasons projects were unsuccessful for this year’s outdoor recreation funding; and if he will make a statement on the matter. [70584/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_314",
          "debateSectionId": "dbsect_314",
          "showAs": "Rural Recreation Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_314.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_380",
        "questionNumber": 380
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Outdoor Recreation Infrastructure Scheme (ORIS) provides funding under a number of measures for the development of new outdoor recreational infrastructure and for the necessary repair, enhancement or promotion of existing outdoor recreation infrastructure in countryside areas across Ireland. A large proportion of the funding goes to support walking trails.  Projects funded under ORIS should, in the main, be located in the countryside (i.e. not within the environs of towns or villages). However, ORIS funds recreational infrastructure linking a town or village to significant outdoor recreation facilities located in the countryside. The scheme has funded the provision of pathways to create such linkages. However, It should be noted, the provision and maintenance of footpaths within towns and villages is not supported by the scheme.  The provision of paths within towns and villages is a matter for local authorities. Depending on the nature of the project, the deputy may wish to explore the potential for active travel funding through the Department of Transport. Indeed, funding for public realm works may also be eligible as part of larger regeneration projects funded under the Town and Village Renewal Scheme or the Rural Regeneration and Development Fund.   ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 381. Deputy Johnny Guirke asked the Minister for Rural and Community Development and the Gaeltacht his plans to address communities who do not meet criteria for footpath projects under the outdoor recreation funding; and if he will make a statement on the matter. [70585/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_315",
          "debateSectionId": "dbsect_315",
          "showAs": "Rural Recreation Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_315.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_381",
        "questionNumber": 381
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department's CLÁR programme provides funding under a number of different measures for small-scale infrastructural projects in designated rural areas. I was pleased to announce funding of €12.3 million for over 200 projects under the CLÁR programme just last week.  The Programme for Government makes a commitment to carry out a comprehensive review of the eligible CLÁR areas. The statistical analysis for this review has now been completed and I am currently considering the content of the resulting report. It is intended that any changes to be introduced as a result of the review will be implemented before the next iteration of the scheme is launched next year.   ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 382. Deputy Johnny Guirke asked the Minister for Rural and Community Development and the Gaeltacht if he has plans to expand CLÁR areas in County Westmeath; and if he will make a statement on the matter. [70586/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_316",
          "debateSectionId": "dbsect_316",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_316.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_382",
        "questionNumber": 382
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for Culture, Communication and Sport with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform, approves any superannuation schemes submitted by An Post. The operation of the schemes is a matter between the management of An Post, staff representatives and the trustees of the schemes.  In accordance with the Act and the relevant Code of Practice for the Governance of State Bodies, An Post must seek Ministerial approval from both Ministers to increase pensions and deferred pensions for members of the An Post superannuation scheme. Section 2.13 of the Code of Practice for Governance of State Bodies Superannuation and Remuneration annex sets out that NewERA advice should be sought in respect of pension amendment proposals, as is appropriate in their role as commercial and financial advisors to the Ministers.  On 23 October 2025, An Post wrote to my Department requesting consent for an increase to pensions in payment and deferred pensions, arising from its agreements with employee representative groups. It is not possible, at this point, to set out the specific timeframe within which the decision-making process will be concluded by both shareholding Ministers in respect of increases submitted for consent. It should be recognised that the time taken for the pension approval process is necessary to ensure that robust governance procedures are in place. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 471. Deputy Johnny Guirke asked the Minister for Culture, Communications and Sport the status of the An Post pension increase; and if he will make a statement on the matter. [69677/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_417",
          "debateSectionId": "dbsect_417",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_417.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_471",
        "questionNumber": 471
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Officials in my Department engage regularly with their counterparts in local authorities on matters relating to international and temporary protection accommodation, including through the work of the community engagement team.  In addition to this ongoing engagement the Department has in place dedicated channels through which local authorities can contact the Department with queries or concerns in relation to accommodation for people from Ukraine or people seeking international protection.  The respective email inboxes are ukrainetempaccom@justice.ie for concerns relating to accommodation for refugees from Ukraine, and IPPS@justice.ie for matters with respect to international protection accommodation. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 702. Deputy Johnny Guirke asked the Minister for Justice, Home Affairs and Migration if he can provide a contact email address for local authorities to use if they are dealing with ongoing enforcement issues in relation to contracts for IPAS, BTOP, or short-term emergency accommodation; and if he will make a statement on the matter. [70100/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_561",
          "debateSectionId": "dbsect_561",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_561.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_702",
        "questionNumber": 702
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government remains committed to supporting the Irish diaspora, including those who wish to return home. The Programme for Government contains multiple commitments around returning and returned emigrants, both in relation to administrative issues such as driving licences and PPS numbers, as well as the commitment to develop a new Diaspora Strategy.  Reducing administrative barriers faced by those who wish to return to Ireland is a central priority of the current Diaspora Strategy. The Interdepartmental Committee on the Irish Abroad, which I chair, progresses work on this issue, by bringing together representatives of key government departments and external stakeholders, who we work with closely.  Through the Emigrant Support Programme, the Department provides annual funding to Crosscare and Safe Home, both of which assist returning emigrants, as well as the Citizens' Information Board's \"Returning to Ireland\" portal, which provides a wide range of practical information and advice for returning emigrants. For those who wish to start their own business, the Department funds the Back for Business initiative, which provides peer guidance to early stage entrepreneurs who have returned, or plan to return, to Ireland.  In line with the Programme for Government commitment to develop our next Diaspora Strategy, I am leading an extensive consultation process with our diaspora both in person and online. The aim of this process is to ensure that the next strategy can reflect the needs of the global Irish community, including those who are in the process of returning. I have hosted over twenty in-person consultations with Irish communities around the world, as well as a large-scale online consultation, which received over 10,000 responses. These discussions offered an opportunity to respondents to share their views which will feed directly into the new strategy. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 84. Deputy Johnny Guirke asked the Minister for Foreign Affairs and Trade to provide an update, in relation to returning and returned Irish, if she will report on the current situation with regard to the implementation of the Indecon (2018) report recommendations, in particular the appointment of a designated Departmental contact within each relevant Government department, and the establishment of a dedicated Oireachtas committee to focus on the issues concerning the returning Irish emigrants. [68269/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_78",
          "debateSectionId": "dbsect_78",
          "showAs": "Emigrant Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_78.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_84",
        "questionNumber": 84
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  HBFI was established as an independent, commercial entity to provide lending for housing construction. As Tánaiste and Minister for Finance I do not have any role in HBFI’s commercial decisions.  As the deputy may be aware, HBFI is subject to the same confidentiality obligations as other banks and financial institutions and, therefore, cannot comment on at the particularities of individual loan facilities. However, as is the case for all lenders including HBFI, once a loan is fully repaid, the lender ceases to hold security over the related assets.  I can confirm that HBFI has no current role with this development. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 108. Deputy Johnny Guirke asked the Tánaiste and Minister for Finance the extent of the involvement of Home Building Finance Ireland (HBFI) in the financing of the Ringfort development in Rathmolyon, County Meath; if his Department will use its oversight of the HBFI to ensure a resolution for the affected home buyers; and if he will make a statement on the matter. [68187/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Financial Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_108",
        "questionNumber": 108
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that, outside of its general role as a tax authority, it has no role in the investigation of the financial dealings of the companies involved in the Ringfort development.  One of these companies, Meathamatic Limited, was placed into liquidation on 18th November 2025 and Colin Gaynor of Resolute Advisory was appointed as liquidator. Revenue is a creditor of this company but failed to get its nominee appointed.  Under Company Law, the liquidator is obliged to investigate the reasons for the failure of a company and to report to the Corporate Enforcement Authority on how the affairs of the company were conducted by the directors. The liquidator is also tasked with realising the assets of the company to maximise repayments of creditor debts.  As part of this liquidation, a committee of inspection has been set up and I can confirm that Revenue has a representative on this committee. A committee of inspection represents the interests of creditors and oversees the activities of the liquidator. I am assured that Revenue will work closely with the liquidator to ensure that all appropriate actions are taken in this case. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 109. Deputy Johnny Guirke asked the Tánaiste and Minister for Finance if the Revenue Commissioners have a role in the investigation of the financial dealings of the companies involved in the Ringfort development in Rathmolyon, County Meath; and if he will make a statement on the matter. [68188/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_104",
          "debateSectionId": "dbsect_104",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_109",
        "questionNumber": 109
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 168 and 175 together.  If tools are being brought into Ireland from another EU Member State, then no tax is payable on the tools.  If the tools are being imported into the State from a non-EU country, then Customs Duty and VAT may be chargeable on the tools. However, there are two reliefs in EU law that may allow the import of personal tools into the EU/Ireland without Customs Duty or VAT being charged on them.  There is a relief from Customs Duty and VAT associated with ‘Transfer of Business’ relief which, in certain circumstances, can apply to tools of the trade. To qualify for this relief, a tradesperson must have ceased activity outside the EU and moved to Ireland to carry on a similar activity here. A new sole trader activity must be set up in Ireland. Proofs of registration both outside the EU and on return to Ireland will be required to avail of the relief. If ‘Transfer of Business’ relief is applicable, the individual must complete a ‘Transfer of Business Activities’(C-and-E-1078.pdf) form and present it to Revenue.  There is also another relief called Returned Goods Relief (RGR) which provides relief from Customs Duty and VAT when goods are re-imported within a 3-year period into an EU Member State from a non-EU country. This relief is applicable where the tools being returned to Ireland have been exported from Ireland in the first place by the tradesperson.  Please see attached link for further information on RGR - www.revenue.ie/en/customs/businesses/relief-duty-vat/reimported-into-eu/index.aspx.  Any further queries can be sent to customsreliefs@revenue.ie. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 175. Deputy Johnny Guirke asked the Tánaiste and Minister for Finance if he will consider scrapping the VAT and customs duties imposed on tools belonging to skilled trades people who are returning to Ireland from non-EU countries; and if he will make a statement on the matter. [67977/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "Construction Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_175",
        "questionNumber": 175
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 517, 520, 528, 530, 531, 532, 533, 534, 578, 589 and 598 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, proposals for screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 578. Deputy Johnny Guirke asked the Minister for Health her plans for urgent prioritisation of SMA newborn screening implementation, delayed since the Ministerial announcement in 2023, with a clear time-bound commitment indicating when screening will finally commence; and if she will make a statement on the matter. [67692/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_578",
        "questionNumber": 578
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  There is significant ongoing work taking place internationally on advancing and implementing self-driving systems and this is reflected in the work of the United Nations Economic Commission for Europe (UNECE). The new UN Regulations, referred to in the question, were agreed this October but have still not been formally adopted. When they are adopted, I expect that the EU, which are party to the discussions, will move to have them adopted within the EU at the earliest opportunity.  We are currently progressing the development of a National Strategy in relation to connected and self-driving vehicles. I expect this strategy to be completed in the first part of next year. Additionally, due to priority, we are progressing in parallel a supporting framework which includes legislation on testing as well as advanced driver assistance systems. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Johnny Guirke",
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_239.xml"
            }
          },
          "debateSectionId": "dbsect_239",
          "showAs": "Road Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_239"
        },
        "questionNumber": 292,
        "date": "2025-11-12",
        "showAs": " 292. Deputy Johnny Guirke asked the Minister for Transport to outline any plans to implement the new United Nations vehicle safety regulations on assisted and self-driving systems, as developed through the United Nations Economic Commission for Europe, that were agreed in October 2025; if they will be implemented without undue delay; and if he will make a statement on the matter. [61343/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_292"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_491",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08",
          "memberCode": "Johnny-Guirke.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_453",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_453",
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null
        },
        "showAs": " 491. Deputy Johnny Guirke asked the Minister for Further and Higher Education, Research, Innovation and Science the amount spent in the past five years on advertising campaigns to encourage Irish emigrants to return home, by year, in tabular form; and if he will make a statement on the matter. [60729/25] ",
        "questionNumber": 491,
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Ireland needs people with construction skills and experience to help deliver on ambitious targets for new housing and infrastructure. The National Development Plan outlines a record €275.4 billion in public capital investment, aiming to secure Ireland's future, to transform the country, unlock housing, upgrade water and energy infrastructure, deliver more roads, and provide better public transport.  Construction workers are in demand, and there are lots of opportunities for Irish construction workers who have moved abroad and are considering returning. Between now and 2030, Ireland needs between 69,000 -79,000 additional construction sector workers to help deliver on ambitious targets for residential construction and retrofitting targets alone.  My Department is leading on a number of communication initiatives to address the skills gap in construction, including a campaign aimed at Irish construction workers abroad who are considering returning home.  The Build Back Home campaign was developed following research which included feedback from Irish construction workers abroad, that skills they developed abroad may not be valued at home.  The campaign ran for two weeks in October 2024 in Canada and Australia, and will run for seven weeks this October and November, across Canada, Australia and the US. Spend per year is detailed below. To note, 2025 spend will be finalised on campaign completion.     Build Back Home Campaign    2024    2025 (TBC)      Total spend    €166,889    €277,055       Funding for the campaign is provided by the Department of the Taoiseach under the Housing for All Implementation Fund.  Latest analytics show strong engagement with the campaign. The Build Back Home website has more than 68,750 visits, 95% of which are from North America, Canada and Australia. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Climate",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 232. Deputy Johnny Guirke asked the Minister for Climate, Energy and the Environment the funding provided to Meath County Council in the past five years to implement local climate action plans, in tabular form; and if he will make a statement on the matter. [60111/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_232",
        "questionNumber": 232,
        "answerText": " Minister for Climate, Energy and the Environment  All 31 local authorities adopted Local Authority Climate Action Plans (LA CAPs) by Q1 2024, as required under the Climate Act 2021. In 2022, my Department approved a funding proposal to allocate resources to local authorities to develop and implement their LA CAPs over three phases:  Phase 1: Establish the Evidence Base, Resource Requirements, Delivery of the National Climate Action Plan 2021, and Requirements of each LA CAP.  Phase 2: Development of LA CAP.  Phase 3: Implementation.  In 2022, a total of €3.3m was paid to local authorities for Phase 1. In 2023, a total of €4.7m was paid to local authorities for Phase 2.  Local authorities are now in Phase 3. My Department signed a 5-year Service Level Agreement with all local authorities for Phase 3 from November 2023 - December 2028. In 2024, a total of €5.5m was paid to local authorities under Phase 3.  The table below provides a breakdown of the funding paid to Meath County Council to develop and implement their LA CAP. This does not include data for 2020 or 2021 as resourcing for LA CAPs commenced in 2022. Data for 2025 is currently unavailable as local authorities make a claim for reimbursement to my Department in Q4 of each year.     Local authority    2022    2023    2024      Meath County Council    €56,427    €177,339    €187,608       My Department is working closely with local authorities to ensure their work on climate action continues to be supported and resourced. Engagement is carried out through key areas such as funding the Climate Action Regional Offices (CAROs), the Local Authority Climate Action Training Programme, and providing a support role to the EU Climate Neutral and Smart Cities Mission and Decarbonising Zones (DZs). ",
        "debateSection": {
          "showAs": "Climate Change Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_218",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_218.xml"
            }
          },
          "debateSectionId": "dbsect_218"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 430. Deputy Johnny Guirke asked the Minister for Transport if he will review the frequency and capacity of Bus Éireann route NX, as current services between Navan and Dublin are insufficient to meet commuter demand; and if he will make a statement on the matter. [60083/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_430",
        "questionNumber": 430,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Bus Éireann.  In light of the above, I have forwarded the Deputy's question to the NTA and Bus Éireann for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "debateSection": {
          "showAs": "Bus Éireann",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_400",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_400.xml"
            }
          },
          "debateSectionId": "dbsect_400"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 431. Deputy Johnny Guirke asked the Minister for Transport the current waiting times for driving tests in each test centre in County Meath; the number of applicants currently waiting beyond ten to twelve weeks in each test centre, in tabular form; and if he will make a statement on the matter. [60084/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_431",
        "questionNumber": 431,
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. This includes all application and scheduling matters. As such, the information requested is held by the Authority. I have therefore referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days.  The Deputy may wish to note that the RSA publish detailed monthly information on the driver testing service on the CSO website, including the breakdown of waiting times, no shows and distribution of testing capacity by test centre. This information is available at the following link: https://data.cso.ie/product/RSADTS. ",
        "debateSection": {
          "showAs": "Driver Test",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_401",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_401.xml"
            }
          },
          "debateSectionId": "dbsect_401"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 432. Deputy Johnny Guirke asked the Minister for Transport the provisions that are in place to increase the local link bus service within the Navan Municipal District to improve rural connectivity and access to Navan town. [60085/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_432",
        "questionNumber": 432,
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_402",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_402.xml"
            }
          },
          "debateSectionId": "dbsect_402"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 433. Deputy Johnny Guirke asked the Minister for Transport where Navan is included in the safe routes to school programme, and which schools in Navan have been approved for upgrades. [60086/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_433",
        "questionNumber": 433,
        "answerText": " Minister for Transport  The Safe Routes to School (SRTS) Programme was launched in March 2021 with the aim of supporting walking, scooting, and cycling to primary and post-primary schools, and creating safer walking and cycling routes within communities, through the provision of infrastructure interventions including, in some cases, School Zones.  These projects should help alleviate congestion at school gates and increase the number of students who walk or cycle to school. The Safe Routes to School Programme is funded by my Department through the National Transport Authority (NTA) and An Taisce's Green Schools is co-ordinating the programme.  Invitations to express interest were sent to all primary and secondary schools in the country, and 931 applications were received from schools across every county in Ireland. Schools are processed in tranches with 3 rounds having been announced to date. It should be noted that all schools that applied to the original call for applications were accepted into the programme, and if not selected in the Rounds to date will be selected for forthcoming rounds.  Given the pipeline of projects due for completion, there are no plans for an additional call for schools to join the SRTS programme currently.  Noting the role of the NTA in the matter, I have referred your question to that agency for a more detailed answer in relation to schools in Navan. If you do not receive a reply within 10 working days, please contact my private office. ",
        "debateSection": {
          "showAs": "Road Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_403",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_403.xml"
            }
          },
          "debateSectionId": "dbsect_403"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 474. Deputy Johnny Guirke asked the Minister for Finance for a breakdown of the income raised from each county from the local property tax for the past four years, in tabular form. [58613/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_474",
        "questionNumber": 474,
        "answerText": " Minister for Finance  I am advised by Revenue that the Local Property Tax (LPT) liability by County for the years 2022-2025 is provided in the tables below. Liability is based on the returns filed and payments received.  The statistics for 2025, 2024 and 2023 provided below were previously included within the LPT reports, under each respective year tab, available at: [ www.revenue.ie/en/corporate/information-about-revenue/statistics/property-taxes/yearly-stats/2025/index.aspx ]       County    LPT Liability €m  YTD October 2025      Carlow    4      Cavan    5      Clare    11      Cork    65      Donegal    11      Dublin    213      Galway    29      Kerry    15      Kildare    30      Kilkenny    9      Laois    6      Leitrim    2      Limerick    18      Longford    3      Louth    11      Mayo    10      Meath    22      Monaghan    4      Offaly    6      Roscommon    5      Sligo    6      Tipperary    13      Waterford    12      Westmeath    8      Wexford    15      Wicklow    22      Total    555                County    LPT Liability €m  2024      Carlow    4      Cavan    5      Clare    12      Cork    62      Donegal    11      Dublin    212      Galway    25      Kerry    15      Kildare    29      Kilkenny    9      Laois    6      Leitrim    2      Limerick    18      Longford    3      Louth    11      Mayo    10      Meath    21      Monaghan    4      Offaly    6      Roscommon    5      Sligo    6      Tipperary    12      Waterford    11      Westmeath    7      Wexford    15      Wicklow    22      Total    543          County    LPT Liability €m  2023      Carlow    4      Cavan    5      Clare    11      Cork    61      Donegal    11      Dublin    207      Galway    25      Kerry    15      Kildare    28      Kilkenny    9      Laois    6      Leitrim    2      Limerick    18      Longford    3      Louth    10      Mayo    10      Meath    21      Monaghan    4      Offaly    6      Roscommon    4      Sligo    6      Tipperary    12      Waterford    11      Westmeath    7      Wexford    14      Wicklow    21      Total    531          County    LPT Liability €m  2022      Carlow    4      Cavan    5      Clare    11      Cork    59      Donegal    11      Dublin    196      Galway    24      Kerry    14      Kildare    27      Kilkenny    9      Laois    6      Leitrim    2      Limerick    17      Longford    3      Louth    10      Mayo    10      Meath    20      Monaghan    4      Offaly    5      Roscommon    4      Sligo    5      Tipperary    12      Waterford    11      Westmeath    7      Wexford    14      Wicklow    20      Total    510      ",
        "debateSection": {
          "showAs": "Tax Yield",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_442",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_442.xml"
            }
          },
          "debateSectionId": "dbsect_442"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 475. Deputy Johnny Guirke asked the Minister for Finance the expected additional revenue in 2026 from each local authority arising from new legislation on the local property tax, in tabular form. [58615/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_475",
        "questionNumber": 475,
        "answerText": " Minister for Finance  My Department does not prepare an advance estimate of the anticipated annual revenue from local property tax (LPT). Future LPT revenue will be determined by the self-assessed LPT returns filed by property owners as well as the inclusion of newly built properties which come into scope of the tax.  As 2025 is a revaluation year however, officials in Revenue’s Statistics Branch conducted an extensive modelling and valuation exercise in respect of LPT liable properties earlier this year. The purpose of this work was to inform policy decisions and to provide guidance to taxpayers on the valuation of their properties for the upcoming LPT valuation period 2026-2030. A paper outlining the process was published in September and is available on Revenue’s website: www.revenue.ie/en/corporate/documents/research/property-valuation-technical-paper-2026.pdf  The Finance (Local Property Tax and Other Provisions) (Amendment) Act 2025 made changes to how LPT will be charged for 2026 and future years, including the widening of all valuation bands by 20% and a reduction in the base rate from 0.1029% to 0.0906%. As a result of these changes, according to Revenue’s modelling in the linked paper, total LPT yield is estimated to increase by 8% or approximately €45 million following revaluation. This estimate does not take account of the local adjustment factor decided by local authorities. Government has agreed that any additional LPT yield generated as a result of these changes will go directly to local authorities for their discretionary use.  In respect of the estimated additional LPT revenue for every local authority next year, I am advised by the Department of Housing, Local Government and Heritage that they publish detailed information regarding LPT allocations to local authorities at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/  The allocations for 2025 and 2026 may be compared to show the anticipated increases in LPT funding for local authorities. These publications also account for the local adjustment factor decided by each respective council. ",
        "debateSection": {
          "showAs": "Tax Yield",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_443",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_443.xml"
            }
          },
          "debateSectionId": "dbsect_443"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 562. Deputy Johnny Guirke asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if a start date has been agreed for the commencement of remedial works on cairn T at the Loughcrew heritage site near Oldcastle, County Meath; if he can confirm the plan and schedule for the re-opening of cairn T to the public;; and if he will make a statement on the matter. [59520/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_562",
        "questionNumber": 562,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Cairn T is one of the largest tombs in the Loughcrew Passage Grave Cemetery complex and is a National Monument in State care. The Cairn has been closed to the public since October 2018 as a safety precaution.  The OPW is continuing to work on detailed solutions for stabilisation of the Cairn and these works will require Ministerial Consent. It is intended that the works will be undertaken later in 2026 following the granting of Ministerial Consent.  The public will not have any access to the inside of Cairn T or the chamber for the 2026 season. It is not possible at this stage to give a definitive timeline for the reopening of Cairn T to the public.  The OPW is also working with the Department of Housing Local Government and Heritage to develop a conservation management plan for the Loughcrew Megalithic Cemetery of Slieve na Cailliaghe. ",
        "debateSection": {
          "showAs": "Archaeological Sites",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_514",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_514.xml"
            }
          },
          "debateSectionId": "dbsect_514"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 813. Deputy Johnny Guirke asked the Minister for Education and Youth if she will outline the progress made establishing special school and special class places in County Meath, and whether further expansions are planned for 2026. [59116/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_813",
        "questionNumber": 813,
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available nationwide for the 2025/26 school year.  Of the 407 new special classes sanctioned for the 2025/26 school year 21 were established in County Meath, 16 at primary and 5 at post-primary level. This brings to 177 the number of special classes currently in operation in the county. There are also 3 special schools in County Meath with approximately 220 students enrolled.  When looking to provide additional special school capacity the department’s preferred option is to increase provision in existing special schools if possible. Where this is not possible in a region, my department and the NCSE will consider the need to establish a new special school. My department and NCSE monitor the need for additional special school capacity very closely and will continue to monitor the situation in County Meath.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  It is envisioned that the majority of new special classes for the 2026/27 school year will be sanctioned by 31 December 2025. My department and the NCSE are committed to ensuring that sufficient special education placements remain available in every county. ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_744",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_744.xml"
            }
          },
          "debateSectionId": "dbsect_744"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 916. Deputy Johnny Guirke asked the Minister for Education and Youth if a school capacity assessment has been carried out for the towns of Navan,Trim, Enfield, County Meath, to identify current and projected demand for school places; and if she will make a statement on the matter. [60070/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_916",
        "questionNumber": 916,
        "answerText": " Minister for Education and Youth  As the Deputy may be aware, in order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  Since 2020 my department has invested over €431 million in school infrastructure across County Meath. The department is continually planning for and investing in existing and new schools to ensure that every child in the State has access to a school place.  While my department is aware of enrolment pressures and demand for additional school places in some areas, it is important to note that enrolment pressures can be driven by duplications of applications, applications from outside an area, and school of choice factors. Notwithstanding the above, in some areas, demographic pressures and other factors are driving a requirement for additional school places.  Major new residential developments have the potential to alter the demand for school places at a local level. In that regard, as part of the demographic demand analysis, my department monitors planning and construction activity in the residential sector. This involves the analysis of data sources from local authorities and the CSO along with the engagement with local authorities and the construction sector. In this way, up-to-date information on significant new residential developments is obtained and factored into the demographic analysis exercise. This is necessary to ensure that schools infrastructure planning is keeping pace with demographic changes, at a local level, where there is a constantly evolving picture with planned new residential development.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the circumstances of each case and may, be provided through:  • Utilising existing unused capacity within a school or schools,  • Extending the capacity of a school or schools,  • Provision of a new school or schools.  If additional accommodation is required, the aim to try and facilitate this, as much as possible, by way of expansion of existing schools rather than establishing new schools. The expansion of existing schools is consistent with wider Government objectives under Project Ireland 2040 for an increased emphasis on compact growth. In respect of post primary schools, new post primary schools must have a student enrolment capacity of 600-1,000 students and must be co-educational. A lower threshold of 400 students may apply to gaelcholáistí, having regard to the alternative of establishing an Irish-medium unit (aonad) in an English-medium school.  New schools are only established in areas of demographic growth as the resources available for school infrastructure have to be prioritised to meet the needs of areas of significant population increase so as to ensure that every child has a school place.  There are a number of active projects at primary and post-primary level across the school planning areas of Kilcock, Navan and Trim that will increase capacity. At primary level there are new school building projects in progress for S N na Trionoide Naofa, Ard Rí Community National School, Navan and Gaelscoil na Boinne, Trim. At post-primary level there are new school building projects in progress for Enfield Community College and Scoil Mhuire, Trim, both will provide for LTPE 1,000 and 6 SEN. In addition, there are extension projects in progress across the referred SPA’s for both primary and post-primary.  The Capital Programme details the school projects that are being progressed under Project Ireland 2040. The current status of large-scale projects being delivered under Project Ireland 2040, may be viewed on the Department's website at, www.gov.ie and this information is updated regularly. In addition, a list of large-scale projects completed from 2010 to date may also be viewed on the website.  My department will continue to liaise with Local Authorities in respect of their County Development Plans and any associated Local Area Plans with a view to identifying any potential long-term school accommodation requirements across school planning areas including Kilcock, Navan and Trim. ",
        "debateSection": {
          "showAs": "School Enrolments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_818",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_818.xml"
            }
          },
          "debateSectionId": "dbsect_818"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 917. Deputy Johnny Guirke asked the Minister for Education and Youth the status of all school building and extension projects approved for Meath under the school building programme, including timelines for planning, tender and construction stages. [60071/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_917",
        "questionNumber": 917,
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing, and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My department has invested over €431m in capital expenditure since 2020 in Meath, of which €424m relates to school buildings. This investment has supported the completion of 67 school building projects including 4 new school buildings. Currently 25 projects are in construction, of which 4 are new school buildings.  The current status of all projects is set out under item number ten at the following link (www.gov.ie) . ?This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.? ",
        "debateSection": {
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_819",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_819.xml"
            }
          },
          "debateSectionId": "dbsect_819"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 918. Deputy Johnny Guirke asked the Minister for Education and Youth the breakdown of the number of applications for school transport in County Meath for the 2025-2026 academic year; the number of pupils who were issued a bus ticket under the scheme; the number of pupils who were refused a place; and if she will make a statement on the matter. [60072/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_918",
        "questionNumber": 918,
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  Under the current terms of the School Transport Scheme, children are eligible for transport where they reside not less than 3.2km from and are attending their nearest primary school, and reside not less than 4.8km from and are attending their nearest post primary centre, as determined by the Department/Bus Éireann, having regard to ethos and language.  The closing date for school transport for the 2025/26 school year was 25 April 2025. The closing date for payments/inputting medical card details was 06 June 2025.  Children who are not eligible for school transport, but who completed the application process on time, will be considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Under the terms of the scheme, the availability of concessionary transport varies from year to year based on the capacity on the buses running on all the various routes and the number of eligible children accommodated on each route.  Due to the nature of concessionary transport for non-eligible children and the priority of providing places for eligible children, there may be an excess of demand over supply for concessionary places, in these cases Bus Éireann will allocate tickets for spare seats using an agreed selection process.  The data requested by the Deputy for applications in County Meath is provided in the attached table.     -      Meath - Mainstream applications for the 2025/2026 school year*        Total Number of mainstream tickets issued    6,428      Total Number of on time concessionary pupils who did not receive a ticket    87      Total Number of late concessionary pupils who did not receive a ticket    29      Total Number of late eligible pupils who did not receive a ticket    21      Total valid applications    6,565     *Position at 9 October 2025.   ",
        "debateSection": {
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_820",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_820.xml"
            }
          },
          "debateSectionId": "dbsect_820"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1041. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage for a breakdown of the distribution of the local property tax funding to each local authority for the past four years, in tabular form. [58614/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1041",
        "questionNumber": 1041,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1041 and 1042 together.  Local Property Tax (LPT) is administered and collected by the Revenue Commissioners and subsequently transferred into the Local Government Fund (LGF). The funds are redistributed, by my Department, to local authorities in accordance with the Government’s allocation policies.  In overall terms, LPT broadens the tax base and reduces the level of central funding required by local government, freeing up resources for expenditure in other areas. Funding allocations are decided in advance of collection, based on estimates (from the Revenue Commissioners) of the LPT yield in individual local authority areas for the following liability year. The annual LPT allocation currently stands at €696.7 million for 2025 and will further increase to €767.1 million for 2026.  The LPT allocation mechanism was changed in 2023 to allow for 100% of the estimated LPT yield to be retained locally within the local authority area where it is collected. Apart from the yield, there are three other factors that ultimately determine the annual LPT allocation for an individual local authority; namely, the local authority’s LPT baseline (minimum funding requirement), the amount of any surplus above an authority’s LPT baseline used to self-fund certain local housing or roads services, and, finally, the local adjustment factor.  Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer. Baselines for 2024 were adjusted in accordance with the recommendations of the 2023 Baseline Review working group, and furthermore, every authority received an increase in baseline funding of at least €1.5m. In total, LPT baselines increased by €75.4m at that time. Building on the baseline increases of 2024, there will be a further increase of €42m in 2026, which will ensure that any benefit from the revaluation of LPT will go directly to the sector where it is needed. In addition, the allocation model for 2026 is changed to allow those authorities with an LPT income above their baseline to retain a greater portion of the surplus for their own use, increasing from 22.5% to 31% of overall yield. Both changes together will lead to an increase in own use funding in the overall sum of €85.4m  Local authorities may vary the rate of Local Property Tax (LPT) in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. While recent changes to the LPT legislation will allow elected members to adjust the Local Adjustment Factor (LAF) upwards to a maximum of 25%; due to the timing of the legislation, commencement of this section will be delayed until the 2027 LPT liability year.  If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements. 25 local authorities resolved to increase their LPT rates above the basic rate for 2026, whereas 3 local authorities decided to reduce the basic rate locally. The overall net gain arising from the variation decisions for 2026 is €23.2m.  Detailed information regarding LPT allocations for each year, is published by my Department at the following link: [ www.gov.ie/en/collection/ea27d-local-property-tax-allocations/ ] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_908",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_908.xml"
            }
          },
          "debateSectionId": "dbsect_908"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1042. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage to outline the benefits the increased local property tax will have for each local authority; if each local authority will receive additional funding; and if he will make a statement on the matter. [58616/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1042",
        "questionNumber": 1042,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1041 and 1042 together.  Local Property Tax (LPT) is administered and collected by the Revenue Commissioners and subsequently transferred into the Local Government Fund (LGF). The funds are redistributed, by my Department, to local authorities in accordance with the Government’s allocation policies.  In overall terms, LPT broadens the tax base and reduces the level of central funding required by local government, freeing up resources for expenditure in other areas. Funding allocations are decided in advance of collection, based on estimates (from the Revenue Commissioners) of the LPT yield in individual local authority areas for the following liability year. The annual LPT allocation currently stands at €696.7 million for 2025 and will further increase to €767.1 million for 2026.  The LPT allocation mechanism was changed in 2023 to allow for 100% of the estimated LPT yield to be retained locally within the local authority area where it is collected. Apart from the yield, there are three other factors that ultimately determine the annual LPT allocation for an individual local authority; namely, the local authority’s LPT baseline (minimum funding requirement), the amount of any surplus above an authority’s LPT baseline used to self-fund certain local housing or roads services, and, finally, the local adjustment factor.  Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer. Baselines for 2024 were adjusted in accordance with the recommendations of the 2023 Baseline Review working group, and furthermore, every authority received an increase in baseline funding of at least €1.5m. In total, LPT baselines increased by €75.4m at that time. Building on the baseline increases of 2024, there will be a further increase of €42m in 2026, which will ensure that any benefit from the revaluation of LPT will go directly to the sector where it is needed. In addition, the allocation model for 2026 is changed to allow those authorities with an LPT income above their baseline to retain a greater portion of the surplus for their own use, increasing from 22.5% to 31% of overall yield. Both changes together will lead to an increase in own use funding in the overall sum of €85.4m  Local authorities may vary the rate of Local Property Tax (LPT) in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. While recent changes to the LPT legislation will allow elected members to adjust the Local Adjustment Factor (LAF) upwards to a maximum of 25%; due to the timing of the legislation, commencement of this section will be delayed until the 2027 LPT liability year.  If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements. 25 local authorities resolved to increase their LPT rates above the basic rate for 2026, whereas 3 local authorities decided to reduce the basic rate locally. The overall net gain arising from the variation decisions for 2026 is €23.2m.  Detailed information regarding LPT allocations for each year, is published by my Department at the following link: [ www.gov.ie/en/collection/ea27d-local-property-tax-allocations/ ] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_908",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_908.xml"
            }
          },
          "debateSectionId": "dbsect_908"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1043. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage when each local authority will be reimbursed for the storm damage clean-up of storm Éowyn; and if he will make a statement on the matter. [58617/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1043",
        "questionNumber": 1043,
        "answerText": " Minister for Housing, Local Government and Heritage  My Department undertakes the Lead Government Department role, as set out in the Strategic Emergency Management (SEM) Framework (2017), in relation to the coordination of national level responses to severe weather and flooding emergencies, where warranted. My Department's National Directorate for Fire & Emergency Management undertakes this role and works closely with local authority Severe Weather Assessment Teams and Met Éireann.  Local authorities are designated as the lead agencies for coordinating a response to flooding and severe weather emergencies. All local authorities have an established Severe Weather Assessment Team in place, monitoring Met Éireann weather warnings, High Tide Advisories and the European Flood Awareness System (EFAS) advisory warnings. Local authorities also have Severe Weather/ Flood Plans in place to support the response to weather emergencies.  Since 2009, my Department has made financial support of over €100 million available to assist local authorities in meeting the unbudgeted costs of clean-up and necessary immediate works, including for exceptional overtime payments, the hire of plant and heavy machinery, the purchase of materials required for the clean-up and the hire of contractors associated with significant severe weather emergency events.  This is in recognition of the exceptional nature of the activities carried out by local authorities in responding to these types of emergencies and the fact that the costs of these un-programmed activities could not be foreseen in annual expenditure planning. This practice is considered a vital enabler to underpin a rapid response by local authorities.  In the context of Storm Éowyn and the exceptional nature of the response and humanitarian assistance activities carried out by local authorities, clearly the costs of these activities were not budgeted for within existing resources. My Department has collated costs from all local authorities in relation to severe weather responses earlier this year and, in consultation with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, is working with local authorities to address relevant unbudgeted costs. This process should be concluded shortly.  It should be noted that funding the repair of public infrastructure is undertaken by the relevant Department in line with its sectoral responsibility. Capital costs associated with infrastructural damage, for example damage to the roads network and coastal protection infrastructure (where necessary), are funded under relevant sectoral arrangements. ",
        "debateSection": {
          "showAs": "Local Authorities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_909",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_909.xml"
            }
          },
          "debateSectionId": "dbsect_909"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1079. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage for an update on the number of social and affordable housing units currently under construction in Meath; and if he will outline projected completion dates for each development. [59100/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1079",
        "questionNumber": 1079,
        "answerText": " Minister for Housing, Local Government and Heritage  My Department publishes comprehensive programme-level statistics on a quarterly basis on social housing delivery activity by local authorities and Approved Housing Bodies in each local authority, including Meath. This data is available to the end of Q2 2025 and is published on the statistics page of my Department’s website at the following link: www.gov.ie/en/collection/6060e-overall-social-housing-provision/  My Department also publishes the Social Housing Construction Status Report (CSR), which provides details of social housing developments, their location and their funding programme that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The most recent publication was for Quarter 2 2025. The Q2 2025 CSR and all previous versions of the CSR are available on the Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/social-housing-construction-projects-status-reports/  A version of the Q2 2025 CSR file can also be downloaded for analysis by local authority, Approved Housing Body etc. at this link: www.opendata.housing.gov.ie/dataset/social-housing-construction-status-report-q2-2025  In relation to affordable housing, overall, nearly 16,900 affordable housing solutions have been delivered by our range of delivery partners since the launch of Housing for All, including 929 in Meath.  Meath County Council has received funding approval for ten schemes to deliver 131 affordable purchase homes by end 2027 with the support of the Affordable Housing Fund, of which 83 have been delivered.  Furthermore, six Approved Housing Body projects have been approved to date under the Cost Rental Equity Loan scheme. 64 Cost Rental homes have been delivered, and a further 168 are to be delivered by end 2026.  My Department continues to engage with all delivery partners to further the development of the affordable housing delivery pipeline for 2026 and beyond, and to ensure that the affordable housing programme responds effectively to needs identified at a local level. ",
        "debateSection": {
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_940",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_940.xml"
            }
          },
          "debateSectionId": "dbsect_940"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1080. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage if additional funding will be allocated to Meath County Council to accelerate the delivery of serviced sites in Navan, Trim and Kells under the Serviced Sites Fund; and if he will make a statement on the matter. [59101/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1080",
        "questionNumber": 1080,
        "answerText": " Minister for Housing, Local Government and Heritage  The Serviced Sites Fund, which was introduced in 2019 as a support to local authorities towards the provision of infrastructure required to facilitate the delivery of affordable housing, has been replaced by the Affordable Housing Fund (AHF). The AHF is available on an ongoing basis to all local authorities to assist towards the development costs (which may include infrastructure, site costs, construction costs, etc.) of providing affordable housing for purchase or for rent in urban areas where affordable housing need have been identified.  To date Meath County Council has received funding approval for ten schemes to deliver 131 affordable purchase homes by end 2027 with AHF support, with 83 of these homes delivered to date.  In addition to the AHF, the Programme for Government recognised the need to accelerate home building by unblocking infrastructure delays and coordinating investment in servicing zoned land.  Significant progress has been made in establishing the Housing Activation Office, which is central to achieving this objective. Senior specialists from Uisce Éireann, ESB Networks, the National Transport Authority, Transport Infrastructure Ireland and the local government sector are now in place. In addition, senior staff from my Department are assigned to the Office.  The Office is also developing a new Housing Infrastructure Investment Fund under the National Development Plan to support direct investment in infrastructure needed at a local level to unblock housing development. This new fund will operate in addition to existing investment programmes such as the Local Infrastructure Housing Activation Fund and the Urban Regeneration and Development Fund, which will continue to play a key role alongside the Housing Infrastructure Fund.  This joined-up approach will help accelerate housing delivery by unblocking infrastructure constraints and ensuring that investment is targeted to where it can have the greatest impact. This will help support local authorities in achieving their housing targets in line with the Revised National Planning Framework.  While I cannot comment on any individual sites in advance of the opening of the Housing Infrastructure Fund, there will be close engagement with stakeholders, including local authorities, to identify priority areas for investment.  Separately, there is also a Ready to Build Scheme, launched in September 2022 and funded by the Croí Cónaithe Towns Fund. Under the Scheme, local authorities can make serviced sites in towns and villages available to potential individual purchasers to build a home.  Under the Scheme, local authorities identify suitable sites in their ownership or purchase sites in towns and villages and make them available for sale for the purpose of building a principal private residence. Once serviced, the local authority will make the site available for sale at a discount on the market value of the site. The level of discount to the individual will depend on the level of servicing cost incurred by the local authority before the sale of the site, but will not exceed €30,000.  The scheme is managed and administered by local authorities on behalf of my Department. As no sites have fully completed the sale process to date in Meath, no claim for net recoupment has been submitted to the Department.  A review of the schemes under the Croí Cónaithe Towns Fund, including the Ready to Build Scheme, was undertaken in 2024. That review has been completed and is under consideration. ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_941",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_941.xml"
            }
          },
          "debateSectionId": "dbsect_941"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1081. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage for details of any further delays experienced in the planning process for housing developments in Meath; the supports available to local authorities to streamline approvals; and if he will make a statement on the matter. [59102/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1081",
        "questionNumber": 1081,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The operation of the planning system in County Meath would, in the first instance, be a matter for Meath County Council and under section 30 of the Planning and Development Act 2000, as amended I am precluded from discussing individual cases that may or may not be delayed.  It should be noted however, that my Department has overseen considerable legislative and structural reform of the Irish planning system over the past two years.  The National Planning Framework (NPF) has been revised to reflect Ireland’s housing and infrastructure goals associated with a growing population and economy, and provides the planning system with a strategic plan to shape the future growth and development of our Country to 2040.  In addition, the Planning and Development Act 2024 (the Act) represents the most significant update of planning legislation in a quarter century and contains many impactful reforms.  The Act introduces statutory time periods for decision making for An Coimisiún Pleanála (An Coimisiún) for the first time. Increased resource allocation to An Coimisiún Pleanála has reduced the number of cases on hand from 3,638 in May 2023 to 1,362 cases in July 2025, which is a 62.5% decrease. The new Act also contains important reforms in relation to Judicial Review (JR):-  • removing the requirement to apply for leave to apply for JR, which reduces time and removes unnecessary legal costs to all parties.  • requires that an application for JR may only be made on the grounds of challenge raised by the applicant in the statement of grounds filed with their application.  • provides that an applicant for JR will not be permitted to plead a ground in JR proceedings unless they have a sufficient interest in the matter to which the ground relates.  Alongside the above reforms, my Department is also currently reviewing exempted development Regulations, developing a Planning Excellence Framework and implementing the Ministerial Action Plan on Planning Resources, which covers a range of measures to address resourcing challenges across the sector.[ ] ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_942",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_942.xml"
            }
          },
          "debateSectionId": "dbsect_942"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1082. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage the number of vacant or derelict properties identified in County Meath; and the number of these that have been brought back into use under the croí cónaithe or related schemes. [59103/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1082",
        "questionNumber": 1082,
        "answerText": " Minister for Housing, Local Government and Heritage  Addressing vacancy and dereliction is a key priority for Government.  The Vacant Homes Action Plan, published in January 2023, set out the various actions being pursued to return vacant properties back into use as homes. In March, I published the 2025 Progress Report which shows the significant progress that is being made and it is available on my Department's website at the following link: www.gov.ie/en/publication/df86c-vacant-homes-action-plan-2023-2026/  Data in relation to vacant properties is available from a number of sources such as the Central Statistics Office (CSO), Census 2022 and GeoDirectory.  The CSO has recently developed a new statistical release on residential vacancy. The release, published on 24 September 2025, provides information on the extent of residential vacancy in 2022 and 2023, using ESB data on metered residential electricity consumption, with future regular publications planned.  In the release, the CSO note a national vacancy rate of 3.3% at the end of Q4 2023, down from 3.6% in Q4 2022. Data is provided at a national, local authority and local electoral level, including for Meath County Council.  In the latest GeoDirectory Residential Buildings Report for Q2 2025, the average vacancy rate across Ireland had dropped to 3.7%, the lowest rate recorded since 2013; a local authority breakdown is also provided.  My Department has also supported local authorities to collate data on vacant and derelict properties in settlements in their administrative areas. Almost all local authorities, including Meath County Council, now have a database of vacant properties which they can update on an ongoing basis. The database is not intended to be a comprehensive count of every vacant and derelict property in their administrative area. It is used by the local authority to engage with property owners and work with them to bring those properties back into use.  Under section 8 of the Derelict Sites Act 1990, a local authority is obliged to maintain a Derelict Sites Register and shall enter on to the register the particulars of any land in their functional area which, in their opinion, is a derelict site. Under Section 23 of the Act, local authorities may apply a Derelict Sites Levy (DSL), on an annual basis, for sites entered on the derelict sites register on the 1 January of that year. Data is provided on the number of properties on Derelict Sites Registers in Meath in 2022 and 2023. My Department is currently engaged with all local authorities in the process of collecting and collating the 2024 annual returns.     Local Authority    No. of Derelict Sites on Register at 31 December 2022    No. of Derelict Sites on Register at 31 December 2023      Meath    37    34       While varying levels and rates of vacancy are indicated in the different data sources, the overall trend is downwards and vacancy levels are declining.  One of the key measures in the Vacant Homes Action Plan supporting the refurbishment of older, vacant and derelict buildings for housing is the Vacant Property Refurbishment Grant. The grant can provide up to €50,000 for the refurbishment of vacant properties for use as homes and up to €70,000 where the property is derelict.  The grant has been, and continues to be, very successful in bringing vacant and derelict properties back into use and making the refurbishment of these properties an affordable option for buyers across the country.  My Department publishes data on the grant on its website on a quarterly basis, providing breakdowns by local authority. This data can be accessed at the following link: [ Vacancy grant statistics ]. ",
        "debateSection": {
          "showAs": "Vacant Properties",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_943",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_943.xml"
            }
          },
          "debateSectionId": "dbsect_943"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1137. Deputy Johnny Guirke asked the Minister for Housing, Local Government and Heritage the number of local authority home loan applications submitted to Meath County Council to date in 2025; and the length of time applications are taking for the mortgage to be drawn down, in tabular form. [60109/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1137",
        "questionNumber": 1137,
        "answerText": " Minister for Housing, Local Government and Heritage  Applications for a Local Authority Home Loan are made through the individual Local Authorities and the final decision on loan approval is a matter for the relevant local authority and its Credit Committee on a case-by-case basis.  Decisions on all housing loan applications must be made in accordance with the Regulations establishing the scheme and the Credit Policy that underpins the scheme, in order to ensure prudence and consistency in approaches in the best interests of both borrowers and the lenders, the local authorities.  Information on the number of persons making applications for a LAHL to local authorities or the average processing time for an application is not held by my Department. Loan drawdown is a borrower led process where an approved borrower will draw down their loan when they source a suitable property for purchase. Data on the length of time taken by borrowers to draw down their loan approval is not collected.  My Department publishes information on the number and value of (i) local authority loan approvals and (ii) local authority loan drawdowns. Local authority approval means that an official letter of offer has been sent to a borrower (and therefore relates to a specific property and loan amount).  Information on drawdowns, approvals, average drawdowns, and average approvals for Local Authority Home Loans [and its predecessor] are available on my Department’s website at the following link: www.gov.ie/en/collection/42d2f-local-authority-loan-activity/#local-authority-loans-approvedpaid ",
        "debateSection": {
          "showAs": "Local Authorities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_986",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_986.xml"
            }
          },
          "debateSectionId": "dbsect_986"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1384. Deputy Johnny Guirke asked the Minister for Justice, Home Affairs and Migration the number of safe homes in County Meath; and if he will make a statement on the matter. [60097/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1384",
        "questionNumber": 1384,
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence and ensuring that victims and survivors receive the support and care they need is an absolute priority for me.  Since its establishment last year, Cuan has been working to accelerate the delivery of safe accommodation across the country.  Following a request from me, Cuan worked with services and partners to assess and review progress and identify a series of actions to accelerate delivery and to bring safe accommodation on stream as quickly as possible to meet the needs of those fleeing violence.  On foot of this review, completed in spring 2025, and following agreement with me, the following will be delivered:  • 52 new family refuge units by the end of 2026  • 45 new safe homes by the end of 2026  • 50 new units under construction by the end of 2026  At the outset of the zero-tolerance strategy there were 49 safe homes in place. Therefore, by the end of 2026 it is envisaged to have 94 safe homes and 193 refuge units completed bringing total safe accommodation to 287, with 50 further refuge units under construction.  Given the specific nature of the information requested by the Deputy, I have referred it to Cuan for direct response as this relates to work being carried out under their remit. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1177",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1177.xml"
            }
          },
          "debateSectionId": "dbsect_1177"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1385. Deputy Johnny Guirke asked the Minister for Justice, Home Affairs and Migration the number of new Gardaí assigned to all stations in county Meath in 2025; and if he will make a statement on the matter. [60098/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1385",
        "questionNumber": 1385,
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under the Policing, Security and Community Safety Act 2024, which includes the allocation and deployment of Garda resources and personnel throughout the State. As Minister, I have no role in these independent functions.  In the interest of transparency, An Garda Síochána publish information in relation to the allocation of Probationer Gardaí by Division and Station, including for county Meath. This is publicly available and can be found at the following link: www.garda.ie/garda/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/garda-strength-breakdown-2025.html  The Deputy should select the most recently available date and then select the file titled “Allocation of Probationer Gardai by Division and Station 2015 to the most recent date \".  It should be noted that the allocation of newly attested Gardai must take account of their ongoing development and training needs. In addition, the allocation of newly attested Gardaí from Templemore allows for currently serving Garda members to move on transfer to other Divisions across the country and into specialist units. ",
        "debateSection": {
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1178",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1178.xml"
            }
          },
          "debateSectionId": "dbsect_1178"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1458. Deputy Johnny Guirke asked the Minister for Agriculture, Food and the Marine the number of farmers in County Meath waiting on ACRES payment for 2025; and if he will make a statement on the matter. [60100/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1458",
        "questionNumber": 1458,
        "answerText": " Minister for Agriculture, Food and the Marine  A total of over €517.2m has issued to date to participants of the Agri-Climate Rural Environment Scheme (ACRES).  Payments in respect of scheme year 2025 to participants in Meath and across the country are due to commence in the coming weeks. ",
        "debateSection": {
          "showAs": "Agriculture Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1246",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1246.xml"
            }
          },
          "debateSectionId": "dbsect_1246"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1538. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality for an update on required staffing levels for education centres such as play schools and creches; and to outline any plans to attract additional qualified staff to County Meath; and if she will make a statement on the matter. [59115/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1538",
        "questionNumber": 1538,
        "answerText": " Minister for Children, Disability and Equality  In setting regulatory requirements for early years services, the primary consideration must be children’s health, safety and well-being.  The minimum adult-to-child ratios for preschool services are set out in Schedule 6 of the Child Care Act 1991 (Early Years Services) Regulations 2016. The ratios set the maximum number of children allowed per staff member working directly with the children, and services can choose to have fewer children per staff member if they wish.  The minimum required ratios of adults to children in preschool services for full-day care or part-time provision are: 1:3 for children under 1 year old; 1:5 for children aged between 1 and 2 years old; 1:6 for 2 year olds; and 1:8 for preschool children aged between 3 and 6.  For children in sessional (less than 3.5 hours) preschool provision who are aged between 2 years 6 months and 6 years old, there is a minimum adult-child ratio of 1:11. This sessional minimum ratio of 1:11 applies to children participating in the Early Childhood Care and Education (ECCE) programme, for which the eligible age group is children between 2 year 8 months and 5 year 6 months. There are no plans at present to revise the minimum adult-to-child ratios for preschool services.  School age childcare (SAC) services are required to operate within regulatory minimum adult-to-child ratios as set out in the Child Care Act 1991 (Early Years Services) (Registration of School Age Services) Regulations 2018. The minimum required ratio of adults to children in SAC services is 1:12. The 1:12 ratio was agreed following consultation with an expert group on SAC standards, which included a range of sectoral representatives among its members.  In line with the commitment in the First 5: Implementation Plan 2023-2025 (action D.2.A.5), the Department has recently commenced the process of drafting comprehensive regulations for SAC services, building on the initial 2018 registration regulations. As part of this process, the Department is also reviewing the legislation underpinning the regulation of SAC. The Department recently concluded a public consultation which included questions on the adult-to-child ratios.  Childminding-specific Regulations came into effect in September 2024, and are designed to be proportionate and appropriate to the home and family setting in which childminders work. These Regulations ensure there are no more than 6 children in the care of the childminder at any given time, with no more than 2 children under the age of 15 months.  It is acknowledged many early learning and childcare services report recruitment and retention challenges. In general, these challenges are not caused by insufficient supply of staff, but by high levels of turnover.  In a very competitive labour market and with low levels of unemployment, recruitment and retention is a challenge for all employers.  Improvements in pay is certainly key to improving recruitment and retention rates, as is the full implementation of Nurturing Skills.  Pay is one of a number of issues impacting the early learning and care and school-age childcare workforce. The level of pay for early years educators and school-age childcare practitioners does not reflect the value of their work for children, families, society and the economy.  Although the Government is the primary funder of the sector, it is not the employer and cannot directly set wages or conditions.  The Joint Labour Committee is the formal mechanism established by which employer and employee representatives can negotiate minimum pay rates, which are set down in Employment Regulation Orders.  Outcomes from the Joint Labour Committee process are supported by Government through Core Funding. In this programme year 2025/26 Core Funding has increased by 6% to €350 million with an additional €45 million in ring-fenced Core Funding provided to support early learning and care services in meeting the increased cost of minimum pay rates in the sector.  As recently announced, the Minister of State for Employment, Small Business and Retail Alan Dillon has signed new Employment Regulation Orders for Early Years Educators and School-Age Practitioners.  The Orders commenced on 13 October 2025. They provide for an average of 10% increase to minimum hourly rates of pay. It is estimated that 67% of those working in the sector will see their wages increase as a result of the new minimum pay rates.  The Government remains committed to ‘continue to implement Employment Regulation Orders to attract and retain early years educators’, as provided for in the Programme for Government.  \"Nurturing Skills: The Workforce Plan for Early Learning and Care and School-Age Childcare, 2022-2028\" aims to strengthen the ongoing process of professionalisation for those working in the sector. One of the five \"pillars\" of Nurturing Skills comprises commitments aimed at supporting recruitment, retention and diversity in the workforce, and it includes actions to raise the profile of careers in the sector.  The Plan includes role profiles, a career framework and commitments to support early years educators to up-skill and develop their careers. It also includes commitments to reduce staff turnover, to attract graduates to enter and remain in the sector along with actions to actively promote careers in Early Learning and Care and School Age Childcare.  Officials also continue to discuss issues of recruitment and retention with stakeholders through a Sub-Group of the Early Learning and Childcare Stakeholder Forum.  The general consensus of the Group is that pay is the single biggest issue but the Group continues to identify other actions, including:  * a Student Fast-track Process for recognition of studies to work in service out of term,  * the assessment of unfinished qualifications, where people who may have started a relevant qualification but did not get to finish it, can have what they completed assessed for meeting qualification requirements  * an agreement to promote careers in the sector. ",
        "debateSection": {
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1318",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1318.xml"
            }
          },
          "debateSectionId": "dbsect_1318"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1539. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality if additional capital funding will be made available to early years providers in County Meath to expand or upgrade facilities participating in the ECCE program; and if she will make a statement on the matter. [59117/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1539",
        "questionNumber": 1539,
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable Early Learning and Care and School Age Childcare is a key priority of Government.  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile 2023/24 shows that the estimated number of enrolments increased by approximately 19% from the 2021/22 programme year.  The Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding funds services based on the number of places available. This provides stability to services, and reduces the risk associated with opening a new service or expanding an already existing service.  The Government is also supporting the expansion of capacity through capital funding. The Building Blocks Extension Grant Scheme is designed to increase capacity in the 1–3-year-old, pre–Early Childhood Care and Education, age range for full day care. Core Funding Partner Services could apply for capital funding to physically extend their premises or to construct or purchase new premises. The Scheme will deliver up to 1,500 full-day care places for 1- to 3-year-olds. The shortlisted services are now working with the Chief State Solicitor’s Office in completing the legal formalities of the scheme. I look forward to seeing these projects progress over the coming months.  The Programme for Government commits for the first time to provide capital investment to build or purchase state-owned early learning and childcare facilities, to create additional capacity in areas where unmet need exists. State ownership of facilities is a very substantial and significant development and offers the potential for much greater scope to influence the nature and volume of provision available and to ensure better alignment with estimated demand. This work will be supported through capital investment under the revised National Development Plan.  As announced in the context of Budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through a further Building Blocks scheme and a number of quality initiatives including supports to childminders. ",
        "debateSection": {
          "showAs": "Early Childhood Care and Education",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1319",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1319.xml"
            }
          },
          "debateSectionId": "dbsect_1319"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1540. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality when she plans to increase the capitation rate for ECCE providers to reflect on the rising operational and staff costs in County Meath; and if she will make a statement on the matter. [59118/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1540",
        "questionNumber": 1540,
        "answerText": " Minister for Children, Disability and Equality  ECCE is a free two-year preschool programme available to all children within the eligible age range. ECCE is a play-based learning programme. The programme runs from September to June each year, aligned with the primary school calendar. ECCE is not mandatory, but is very successful, with an estimated 96% of children in the eligible age range attending.  To deliver the ECCE Programme, preschool providers receive a capitation of €69 per child per week. This was increased from €64.50 in September 2018.  When Core Funding services was introduced in 2022, services previously in receipt of ECCE standard capitation (of €69 per week per child) received an addition €9.75 per child per week through Core Funding – an increase of 9.5%. For the coming programme year, ECCE capitation and Core Funding combined will be €80.40.  Core Funding has seen consistent increased State investment to the sector year on year and is set in year 4 to be worth over €390 million contingent on the establishment of new minimum rates of pay in the sector through updated Employment Regulation Orders. This is an increase of over 50% since the scheme began in September 2022 with an allocation of €259 million.  The graduate premiums provide additional funding on the basis of graduate leadership in a service. Both the Graduate Lead Educator Premium and the Graduate Manager Premium are paid out a rate of €4.44 per graduate-led hour for early learning and childcare provision.  The targeted measures consist of a flat rate top-up for sessional-only services, a minimum base rate allocation and a maximum base rate allocation. The flat rate top-up for sessional-only services is paid out at an annual rate of €5,000 per service or a weekly rate of €96.15 to services who are registered with Tusla to offer only sessional provision.  The minimum base rate allocation is currently set at €14,400. Any centre-based service whose base rate allocation (and flat rate allocation where applicable) falls below this level will see their grant automatically topped up to the minimum allocation.  The maximum base rate allocation is currently set at €450,000. No service will receive more than this amount in respect of their capacity. The Graduate Premiums and Staff Funding Additional Contribution are applied separately and can bring a services allocation above the minimum or maximum value.  This year, the Staff Funding Additional Contribution is a newly introduced element of the grant designed to distribute the ring-fenced funding for improving staff pay and conditions, contingent on the establishment of updated Employment Regulation Orders. This funding is ring-fenced for staff pay and conditions and can only be used for this purpose, and €45 million is available for this purpose.  The calculation of the Staff Funding Additional Contribution per service is linked to the staffing requirements set out by regulations and reflects that the funding that has been available for graduate-led provision for the previous three years can and should be facilitating higher rates of pay for graduates.  The release of the funding is contingent on the establishment of updated Employment Regulation Orders by the independent Joint Labour Committee.  It is important to note that although there are various elements used to derive the grants for individual services, the eligible areas of expenditure of the Core Funding grant are much broader. Services can choose how to spend their Core Funding grant in accordance with the approved areas of expenditure outlined in the Funding Agreement. The Staff Funding Additional Contribution is the only element of the grant which has a prescribed use.  The year 4 allocation reflects increases secured in Budget 2025 to facilitate 3.5% capacity growth and to ensure that providers have increased income to continue to be able to meet rising costs whilst maintaining an effective fee freeze.  Unlike other funding streams within the Department, a place does not need to be filled for a service to receive funding, but the service does need to have the necessary staffing in place to meet the regulatory adult to child ratios.  Since September 2025, services receive a minimum of €80.40 per ECCE child per week. This is before the application of graduate premiums, targeted measures, and the ring-fenced funding for improving staff pay and conditions. ",
        "debateSection": {
          "showAs": "Early Childhood Care and Education",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1320",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1320.xml"
            }
          },
          "debateSectionId": "dbsect_1320"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1541. Deputy Johnny Guirke asked the Minister for Children, Disability and Equality if she will provide details on staffing shortages within the early years and ECCE sector in County Meath; the supports being provided to recruit and retain qualified staff; and if she will make a statement on the matter. [59119/25] ",
        "by": {
          "memberCode": "Johnny-Guirke.D.2020-02-08",
          "showAs": "Johnny Guirke",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Johnny-Guirke.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1541",
        "questionNumber": 1541,
        "answerText": " Minister for Children, Disability and Equality  In a very competitive labour market and with low levels of unemployment, recruitment and retention is a challenge for all employers.  It is acknowledged many early learning and childcare services report recruitment and retention challenges. In general, these challenges are not caused by insufficient supply of staff, but by high levels of turnover.  Data from the 2024 Annual Early Years Sector Profile survey shows the national turnover rate for the sector was approximately 25.8%, however the turnover rate for County Meath was 21.1%. of which, nearly 35% of the turnover rate for Meath reflects staff moving from one provider to another.  Improvement in pay is certainly key to improving recruitment and retention rates, as is the full implementation of Nurturing Skills.  Pay is one of a number of issues impacting the early learning and care and school-age childcare workforce. The level of pay for early years educators and school-age childcare practitioners does not reflect the value of their work for children, families, society and the economy.  Although the Government is the primary funder of the sector, it is not the employer and cannot directly set wages or conditions.  The Joint Labour Committee is the formal mechanism established by which employer and employee representatives can negotiate minimum pay rates, which are set down in Employment Regulation Orders.  Outcomes from the Joint Labour Committee process are supported by Government through Core Funding. In this programme year 2025/26 Core Funding has increased by 6% to €350 million with an additional €45 million in ring-fenced Core Funding provided to support early learning and care services in meeting the increased cost of minimum pay rates in the sector.  As recently announced, the Minister of State for Employment, Small Business and Retail Alan Dillon has signed new Employment Regulation Orders for Early Years Educators and School-Age Practitioners.  The Orders commenced on 13th October 2025. They provide for an average of 10% increase to minimum hourly rates of pay. It is estimated that 67% of those working in the sector will see their wages increase as a result of the new minimum pay rates.  The Government remains committed to ‘continue to implement Employment Regulation Orders to attract and retain early years educators’, as provided for in the Programme for Government.  \"Nurturing Skills: The Workforce Plan for Early Learning and Care and School-Age Childcare, 2022-2028\" aims to strengthen the ongoing process of professionalisation for those working in the sector. One of the five \"pillars\" of Nurturing Skills comprises commitments aimed at supporting recruitment, retention and diversity in the workforce, and it includes actions to raise the profile of careers in the sector.  The Plan includes role profiles, a career framework and commitments to support early years educators to up-skill and develop their careers. It also includes commitments to reduce staff turnover, to attract graduates to enter and remain in the sector along with actions to actively promote careers in Early Learning and Care and School Age Childcare.  Officials also continue to discuss issues of recruitment and retention with stakeholders through a Sub-Group of the Early Learning and Childcare Stakeholder Forum.  The general consensus of the Group is that pay is the single biggest issue but the Group continues to identify other actions, including:  * A Student Fast-track Process for recognition of studies to work in service out of term,  * The assessment of unfinished qualifications, where people who may have started a relevant qualification but did not get to finish it, can have what they completed assessed for meeting qualification requirements  * An agreement with providers to promote careers in the sector. ",
        "debateSection": {
          "showAs": "Early Childhood Care and Education",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1321",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1321.xml"
            }
          },
          "debateSectionId": "dbsect_1321"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}