{
  "head": {
    "counts": {
      "questionCount": 3135,
      "resultCount": 3135
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1021. Deputy Michael Lowry asked the Minister for Health if she will address the current care pathway for women and their partners experiencing pregnancy loss (details supplied) in the Midwest, specifically in Limerick Maternity Hospital, where those miscarrying are assessed and treated in the same unit as women receiving antenatal care. [69789/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_847",
          "debateSectionId": "dbsect_847",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_847.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1021",
        "questionNumber": 1021
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly.   ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_973.xml"
            }
          },
          "debateSectionId": "dbsect_973",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_973"
        },
        "questionNumber": 1120,
        "date": "2025-11-12",
        "showAs": " 1120. Deputy Michael Lowry asked the Minister for Health if she will provide an update on the provision of special needs dental services in Nenagh; if she is aware that the post of special needs dentist has been vacant for over a year, with no replacement appointed despite advertisements; the number of children, including those with autism, currently waiting for dental treatment under sedation or anaesthetic in the Nenagh area; the contingency plans which are in place to ensure access to appropriate dental care for these children; and if she will make a statement on the matter. [62229/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1120"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 286. Deputy Michael Lowry asked the Minister for Transport if he is considering a proposal (details supplied); and if the inclusion of commercial bus operators in the under-9 free travel scheme is under review. [58242/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_286",
        "questionNumber": 286,
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA), which regulates fares for services provided under Public Service Obligation (PSO) contracts, plays a central role in achieving this.  As the Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of €940m, provides a significant 43% uplift in the PSO allocation from 2025 to further support subsidised bus and rail services across Ireland, as well as maintaining targeted fares initiatives such as the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19-25, as part of the NTA's National Fares Strategy.  The previous Government decision did not include provisions for extending free travel for children under 9 to commercial bus operators. While the NTA is responsible for licensing commercial bus services, any decisions regarding fares charged by these services are managed by commercial operators themselves, who largely operate without any State subvention. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_261",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_261.xml"
            }
          },
          "debateSectionId": "dbsect_261"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1743. Deputy Michael Lowry asked the Minister for Health if her attention has been drawn to a series of matters in relation to the recently published Standards of Proficiency and Education and Training Requirements for the profession of psychotherapy by CORU (details supplied); and if she will exercise her powers under the Health and Social Care Professionals Act 2005 to ensure that, at a minimum, current standards of training and professional practice are maintained, as recommended by an organisation and its ten member organisations representing the profession nationally. [58246/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1743",
        "questionNumber": 1743,
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I propose to take Question Nos 1641,1679,1690 to 1692, inclusive, 1705,1743,1839,1874,1901,1990 and 2048 together.  As the Deputies are aware, CORU is Ireland’s multi-profession health and social care regulator. CORU’s role is to protect the public by regulating the health and social care professions designated under the Health and Social Care Professionals Act 2005 (as amended).  Counsellors and psychotherapists perform a vital role, providing therapeutic care to often vulnerable people. Regulation is being introduced to these professions to protect the public, ensuring that care provided is of a consistently high standard and always by suitably qualified individuals.  The Counsellors and Psychotherapists Registration Board (CPRB) was established in 2019 and since that time has been working to progress regulation of both professions.  The CPRB undertook extensive research, analysis, and public consultation as part of the process of introducing statutory regulation for these professions. This work has been informed by, and is in line with, requirements set out in the EU Proportionality Test Directive (transposed into Irish law on 19 August 2022 (S.I. No. 413/2022)).  The public consultation process received over 700 submissions, including from educators, professional bodies and existing practitioners. This comprehensive process recognised the differences in scope and complexity of practice between the two professions and ensures that the threshold standards and qualification levels set for each accurately reflect the competencies required for safe and effective practice, while strengthening public protection.  In line with the CPRB’s statutory responsibility to assess, balance and consider all perspectives before reaching a final evidence-based decision, the Board carefully considered every submission received and determined the final Standards and Criteria that will underpin entry to the registers for both counsellors and psychotherapists. This open, structured and inclusive process demonstrates CORU’s clear commitment to transparency, accountability, evidence-based decision-making, proportionality and, above all, the protection of the public.  A comprehensive consultation report has been published by CORU, setting out the process followed, the key themes raised in submissions, and the rationale for the final decisions taken by the Board and is accessible at Counsellors & Psychotherapists Registration Board - Coru  In July 2025 CORU published two key documents for each of these professions:  Standards of Proficiency • : These outline the threshold knowledge and skills required for entry to the register. They define what a counsellor or psychotherapist must be able to do at the point of entry into practice.  Criteria for Education and Training Programmes • : These set out the systems and processes education providers must implement in the design and management of education and training programmes. They provide assurance that all graduates have achieved all the Standards of Proficiency upon successful completion of an education and training programme.  The adopted Standards and Criteria reflect the threshold knowledge and skills required for safe practice at entry to the professions of Counselling and Psychotherapy. The introduction of consistent standards for the education and training of counsellors and psychotherapists marks a significant milestone, ensuring that those seeking support can have confidence in accessing appropriately trained and qualified practitioners.  The Standards of Proficiency set by the Board may not fully reflect how an existing practitioner sees his or her current practice. This is because the Standards set only the knowledge and skills needed on day one for practice. They are not meant to wholly reflect the practice of existing practitioners.  For existing practitioners, there is provision in the Health and Social Care Professionals Act 2005 (as amended) to make registration applications (when the register opens) through the grandparenting process, also known as the Section 91 registration pathway.  The Board also highlighted that the standards do not set post-qualifying standards of practice for registrants. This would include such areas as CPD and supervision post qualification. Requirements for registrants will be addressed through the Code of Professional Conduct and Ethics that will be set in advance of the opening of the register and will be subject to a public stakeholder consultation.  On issues such as personal therapy and clinical supervision CORU’s competency-based framework ensures that essential attributes such as self-awareness, reflexivity, and ethical judgment are achieved through validated educational methods, including clinical supervision, reflective practice, and experiential learning.  CORU’s criteria mandate structured, practice-integrated supervision that enables supervisors and educators to directly evaluate proficiency and ensure safe practice. This approach provides robust, verifiable safeguards while maintaining flexibility for different theoretical modalities. The standards set the threshold for safe and effective practice, without restricting innovation or allowing education providers to exceed these minimum requirements at their discretion.  Regarding professional mobility, the profession of psychotherapist falls under the general system of recognition within the European Union, whereby each Member State determines the required training standards and assesses applications for recognition of qualifications from other Member States through a comparative evaluation. Where substantial differences in qualifications exist, compensation measures may be required.  Irish trained psychotherapists who move to another Member State will be assessed under the general system of recognition in the same way that other Irish trained health professionals are assessed when moving to another Member State, for example physiotherapists and social workers. There is no standardisation of education and training for psychotherapists in the EU and each Member State which regulates the profession does so in a manner which reflects the context in that State.  It is important to note that neither counselling nor psychotherapy is currently a statutorily regulated profession in the UK, including Northern Ireland. This means there are no legal restrictions preventing someone from practising as a counsellor or psychotherapist in these jurisdictions.  When the registers open in Ireland the CPRB will become the competent authority responsible for assessing international applicants who wish to practise as counsellors or psychotherapists in Ireland.  At that stage, any person, including those qualified in the UK or Northern Ireland, will be able to apply to have their qualifications assessed to demonstrate that they meet the threshold standards of proficiency, meaning the required knowledge, skills, and competence to practise safely and effectively in Ireland.  I am confident that CORU’s work will bring clear benefits for public protection. The framework has been designed to strengthen standards of practice while ensuring that training pathways and workforce supply are not adversely affected.  I am assured that CORU will continue to engage closely with education providers, professional bodies, and other stakeholders as the regulatory process advances, keeping public protection at the centre of this work.  I am eager to see this work progressed so that two very important professions are finally regulated, in the interest of public protection. ",
        "debateSection": {
          "showAs": "Medical Qualifications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1409",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1409.xml"
            }
          },
          "debateSectionId": "dbsect_1409"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_283",
        "answerText": " Minister for Justice, Home Affairs and Migration  Getting more Gardaí on our streets to prevent crime is my first priority as Minister for Justice.  This Government is committed to ensuring that An Garda Síochána has the resources it needs to fight crime and a strengthened, well-resourced Garda organisation is central to this policy.  The Garda Vote in Budget 2026 includes unprecedented funding of €2.59 billion which will support the continued recruitment of Garda members and staff.  The Recruitment and Training Capacity Group was established in 2024 to support the achievement of increased recruitment. The Group has now completed its work and has published their report, which details the changes that have been made by An Garda Síochána and publicjobs to their end-to-end processes for Garda Trainee recruitment, shortened recruitment timeframes, reform of the physical competency test, introduction of an Assessment Centre approach to elements of recruitment and two recruitment competitions launched in 2025. These changes have significantly improved the situation on recruitment and the Group is satisfied that the process has been made much more efficient. The group’s final report is available on my Department’s website at the following link:  www.gov.ie/en/department-of-justice-home-affairs-and-migration/publications/an-garda-s%C3%ADoch%C3%A1na-recruitment-training-capacity-group-report-september-2025/  The Group has recommended that research be conducted to gain further insight on the decision-making process of potential Garda recruits, to help inform further enhancements to the recruitment process.  The Report also recommends that a Working Group be established to consider specifically the case for a second training college and the role that the tertiary system could play in the delivery of Garda training. I've asked for that work to be expedited.  In respect of the Garda College in Templemore works commenced on the campus during the summer of 2025 and will be overseen by OPW. The intention is that when this work is completed, the College will be able to accommodate up to 250 trainees per intake. ",
        "date": "2025-10-09",
        "questionNumber": 283,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_248",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_248.xml"
            }
          },
          "debateSectionId": "dbsect_248",
          "showAs": "An Garda Síochána"
        },
        "showAs": " 283. Deputy Michael Lowry asked the Minister for Justice, Home Affairs and Migration in view of increased recruitment, the plans being considered to train and accommodate trainee Gardaí; and to detail any proposal to expand the facilities at Templemore. [54199/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can advise the Deputy that the Programme for Government commits to developing an appropriate mechanism to allow additional time for students with specific needs and in certain circumstances, and also to ensure that those who use assistive technology can do so in State examinations.  The State Examinations Commission (SEC) has responsibility for the operation and delivery of the State examinations, and facilitates access to the examinations through its scheme of reasonable accommodations at the certificate examinations, otherwise known as the RACE scheme.  I welcome that the SEC is currently undertaking a comprehensive review of the scheme in which it intends to give consideration to these and all relevant issues.  I have asked the SEC to respond directly to the Deputy with further detail about the RACE scheme and the ongoing system wide review of the scheme. ",
        "by": {
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "date": "2025-10-08",
        "questionNumber": 202,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_169",
          "debateSectionId": "dbsect_169",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_169.xml"
            }
          },
          "showAs": "State Examinations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_202",
        "showAs": " 202. Deputy Michael Lowry asked the Minister for Education and Youth the progress that has been made, and if a final decision will be made, on the provision of additional time allocation for dyslexic students, taking part in State exams with a professional diagnosis, that have not received a language exemption from the school management or her Department; and if she will make a statement on the matter. [54021/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 42. Deputy Michael Lowry asked the Minister for Climate, Energy and the Environment the reason, in the current consultation process on National Territory Mapping for Renewable Electricity, the maps provided are only available in static PDF format with shaded areas, without scalable or detailed layers showing towns, townlands and other reference points; if he will confirm the reason these maps have not been made available as layers on the Government's own Tailte Éireann National Geospatial Data Hub; if he will commit to publishing these datasets in an accessible and interactive format to enable full public engagement; and if he will extend the consultation deadline in light of the difficulty members of the public currently face in interpreting the proposed areas.  [53551/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_66.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_66",
          "showAs": "Renewable Energy Generation",
          "debateSectionId": "dbsect_66"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_42",
        "answerText": " Minister for Climate, Energy and the Environment (Deputy Darragh O'Brien)  The coordinated mapping of the national territory for the purposes of the recast Renewable Energy Directive (RED III), has been undertaken based on lands already identified for grid scale renewable electricity, in several existing City/County Development Plans. These plans have been subject to environmental assessments and statutory public consultation (in accordance with the relevant provisions of the Planning and Development Act 2000, as amended) and are adopted by the Elected Members of each local authority.  For the purposes of this Public Consultation the mapping is available in PDF/PNG formats only, as hosted on the Department’s website. The mapping has been made available in these formats to allow for access across a range of devices and platforms and for all users. For detailed local level mapping information, contact can be made directly with local authorities. The current Article 15b mapping can be cross-referenced against any such relevant City/County Development Plan, Wind Energy Strategy or Renewable Energy Strategy.  It is important to note that the Article 15b national territory mapping does not alter or amend any existing City/County Development Plans nor does it affect their status under any enactment. The coordinated national territory mapping has been generated, solely, to meet the obligations of the State under RED III Article 15b. The closing date for submissions is Friday 10 October 2025 at 5.30pm. ",
        "questionNumber": 42
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 150. Deputy Michael Lowry asked the Minister for Enterprise, Tourism and Employment the number of companies registered as companies limited by guarantee at the end of 2024; and if he will make a statement on the matter. [53227/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_167.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_167",
          "showAs": "Company Registration",
          "debateSectionId": "dbsect_167"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_150",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 150 and 151 together.  I refer to Minister Burke's recent response (PQ 46366/25) on 8th September 2025 to the Deputy on this matter. As advised, there were 19,038 companies limited by guarantee on the Register of Companies at the end of 2024. The Companies Registration Office does not collect data on the number of persons employed in a company. ",
        "questionNumber": 150
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 151. Deputy Michael Lowry asked the Minister for Enterprise, Tourism and Employment the number of people employed directly by companies registered as companies limited by guarantee at the end of 2024; and if he will make a statement on the matter. [53228/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_167.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_167",
          "showAs": "Company Registration",
          "debateSectionId": "dbsect_167"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_151",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 150 and 151 together.  I refer to Minister Burke's recent response (PQ 46366/25) on 8th September 2025 to the Deputy on this matter. As advised, there were 19,038 companies limited by guarantee on the Register of Companies at the end of 2024. The Companies Registration Office does not collect data on the number of persons employed in a company. ",
        "questionNumber": 151
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "by": {
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "date": "2025-10-01",
        "questionNumber": 164,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_176.xml"
            }
          },
          "showAs": "Disabilities Assessments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_164",
        "showAs": " 164. Deputy Michael Lowry asked the Minister for Children, Disability and Equality if she is aware of the case of a child (details supplied) whose mother applied for an Assessment of Need on 16 June 2024 under the Disability Act 2005, and was notified by the HSE that an assessment will not be carried out for 32 months; the steps she will take to ensure assessments are carried out within three months; and the interim supports available for children who are awaiting assessments. [52466/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 580. Deputy Michael Lowry asked the Minister for Health if she will urgently review the current restrictions on CAR-T cell therapy, which limit access to patients under the age of 26, in light of the case of a person (details supplied). [49581/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_531.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_531",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_531"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_580",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 580
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 164. Deputy Michael Lowry asked the Minister for Climate, Energy and the Environment the steps he intends to take to protect consumers from excessive energy costs, particularly given the profit figures from major providers (details supplied); his views on whether the CRU is adequately fulfilling its role as a regulator, given that Ireland continues to have some of the highest energy prices in Europe; and if he is considering the re-nationalisation of electricity and gas supply to ensure affordability and security for households, given many people can no longer cope with rising cost-of-living and energy bills. [49378/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_151.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_151",
          "showAs": "Energy Prices",
          "debateSectionId": "dbsect_151"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_164",
        "answerText": " Minister for Climate, Energy and the Environment  The electricity and gas retail markets in Ireland operate within a European Union regulatory regime wherein electricity and gas markets are commercial and liberalised. Operating within this overall EU framework, responsibility for the regulation of the electricity and gas markets, including the matters raised by the Deputy, is solely a matter for the independent regulator, Commission for Regulation of Utilities (CRU). In line with long standing policy on deregulating price setting, CRU ended its regulation of retail prices in the electricity market in 2011, and in the gas market in 2014.  Price setting by electricity suppliers, including standing charges, is a commercial and operational matter for the companies concerned. Each such company has its own different approach to pricing decisions over time, in accordance with factors such as their overall company strategic direction and developments in their cost base. Within a competitive environment, providers also have costs such as staffing, tax, infrastructure, and cost of network tariffs which, in turn, affects end users’ bills.  The Government is committed to addressing high energy costs experienced by Irish consumers. The Programme for Government acknowledges the increased energy cost pressures on households and businesses and commits to bringing forward measures to help contain these costs. Government recently approved an extension of the 9% VAT rate currently applied to gas and electricity by a further six months to October 2025 at an estimated cost of €85 million.  Further measures to support Irish consumers, including targeted schemes, will be considered as part of the work programme of the National Energy Affordability Taskforce. ",
        "questionNumber": 164
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 379. Deputy Michael Lowry asked the Minister for Health if she will provide an update on the provision of special needs dental services in Nenagh; if she is aware that the post of special needs dentist has been vacant for over a year with no replacement appointed, despite advertisements; the number of children, including those with autism, currently waiting for dental treatment under sedation or anaesthetic in the Nenagh area; the contingency plans in place to ensure access to appropriate dental care for these children; and if she will make a statement on the matter. [49533/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_336.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_336",
          "showAs": "Dental Services ",
          "debateSectionId": "dbsect_336"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_379",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionNumber": 379
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 1191. Deputy Michael Lowry asked the Minister for Health if she will address the current lack of clarity, access, and governance in the provision of urgent ophthalmic care in the south-east and mid-west regions; and if she is aware of shortfalls in care provision in the region (details supplied). [48030/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_998.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_998",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_998"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1191",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1191
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 1192. Deputy Michael Lowry asked the Minister for Health the steps being taken to ensure clear and consistent governance across ophthalmology emergency referral pathways; that no patient with suspected acute or sight-threatening pathology is turned away from hospital care and that regional equity is provided in order that patients in Thurles and surrounding areas have timely access to emergency eye services. [48031/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_999.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_999",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_999"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1192",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1192
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 1196. Deputy Michael Lowry asked the Minister for Health the current provision of prosthetics for children in Ireland, including access to advanced prosthetic options; and whether this provision is sufficient to meet the needs of children with complex injuries, such as a child (details supplied). [48039/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1003.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1003",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_1003"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1196",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1196
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 1197. Deputy Michael Lowry asked the Minister for Health the specialist teams and services in place to support children requiring prosthetics alongside complex abdominal and stoma care; and whether the HSE has sufficient expertise and resources to deliver this care within Ireland. [48040/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1004.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1004",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_1004"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1197",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1197
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 1198. Deputy Michael Lowry asked the Minister for Health her plans to address the identified gaps in paediatric prosthetic services, including long-term rehabilitation and follow-up supports, to ensure families are not forced to seek treatment abroad. [48041/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1005.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1005",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_1005"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1198",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1198
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 1199. Deputy Michael Lowry asked the Minister for Health if she will commit to a review of paediatric prosthetic provision in Ireland, with a view to ensuring that children such as a child (details supplied) can access the same standard of ongoing care and rehabilitation as they receive in acute and emergency care. [48042/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1006.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1006",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_1006"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1199",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1199
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Defence",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 219. Deputy Michael Lowry asked the Tánaiste and Minister for Defence if his attention has been drawn to the treatment of a person (details supplied); if he will confirm whether proper procedures and Defence Forces regulations, including TS INF 090/2018 Amendment 5, were adhered to during the assessment and retesting process; and if he will make a statement on the matter. [45571/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_219",
        "questionNumber": 219,
        "answerText": " Tánaiste and Minister for Defence  I am advised by the Military Authorities that an internal review has been undertaken in relation to this particular case. I understand that as a result of the review the matter has been resolved and the individual in question has indicated they are satisfied with its resolution. ",
        "debateSection": {
          "showAs": "Defence Forces",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_176",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_176.xml"
            }
          },
          "debateSectionId": "dbsect_176"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 396. Deputy Michael Lowry asked the Minister for Transport the reason the free travel scheme for children under nine-years of age, which was announced in Budget 2025, does not apply to Irish Rail services where tickets are still being charged; and if he will make a statement on the matter. [46870/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_396",
        "questionNumber": 396,
        "answerText": " Minister for Transport  The new Child (5–8) TFI Leap Card was launched on 3rd September, extending free travel on all PSO services (including rail) to children aged 5 to 8 years. This welcomed initiative was announced as part of the Budget 2025 package of measures and delivers on a key Programme for Government commitment to make public transport more affordable and accessible for families. The extension of free travel for children under 9 builds on the 2017 introduction of free travel for children under five on subsidised public transport services.  The Child (5–8) TFI Leap Card expires at the end of the month in which the child turns nine. After this point, they should transition to using the Child (5–15) card for discounted fares. Revised Child (5-15) Leap Card products were introduced on 1st September across the Dublin Commuter Leap fare zones, offering a significantly increased discount of 67% off adult fares, up from the previous 50%. These enhanced fares apply to daily, weekly, and monthly ticket products and are available through the TFI Leap Top-Up App and leapcard.ie.  These changes follow a fare determination made in July, building on earlier adjustments in April and June, which established four new Leap fare zones covering Dublin and surrounding commuter areas.  Children travelling in Zones 2, 3, and 4 will now benefit from the same discount levels as those in Dublin City (Zone 1). Additionally, the revised structure allows onward travel within Zone 1 on TFI rail, Luas, and Dublin city buses at no extra cost.  This enhancement responds directly to public feedback and aims to make public transport more equitable, inclusive, and affordable for young people. ",
        "debateSection": {
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_330",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_330.xml"
            }
          },
          "debateSectionId": "dbsect_330"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 700. Deputy Michael Lowry asked the Minister for Enterprise, Tourism and Employment the number of companies registered as companies limited by guarantee at the end of 2024; the number of persons employed directly by companies registered as companies limited by guarantee at the end of 2024; and if he will make a statement on the matter. [46366/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_700",
        "questionNumber": 700,
        "answerText": " Minister for Enterprise, Tourism and Employment  A company limited by guarantee (CLG) is governed by Part 18 of the Companies Act 2014, it does not have a share capital, and the members’ liability is limited to the amount they guarantee in its constitution to contribute if the company is wound up. A CLG is generally a not for profit entity formed for charitable, social, or professional purpose.  There was 19,038 CLGs on the Register of Companies at the end of 2024. The Companies Registration Office does not collect data on the number of persons employed in a company. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_596",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_596.xml"
            }
          },
          "debateSectionId": "dbsect_596"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1190. Deputy Michael Lowry asked the Minister for Housing, Local Government and Heritage if he will address the disparity between the Local Authority Home Loan property price thresholds in counties such as Tipperary currently capped at €275,000 and the actual cost of purchasing even modest new homes on the market (details supplied) priced at €295,000, which effectively excludes many first-time buyers from access to the scheme; and if he will review and adjust these thresholds so that they are aligned with real market conditions. [45695/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1190",
        "questionNumber": 1190,
        "answerText": " Minister for Housing, Local Government and Heritage  The Local Authority Home Loan is a Government-backed mortgage for creditworthy applicants who cannot get sufficient funding from commercial banks to purchase or build a home. It is available nationwide from local authorities for first-time buyers and fresh start applicants. The loan can be used both for new and second-hand properties, or to self-build.  The Programme for Government 2025 commits to ensuring that the maximum loan values align with current house prices, thus maintaining the scheme accessible.  Work within my Department on the review of the maximum income and property price limits has been carried out and proposals for changes to the lending scheme are under review. ",
        "debateSection": {
          "showAs": "Local Authorities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1014",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1014.xml"
            }
          },
          "debateSectionId": "dbsect_1014"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1754. Deputy Michael Lowry asked the Minister for Agriculture, Food and the Marine the measures being taken to tackle the ongoing issue of illegal sulky racing on public roads, which presents a serious danger to road users and involves widespread mistreatment of horses and ponies; if the Minister is aware of recent documented incidents of such races, including one highlighted by an organisation (details supplied) which show clear evidence of animal abuse; and if he will commit dedicated resources to animal welfare violations associated with this practice. [45679/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1754",
        "questionNumber": 1754,
        "answerText": " Minister for Agriculture, Food and the Marine  The use of sulkies on public roads specifically, as with the use of all vehicles, including animal-drawn vehicles, is governed by the relevant provisions of the Roads and Road Traffic Acts. Revisions to this legislation would be a matter for the Minister for Transport.  The drivers of all vehicles used on public roads, including horse-drawn carriages, are required to comply with road traffic legislation and to behave in a safe manner paying due care to other road users. The enforcement of such road traffic legislation is a matter for An Garda Síochána.  There is a commitment in the Programme for Government to prioritise equine welfare and to build on existing inspectorate supports across the country, ensuring a consistent approach to dealing with horse welfare.  In this regard, my Department and authorised officers appointed under the Animal Health and Welfare Act 2013, including An Garda Síochána, Customs agents, local authorities, the Irish Society for the Prevention of Cruelty to Animals (ISPCA) and the Dublin Society for the Prevention of Cruelty to Animals (DSPCA), undertake appropriate enforcement action, where breaches or shortcomings are identified.  Any reports of neglect or cruelty to animals are investigated. My Department is aware of this case but does not comment on individual cases.  My Department  operates a confidential animal welfare helpline through which members of the public can report incidents of animal cruelty or neglect for investigation.  The dedicated email address and helpline in place for reporting suspected cases of animal welfare are:  Helpline Phone No:  01 607 2379.  Email address - animalwelfare@agriculture.gov.ie ",
        "debateSection": {
          "showAs": "Animal Welfare",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1467",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1467.xml"
            }
          },
          "debateSectionId": "dbsect_1467"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2351. Deputy Michael Lowry asked the Minister for Health if she will address the case of a person (details supplied) who has been unable to access either residential accommodation or a day service transport service; if she will confirm when adequate accommodation space, transport services and staff supports will be made available to ensure that individuals with disabilities can safely live out their lives and consistently attend their day services; and if she will make a statement on the matter. [45660/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2351",
        "questionNumber": 2351,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_2044",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_2044.xml"
            }
          },
          "debateSectionId": "dbsect_2044"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2387. Deputy Michael Lowry asked the Minister for Health her plans to address the uncertainty facing staff at a unit which is due to transfer from a healthcare provider (details supplied) to the HSE at the end of August 2025; the arrangement made to retain the existing staff employed at the unit, and the steps the HSE is taking to ensure continuity of employment and service delivery during this transition; if she will ensure that the HSE engages directly with all affected staff to clarify their employment status and to support a smooth transfer process. [45784/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2387",
        "questionNumber": 2387,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_2075",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_2075.xml"
            }
          },
          "debateSectionId": "dbsect_2075"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2486. Deputy Michael Lowry asked the Minister for Health the steps her Department and the HSE will take to ensure that newly qualified nurses are provided with employment opportunities within the Irish health system; if she will address the difficulties being experienced by graduate nurses (details supplied); and if she will make a statement on the matter. [46329/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2486",
        "questionNumber": 2486,
        "answerText": " Minister for Health  The Health Service Executive would strongly encourage all healthcare workers to return to Ireland to commence their careers. All Irish graduates are offered employment opportunities in the HSE and we continually run nursing recruitment competitions.  The Department recommends that the individual register with the HSE Career Hub careerhub.hse.ie/ This provides for job alerts to members for roles in the HSE and S38 & S39s (Over 2 million notifications issued to date). The HSE has seen a 100% Increase of eligible applicants for sponsorship public health nursing and midwifery programmes, following profiling on the Career Hub, coupled with candidate engagement webinars.  The HSE continues to recruit in a fiercely competitive global recruitment market in which the WHO forecast a deficit of healthcare workers of over 10 million by 2030. It is in this context that the HSE continues to explore new opportunities to attract and build our healthcare workforce both nationally and internationally. ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_2156",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_2156.xml"
            }
          },
          "debateSectionId": "dbsect_2156"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 1922. Deputy Michael Lowry asked the Minister for Justice, Home Affairs and Migration if he will provide an update on the measures being taken to reduce delays in the processing of toxicology reports by the State Laboratory in Celbridge; the steps being taken to increase the number of pathologists available to carry out coronial post-mortem examinations in the mid-west region, specifically in the counties of Limerick, Clare, and parts of Tipperary, where there are currently only two part-time pathologists providing this critical service. [40868/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1631.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1631",
          "showAs": "Coroners Service",
          "debateSectionId": "dbsect_1631"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1922",
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will appreciate, Coroners are independent office holders and neither I, nor my Department has any role in directing the work of coroners during the death investigation function.  I can further advise the Deputy the State Laboratory is under the aegis of the Department of Public Expenditure, NDP Delivery and Reform. To be of assistance, my officials have made enquiries with the Department of Public Expenditure, NDP Delivery and Reform. The information provided by the State Laboratory is set out at the link below.  I am acutely conscious that any delay in carrying out coroner-directed post-mortems can be upsetting for bereaved families and loved ones. While the Department does not have a role in directing the work of the Coroner it does actively support coroners in carrying out their statutory functions.  It is important to note that the policy and operational responsibilities for the provision of postmortem examination services to support the work of the Coroner Service is supported by multiple departments and agencies. My Department is responsible for the legislation underpinning the work of coroners, while the provision of the postmortem examination service is largely provided through the health service.  Where a coroner deems a postmortem examination to be required, the coroner concerned will arrange the post-mortem examination to be conducted as expeditiously as possible to ensure timely release of remains to the next of kin of the deceased. Depending on the circumstances of the death, a post-mortem examination will be carried out by a pathologist or, in forensic cases, by the Office of the State Pathologist.  My Department is aware that securing the provision of the postmortem service for the coronial death investigation function is challenging for several reasons, including issues relating to the training and recruitment of pathologists, as well as competing demands on pathologists in areas of diagnostic and research work.  In April 2022, my Department established a ‘Standing Committee on the Provision of Coroner Directed PMEs’, membership of which consists of representatives from the department of Justice, the department of Health, the Health Service Executive, the Office of the State Pathologist, An Garda Síochána, the Coroners Society of Ireland, the Department of Housing, Local Authorities and Heritage and the Faculty of Pathology, Royal College of Physicians Ireland. The committee has met on a quarterly basis from Q3 2022 to consider issues relating to the provision of the pathology service.  In October 2024, Government approval was given to draft a general scheme of a Bill to significantly reform the Coroner Service, to increase efficiencies and minimise the impact of the death investigation process on bereaved people.  The Heads of Bill will address all aspects of the Coroner Service including reforming the current approach for the provision of coroner-directed autopsies.  The PME service is a critical component of the Coroner Service and consideration of autopsy’s is an important element of reforming the service. It is intended to bring Heads of Bill to Government in late 2025.   Supplementary information PQ1922  ",
        "questionNumber": 1922
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 2667. Deputy Michael Lowry asked the Minister for Health the reason the application submitted on behalf of a person (details supplied) for stem cell therapy was refused under the EU Cross-Border Healthcare Directive (Directive 2011/24/EU); if the Minister will clarify whether stem cell therapy is currently considered a treatment covered under the cross-border directive scheme; the specific eligibility criteria and clinical justification applied by the HSE when determining applications for reimbursement under the Directive; the rationale and grounds on which the application was refused; and if there are any plans to review the scope of treatments eligible for reimbursement under the cross-border Directive scheme, particularly innovative or emerging therapies such as stem cell therapy. [41300/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2284.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2284",
          "showAs": "EU Directives",
          "debateSectionId": "dbsect_2284"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2667",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 2667
      },
      "contextDate": "2025-07-29"
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 723,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_643",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_643.xml"
            }
          },
          "showAs": "Personal Injury Claims",
          "debateSectionId": "dbsect_643"
        },
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "showAs": " 723. Deputy Michael Lowry asked the Minister for Justice, Home Affairs and Migration considering the work previously undertaken to replace the Book of Quantum and reduce personal injury awards in line with EU norms through the adoption of the Judicial Guidelines, if he will outline the rationale for any proposed increases to personal injury award levels now under consideration; the way in which the Department reconciles such proposals with the ongoing difficulties facing small businesses, community organisations, and leisure activity providers who continue to struggle with high insurance premiums; and if he will confirm what assessment has been made of the impact of rising personal injury awards on public liability insurance costs and community engagement across Ireland. [39251/25] ",
        "answerText": " Minister for Justice, Home Affairs and Migration  It is important to note that, in reviewing the Personal Injuries Guidelines, the Judicial Council had regard to three issues in particular when considering the amendments.  The first was the fact that in the three years since the adoption of the 1st Edition, significant global and national inflation has occurred.  The second was the jurisprudence of the Superior Courts that has emerged in the same period regarding the proper approach to the assessment of damages in multiple injuries cases.  The third was the approach taken in the most comparable jurisdictions when they reviewed their awards.  As a consequence, the Judicial Council recommended an increase of 16.7% in awards which is in line with increases in the HICP over the relevant period.  In considering the proposed amendments, I have taken into account the Judicial Council report and the latest reports from the Central Bank of Ireland’s National Claims Information Database.  I am acutely aware of the concerns regarding the impact that amendments to the guidelines could have on insurance costs.  I am equally aware of the potential impact on the Personal Injuries Resolution Board and the claims process of not adopting the amendments.  As Minister I am obliged under section 7 of the Judicial Council Act 2019 to lay the draft amendments before each House of the Oireachtas.  The proposed amendments cannot, however, come into operation until a Resolution approving them is passed by both Houses of the Oireachtas. Following extensive discussions on the matter with my Government colleagues, I intend to lay the amended Guidelines before the Houses but will not be bringing a Resolution seeking their approval.  As such, the Personal Injuries Guidelines as they currently stand will remain in place without any amendments increasing the amounts outlined. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_723",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 951,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_854",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_854.xml"
            }
          },
          "showAs": "General Practitioner Services",
          "debateSectionId": "dbsect_854"
        },
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "showAs": " 951. Deputy Michael Lowry asked the Minister for Health how a person can access general practitioner (GP) services in circumstances where all local GPs with GMS contracts have closed patient lists and are not accepting new patients; the options available to individuals such as a person (details supplied); if the HSE has a protocol in place to ensure continuity of care in such cases; and the steps her Department is taking to ensure all patients have meaningful access to essential primary care services regardless of GP list closures. [39224/25] ",
        "answerText": " Minister for Health  GPs are self-employed practitioners and therefore may establish practices at a place of their own choosing. There is no prescribed ratio of GPs to patients and the State does not regulate the number of GPs that can set up in a town or community.  Under the GMS scheme, the HSE contracts GPs to provide medical services without charge to medical card and GP visit card holders. As of the 1st of July, there are 2,566 GPs contracted to provide services under the GMS Scheme and a further 632 GPs do not hold a GMS contract but hold at least one other contract with the HSE for the provision of health services.  Where a person that holds a medical card or GP visit card experiences difficulty in finding a GP to accept them as a patient, the person concerned having unsuccessfully applied to at least three GPs in the area (or fewer if there are fewer GPs in the area) can apply to the HSE Eligibility Unit which has the power to assign a GMS patient to a GP's GMS patient list in accordance with the GMS contract.  Persons who do not hold a medical card or GP visit card access GP services on a private basis and can make enquiries directly to any GP practice they wish to register with. As private practitioners, it is a matter for each individual GP to decide whether to accept additional private patients.  The HSE website provides a \"find a GP\" facility which can assist in locating and contacting GP in or around the area concerned.  Several measures have been taken in recent years to increase the number of GPs practicing throughout the country and thereby improve GP access.  Significant increases in investment in general practice has been provided under the 2019 and 2023 GP Agreements. Under the 2019 GP Agreement additional annual expenditure provided for general practice was increased by €211.6m. This provided for significant increases in capitation fees for participating GMS GPs, and new fees for additional services and increased practice supports, including the introduction of a support for practices in urban areas of social deprivation.  The GP Agreement 2023 further increased GP capitation fees, increased the existing subsidy rates for practice staff, and introduced a grant support for additional staff capacity as well a practice staff maternity leave support.  Annual intake to the GP training scheme has been increased by approximately 80% from 2019 to 2024, with 350 new entrant training places made available from 2024. As a result, the number of GP graduates has increased in recent years and will continue to increase in the coming years.  Furthermore, recruitment of GPs from abroad is ongoing under the International Medical Graduate (IMG) Rural GP Programme. As of June, 118 IMG doctors are in practice here with a further 18 having completed the new 2-year programme. The placement of IMG GPs is targeted to rural and underserved areas. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_951",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 954,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_857",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_857.xml"
            }
          },
          "showAs": "Health Service Executive",
          "debateSectionId": "dbsect_857"
        },
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "showAs": " 954. Deputy Michael Lowry asked the Minister for Health If she will address the current uncertainty facing staff at a healthcare facility (details supplied); the arrangements that have been made to retain the existing staff currently employed at the unit; the steps the HSE is taking to ensure continuity of employment and service delivery during this transition; and if she will ensure that the HSE engages immediately and directly with all affected staff to clarify their employment status and to support a smooth transfer process. [39259/25] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_954",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_261",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 261,
        "date": "2025-07-08",
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including vehicle age limits for SPSVs, is a matter for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  Accordingly, I have referred your question to the NTA for direct reply. Please advise my private office if you have not received a reply within 10 working days.  For the Deputy's information, a separate licensing regime is administered by An Garda Síochána under the Road Traffic Acts. This relates to Article 60 of the Road Traffic (Public Service Vehicles) Regulations, 1963 which applies to the licensing of large public service vehicles and ambulances, particularly those that are one year old or more. Bus Éireann operates the School Transportation Service on behalf of the Department of Education and awards contracts to eligible operators to provide this service. My Department is currently undertaking a review of the Article 60 licensing regime, and stakeholder engagement is ongoing in this regard. ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "debateSection": {
          "showAs": "Driver Licences",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_184",
          "debateSectionId": "dbsect_184",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_184.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 261. Deputy Michael Lowry asked the Minister for Transport if any consideration is being given to changing the ten-year rule for SPSV licence holders (details supplied); and if he will make a statement on the matter. [37317/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        }
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_380",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 380,
        "date": "2025-07-08",
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school.  The CASWS operates on a multi-annual basis across a number of categories of works such as external environment works which could include carparking and set down areas.  I can confirm my department have received an application under the CASWS for the school in question. However, it should be noted that applications will be assessed in accordance with availability of funding.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis with the first tranche of projects being announced in Q4 2025 for commencement in summer 2026. Under this scheme, approved applications from schools that are not reached for funding or market prioritisation reasons (as above) in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Full details of the new CASWS, Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link: www.gov.ie/en/department-of-education/services/summer-works-scheme/ ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "debateSection": {
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_287",
          "debateSectionId": "dbsect_287",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_287.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 380. Deputy Michael Lowry asked the Minister for Education and Youth if funding will be allocated under the application for the new summer works scheme for a school (details supplied). [37083/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        }
      }
    },
    {
      "contextDate": "2025-07-03",
      "question": {
        "questionNumber": 222,
        "answerText": " Minister for Education and Youth  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies, or to provide funding to facilitate inclusion and access for pupils with special needs. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of a minimal scope works to address the emergency situation. The EWS in intended to remedy an emergency situation and usually provides only an interim measure until a permanent solution can be delivered under the Summer Works Scheme (SWS) which deals with upgrade works to the school.  The EWS is open to primary and post primary schools with permanent recognition and in non-rented accommodation. To make an application schools must complete the online Emergency Works Application Form available through the Esinet system.  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for external environment works. The EWS operates on the basis of a minimal scope of works required to remedy an emergency situation and, on this basis, the school was advised to submit further documentation and clarifications.  Once this has been received the EWS team will review the application and will engage further with the school as appropriate. The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail"
        },
        "date": "2025-07-03",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "showAs": " 222. Deputy Michael Lowry asked the Minister for Education and Youth if additional funding can be allocated to small rural DEIS schools, such as (details supplied), to cover health and safety essential works, given the significant financial strain these schools face in maintaining their facilities, and if she will consider their application for emergency works to be carried out. [36796/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-03/pq_222",
        "debateSection": {
          "debateSectionId": "dbsect_234",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/dbsect_234",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/mul@/dbsect_234.xml"
            }
          },
          "showAs": "School Funding"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        }
      }
    },
    {
      "question": {
        "questionNumber": 807,
        "showAs": " 807. Deputy Michael Lowry asked the Minister for Health if her Department is aware of the case of a person (details supplied); the actions being taken by the HSE to ensure they receive adequate administrative support, in line with occupational health recommendations, given their condition; if she is aware that the HSE-approved permanent administrative post has not been sanctioned by IBH/paybill, and that efforts to recruit via agency and internal panels have failed; and if she will make a statement on the matter. [35884/25] ",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_749",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_749.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_749"
        },
        "answerText": " Minister for Health  The department have asked the HSE to respond to the Deputy directly on this matter. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_807",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "contextDate": "2025-06-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-26/writtens/mul@/dbsect_290.xml"
            }
          },
          "debateSectionId": "dbsect_290",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-26/writtens/dbsect_290",
          "showAs": "School Uniforms"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-26/pq_274",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 274,
        "showAs": " 274. Deputy Michael Lowry asked the Minister for Social Protection if his attention has been drawn to the plight of foster parents’ difficulties in qualifying for back to school clothing and footwear allowance for foster children due to means test being applied for assessment (details supplied); and if he will make a statement on the matter. [35020/25] ",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 274 and 276 together.  This Government acknowledges the important role that carers, including foster carers, play and remains fully committed to supporting them. That is why I was really pleased to announce that Back-to-School Clothing and Footwear Allowance eligibility is being extended to include children for whom Foster Care Allowance is being paid.  The Back-to-School Clothing and Footwear Allowance scheme provides a once-off payment to eligible families to assist with the costs of clothing and footwear when children start or return to school each autumn. The scheme operates from June to September each year.  In order to qualify for Back-to-School Clothing and Footwear Allowance, an applicant must satisfy a number of qualifying conditions, one of which requires the applicant’s household income to be within the relevant income limits. The income limits for the scheme are increased annually as part of the budget process.  The Weekly Household Income Limits for 2025 are:     No. of Children    Income Limit      1 child    €694.00      2 children    €756.00      3 children    €818.00      4 children*    €880.00     * Limit is increased by €62 for each additional child.  The household income includes weekly social protection payments, gross income from employment, minus employees PRSI and a €20 travel allowance and any other income the household may have.  Any income from Working Family Payment, Child Benefit, Rent Supplement, Back to Work Family Dividend, Guardian’s Payments, Domiciliary Care Allowance, Blind Welfare Allowance, Foster Care Allowance, Higher Level Education grants is not assessable. Rehabilitative employment (up to €165 per week) is also not assessable.  Matters relating to foster care are the responsibility of my colleague, the Minister for Children, Disability and Equality, whose Department has overseen a significant increase in investment in foster care supports, including a 21% increase to the rates of the foster care allowance. The rates have been increased to €400 per week for children aged under 12, and €425 per week for those over 12. In 2025, this means that foster carers will receive an additional €3,900 in allowances.  In addition, Budget 2025 set out further investment and support towards children in foster care, including funding which will be used to provide an Initial Placement Payment at the beginning of each initial foster care placement from 2025. Provision has also been made for additional mileage support for foster carers who have significant travel responsibilities for children in their care.  It is expected some 2,300 children in foster care will now be eligible for the Back-to-School Clothing and Footwear Allowance and I encourage foster care families to apply for the allowance.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-06-26",
        "by": {
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        }
      }
    },
    {
      "question": {
        "questionNumber": 1331,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1331",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "showAs": " 1331. Deputy Michael Lowry asked the Minister for Health to provide details on the current HSE recruitment efforts for home support service staff in north Tipperary, particularly in the Lorrha and surrounding areas in CHO 3 Mid-West, outlining the number of existing vacancies and the level of recruitment planned for 2025; when these positions are expected to be filled; the measures being taken to address service delivery shortfalls and staffing constraints, especially in the context of reported employment embargoes which may be preventing qualified applicants from securing available roles; and if she will make a statement on the matter. [29254/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1158.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1158",
          "showAs": "Home Care Packages",
          "debateSectionId": "dbsect_1158"
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1499,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1499",
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "showAs": " 1499. Deputy Michael Lowry asked the Minister for Health the hours during which Shannon Doc operates in Roscrea, County Tipperary; if she will provide a breakdown of each day that the Shannon Doc service did not open during its advertised opening hours between 1 January 2024 and 31 May 2025; the reasons no service was provided on each of those days; what efforts are being made to ensure that a full service is being provided; and if she will make a statement on the matter. [29928/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1309.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1309",
          "showAs": "Community Care",
          "debateSectionId": "dbsect_1309"
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "contextDate": "2025-05-13",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/mul@/dbsect_405.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/dbsect_405",
          "showAs": "School Staff",
          "debateSectionId": "dbsect_405"
        },
        "questionType": "written",
        "questionNumber": 578,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 578. Deputy Michael Lowry asked the Minister for Education and Youth if he will review the case of a person (details supplied) who was refused incremental credit. [23704/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-13/pq_578",
        "answerText": " Minister for Education and Youth  I refer to your correspondence on behalf of a primary teacher regarding the refusal of incremental credit.  The criteria for the award of incremental credit are set out in the Department’s Circulars 10/2001 for Primary teachers, 29/2007 and 29/2010 for post-primary teachers. The criteria for the award of incremental credit to recognised teachers was agreed under the auspices of the Teachers Conciliation Council (TCC). The relevant circular applying here is 10/2001.  These circulars provide for the award of incremental credit in respect of overseas teaching service, both within and outside the EU. Where a school satisfies the criteria set out in the circulars to have service at that school recognised for incremental credit, an award of incremental credit can be made.  The criteria for the award of incremental credit for teachers are subject to review by way of an incremental credit committee, which is a sub-committee of the TCC, and which meets on an ongoing basis.  The department is planning to review the incremental credit circulars towards the end of this year. As part of this process, the department will consult with the education partners via the incremental credit sub-committee of the TCC.  Regarding the teacher you are referring to, this teacher was not a qualified primary trained teacher during this period of service, therefore her application for incremental credit was refused. ",
        "date": "2025-05-13"
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "questionNumber": 249,
        "showAs": " 249. Deputy Michael Lowry asked the Minister for Transport if he will urgently address the critical funding shortfall in the CIÉ 1951 pension scheme to ensure that pensioners, who have not received an increase in 15 years, receive the financial support they deserve; if he will provide the necessary funding through his Department to rectify this situation, or alternatively, incorporate this pension scheme into the general public service scheme to guarantee fair treatment for these public servants; and if he will make a statement on the matter. [22922/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-08/pq_249",
        "debateSection": {
          "debateSectionId": "dbsect_242",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/dbsect_242",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          },
          "showAs": "Córas Iompair Éireann"
        },
        "answerText": " Minister for Transport  I propose to take Questions Nos. 249, 251 and 257 together.  From the outset I would like to clarify that I, as Minister for Transport, have responsibility for policy and overall funding in relation to public transport. However, issues in relation to CIÉ pension schemes are primarily a matter for the trustees of the pension schemes, the CIÉ Group and their employees. As a commercial semi-state body, CIÉ are responsible for the provision of pension schemes for their employees - this is consistent with the pension arrangements of semi-state bodies.  That being said, I am acutely aware of concerns raised by the members of both CIÉ pension schemes, regarding the lack of pension increases since 2008, especially given the higher cost of living that many are facing.  I understand that an increase for pensioners would only be possible when the Schemes are capable of sustaining such increases. Furthermore, any such proposal would be dependent on the advice of the Scheme Actuary at the time an increase is proposed and is done in agreement with the Trustees of the Schemes.  My Department is engaged with financial advisors at NewERA, the Pensions Authority, and the Department of Public Expenditure, Infrastructure, Public Services, Reform and Digitalisation on the matter of bringing CIÉ pensions onto a more stable footing for the benefit of active, and retired scheme members.  Decisions regarding pension increases are ultimately a matter for the CIÉ Board as informed by actuarial advice and is subject to requirements imposed by statute and scheme rules. Accordingly, I have referred your question to CIÉ for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-05-08"
      },
      "contextDate": "2025-05-08"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "questionNumber": 283,
        "showAs": " 283. Deputy Michael Lowry asked the Minister for Finance given the ongoing concerns about discrimination in inheritance tax policy, particularly affecting single and childless citizens, the reason these individuals are subject to less favourable tax-free thresholds compared to other groups; if he will commit to a complete reform of the inheritance tax system, rather than merely tweaking the Group A, B, and C thresholds; if he will reconsider the terminology used for Group C recipients, who are often loved ones and lifelong friends, and ensure that the tax policy reflects their importance in people's lives; and, given the impact on one million single and childless citizens, the measures the Minister will take to ensure that the inheritance tax policy is fair and non-discriminatory; and if he will make a statement on the matter. [22917/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-08/pq_283",
        "debateSection": {
          "debateSectionId": "dbsect_271",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/dbsect_271",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/mul@/dbsect_271.xml"
            },
            "pdf": null
          },
          "showAs": "Tax Data"
        },
        "answerText": " Minister for Finance  Capital Acquisitions Tax (CAT) is a beneficiary-based tax on gifts and inheritances that is payable on the value of the property received. For CAT purposes, the relationship between the person giving a gift or inheritance (i.e. the disponer) and the person who receives it (i.e. the beneficiary) determines the maximum amount, known as the “Group threshold”, below which CAT does not arise.  There are three Group thresholds:  • the Group A threshold (currently €400,000) applies where the beneficiary is a child of the person giving the gift or inheritance  • the Group B threshold (currently €40,000) applies where the beneficiary is a brother, sister, nephew, niece, lineal ancestor or lineal descendant of the person giving the gift or inheritance  • the Group C threshold (currently €20,000) applies in all other cases.  It is useful to note that the definition for children for CAT purposes includes any stepchildren, adopted children or certain foster children. All can avail of the Group A threshold in respect of gifts and inheritances received from that disponer.  In addition, nieces or nephews of that disponer may qualify for favourite niece or favourite nephew relief in respect of gifts or inheritances of business assets. The relief allows a niece or nephew who qualifies for the relief to avail of the Group A threshold. Qualifying nieces or nephews are those who have worked substantially on a full-time basis for a period of five years prior to the gift or inheritance being given in carrying on, or assisting in the carrying on, the trade, business or profession, of the disponer.  For the nephew or niece to be deemed to be working substantially on a full-time basis in the business he or she must work:  • more than 24 hours per week at the place where the business, trade or profession is carried on; or  • more than 15 hours per week at the place where the business, trade or profession is carried on exclusively by the disponer, any spouse or civil partner of the disponer and the nephew or niece.  Furthermore, it is worth noting that there is an exemption from CAT where dwelling houses are bequeathed by individuals who:  • have lived there for a specified period of time before the inheritance,  • will continue to live there for a specified period of time after the inheritance, and  • who have no beneficial interest in any other residential property at the date of the inheritance.  My officials are reviewing CAT as part of the annual Tax Strategy Group papers. These papers outline the tax policy considerations for the Government and the options available to it in forming this year’s Budget. They are published in advance of the Budget and are the best means of considering inheritance tax in an analytical and transparent way.  Finally, it is important to be aware that changes to CAT bear significant costs and must be considered in the context of available resources and must also be balanced against competing demands. ",
        "date": "2025-05-08"
      },
      "contextDate": "2025-05-08"
    },
    {
      "contextDate": "2025-05-07",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/mul@/dbsect_54.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/dbsect_54",
          "showAs": "Mining Industry",
          "debateSectionId": "dbsect_54"
        },
        "questionType": "written",
        "questionNumber": 36,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Environment",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 36. Deputy Michael Lowry asked the Minister for the Environment, Climate and Communications if his Department will support proposals concerning the Shallee project and the development of facilities at Shallee Mine in Silvermines, County Tipperary; if he has been made aware of previous correspondence issued to his Department (details supplied); if he will review this correspondence; and if he will make a statement on the matter. [22529/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-07/pq_36",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Darragh O'Brien)  As stated in the Policy Statement on Mineral Exploration and Mining 2022, my Department supports in principle the potential of legacy mine sites to contribute to communities as public amenities, sites for geoheritage, tourism, renewable energy and businesses, including potential remining, through their management, stabilisation, and rehabilitation, in addition to the Department actively ensuring any necessary environmental remediation and the protection of valuable habitats are addressed, as appropriate.  In line with this principle, a Historic Mines Rehabilitation Programme has been established in Geological Survey Ireland in August 2024. Under this Programme my Department is working closely with Tipperary County Council, particularly regarding safety works, and an active environmental monitoring programme has been put in place. The Department is currently progressing tasks associated with the rehabilitation of the Silvermines historic mine site areas, including the resolution of land title matters with relevant landowners in the area. ",
        "date": "2025-05-07"
      }
    },
    {
      "contextDate": "2025-05-07",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/mul@/dbsect_116.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/dbsect_116",
          "showAs": "Tax Code",
          "debateSectionId": "dbsect_116"
        },
        "questionType": "written",
        "questionNumber": 117,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Finance",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 117. Deputy Michael Lowry asked the Minister for Finance if he will address the issue of the tax band for old age pensioners, which has remained unchanged at €36,000 for several years; if he is aware that recent increases in the old age pension have resulted in some pensioners, such as those with small additional incomes, being pushed back into the tax net and facing a 40% tax rate; if he will consider adjusting the tax band to ensure that pensioners on small incomes are not adversely affected by these increases; and if he will make a statement on the matter. [22530/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-07/pq_117",
        "answerText": " Minister for Finance  As the Deputy is aware the current thresholds for the income tax age exemption are €18,000 per annum where an individual is aged 65 years or over, and €36,000 per annum for married couples and civil partners, jointly assessed to tax, where either individual is aged 65 or over. The relevant income thresholds may be increased further if the individual has a qualifying child. Additionally, marginal relief may be available where the individual’s or couple’s income exceeds the relevant exemption limit but is less than twice that amount.  The current tax arrangements for persons aged 65 or older compare favourably with the tax treatment of the generality of taxpayers. For example, the age tax credit or the age exemption limits and marginal relief are available to persons aged 65 or over. In addition, reduced rates of USC also apply for persons aged 70 or older where their total income is €60,000 or less per annum. Furthermore, the State Contributory Pension and the State Non-Contributory Pension are not chargeable to USC or Pay Related Social Insurance.  The Commission on Taxation and Welfare recommended that age should be removed as a factor for determining the charge to income tax and USC as it narrows the base and breaches the concept of horizontal equity. Further details are set out in the Report of the Commission, at the following link.  www.gov.ie/en/publication/7fbeb-report-of-the-commission/  Accordingly, I have no plans to increase the age exemption limits.  However, persons aged over 65 can avail of the age exemption or the normal tax system of credits and bands.  With the substantial increases to tax credits in recent Budgets, the effective entry point to income tax has increased for all taxpayers, including those aged 65 or older. For 2025, the effective entry point to income tax for an individual in receipt of the single person credit, employee/earned income credit and the age credit is €21,225 per annum.  Therefore, depending on their personal circumstances, it may be more beneficial for persons aged over 65 to be taxed under the normal tax system of credits and bands.  I would encourage all taxpayers to ensure that they are availing of the most beneficial tax treatment. ",
        "date": "2025-05-07"
      }
    },
    {
      "contextDate": "2025-05-07",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/mul@/dbsect_105.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/dbsect_105",
          "showAs": "Tax Reliefs",
          "debateSectionId": "dbsect_105"
        },
        "questionType": "written",
        "questionNumber": 118,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Finance",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 118. Deputy Michael Lowry asked the Minister for Finance if persons who have undergone scoliosis spinal fusion surgery can qualify for the disabled drivers and disabled passengers scheme, which provides relief from VRT and VAT on the use of an adapted car, an exemption from motor tax, and an annual fuel grant; if he plans to alter the qualification criteria for the scheme to include scoliosis spinal fusion survivors; and if he will make a statement on the matter. [22549/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-07/pq_118",
        "answerText": " Minister for Finance  I propose to take Questions Nos. 99, 107, 109, 110, 113 and 118 together.  The Deputy should note that my Department and I share concerns that the Disabled Drivers and Disabled Passengers Scheme or DDS is no longer fit-for-purpose and believe it should be replaced with a needs-based, grant-led approach for necessary vehicle adaptations that could serve to improve the functional mobility of the individual.  However, this is very much a matter for Government as whilst my Department has oversight of the DDS, I do not have responsibility for disability policy.  As the Deputy is aware the National Disability & Inclusion Strategy or NDIS Transport Working Group recommended that the DDS be replaced with a modern, fit-for-purpose vehicular adaptation scheme. This is in line with the general view that we need to move away from a medical criteria-based approach to a needs-based approach.  Under the aegis of the Department of the Taoiseach, the sub-group convened to progress NDIS proposals for needs-based, grant-aided, modern vehicle adaptation supports to replace the DDS, have generated a report that has been submitted to the Department of the Taoiseach, for its consideration.  In that context, any further changes to the existing DDS would run counter to NDIS proposals to entirely replace the scheme with a modern, fit-for-purpose vehicular adaptation scheme. ",
        "date": "2025-05-07"
      }
    },
    {
      "contextDate": "2025-05-07",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/mul@/dbsect_152.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/dbsect_152",
          "showAs": "School Staff",
          "debateSectionId": "dbsect_152"
        },
        "questionType": "written",
        "questionNumber": 153,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 153. Deputy Michael Lowry asked the Minister for Education and Youth if she will support the allocation of additional resources to the Department of Education to fund a proposed scheme where caretakers are paid directly by a Department body; if he will ensure that small rural DEIS schools, such as a school (details supplied), receive adequate funding to cover essential maintenance and upkeep; and if she will make a statement on the matter. [22575/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-07/pq_153",
        "answerText": " Minister for Education and Youth  Tackling educational disadvantage and supporting students to fulfil their full potential in life is a key priority for my Department, and for the government. The DEIS programme is a key policy of government to tackle concentrated educational disadvantage at school level. It provides a targeted range of supports and is additional to the universal supports provided to all schools, such as the introduction of free school books and free hot school meals.  The department invests over €180 million annually to provide additional supports to almost 1,200 schools in the DEIS programme which supports approximately 260,000 students.  The DEIS programme is targeted at schools with the highest levels of concentrated disadvantage. Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme and the model was applied fairly and equally to all schools. A detailed paper on the refined DEIS identification model is available on gov.ie.  All schools that were not satisfied with the outcome following the application of the DEIS identification model to their school enrolment data, were provided with the opportunity to make an appeal. Circular 0019/2022 outlined the details of the DEIS appeals process. Under the DEIS appeals process, schools were provided with the opportunity to have the application of the refined DEIS identification model to their school’s data reviewed. The appeals process also offered schools the opportunity to review their school enrolment data which they had submitted to the department and to improve its accuracy if necessary. All appeals submitted have now been processed by the department and schools have been notified of the outcome. The DEIS appeals process was applied fairly across all appellants, the window for appeals has now closed and the results are final.  It is possible for two neighbouring schools to have a different profile in terms of proportion of students from disadvantaged backgrounds and the relative weighting of disadvantage apportioned in each. The designation of neighbouring schools to different DEIS status does not mean that there is no educational disadvantage present in one school, but that the concentrated level of educational disadvantage of the two schools is different. Gender of students, ethos of the school or the designation of a school as single or mixed is not a factor in the DEIS identification model.  The DEIS programme is based on the premise that in order to have the maximum possible impact on providing opportunities for students most at risk of educational disadvantage, extra resources must be targeted as closely as possible at those students with the greatest level of need.  I am determined to close the performance gap between DEIS and non-DEIS schools and introduce more innovative solutions to tackle disadvantage. A new DEIS Plan will be published in 2025. This plan will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling educational disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.   Minor Works & Emergency Works   The Department recognises the importance of the Minor Works Grant to primary and special schools. Under Project Ireland 2040, a commitment was given that the Minor Works Grant would be paid in either December or January of the school year to all primary and special schools. In recent years the Department’s approach has been to pay the Minor Works Grant to primary and special schools in advance of the start of the following school year to facilitate a better lead in period for schools to plan any maintenance or minor works during the summer period.  The Minor Works Grant for the school year 2024/2025 issued in April 2024. The lead-in period ahead of the new school year, give schools sufficient time to make plans and set priorities for use of the funding.  Primary and special schools need not apply for minor works grant aid. Under the scheme, funding is made available to all primary and special schools on the following basis:  €5,500 basic grant plus €18.50 per mainstream pupil and €74 per special needs pupil enrolled in the school on the 30th of September of the year prior to the issue of the grant. The €74 rate applies to a special needs pupil attending a special school or attending a special class attached to a mainstream school.  Schools have the autonomy to use this funding for maintenance and small-scale improvements to school buildings and grounds. Given that each school setting is different, individual schools are best placed to decide how best to use this funding to address their particular needs.  The works that can be undertaken under the Minor Works Grant Scheme include maintenance and small-scale improvements to school buildings and grounds, painting, improvement or replacement of mechanical and electrical services, the purchase of standard furniture and educational equipment, the purchase of floor coverings and window blinds, the purchase of IT related equipment, ventilation improvements, and enhancements to outdoor learning environments.  The Department's Planning & Building Unit is currently assessing its work programme and priorities for 2025 in the context of its available funding. The timeline for the payment of the next tranche of grant funding will be confirmed in due course.  The Emergency Works Scheme ensures the availability of funding for urgent works to schools that need resources as a result of an emergency situation. An emergency is a situation which poses an immediate risk to health, life, property or the environment, that happens in sudden, unforeseen circumstances and requires immediate action, and if not corrected, would prevent the school, or part of it, from opening. The EWS operates on the basis of the minimal scope of works required to remedy an emergency situation. The EWS usually provides an interim solution until such time as a comprehensive solution can be provided under the Summer Works Scheme (SWS). As part of the minimal scope general maintenance and paining are not covered by EWS and it is open to schools to use their Minor Works Grant for such issues. Further information and how to apply can be found on the Gov.ie website or at gov - Emergency works (www.gov.ie)   Caretakers   As part of a package agreed with Fórsa, the trade union representing school secretaries and caretakers, following a series of engagements at the Workplace Relations Commission (WRC) in 2022, the implementation of revised salary and annual leave entitlements for school secretaries is now fully operational, and lessons learned from that process are now playing a key role in the drafting and implementation of a similar deal to be offered to grant funded school caretakers.  The Department is committed to ensuring that school caretakers will be afforded the opportunity to avail of a similar package to that which was accepted by school secretaries in the near future. As the deal to be offered to caretakers, when agreed, will be similar to that implemented for school secretaries, it is not currently anticipated that the granting of public servant status, and the entitlements which arise therefrom, will form part of the proposal.  In the normal course, there are ongoing discussions with the public service unions on any and all matters relating to pay agreements. Any review of changes to the employment of school caretakers or other pay mechanisms, can occur only under those processes and any such proposals would need to be considered in detail by the Department, the Department of Public Expenditure and Reform, and the relevant unions.   Capitation Funding   The Department is committed to providing funding to recognised primary and post-primary schools in the Free Education Scheme by way of per capita grants. The two main grants are the capitation grant to cater for day-to-day running costs such as heating, lighting, cleaning, insurance and general up-keep, and the ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities, except for the employment of relevant secretaries as per Circular 0036/2022.  The current standard rate of capitation grant is €200 per pupil in primary schools and €345 per student in post-primary schools.  Primary schools with fewer than 60 pupils are paid the capitation and the ancillary grants on the basis of having 60 pupils.  As part of the capitation package in Budget 2025 the Department is pleased to have secured over €30 million as a permanent increase in capitation funding to assist schools now and longer term with increased day-to-day running costs. This represents an increase of circa 12% on current standard rates and enhanced rates. This increase is on top of the circa 9.2% increase from last year’s budget. This will bring the standard rate of capitation grant to the level of €224 per pupil in primary schools and €386 per student in post-primary schools from September 2025. Enhanced rates will also be paid in respect of pupils with special educational needs and Traveller pupils. Schools should also ensure that they are availing of the available OGP procurement frameworks and getting best value for money for all school expenditure.  In addition to these grants, €45 million in cost-of-living supports issued in November 2024 to support all recognised primary and post-primary schools in the Free Education Scheme. This additional funding announced in Budget 2025 is designed to assist schools with increased day-to-day running costs such as heating and electricity. This funding was paid at a rate of €36 per pupil in primary schools and €55 per student in post-primary schools. Enhanced rates were also paid in respect of pupils with special educational needs and Traveller pupils.  The Financial Support Services Unit (FSSU), funded by the Department, is an important source of advice and support to schools on financial matters, including budgeting and cashflow management. Contact details for FSSU can be found on www.fssu.ie. ",
        "date": "2025-05-07"
      }
    },
    {
      "contextDate": "2025-05-07",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/mul@/dbsect_204.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/dbsect_204",
          "showAs": "School Funding",
          "debateSectionId": "dbsect_204"
        },
        "questionType": "written",
        "questionNumber": 205,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10"
        },
        "showAs": " 205. Deputy Michael Lowry asked the Minister for Education and Youth if additional funding can be allocated to small rural DEIS schools (details supplied) to cover essential maintenance and caretaker roles, given the significant financial strain these schools face in maintaining their facilities; and if she will consider implementing a scheme where caretakers are paid directly by a Department body to ensure consistent maintenance support; and if she will make a statement on the matter. [22573/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-07/pq_205",
        "answerText": " Minister for Education and Youth  Tackling educational disadvantage and supporting students to fulfil their full potential in life is a key priority for my Department, and for the government. The DEIS programme is a key policy of government to tackle concentrated educational disadvantage at school level. It provides a targeted range of supports and is additional to the universal supports provided to all schools, such as the introduction of free school books and free hot school meals.  The department invests over €180 million annually to provide additional supports to almost 1,200 schools in the DEIS programme which supports approximately 260,000 students.  The DEIS programme is targeted at schools with the highest levels of concentrated disadvantage. Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme and the model was applied fairly and equally to all schools. A detailed paper on the refined DEIS identification model is available on gov.ie.  All schools that were not satisfied with the outcome following the application of the DEIS identification model to their school enrolment data, were provided with the opportunity to make an appeal. Circular 0019/2022 outlined the details of the DEIS appeals process. Under the DEIS appeals process, schools were provided with the opportunity to have the application of the refined DEIS identification model to their school’s data reviewed. The appeals process also offered schools the opportunity to review their school enrolment data which they had submitted to the department and to improve its accuracy if necessary. All appeals submitted have now been processed by the department and schools have been notified of the outcome. The DEIS appeals process was applied fairly across all appellants, the window for appeals has now closed and the results are final.  It is possible for two neighbouring schools to have a different profile in terms of proportion of students from disadvantaged backgrounds and the relative weighting of disadvantage apportioned in each. The designation of neighbouring schools to different DEIS status does not mean that there is no educational disadvantage present in one school, but that the concentrated level of educational disadvantage of the two schools is different. Gender of students, ethos of the school or the designation of a school as single or mixed is not a factor in the DEIS identification model.  The DEIS programme is based on the premise that in order to have the maximum possible impact on providing opportunities for students most at risk of educational disadvantage, extra resources must be targeted as closely as possible at those students with the greatest level of need.  I am determined to close the performance gap between DEIS and non-DEIS schools and introduce more innovative solutions to tackle disadvantage. A new DEIS Plan will be published in 2025. This plan will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling educational disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  Minor Works & Emergency Works  The Department recognises the importance of the Minor Works Grant to primary and special schools. Under Project Ireland 2040, a commitment was given that the Minor Works Grant would be paid in either December or January of the school year to all primary and special schools. In recent years the Department’s approach has been to pay the Minor Works Grant to primary and special schools in advance of the start of the following school year to facilitate a better lead in period for schools to plan any maintenance or minor works during the summer period.  The Minor Works Grant for the school year 2024/2025 issued in April 2024. The lead-in period ahead of the new school year, give schools sufficient time to make plans and set priorities for use of the funding.  Primary and special schools need not apply for minor works grant aid. Under the scheme, funding is made available to all primary and special schools on the following basis:  €5,500 basic grant plus €18.50 per mainstream pupil and €74 per special needs pupil enrolled in the school on the 30th of September of the year prior to the issue of the grant. The €74 rate applies to a special needs pupil attending a special school or attending a special class attached to a mainstream school.  Schools have the autonomy to use this funding for maintenance and small-scale improvements to school buildings and grounds. Given that each school setting is different, individual schools are best placed to decide how best to use this funding to address their particular needs.  The works that can be undertaken under the Minor Works Grant Scheme include maintenance and small-scale improvements to school buildings and grounds, painting, improvement or replacement of mechanical and electrical services, the purchase of standard furniture and educational equipment, the purchase of floor coverings and window blinds, the purchase of IT related equipment, ventilation improvements, and enhancements to outdoor learning environments.  The Department's Planning & Building Unit is currently assessing its work programme and priorities for 2025 in the context of its available funding. The timeline for the payment of the next tranche of grant funding will be confirmed in due course.  The Emergency Works Scheme ensures the availability of funding for urgent works to schools that need resources as a result of an emergency situation. An emergency is a situation which poses an immediate risk to health, life, property or the environment, that happens in sudden, unforeseen circumstances and requires immediate action, and if not corrected, would prevent the school, or part of it, from opening. The EWS operates on the basis of the minimal scope of works required to remedy an emergency situation. The EWS usually provides an interim solution until such time as a comprehensive solution can be provided under the Summer Works Scheme (SWS). As part of the minimal scope general maintenance and paining are not covered by EWS and it is open to schools to use their Minor Works Grant for such issues. Further information and how to apply can be found on the Gov.ie website or at gov - Emergency works (www.gov.ie)  Caretakers  As part of a package agreed with Fórsa, the trade union representing school secretaries and caretakers, following a series of engagements at the Workplace Relations Commission (WRC) in 2022, the implementation of revised salary and annual leave entitlements for school secretaries is now fully operational, and lessons learned from that process are now playing a key role in the drafting and implementation of a similar deal to be offered to grant funded school caretakers.  The Department is committed to ensuring that school caretakers will be afforded the opportunity to avail of a similar package to that which was accepted by school secretaries in the near future. As the deal to be offered to caretakers, when agreed, will be similar to that implemented for school secretaries, it is not currently anticipated that the granting of public servant status, and the entitlements which arise therefrom, will form part of the proposal.  In the normal course, there are ongoing discussions with the public service unions on any and all matters relating to pay agreements. Any review of changes to the employment of school caretakers or other pay mechanisms, can occur only under those processes and any such proposals would need to be considered in detail by the Department, the Department of Public Expenditure and Reform, and the relevant unions.  Capitation Funding  The Department is committed to providing funding to recognised primary and post-primary schools in the Free Education Scheme by way of per capita grants. The two main grants are the capitation grant to cater for day-to-day running costs such as heating, lighting, cleaning, insurance and general up-keep, and the ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities, except for the employment of relevant secretaries as per Circular 0036/2022.  The current standard rate of capitation grant is €200 per pupil in primary schools and €345 per student in post-primary schools.  Primary schools with fewer than 60 pupils are paid the capitation and the ancillary grants on the basis of having 60 pupils.  As part of the capitation package in Budget 2025 the Department is pleased to have secured over €30 million as a permanent increase in capitation funding to assist schools now and longer term with increased day-to-day running costs. This represents an increase of circa 12% on current standard rates and enhanced rates. This increase is on top of the circa 9.2% increase from last year’s budget. This will bring the standard rate of capitation grant to the level of €224 per pupil in primary schools and €386 per student in post-primary schools from September 2025. Enhanced rates will also be paid in respect of pupils with special educational needs and Traveller pupils. Schools should also ensure that they are availing of the available OGP procurement frameworks and getting best value for money for all school expenditure.  In addition to these grants, €45 million in cost-of-living supports issued in November 2024 to support all recognised primary and post-primary schools in the Free Education Scheme. This additional funding announced in Budget 2025 is designed to assist schools with increased day-to-day running costs such as heating and electricity. This funding was paid at a rate of €36 per pupil in primary schools and €55 per student in post-primary schools. Enhanced rates were also paid in respect of pupils with special educational needs and Traveller pupils.  The Financial Support Services Unit (FSSU), funded by the Department, is an important source of advice and support to schools on financial matters, including budgeting and cashflow management. Contact details for FSSU can be found on www.fssu.ie. ",
        "date": "2025-05-07"
      }
    },
    {
      "contextDate": "2025-04-10",
      "question": {
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "date": "2025-04-10",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-10/pq_221",
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the current school year, over 172,500 children, are transported daily in approximately 7,900 vehicles across 10,300 routes daily to primary and post-primary schools throughout the country. These daily trips cover over 100 million kilometres. This figure includes over 143,800 pupils travelling on primary and post primary services, 21,700 pupils with special educational needs, and 6,800 pupils who have arrived in Ireland from Ukraine.  The scheme is made up of three separate schemes, the school transport scheme for primary, post primary and for children with special educational needs. Transport is also provided for children who have arrived in Ireland from Ukraine and those residing in IPAS/EROC centres.  The total expenditure on the scheme in 2024 was €512m.  Bus Éireann has advised that the pupils in the area in question are deemed concessionary to schools in the referred town as it is not their nearest post-primary centre and there is no service available.  The Bus Éireann family portal is now open for new applications for school transport services for the 2025/26 school year. The closing date for new applications is Friday 25 April 2025.  Under the current terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the department/Bus Éireann, having regard to ethos and language.  Eligible children who complete the application process and pay or enter their medical card details on time will get a seat on a school bus service, if a service is available.  Children who are not eligible for school transport but complete the application and pay or enter their medical card details on time will be considered for any spare seats available after eligible children have been accommodated. These spare seats are called concessionary seats.  There may be more demand than availability for concessionary seats. In such cases, Bus Éireann will use a selection process to allocate tickets for the spare seats.  A minimum number of 10 eligible children residing in a distinct locality, as determined by Bus Éireann, are required before consideration may be given to the establishment or retention of school transport services, provided this can be done within reasonable cost limits.  Temporary alleviation measures will continue for the 2025/26 school year at post-primary level. This means that, if there are available services and enough capacity, transport will be provided for concessionary pupils who are eligible for transport to their nearest school but are attending their second nearest school or post-primary centre. This is only if they apply on time and pay or enter medical card details on time.  The School Transport 2030 report, which was published in early 2024 marks the largest review of the School Transport Scheme since it was established in 1967. The Government is committed to working to achieve the report’s recommendation of expanding access to the scheme so that an additional 100,000 pupils can be carried by 2030. The recommended changes to the future operation of the schemes include expansion of the current eligibility criteria, addressing current operational challenges and moving towards better integration with public transport to ensure the best value for money to the Exchequer. A phased implementation of the review’s recommendations began at the start of the 2024/2025 school year.  As indicated at the time of the launch of the review, a number of pilots were being considered by my Department in conjunction with the Department of Transport and Bus Éireann. As also indicated at the time of the launch of the review, it was intended that following closure of the application process for the 2024/2025 school year consideration would be given to further potential pilots.  A total of 14 pilot projects are underway this school year. These pilots are currently being evaluated and they will provide valuable insights into the impact of increased demand on the scheme, the potential for integrating public transport with school transport services, and opportunities to promote more sustainable modes of transport. The findings from the evaluation will guide the planning and implementation needed for a national rollout of a revised School Transport Scheme.  Further information on plans for the 2025/2026 school year will be available shortly. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 221. Deputy Michael Lowry asked the Minister for Education if she will examine a request from a person (details supplied) regarding the ongoing school transport situation between Templederry, Nenagh, County Tipperary to attend secondary schools in Thurles, County Tipperary [18147/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_218",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-10/writtens/mul@/dbsect_218.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-10/writtens/dbsect_218",
          "showAs": "School Transport"
        },
        "questionNumber": 221,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "question": {
        "questionNumber": 219,
        "showAs": " 219. Deputy Michael Lowry asked the Minister for Education if she will examine the response issued to the parents of a pupil (details supplied); if she will consider removing the nearest school criteria so that pupils are not locked out of school transport for attending other schools that better meet their needs but are not their closest school; and if she will make a statement on the matter. [16400/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-03/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          },
          "showAs": "School Transport",
          "debateSectionId": "dbsect_231",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-03/writtens/dbsect_231"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-03",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-03/pq_219",
        "by": {
          "showAs": "Michael Lowry",
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10"
        },
        "questionType": "written",
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the current school year, over 172,500 children, are transported daily in approximately 7,900 vehicles across 10,300 routes daily to primary and post-primary schools throughout the country. These daily trips cover over 100 million kilometres. This figure includes over 143,800 pupils travelling on primary and post primary services, 21,700 pupils with special educational needs, and 6,800 pupils who have arrived in Ireland from Ukraine. The scheme is made up of three separate schemes, the school transport scheme for primary, post primary and for children with special educational needs. Transport is also provided for children who have arrived in Ireland from Ukraine and those residing in IPAS/EROC centres. The total expenditure on the scheme in 2024 was €512m.  Under the terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the department/Bus Éireann, having regard to ethos and language.  Eligible children who complete the application process and pay or enter their medical card details on time will get a seat on a school bus service, if a service is available.  Children who are not eligible for school transport but complete the application and pay or enter their medical card details on time will be considered for any spare seats available after eligible children have been accommodated. These spare seats are called concessionary seats.  There may be more demand than availability for concessionary seats. In such cases, Bus Éireann will use a selection process to allocate tickets for the spare seats.  Temporary alleviation measures will continue for the 2025/26 school year at post-primary level. This means that, if there are available services and enough capacity, transport will be provided for concessionary pupils who are eligible for transport to their nearest school but are attending their second nearest school or post-primary centre. This is only if they apply on time and pay or enter medical card details on time.  Bus Éireann, has advised that the child referred to by the Deputy is attending his second nearest school and therefore he is not eligible for school transport under the Primary and Post Primary School Transport Scheme.  Bus Éireann is responsible for the planning and timetabling of school transport routes. Bus Éireann endeavours, within available resources, to ensure that each eligible child has a reasonable level of school transport service in the context of the Scheme nationally. Once routes have been finalised, Bus Éireann will assign tickets for each school transport service. Tickets will begin to issue in mid-July and will continue to issue throughout July and August. Families who are unsuccessful in obtaining a seat will be notified via email and a refund will issue.  If a family has applied to attend their nearest school in regard to ethos and language and have been advised by the school authorities that it is full, the department will consider if the pupil is eligible to their next nearest school.  In this regard, families should provide the following documentary evidence as proof:  • an application for enrolment that was made within the deadline dates specified by the school, and  • a letter from the school authorities confirming that the school was full at time of enrolment.  All queries and documentation can be sent to School Transport Section through the Customer Service Portal here; Customer Service Portal. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-03"
    },
    {
      "contextDate": "2025-03-26",
      "question": {
        "by": {
          "memberCode": "Michael-Lowry.D.1987-03-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Lowry.D.1987-03-10",
          "showAs": "Michael Lowry"
        },
        "date": "2025-03-26",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-26/pq_17",
        "answerText": " Minister for the Environment, Climate and Communications  Following the outcome of the independent “National Review of State Supports for PhD Researchers”, directed by the Department of Further and Higher Education, Research, Innovation and Science (DFHERIS), SEAI announced in 2023 that the eligible research stipend budget contribution for SEAI-funded PhD students was increasing from €18,500 to €25,000 per annum effective from 1 January 2024.Following this announcement, all PhD stipends funded by SEAI since the 2023 call have received the increased €25,000 per annum in budget contributions.  SEAI also engaged with universities that are hosting SEAI funded projects awarded prior to 2023 with active PhD students. The universities then confirmed that in some cases the original awarding value was sufficient to apply this increase to their PhD students, but for others was challenging.  For these cases, SEAI is now progressing through the necessary internal review and approvals processes to progress a solution, with a decision expected by this Friday 28 March. ",
        "to": {
          "uri": null,
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 17. Deputy Michael Lowry asked the Minister for the Environment, Climate and Communications if he is aware of the ongoing issues faced by PhD researchers funded by the Sustainable Energy Authority of Ireland (SEAI) regarding the implementation of the recommended stipend increase from €18,500 to €25,000; the steps being taken to ensure that the necessary additional funding is allocated to support this increase; if the SEAI has received any additional funding to support the stipend increase; the measures that are being taken to ensure that all eligible PhD researchers receive the increased stipend as recommended; if he will commit to addressing this funding shortfall to support young researchers and promote research and innovation in Ireland; if he will take immediate action to resolve the financial difficulties faced by researchers due to rising living costs and inflation, given the importance of supporting research and innovation for Ireland’s future; and if he will make a statement on the matter. [14427/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_61",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-26/writtens/mul@/dbsect_61.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-26/writtens/dbsect_61",
          "showAs": "Research and Development"
        },
        "questionNumber": 17,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    }
  ]
}