{
  "head": {
    "counts": {
      "questionCount": 143,
      "resultCount": 143
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Shaping the Future: the Early Years Action Plan, Phase 1 Report , published on 17 December, sets out the Government’s approach to build an affordable, high-quality, accessible early learning and care (ELC) and school-age childcare (SAC) system. The approaches and actions set out in Shaping the Future relate to the full breadth of funding schemes for ELC and SAC.  Shaping the Future builds on the Expert Group review of the funding model that was set out in 2021 in the report, Partnership for the Public Good .  The Phase 1 report of Shaping the Future sets out specific actions to be undertaken in 2026, working within the budgetary resources available. During 2026, work will be undertaken to inform the development of Phase 2 actions, which will be published later in 2026 and which will relate to the period 2027 to 2029. The process of developing Phase 2 actions will include a broad public consultation process, in line with the Programme for Government commitment.  In addition, reviews of specific funding schemes are either in train or have been undertaken recently. A comprehensive review of the ECCE programme was published in October of last year. An evaluation of the Access and Inclusion Model was also published last year. Both final reports identified possible enhancements for the future, which informed the current Programme for Government commitments. The Programme for Government also commits to review and increase Core Funding.  An independent evaluation of the National Childcare Scheme will commence in early 2026 building on a previous review published in 2021. This evaluation will examine how effectively the Scheme is operating, whether it is meeting its policy objectives and if further changes are needed. Any changes to the ECCE Programme and/or the NCS will be made following consultation with those impacted, and in the wider context of Phase 2 actions in Shaping the Future to be published later in 2026, which will include a roadmap to reduce parental fees to a maximum of €200 per month over the lifetime of the Government.  An IGEES evaluation of the first year of Core Funding and the development of an evaluation framework for Core Funding is currently underway. This project will examine the early implementation of Core Funding and make recommendations for future evaluations of the grant. Findings from the project are expected in Quarter 1 2026.  In addition to this formal evaluation, since Core Funding was introduced, its effectiveness has been subject to ongoing review and the scheme itself has evolved year on year.  Core Funding has increased from €259m for year 1 and now stands at €392m for the current and fourth programme year. The allocation of this increased funding each year was informed by the data from previous years, feedback from stakeholders as well as an independent financial review of sessional services by Frontier Economics. The allocation for year 5 - which will exceed €480m - will be informed by a range of data, including validated financial returns from providers. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 22. Deputy Edward Timmins asked the Minister for Children, Disability and Equality the plans to review the funding models for childcare including anomalies in core funding; and if she will make a statement on the matter. [73196/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_65",
          "debateSectionId": "dbsect_65",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_65.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_22",
        "questionNumber": 22
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 142 and 157 together.  Regulation of retail energy markets is solely a matter for the Commission for Regulation of Utilities (CRU) since the enactment of the Electricity Regulation Act 1999, and subsequent legislation. The CRU is an independent regulator, accountable to the Oireachtas and not to me as Minister. However, officials from my Department engage with the CRU on an ongoing basis to track developments in retail and wholesale energy markets.  The latest data from Eurostat shows that, in nominal terms, Ireland ranked fifth for electricity prices and eighth for household gas prices among European countries in the first half of 2025. When adjusting for purchasing power parity, Ireland is mid-table in terms of energy affordability with the twelfth highest electricity and gas prices among European countries.  The CRU published a report on retail energy markets in September 2023 in relation to competition and supplier pricing in the energy market. The report was in response to a request by the then Minister for the Environment, Climate and Communications to examine supplier hedging practices and pricing strategies in the Irish energy market. Based on a review of supplier prices and wholesale market costs, the CRU considered that retail prices are broadly continuing to reflect underlying cost drivers, such as wholesale gas and electricity prices, but with a lag period due to supplier hedging strategies.  The CRU also published a report comparing household electricity and gas prices between Ireland and other European countries in 2024. This report outlined that hedging strategies employed by energy suppliers lessened the impact of price increases for households but resulted in elevated retail prices when compared to other European countries.  Under the Programme for Government 2025, we have committed to commissioning an independent review into the speed and level of pass through from wholesale prices to retail prices, with an additional assessment of the overall price dynamics and a focus on the competitiveness of the Irish economy. I have written to the CRU to commence work on this review and my officials have held initial discussions with the regulator in relation to progressing this commitment.  My Department has also established a cross-Government National Energy Affordability Taskforce to identify, assess and implement measures that will enhance energy affordability for households and businesses, while delivering key renewable commitments and protecting security of supply and economic stability.  The taskforce's first report set out measures for consideration as part of the Budget 2026 process. This report has been published on Gov.ie, in advance of further analysis and the publication of the Energy Affordability Action Plan in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 142. Deputy Edward Timmins asked the Minister for Climate, Energy and the Environment to explain the current level and the movement in electricity costs; and if he will make a statement on the matter. [73215/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_173",
          "debateSectionId": "dbsect_173",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_142",
        "questionNumber": 142
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Credit Review was set up in 2010 to encourage and increase the supply of credit to viable SMEs, sole traders and farmers and help ensure the bank credit system is operating effectively for them. The Credit review is an effective and affordable review service for businesses who have credit facilities refused, reduced, or withdrawn and where the loan amount was between €1,000 and €3m. Current participating banks include AIB, Bank of Ireland, and PTSB.  The Credit Reviewer has issued regular reports which contain details on the number of applications for review (appeal by borrowers against a bank’s credit decision). The reports can be found at: www.creditreview.ie  Borrowers are supported where the reviewer deems the business to be viable (able to meet debt repayments) or potentially viable. Where credit cannot be recommended at that point in time, a roadmap is provided for the borrowers to assist them in the steps required to become bankable in future.  Of cases completed since inception, 59 per cent were supported by Credit Review and the banks agreed to provide credit of €85.9m (or 78 per cent of the supported cases).  Details of the number of reviews (appeals) for the last three years:   APPLICATION NUMBERS       Year      2022      2023      2024       Total Applications    71    57    59      Eligible Cases    55    51    50      Abandoned    23    6    10      Withdrawn and Got Credit    3    4    3        APPEAL OUTCOMES       Year      2022      2023      2024       Total Appeals Completed    45    47    46      Bank Upheld    10    14    27      Borrower Supported    35    33    19      SME Got Credit    19    21    7       When the borrower is supported by Credit Review, the bank is asked to provide credit or explain why it will not (‘comply or explain’); Credit Review cannot compel banks to lend.  Where the Credit Review upholds a bank’s decision not to lend, it provides the borrower with a set of recommendations to address the weaknesses in the proposal. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 234. Deputy Edward Timmins asked the Tánaiste and Minister for Finance the number of applications made to the credit review office; the number that resulted in the credit review office recommending lending; the outcome from the banks in the past three years; and if he will make a statement on the matter. [69896/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_246",
          "debateSectionId": "dbsect_246",
          "showAs": "Credit Availability",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_246.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_234",
        "questionNumber": 234
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Historic weirs on rivers were generally constructed for private purposes, such as milling, fisheries or water management and responsibility for the maintenance or repair of weirs rests with the landowner.  A public body would have responsibility for such a weir if the structure was constructed by, or formally incorporated into, a statutory scheme under that body’s functions. My Department has no responsibility for the ownership or maintenance of weirs. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 274. Deputy Edward Timmins asked the Minister for Climate, Energy and the Environment who is responsible for historic weirs that have been eroded and allowed to deteriorate, such as the Slaney river weir at Baltinglass, County Wicklow. [73287/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_283",
          "debateSectionId": "dbsect_283",
          "showAs": "Waterways Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_283.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_274",
        "questionNumber": 274
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I would like to assure the Deputy that attracting and retaining talented individuals and encouraging them to stay and enjoy a fruitful career in the Defence Forces is a priority. Significant work has been undertaken over the past five years to transform the Defence Forces and is having a tangible impact with the stabilisation of overall staffing levels in the Defence Forces.  In addition to a programme of cultural transformation, which is underway, specific actions in retention, which have been delivered, include:  • Significant progress on pay;  • The extension of the existing Service Commitment Scheme for Air Corps pilots, to Air Traffic Control (ATC) personnel;  • An increase in the mandatory retirement age to 62;  • The extension of private healthcare to all ranks in the Defence Forces;  • Provision of fitness, training and sports facilities across its installations;  • Progress on the 2023-2027 Defence Forces Infrastructure Development Plan (IDP) with the highest level of financial resources in the State’s history;  • The provision of excellent training and education opportunities;  • The implementation of the Working Time Directive.  Work is continuing to build on these initiatives through the delivery of a Strategic HR Change Programme, which includes:  • The transformation of Career and Talent Processes and Promotion Systems;  • Remote Learning Solutions;  • A Coaching and Mentoring Programme;  • Flexible Work Practices and Family Friendly Policies.  Local Bargaining has emerged as an important tool to address targeted issues related to workforce retention, particularly within critical skill areas. A range of bespoke proposals are currently under consideration that seek to improve job satisfaction, enable professional development, and address known pinch points affecting career progression and operational continuity.  In January 2025, a Retention Team was set up in the Defence Forces to start building a clear pathway to reduce overall attrition across the Defence Forces. The first focus has been on stabilising the workforce through targeted, evidence-led actions.  Work is well underway on the Defence Forces Retention Strategy, with support from an external partner.  Looking further ahead, the Defence Forces Strategic Workforce Plan is being developed. This plan will set out how the organisation can best balance its workforce in terms of numbers, structure, and skills over the coming years. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 148. Deputy Edward Timmins asked the Minister for Defence the steps being taken to ensure retention of staff in the Defence Forces; and if she will make a statement on the matter. [72035/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_86",
          "debateSectionId": "dbsect_86",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_148",
        "questionNumber": 148
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  On 14 October 2025, the Government approved the General Scheme of the Residential Tenancies (Amendment) (No. 2) Bill 2025, which is now the subject of priority drafting by the Office of Parliamentary Council and pre legislative scrutiny by the Joint Oireachtas Committee on Housing, Local Government and Heritage. The Bill will amend the current system of rent controls and provide new measures to protect tenants, including stronger security of tenure, to come into effect for new tenancies created on or after 1 March 2026.  The Bill will include a number of provisions to mitigate the impact of 6 year Tenancies of Minimum Duration (TMDs) on a smaller landlord (i.e. a landlord who is not a company and has 3 or fewer tenancies). A smaller landlord will be allowed to terminate a tenancy at any time during a 6 year TMD if:  • the landlord intends to sell the rented dwelling due to financial hardship (to be prescribed in law) and does not wish to do so with the tenant(s) in situ;  • the landlord requires the property for himself/herself or an immediate family member (spouse/civil partner, child or parent) to occupy as a principal private residence;  • the tenant is breaching his/her tenancy obligations; or  • the dwelling is no longer suitable to the accommodation needs of the tenant household.  A detailed communications campaign by this Department, in conjunction with the RTB, will continue to publicise the new legislative measures from 1 March 2026.  Up-to-date information is available at: www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/government-reforms-to-the-rental-sector-starting-1-march-2026/.  The information provided in this reply is based on the policy measures approved by the Government on 10 June 2025 to come into effect on 1 March 2026, in order to boost investment in the supply of homes available for rent and keep existing landlords in the market. The Residential Tenancies (Amendment) (No. 2) Bill will be published as soon as possible and will be subject to debate, and open to amendment, during the legislative process in the Houses of the Oireachtas. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 578. Deputy Edward Timmins asked the Minister for Housing, Local Government and Heritage in the fair deal where a house must be sold within one year of the date of death, if a new tenant after 1 March 206 has a right to a six year tenancy in the same house after it is sold; and if he will make a statement on the matter. [71950/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_456",
          "debateSectionId": "dbsect_456",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_456.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_578",
        "questionNumber": 578
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department is committed to strong financial oversight and cost control. We achieve this through strategic planning, rigorous monitoring and operational efficiency.  Each year, we prepare detailed estimates of expenditure. This is a robust process that examines current spending, identifies opportunities for savings and reallocates resources to priority areas. Every Department submits its estimates to the Vote sections within my Department, which are then carefully scrutinised to ensure that only essential resources are sought.  All spending is subject to review and approval in line with established policies and circulars. Earlier this year, I committed to carrying out a review of Public Financial Procedures (PFP) with a view to further enhancing accountability in regard to public expenditure management and ensuring value for money in government decision making. This review process, which is now underway, is about understanding what supports and structures can help to deliver accountability and performance improvements in:  • budgetary discipline within the limits voted by Dáil Éireann;  • clarity around accountability and financial responsibility to Government and the Oireachtas;  • how financial accountability rules enable responsible delivery; and  • evidence based expenditure decisions.  The review process and updated PFP and related supports will look to better assist Accounting Officers, Finance Officers and other expenditure officials over programmes carry out their duties. It will also assist parliamentarians to better understand where responsibility and accountability lie on questions of value for money and budgetary management that will support scrutiny by the Oireachtas of spending decisions and compliance with governance requirements. The updated PFP should ensure that all officials who are responsible for public expenditure are clear in terms of their personal and legal accountability for budgetary discipline.  Value for money is an ongoing priority for this Government. In July this year, my Department issued a circular to set out the value for money obligations on all civil and public servants, so that the public sector demonstrates the highest standards of financial judgement and due diligence when developing and implementing policy. I continue to work to improve cost control through every lever available to me. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 47. Deputy Edward Timmins asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the measures to improve cost control in his Department; and if he will make a statement on the matter. [70823/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_88",
          "debateSectionId": "dbsect_88",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_47",
        "questionNumber": 47
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As part of the NDP Review 2025, Government set out annual sectoral allocations for 2026 to 2030, and overall Government capital expenditure ceilings to 2035. This leads to a total public capital investment of €275.4 billion over the period to 2035. This comprises €202.4 billion in Exchequer Voted capital expenditure from 2026 to 2035.  Of this, €102.4 billion is being allocated for the next five years – an additional €23.9 billion on what was previously allocated in the NDP. A further €10 billion in equity and fund releases is being provided for mega-projects in water, energy and transport. This brings the total additional capital investment to €33.9 billion for the period to 2030.  The agreement of five-year annual sectoral allocations provides multiyear certainty to departments as to their level of capital funding over the next five years. This multiyear certainty has enabled departments to plan for the delivery of their capital investment priorities through to 2030. It also provides visibility on the investment pipeline to enable construction firms to scale capacity and prepare commercial bids to deliver on the planned investment.  In addition, the provision of €10 billion in equity and fund releases to fund strategic megaprojects in the water, energy and transport sectors provides certainty regarding the pipeline of investment in these critical sectors through a ring-fenced funding mechanism outside of the core exchequer gross voted capital allocations.  Responsibility for the prioritisation, management and delivery of individual investment projects within the agreed NDP allocations, rests with the individual sponsoring Department in each case. Information on the individual capital projects to be prioritised in each sector is available in the sectoral investment plans, which are being published by each department through November and December. These plans set out the capital projects being prioritised for delivery by department across 2026 to 2030.   Question No. 71 answered with Question No. 69.  ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 70. Deputy Edward Timmins asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the measures to support long term funding guarantees on capital infrastructure projects; and if he will make a statement on the matter. [70824/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_109",
          "debateSectionId": "dbsect_109",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_109.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_70",
        "questionNumber": 70
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The current status of the 3 secondary school projects referred to by the Deputy is as follows:  The Blessington Community College project has been devolved for delivery to Kildare and Wicklow Education and Training Board (KWETB). The Project is currently at Stage 2b of the architectural design process. This stage allows for detailed design and planning, obtaining the necessary statutory permissions and the preparation of tender documents. A full grant of planning permission has been received for the school.  KWETB have recently submitted the Stage 2b report to the Department and this is currently under review by the Departments Professional and Technical team. When this review is complete the Department will revert directly to KWETB regarding the next steps. While at this early stage, it is not possible to provide a timeline for the completion of the project. KWETB will continue to engage directly with the school authorities to keep them fully informed of progress.  Regarding St Kevins CC Dunlavin, this project has been devolved to the National Development Finance Agency (NDFA) for delivery as part of a programme of school building projects. The project is currently at Stage 2b of the architectural planning design process with a full grant of planning permission received for the school in 2024. Stage 2b is being finalised at the moment. The length of time a project takes to go through each stage varies, depending on a number of factors, including scale and complexity.  While at this early stage it is not possible to provide a timeline for completion of this project, the NDFA will continue to engage directly with the school authorities to keep them fully informed of progress on this important project.  Finally, in relation to Scoil Chonglais Baltinglass, the school was approved a project under my Department’s Additional School Accommodation (ASA) scheme?to provide three general classrooms, one Textiles room, one Music room, one DCG/Tech room, one Home Economics room, two Science laboratories with one Prep area and a two Classroom SEN base.? This project has been devolved for delivery to KWETB.  This project received my Departments approval to go to planning in Q1 2025 and my Department currently awaits a post planning (developed design) report for review. It is now within the remit of the school authority along with KWETB to progress this project.  The Department is committed to ensuring appropriate school accommodation is available for all children in West Wicklow and will in the wider context outlined, ensure that these three projects - as for all projects on our school building programme - are subject to the due diligence required under the Public Infrastructure Guidelines.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  Government Departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 120. Deputy Edward Timmins asked the Minister for Education and Youth the status of building projects at schools in west Wicklow (details supplied);; and if she will make a statement on the matter. [70829/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_142",
          "debateSectionId": "dbsect_142",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_120",
        "questionNumber": 120
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Ensuring that every child's experience in school is positive and that they have qualified, engaged teachers available to support them in their learning is a priority area of action for this Government.  The Department is currently producing a range of data on teacher supply to improve the understanding of the teacher supply landscape. My Department has recently published three reports: an analysis of the Teaching Council register, unmet demand in post-primary schools and on substitute teachers.  My Department is also undertaking other teacher supply data analysis including teacher demand and supply projections and an annual analysis of the teaching workforce based on analysis of teacher payroll data. These reports are expected to be published in early 2026.??  Pupil enrolment projections are a key tool for education planning in Ireland, offering insights into school attendance trends over the next 20 years. In March 2024 the Projections of full-time enrolment Primary and Post Primary level 2023 – 2042 report on enrolment projections was published (available here [ www.gov.ie/en/department-of-education/collections/projections/ ]). This report, forms part of a regular series by my Department and updates the 2021 national and regional projections which informs teacher demand and supply modelling.  The revised enrolment projection’s report will inform the upcoming statistical projections on annual teacher demand and supply at primary and post-primary levels. The most recent analysis of teacher supply and demand Developing a Teacher Demand and Supply Model for Ireland 2021-2038 A Technical Report was published in March 2021.?(see [ assets.gov.ie/static/documents/developing-a-teacher-demand-and-supply-model-for-ireland-2021-2038-a-technical-report.pdf ]).  The data produced by my Department shows there are more qualified teachers than ever working in schools with analysis of teacher payroll data from March 2025 showing over 79,000 teachers employed nationwide in our schools with over 43,000 at primary level including special schools and 36,000 in post-primary schools.?Over?97% of ?allocated teaching posts are filled.??  Demand for teacher education remains strong, with 3,600 newly qualified teachers registered in 2025. Salaries range from €44,879 to €85,000, and CAO first-preference applications for teaching programmes have increased steadily.  My Department continues to engage closely with stakeholders to address teacher supply and retention challenges. I am committed to considering further measures to strengthen the teaching workforce to ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 182. Deputy Edward Timmins asked the Minister for Education and Youth if a review is being carried out of the projected teacher numbers required at primary and post primary schools; and if she will make a statement on the matter. [67791/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_207",
          "debateSectionId": "dbsect_207",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_207.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Edward Timmins  As I am sure the Minister is aware, Erasmus is a wonderful programme that has brought students from all over Europe together and allowed them to experience other cultures. It has increased our understanding of other European countries and, thus, has given Irish people ideas and knowledge that have enriched our country. It has been a huge success and is mostly a positive experience for those who partake in it. Are there plans to vary, expand or deepen the Erasmus programme for third level students? \n Deputy James Lawless  I am glad the Deputy raised this programme because it is extremely important. It has served us and our students and educational institutions well. I was in Europe on Tuesday at the Competitiveness Council. I attended the research and innovation meetings. I will be back in the near future attending the education Council at which Erasmus will be on the agenda. My colleague, the Minister of State, Deputy Harkin, recently attended a meeting of a similar nature, in Copenhagen I think, where some of these discussions took place.  The current Erasmus+ programme supports education, training, youth and sport and aligns closely with the objectives of the European Education Area as well as the ambitions set out in the European Commission's Union of Skills communications of March this year. The goal is to develop high-quality adaptable training and skills systems that strengthen the EU's competitiveness. When people travel the mind broadens, the experience is wider, people are generally richer for the experience and bring back an enhanced skill set as well as relationships and networking that stand to them in due course. It is part of our competitiveness as a Union and a Continent.  There are also measures such as the European universities alliances. I had the pleasure of opening the conference these had in UCC earlier this year. The alliances also create long-term partnerships and deepen collaboration across the sector. Erasmus+ remains one of the key European Union initiatives with significant impact. It has played a central role in promoting mobility, strengthening intercultural understanding and expanding exciting opportunities for learners. Last year, more than 6,200 Irish higher education students participated in Erasmus, with strong engagement across schools, vocational education and training, youth and sport. I expect that trend to continue in an upward direction as the programme evolves. There is an emerging shape of the new Erasmus programme from 2028 to 2034. \n Deputy Edward Timmins  Ireland benefits more than any other European nation from this programme. Given our geographic location, it is so important that we develop contacts and understanding of mainland Europe. This enriches us culturally. Understanding another language leads us to better understand other peoples. It also helps us think in different ways and develop new ideas. Learning a European language is one of the most enriching experiences one can have. I speak as someone who spent a few years working and living in mainland Europe, in France, Germany and Switzerland. There are also economic benefits to these exchanges. As a small nation, we are hugely dependent on exports. We have a huge market of wealthy economies on our doorstep. There are opportunities for Irish businesses to export to these countries. They also represent economies we can rely on, which are stable and respect the rule of law. \n Deputy Colm Burke  This is an extremely important programme, and I welcome it. To take a slightly different angle, I am disappointed by the lack of joined-up thinking in our universities about offering joint courses at universities in Northern Ireland and in the South.  For instance, I remember when I was Lord Mayor of Cork I travelled to Shanghai to set up a link between UCC and two universities in Shanghai, but we do not seem to have that connection with the third level institutions in Northern Ireland. The Department of higher education should try to expand that. A student could do three years in UCD and one year in a university in Northern Ireland or three years in UCC and one year in Northern Ireland. I do not think we have done enough in that whole area and it is very important we develop it. \n Deputy James Lawless  I will take Deputy Burke's question first and then come back to Deputy Timmins. Regarding the Northern Ireland dimension, I am glad the Deputy raised this important point. Unfortunately, with the UK leaving the European Union, Northern Ireland is not eligible for Erasmus programmes. However, the Government supports Northern Ireland students to allow them to continue to participate. Northern Ireland students are funded by the Republic to partake in Erasmus. We have done that repeatedly in recent years to ensure students there have the opportunities available to students elsewhere on the island. I am proud we are able to do that on an all-Ireland basis.  I take the Deputy's point about the potential for a placement in a Northern university and vice versa . I mentioned a few moments ago the Queen's University Belfast and Dundalk IT collaboration under which we will have the first all-island university very soon. The next question goes to that issue and I will speak more on it when we reach it. I will respond to Deputy Timmins shortly. \n Deputy Edward Timmins  I note the current Erasmus+ programme ambitions include fostering stronger participation in democratic life, common values and civic engagement. This is more important than ever, given the threat democracy is experiencing in the western world. The ambition to expand well beyond Europe's borders is also commendable. Promoting our European values is a worthy cause. We often forget how fortunate we are to live in a peaceful, democratic and wealthy society, something our ancestors could only dream of and which people in many parts of the world today do not have.  Ireland was known as the island of saints and scholars back in the Dark Ages. We went to Europe, educated the natives and our legacy remains all over Europe. I urge the Minister to continue to support and develop this rich and positive programme that we call Erasmus. \n Deputy James Lawless  The Deputy is absolutely right and I completely agree. The point is well made, particularly now, when we have the shadow of war on the Continent and tensions internationally. Perhaps, we do not have the same community of nations that we might traditionally have enjoyed. It is all the more important, therefore, that we better understand each other, communicate and exchange with one another, and have shared experiences, including the pan-European experience Erasmus can afford.  The shape of the new programme proposes to merge Erasmus with the European Solidarity Corps, which will create a new single integrated programme that will go beyond the university experience, viable though that is, to also incorporate volunteering and community activities. That would include learning opportunities across volunteering, youth and sport, as well as the purely educational aspects and promote co-operation between institutions. It will encourage institutions to engage in universities alliances and other European initiatives that bring universities together at European level. This is a positive development, which will deepen and strengthen the programme. I am very much committed to supporting it. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 212. Deputy Edward Timmins asked the Minister for Further and Higher Education, Research, Innovation and Science if there are plans to vary, expand or deepen the Erasmus programme for third level students; and if he will make a statement on the matter. [67790/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_47",
          "debateSectionId": "dbsect_47",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_47.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_212",
        "questionNumber": 212
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland's Capital Gains Tax (CGT) rate is 33%. It is paid on the chargeable capital gain made when a person disposes of an asset. The chargeable gain is usually the difference between the price paid for the asset and the price it is disposed of. CGT is payable by the person making the disposal.  Section 556 of the Taxes Consolidation Act 1997 (‘TCA 1997’) provides a measure of relief for capital gains which are attributable purely to inflation, commonly known as ‘indexation relief’. The section provides that, in computing the chargeable gain on the disposal of an asset, the cost of acquisition of the asset (and any other expenditure allowable in computing the gain) are to be indexed, that is, they are to be adjusted by applying to it a multiplier based on the All Items Consumer Price Index as compiled by the Central Statistics Office. Finance Act 2003 amended section 556 TCA 1997 such that indexation relief does not apply from the 2003 tax year onwards. Indexation relief however, continues to be available in computing a chargeable gain arising on the disposal of an asset where the deductible expenditure on that asset was incurred prior to the tax year 2003, with the relevant indexation multiplier being determined by reference to the year in which the expenditure was incurred.  Where an asset was held on 6 April 1974, the market value of the asset as at that date is deemed to be the cost of acquisition and indexation is applied to this base “cost”. Indexation relief cannot operate to create an artificial loss or to augment an actual monetary loss. There is also a restriction on the amount of indexation available on the disposal of development land – section 651 TCA 1997 restricts indexation relief to the current use value of the land at the date of acquisition, together with such proportion of the incidental costs of acquisition as is referable to that current use value.  Indexation relief was ended as a means of gradually broadening the tax base, and it has proved effective in that regard.  The Programme for Government commits to maintaining a broad tax base to guard against the need for counter-cyclical fiscal policy in the event of a downturn and to prepare for future budgetary challenges relating to population aging. CGT is part of a system to ensure taxation is not focused solely on income tax and that those who benefit from gains in the value of their assets are included within the tax net on an equitable basis.  For this reason, it is not intended to reintroduce indexation for capital gains tax. As with all taxes, CGT is subject to ongoing review, which involves the consideration and assessment of the rate of CGT and the relevant reliefs and exemptions from CGT. CGT policy and legislation is reviewed as part of the annual Budget and Finance Bill process and as part of wider tax policy considerations. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 35. Deputy Edward Timmins asked the Tánaiste and Minister for Finance if he will reintroduce indexation for capital gains; and if he will make a statement on the matter. [64608/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_55",
          "debateSectionId": "dbsect_55",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_55.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_35",
        "questionNumber": 35
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Residential Zoned Land Tax (RZLT) was introduced in Finance Act 2021 and first charged in 2025. It seeks to increase housing supply by encouraging the activation of residential development on lands which are suitably zoned and appropriately serviced.  Owners of land which was zoned for residential use and serviced on 1 January 2022, or which first became both zoned for residential use and serviced in the course of 2022, and which appeared on the revised map published by local authorities by 31 January 2025, first became liable to RZLT on 1 February 2025.  It is important to note that, to come within the scope of RZLT, farmland must be both zoned for residential use and serviced. Farmland that is zoned for residential use, but which is not currently serviced is not within the scope of the tax and will only come within the scope of the tax should the land become serviced in the future.  The legislation also provides that farmland which is zoned for mixed use, including residential use, and which is integral to the operation of a farming trade carried out on or beside it, is excluded from the tax, even where such land is serviced, and should not be included on the RZLT maps prepared and published by local authorities identifying land within the scope of the tax.  Finance Bill 2025 provides a further opportunity to landowners whose land will appear on a revised map to be published on 31 January 2026 to request the rezoning of such land to reflect its economic use from the local authority in whose functional area the land is situated. Where certain conditions are met, such land will be granted an exemption from the 2026 RZLT liability, and where land is subsequently re-zoned such that it no longer meets the relevant criteria for the tax, it will fall outside the scope of RZLT going forward.  The Deputy should also be aware that as much as possible, it is important to treat all landowners in a similar way in relation to the application of RZLT. Consequently, if we were to exempt one group of landowners such as farmers, whilst applying the tax to others who may have equally compelling reasons from an economic activity perspective to seek an exemption, there is a risk of a legal challenge to the legislation.  As with all taxes, RZLT is kept under regular review by officials in my department. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 38. Deputy Edward Timmins asked the Tánaiste and Minister for Finance if work will be carried out to simplify the exclusion process whereby farmed land is subject to the residential zoned land tax; and if he will make a statement on the matter. [55032/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_58",
          "debateSectionId": "dbsect_58",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_38",
        "questionNumber": 38
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Finance Act 2021 introduced Part 22A Residential Zoned Land Tax (RZLT) into the Taxes Consolidation Act 1997. RZLT is designed to prompt residential development by owners of land that satisfies the relevant criteria for the tax, that being that the land is zoned for residential or mixed-use (including residential) purposes and is serviced.  RZLT is an annual tax, calculated at a rate of 3% of the market value of the land within its scope. Where land is zoned or serviced after 1 January 2022, the tax is first due in the third year after the year in which it comes within scope. The tax was first charged on 1 February 2025 in respect of land which satisfied the relevant criteria on or before 31 December 2022 and was payable in May 2025, subject to certain exemptions and deferrals. The 2026 liability will arise on 1 February 2026 in respect of land which satisfied the relevant criteria on or before 31 December 2023 and will be payable by 23 May 2026.  The objective of RZLT is to activate land for residential development. Where an application for planning permission in respect of a site that is subject to RZLT is refused, development cannot commence and the land remains within the charge to RZLT. However, should a subsequent application for planning permission be successful, RZLT arising in the 12 months after the grant of planning permission may be deferred. Where residential development commences within that 12-month period, the RZLT so deferred will, on the making of a claim, not be payable where development is completed within the timeframe set out in the planning permission and a certificate of compliance on completion is in place to evidence same. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 320. Deputy Edward Timmins asked the Tánaiste and Minister for Finance if a person is still liable for the residential zoned land tax in cases in which an application for planning permission is refused; and if he will make a statement on the matter. [69950/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Residency Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_320",
        "questionNumber": 320
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My department’s Walks Scheme provides funding to private landholders who maintain the walking trails that traverse their land. A trail must be approved and registered on Sport Ireland’s Trail Register in order to be considered for the scheme.  This scheme has grown substantially in recent years, with more than four times as many trails now approved on the scheme compared to this time 6 years ago.  In May of this year, I announced that an additional 22 new walking trails had received approval in principle to join the Walks Scheme. There are now 164 trails that are fully approved or have approval in principle to join the Walks Scheme compared to just 39 trails on the scheme at the end of 2019. This exceeds the commitment under Embracing Ireland’s Outdoors, the National Outdoor Recreation Strategy, to increase the number of trails covered by the Walks Scheme to 150.  Once a trail is approved to join the scheme, the local development companies who manage the scheme on behalf of my department work with landowners to develop tailored work plans and to fully bring the trail on to the scheme. To date, 120 trails and 2,719 landowners have been fully brought onto the scheme.  My department provides funding for 23 Rural Recreation Officers, or RROs, in 22 local development companies countrywide. Work is ongoing by the local development companies and the RROs to bring the remaining trails on to the scheme.  I am open to widening the scheme further in due course. My immediate focus is to bring the trails that have approval in principle fully on to the scheme as soon as possible. This will allow eligible landowners to undertake agreed work on the trails and receive their payments. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 20. Deputy Edward Timmins asked the Minister for Rural and Community Development and the Gaeltacht the plans which are in place for expanding the walking and trails schemes; and if he will make a statement on the matter. [68489/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_57",
          "debateSectionId": "dbsect_57",
          "showAs": "Sport and Recreational Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_57.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_20",
        "questionNumber": 20
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Rural Regeneration and Development Fund (RRDF) is a major programme which seeks to support large-scale, ambitious projects that can achieve sustainable economic and social development in rural areas. The focus of the RRDF is on rural towns and villages with a population of less than 10,000 people.  Funding under the RRDF is allocated to local authorities and other State-funded bodies, who take the lead role in individual projects and manage project spend. As a general rule, the RRDF will provide up to 80% of the total project costs, with at least 20% to be provided in matching contributions by the applicants. For counties in the North-West Region, this matching requirement has been reduced to 10%.  RRDF grant payments are made to the designated Lead Body over the lifetime of the project. The department makes this funding available on the basis of actual expenditure incurred at project level, and claimed thereafter by the Lead Body. To date, the RRDF has allocated over €613 million for 273 projects across Ireland, with over €258 million of that having been drawn down to date by Lead Bodies. Substantial further claims are expected by the end of this year, and my officials continue to engage proactively with Lead Bodies in relation to maximising drawdown over the course of these multi annual projects.  I was delighted to recently announce successful projects under the Fourth Call for Category 2 applications, with funding of over €20.5 million being allocated to 30 landmark regeneration projects in rural communities across the country. I can also confirm it is my intention to launch a Call for Proposals for larger scale Category 1 RRDF projects in the near future.  I am committed to ensuring that the RRDF can continue to support high quality and transformational projects across rural Ireland in line with the objectives of Our Rural Future and the Town Centre First policy . ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 52. Deputy Edward Timmins asked the Minister for Rural and Community Development and the Gaeltacht regarding the Rural Regeneration and Development Fund, the amount which has been allocated to and been spent to date on the scheme since its inception; and if he will make a statement on the matter. [68488/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_89",
          "debateSectionId": "dbsect_89",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_52",
        "questionNumber": 52
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Edward Timmins  It is important that in all our discussions here, we choose our language carefully. We must not say anything that might inflame situations or give encouragement to any extreme positions. We must stick to the facts at all times. Let us remember that we are talking about fellow human beings.  I ask if there is a strategy to spread the location of IPAS accommodation and avoid having large clusters in one area. \n Deputy Colm Brophy  I appreciate the comments in relation to the language and tone that must be used at all times in having conversations around this issue. It is very important, and important in this House.  During the period from 2022 to 2024, over 45,000 additional international protection applicants arrived in Ireland. Prior to this, a typical three-year period would have seen between 8,000 and 9,000 arrivals. IPAS was accommodating approximately 7,000 people in total at the end of 2021. By the end of 2024, that figure had risen to 32,000.  During that surge, the State was obliged to urgently source over 26,000 beds for international protection applicants, and in parallel, up to 60,000 beds for people fleeing the war in Ukraine. Centres were opened across the country, often at short notice, in order to ensure that people were provided with shelter. Given the emergency, the State was not in a position to implement any deliberate policies in relation to dispersal or distribution of accommodation centres during this period. However, I note that the 318 IPAS accommodation centres currently in operation are distributed and operational in every county across Ireland.  Due to the reduction in the numbers seeking international protection in 2025, my Department has been able to progress a range of very significant actions; to work to improve oversight, particularly of value for money; and to increase the proportion of State-owned beds across the system. The new rate card that has been implemented for contracts has delivered savings of over €59 million since May of this year. While commissioning emergency commercial accommodation will continue to be necessary in the short to medium term, it is being contracted on a short-term basis, which enables the State to decommission this capacity with agility as contracts expire or to meet fluctuating demand.  Ireland has adopted and is now working to implement the EU pact on migration. Reforming and speeding up the processing of applications should serve over time to reduce the scale of the demand for international protection accommodation, as we have seen starting in recent years. \n Deputy Edward Timmins  I thank the Minister of State for that information. I understand the massive pressures that commenced three or four years ago. The most important thing is that we have open and frank discussions. By having open discussions, we lessen the possibility of false information and extreme positions taking hold. Two years ago, I stated publicly that we should have an open discussion on immigration. Only now is this beginning. We need to discuss this openly and not brush it under the carpet. We have nothing to hide. As a nation, we have been very generous. It is important that centres are not all located in one area or that small towns and villages do not have very high numbers. In my own county of Wicklow, the majority of IPAS centres, and of the numbers of applicants, are located in one municipal district. That district is west Wicklow. This district is also the most poorly served by public transport and services. This was not well planned. We need now to develop long-term strategies for IPAS locations. \n Deputy Colm Brophy  I assure the Deputy, as I did in my initial reply, that this is what we are doing. We fully recognise that we went through a period where we had an effective emergency. We had a massive surge in numbers and we had to respond to those on a humanitarian basis and to provide emergency accommodation as necessary. The operation that the Minister, Deputy O'Callaghan, and I have been working on, literally day and night since we came into office, is to ensure we put in place an IPAS system that is fit for purpose, delivers value for money for the taxpayer, is based on moving towards State ownership of facilities rather than commercial contracting, and takes into account impacts on communities and local people. We also want to meet our key central requirement, which is to provide the accommodation that is needed, as we are obliged to do under our international obligations. In the context of doing all of that and in the context of renewing the contracts as they fall due, we are very much aware of the need to have an even spread, to look at how impacted communities are by location and to take that into account in all future decisions we make. Overall, the way of dealing with this is to bring down the numbers, which will bring down the need for the centres. \n Deputy Edward Timmins  I fully appreciate the great work the Minister of State is doing. I commend him and the Minister, Deputy O'Callaghan, on the steps taken. They are very much facing up to the reality because to date in this country the political classes have been out of sync with the views of ordinary decent Irish people. We need to be transparent in how we are dealing with the housing of people who are exiting the IPAS system. Our councils need to inform the councillors of any relevant policies that impact housing allocations. Also, in regard to expenditure, and I understand the Minister of State is dealing with this, I urge the Minister to work to renegotiate all contracts with a view to lowering the cost. Regular counts should be done to establish the numbers in each centre so we are not paying for people who are not living there. One of the cornerstones of any system is that all citizens of the State who are working are treated equally. In the case of IPAS residents who are working and earning a wage, there must be a contribution to accommodation costs. Rent should be calculated along the lines of the letting priority scheme and local authority rents. \n Deputy Colm Brophy  There is very little of that I would disagree with. To be absolutely clear, the Minister, Deputy O'Callaghan, and I have announced a contribution model which we will implement. We believe absolutely in a system based on fairness, which means that people who are working and bring provided with accommodation through the IPAS system should make a contribution to the cost of that provision. On the actual cost of providing the IPAS system, as I mentioned we have implemented a new rate card as part of contract renegotiations. As each contract comes forward for renegotiation, the new rate card kicks in. That is delivering savings to the State on providing IPAS accommodation of million and millions of euro. The real long-term saving to the State is the switch, which we have also implemented, to State-owned facilities. As the cost of a State-owned facility is a fraction of that of a commercial facility, that is the way we want to move. We are also cognisant that once people have moved through IPAS and have been granted permission to remain in this country, they should move out of IPAS centres and move into their own accommodation. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 87. Deputy Edward Timmins asked the Minister for Justice, Home Affairs and Migration if there is a strategy to spread the location of IPAS accommodation and avoid having large clusters in one area; and if he will make a statement on the matter.  [66709/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_28",
          "debateSectionId": "dbsect_28",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_28.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_87",
        "questionNumber": 87
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department is responsible for developing policy in relation to cybercrime and coordinating a range of different cyber initiatives at national and international level.  In particular, work is currently ongoing to implement the EU e-Evidence Package. This is comprised of Directive (EU) 2023/1544 and Regulation (EU) 2023/1543, which sets out a cross-border framework for accessing electronic evidence (subscriber, traffic and content data) held by online and electronic communications service providers during specific criminal investigations in the EU. Once implemented, this will allow authorities in one EU Member State to issue an order to produce electronic evidence to a service provider based in another EU Member State. Implementation of this package is significant, and will have a major impact on Ireland and other EU Member State’s ability to ensure effective access to digital evidence in tackling serious crime, including cybercrime.  Ireland also remains committed to the ratification of the Council of Europe Convention on Cybercrime (‘Budapest Convention’). A significant number of requirements of the Convention have already been met by the Criminal Justice (Offences Relating to Information Systems) Act 2017. The remaining articles of the Convention will be addressed by two legislative projects that are currently being progressed.  Ireland also recently signed the United Nations Convention against Cybercrime in Hanoi, Vietnam on 25 October 2025. Participation in instruments such as these enable us to improve our ability to tackle cybercrime and cyber enabled crimes, by providing the legal mechanisms and tools which enhance co-operation between law enforcement authorities across jurisdictions.  As of 31 October 2025 there were 72 members of An Garda Síochána attached to the Garda National Cyber Crime Bureau. The Bureau plays a key role as the national Garda unit tasked with the forensic examinations of computer and mobile devices that have been seized during the course of any criminal investigations.  Another important role of the Bureau is the investigation of cyber dependent crimes that target significant or complex attacks on computer systems, corporate networks or critical national infrastructures. The Bureau also provides cyber safety and prevention advice to all sectors of industry and the community on the current and emerging risks to online activity and personal or sensitive data. This comes from its liaison with law enforcement colleagues across the globe, academia and industry partners on ways to identify crime trends.  The National Cyber Security Centre (NCSC) came under the remit of my Department in June of this year, as per this Government’s commitment to ensuring the proper alignment of our national security infrastructure. The 2026 budget for the NCSC has increased by over 50% to €12 million.  The NCSC and An Garda Síochána actively collaborate in relation to cyber incidents that are also cybercrimes as defined by the Criminal Justice (Offences Relating To Information Systems) Act 2017 and related laws. There are existing information sharing arrangements between NCSC and An Garda Síochána to share cyber intelligence. The organisations also work together to promote awareness of cyber risks among businesses and individuals. Work is underway to formalise the operational relationship, including the secondment of Gardaí to the NCSC by way of a Memorandum of Understanding (MOU).  Ireland’s second National Cyber Security Strategy, published in 2019, came to a close at the end of 2024. Preparations for the successor strategy are underway in my Department. I expect to be in a position to publish the Third National Cyber Security Strategy early in 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 126. Deputy Edward Timmins asked the Minister for Justice, Home Affairs and Migration the strategies in place, and planned, to deal with cyber-crime; and if he will make a statement on the matter. [66708/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_151",
          "debateSectionId": "dbsect_151",
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_151.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_126",
        "questionNumber": 126
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Edward Timmins  I offer the Minister my best wishes for his role, which is not so new anymore. His is a very important role, particularly at this critical time. We are in different constituencies but are near neighbours where south Kildare meets west Wicklow.  Agriculture in Ireland is ageing fast. Currently, the average age of a farmer in Ireland is 59. Only 4% are under 35. This imbalance poses risk to long-term food security and to this important sector, which exports 90% of what it produces. The programme for Government commits to a farm succession scheme. Is there a strategy for succession planning for farmers? \n Deputy Martin Heydon  I thank the Deputy for raising this point. While he is in a different constituency, he is the TD who lives closest to me, as we straddle the border between Kildare and west Wicklow.  The challenge of generational renewal in farming has been widely recognised at both national and EU level. The programme for Government prioritises supporting intergenerational farm succession. Food Vision 2030, our shared strategy for the agrifood sector, states that generational renewal in farming is critically important to ensure the future viability and social sustainability of the Irish agrifood sector and of rural Ireland.  Ireland provides a range of supports, including initiatives under the current CAP strategic plan, a suite of strong taxation measures and access to finance, as well as advisory and education and training supports. Despite this support, the average age of farmers continues to rise. The most recent figures show that only 4.35% of farmers are under 35 years of age and some 37% of farmers are over 65.  In September, I launched the report of the commission on generational renewal in farming. Generational renewal, including farm succession, is a complex issue and there are many factors involved. The commission on generational renewal in farming was established to examine this issue and has produced a thorough analysis and made 31 recommendations across a wide range of areas, including CAP supports, pensions, taxation, access to finance, access to land, collaborative arrangements, advisory services, education and training, the important issue of gender balance and the overall attractiveness of the sector. These recommendations will be carefully considered. They are contained in a report that runs to 180 pages. The recommendations will be considered by an implementation group in my Department who will engage with agricultural stakeholders and the relevant public bodies. While some recommendations are for consideration in the context of the next CAP, it is hoped that others can be progressed in a shorter timeframe. Some of the taxation recommendations have already been considered and progressed in budget 2026, with those extended for a longer period than had been requested or anticipated. \n Deputy Edward Timmins  I have read most of that document and most of those 31 recommendations are very worthy.  I would like to see a lot of them being implemented.  On a slightly related matter, I worked most of my life in small and medium sized businesses. The thing that strikes me most about farming is the huge fluctuation in prices from year to year. Most businesses face increases in costs or sales prices in single digit percentage changes. It is not so in farming. This makes it difficult to plan and means people have to build up large reserves to be confident of being able to continue to trade or else they will run out of cash. We need to take measures to make it financially attractive to run a farm business. We need to reduce red tape, which is a turn-off for many farmers, and make all schemes much simpler. Many of the recommendations of the commission on generational renewal in farming will help. \n Deputy Martin Heydon  I agree with the Deputy in many ways. The question I am most often asked about generational renewal is whether there will be a scheme in the next CAP or what it will look like. I want to be able to develop a succession scheme and I hope to have the resources to do that, but young trained farmers will not make life-long decisions based on whether they get one grant in 2028 and put everything on hold until then.  Generational renewal gets to the heart of everything I do. The efforts we are making to try to ensure we have a derogation for nitrates for the next few years is critical to giving certainty to young trained farmers to invest and take the plunge into full-time farming. My new bovine TB plan is a massive issue for the Deputy's constituents in west Wicklow, as it is in Kildare and across the country. Having certainty that we will get on top of that perennial issue, which has been around for 75 years, with a new approach is a key measure. My support for the tillage sector is a key measure in giving confidence for generational renewal, as is making sure farmers have a good solid income. When we talk about sustainability as a three-legged stool, the economic sustainability is every bit as important as being able to deliver the environmental and societal sustainability. \n Deputy Edward Timmins  I bring the Minister's attention to another matter related to generational renewal. I will highlight an unfair flaw in the operation of the fair deal scheme relating to land transfer, for example to a grandchild, which is causing huge financial hardship for families. I will explain how it operates. This rule must be changed. If a family transfers land within five years of the owner entering a nursing home, this land is valued. If the recipients lease the land, they must pay the nursing home 7.5% of the value of the land on an annual base, with no three-year time limit like there is for the family farm. This could go on for 14 years until the total value of the land is paid over. This is completely unfair.  There is no possibility of deferring the payment, as there is for the family home. It is therefore a huge financial burden. Where is the family to get the funds? I know of a case in which a family or young person is being assessed to pay €23,000 per year and the income the person is getting from leasing the land is only €5,000. The person has nowhere to find the cash and it is putting them under huge financial hardship. I am sure the Minister will agree that this is totally unfair. I would like it to be looked at and changed immediately. \n Deputy Martin Heydon  The fair deal scheme has had a specific impact on farmers. While it is not under my remit or that of the Department of agriculture, I have engaged with previous Ministers for Health on it and I would be happy to work with the Minister, Deputy Carroll MacNeill, on this area as well. The last Government made changes around it and we want to be able to give certainty, clarity and comfort to people who are planning the transition of land in the most difficult of circumstances. We want to make sure the fair deal scheme is fair in how it does it. I will be happy to work with the Deputy and colleagues across the House on that issue, because how it affects farmers and how it affects small businesses more broadly is a key consideration. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_27.xml"
            }
          },
          "debateSectionId": "dbsect_27",
          "showAs": "Agriculture Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_27"
        },
        "questionNumber": 106,
        "date": "2025-11-27",
        "showAs": " 106. Deputy Edward Timmins asked the Minister for Agriculture, Food and the Marine if there is a strategy for succession planning for farmers; and if he will make a statement on the matter. [66716/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_106"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Programme for Government acknowledges the vital role of farmers as a driving force in the rural economy and as custodians of the landscape while ensuring sustainable food production for a growing world population.  Strengthening farm incomes is a priority for this Government. We will continue to support the sheep sector with targeted exchequer supports and with other EU co-funded supports that are available to all farmers through the CAP Strategic Plan (CSP).  In Budget 2026, I secured an allocation of €131 million for the livestock sector, which will ensure the continuation of existing dedicated supports, including those worth €42m to the sheep sector in 2026.  Those supports consist of €20m for the multi-annual CSP Sheep Improvement Scheme and €22m for the annual National Sheep Welfare Scheme. The budget for the current National Sheep Welfare Scheme in 2025 was an increase of €7m, or 47%, on the preceding year of 2024. Payments amounting to €16.44m have already issued to more than 13,000 farmers in respect of their participation in the 2025 scheme.  In addition, there are many other multi-annual schemes available under the current CSP, which is worth €9.8 billion to farmers and rural communities between 2023 and 2027. These include basic income payments as well as agri-environment, investment and organic farming schemes, which are particularly significant for sheep farmer incomes.  It is standard practice for my Department to consult the farm organisations on the design and implementation of various schemes that affect their members. The popularity of the current sheep schemes are due to the straightforward, practical and beneficial measures put in place.  As with all schemes, applicants will be subject to a minimum level of inspection and administrative control checks to ensure compliance with scheme conditions and existing regulations.  I am committed to continue providing sheep farmers with meaningful supports aimed at promoting a viable, resilient and sustainable sheep sector. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_139.xml"
            }
          },
          "debateSectionId": "dbsect_139",
          "showAs": "Agriculture Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_139"
        },
        "questionNumber": 143,
        "date": "2025-11-27",
        "showAs": " 143. Deputy Edward Timmins asked the Minister for Agriculture, Food and the Marine if there are plans to increase supports for sheep farmers and limit the amount of red tape on these supports; and if he will make a statement on the matter. [66717/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_143"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 111. Deputy Edward Timmins asked the Minister for Housing, Local Government and Heritage for an update regarding the Government’s policy towards access to ancient archaeological sites; and if he will make a statement on the matter. [56039/25] ",
        "debateSection": {
          "showAs": "Heritage Sites",
          "debateSectionId": "dbsect_134",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_134",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_134.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "questionNumber": 111,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I recognise the immense interest and pride in our archaeological heritage held by communities across the country. These monuments provide a sense of place and a sense of pride to so many. As well as the fine work of the OPW and Local Authorities in maintaining and improving access to monuments in their own care, my own Department has as a priority the improvement of access to monuments through the archaeological grants mechanism, the Community Monuments Fund, which has a dedicated stream of funding to improve interpretation at monuments and access to them subject to landowner permission.  Facilitating and increasing access to our heritage has also been integrated into Heritage Ireland 2030, the national heritage plan, which sets out a framework for the management, protection and conservation of our heritage, including archaeological heritage and monuments. The focus on access throughout the plan includes physical access to sites and monuments, virtual access through the use of digital technologies and access to heritage as a broader principle related to the suite of social, community and economic benefits that such access can bring.  Specific actions in Heritage Ireland’s comprehensive action plan also focus on increasing and enhancing access to heritage - including archaeological heritage - across these three areas. Actions 30 to 36 of the plan focus on increasing access to heritage in the care of the State, including on a seasonal basis and through provision of enhanced visitor services and interpretation as appropriate. Action 36 centres on increasing and improving universal access to heritage for the elderly, people with disability and children, including through the use of new technologies. Other access-focused actions include increasing support for and access to heritage-focused schemes (Action 62) and enhanced collaboration between and support for bodies responsible for providing access to our heritage (Actions 83 and 85). Cross-sectoral annual updates on delivery of Heritage Ireland 2030 and its action plan by State and heritage bodies have been published on the dedicated [ Heritage Ireland 2030 delivery webpage ], including the most recently published update on activities carried out under the plan in 2024.   ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_111",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_56",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_56",
          "showAs": "Sports Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_56.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 17. Deputy Edward Timmins asked the Minister for Culture, Communications and Sport for an update on the progress of a nationwide audit of sports facilities to address shortages in areas underserved including towns with populations over 1,500, as set out in the Programme for Government; and if he will make a statement on the matter. [64605/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_17",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Get Ireland Active was launched in October 2023 and represents the first phase of a comprehensive national database of sports facilities. The database currently consists of more than 15,000 opportunities to be active across the country, including sports and recreation facilities, public places such as playgrounds and trails for walking, running and biking. Additionally, other data – such as the Pobal Deprivation Index – can be overlaid on the database to identify areas that are under or over-served.  A companion mobile phone application has now been developed and is publicly available to download from both the Apple App and Google Play stores. It enables mobile access to the database with the aim of helping people of all ages, abilities and fitness levels to get active and take full advantage of amenities around them.  The database is currently undergoing further development and, once complete, Sport Ireland intends to launch a promotional campaign to raise awareness of Get Ireland Active and the benefits that it can offer.  Overall, the Programme for Government sets out an ambitious future for sport in Ireland where equality of access and opportunity is at the heart of everything we do in this sector.  The need to catalogue sports facilities to address shortages in areas that are currently underserved was first raised in the National Sports Policy 2018 – 2027 which recognised the importance of having an up-to-date database of sports facilities as the basis for a more long-term planned approach to facility investment. The information now available will inform future phases of the Community Sports Facility Fund (CSSF) and the Large Scale Sports Infrastructure Fund (LSSIF).  As for the next round of the CSFF, in line with previous rounds a review of the current funding round will be undertaken and that review will inform the timing of the next round of the CSFF. A new round will open for applications next year. ",
        "questionNumber": 17,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_94",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_94",
          "showAs": "Pension Provisions",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_94.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 63. Deputy Edward Timmins asked the Minister for Culture, Communications and Sport for an update on the An Post pension increase; and if he will make a statement on the matter. [64604/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_63",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for Culture, Communication and Sport with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform, approves any superannuation schemes submitted by An Post. The operation of the schemes is a matter between the management of An Post, staff representatives and the trustees of the schemes.  In accordance with the Act and the relevant Code of Practice for the Governance of State Bodies, An Post must seek Ministerial approval from both Ministers to increase pensions and deferred pensions for members of the An Post superannuation scheme. Section 2.13 of the Code of Practice for Governance of State Bodies Superannuation and Remuneration annex sets out that NewERA advice should be sought in respect of pension amendment proposals, as is appropriate in their role as commercial and financial advisors to the Ministers.  On 23 October 2025, An Post wrote to my Department requesting consent for an increase to pensions in payment and deferred pensions, arising from its agreements with employee representative groups. It is not possible, at this point, to set out the specific timeframe within which the decision-making process will be concluded by both shareholding Ministers in respect of increases submitted for consent. It should be recognised that the time taken for the pension approval process is necessary to ensure that robust governance procedures are in place. ",
        "questionNumber": 63,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_28",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_28",
          "showAs": "Departmental Data",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_28.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 84. Deputy Edward Timmins asked the Minister for Health the number of operations completed for complex laparoscopy for severe endometriosis to date; and if she will make a statement on the matter. [64607/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_84",
        "answerText": " Deputy Edward Timmins  One in ten women in this country are affected by endometriosis, a condition that inflicts immense pain and suffering and is often unspoken about and misunderstood. Can the Minister advise how many operations have been completed for complex laparoscopy for severe endometriosis to date? \n Deputy Jennifer Carroll MacNeill  I thank Deputy Timmins. I think it may be closer to one in seven - possibly one in six - women who are affected by endometriosis, rather than one in ten. We are learning more about it together. Our specialist endometriosis services are monitored by the HSE's national women and infants health programme.  At the end of September 2025, 719 specialist endometriosis surgeries had been carried out. The most complex endometriosis surgeries are performed by multidisciplinary teams. Some 263 of the reported 719 surgeries took place in our complex centres in Tallaght and Cork. Surgeries for less complex endometriosis may also be performed in our acute gynaecology services.  I am committed to expanding the scope and standard of our endometriosis services and improving supports for women. In recent weeks, I approved a plan to expedite access to care for women with endometriosis. The HSE will, as a consequence, carry out more than 100 additional surgeries by the end of this year. We expected 1,200 but will instead have 1,300 by the end of this year, an important addition. I have provided an additional €0.5 million directly for this purpose. By way of progress update, in October, 34 additional surgeries had been completed against a target of 33. The majority of these were excision surgeries. Complex and severe cases were prioritised. An additional colorectal surgeon is also being actively recruited to try to facilitate more complex surgical treatments.  On 18 October, I launched the national framework for the management of endometriosis. It is a necessary expansion of services. The HSE’s budget will help to enable expansion and improve all of our services, including endometriosis. We have to increase awareness. I have written directly to all GPs to try to drive awareness where it is not already there and try to drive a better opportunity for women to have referral pathways much more quickly and a presumptive diagnosis, recognising that women are, of course, the most reliable narrators of their own experience and pain. \n Deputy Edward Timmins  I thank the Minister for the information. I welcome the launch of the first national endometriosis framework and the recognition of the women and girls who have suffered for many years from this condition. I recently met a constituent in my office who has suffered for over 20 years. She has experienced bottlenecks regarding diagnostics. It is very clear that we must acknowledge the pain and impact this condition has brought to the lives of so many women and girls. We need to ensure the framework is actioned without delay. I understand Cork and Tallaght are super hubs. Is this correct? Do all of the surgeries take place in those hospitals? When is it expected that the additional colorectal surgeon will be in place? \n Deputy Jennifer Carroll MacNeill  Not all of the surgeries take place in Cork and Tallaght but the most complex ones do. I have expanded a scheme to treat women who require complex surgery abroad. It was the case that they would go abroad and get the funding back via the cross-border directive. We very quickly put in place a scheme whereby people could get funding upfront for such surgery in many clinics in the UK and Europe. I have actively asked clinicians in the HSE to visit two clinics in Athens and Bucharest that women report to me as being very good but which did not meet the criteria in the first instance. We are trying to expand services.  On 1 September this year, I held a patient voice forum in the Department of Health. The Chief Medical Officer, the CEO of the HSE and the chief nursing officer listened to the voices of 60 or 70 women with very complex and painful endometriosis. On 5 September, I put in place a new action plan, drawn up based on the needs of the women at that forum. From 1 October, we had a new plan for additional surgeries in Ireland to be carried out over three months. On 18 October, I launched a framework and plan to support women who are not able to get the scale of intervention they need here, so that they can get that help internationally while we collectively scale up our complexity on imaging and surgeries in Ireland. \n Deputy Edward Timmins  I thank the Minister. It is obvious that she is making great progress and is giving this the priority it deserves. We must commit to increasing capacity and implementing the visiting consultant model. Bringing internationally recognised experts to operate alongside Irish surgeons would rapidly and affordably expand skills and capacity, which would be far more effective than relying on an overstretched endometriosis surgery abroad interim scheme, ESAIS. This is especially important if the quote of over 100 extra complex surgeries per month is to be met. Over 30,000 women are on waiting lists for complex endo surgeries. To send each abroad at an approximate cost of €20,000 would result in a total cost in the order of €600 million. For operations and treatment to be provided in Ireland under the visiting consultant model would be more cost-effective and have more long-term benefits. This would demonstrate real commitment to the care of women. \n Deputy Jennifer Carroll MacNeill  There are not 35,000 people with endometriosis on outpatient gynaecology lists. Approximately 700 are waiting for endometriosis surgeries. An additional colorectal post has been prioritised and advertised for recruitment in Cork University Hospital. The time it will take will depend on the interest generated but I very much hope it will be done as soon as possible.  The Deputy is correct. I do not necessarily want women to be travelling abroad. I would much rather they get surgery here but it is not an either-or situation. I want them to be able to get the right surgery as soon as possible. As we scale up, we must also facilitate women to be able to get the surgery they need. There will be a major conference in January, which will be driven by the Royal College of Physicians and the college of obstetrics regarding endometriosis and the skills available here.  One surgeon, who will remain nameless, offered to travel with her patient to a clinic in the UK to shadow the surgery and better inform herself in order to learn how to provide a better service to her patients. It is that sort of leaning in that I have seen from consultants in recent months who want to provide a service to women, many of whom have advocated for this and want to do more and better for their patients. I was heartened to hear that story from a patient about her surgeon. ",
        "questionNumber": 84,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_166",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_166",
          "showAs": "Nursing Homes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_166.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 147. Deputy Edward Timmins asked the Minister for Health if work will be carried out to exclude land gifted to a grandchild from the current situation where it is included in the fair deal assessment with no time limit or no option to be included as part of the loan arrangement; and if she will make a statement on the matter. [55033/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_147",
        "answerText": "",
        "questionNumber": 147,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 80,
        "showAs": " 80. Deputy Edward Timmins asked the Minister for Transport when the promised increase on bus route 132 will finally happen, given the increased traffic volumes; and if he will make a statement on the matter. [63503/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_80",
        "questionType": "oral",
        "debateSection": {
          "debateSectionId": "dbsect_27",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/debate/dbsect_27",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/debate/mul@/dbsect_27.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Deputy Edward Timmins  The only public transport from most of west Wicklow to Dublin is the 132 bus. We have no trains. It travels only four times daily, with the last bus leaving Baltinglass at 3 o’clock and the last leaving Dublin at 5.30 p.m. Last April, I met officials of the NTA and was told a very significant increased service – representing a doubling – was happening later in the month. Nothing has happened since. This is exceedingly frustrating. \n Deputy Jerry Buttimer  I thank Deputy Timmins for the matter he has raised tonight. As Minister of State in the Department responsible for transport, I recognise the vital role that enhanced connectivity plays in supporting communities across rural Ireland, including in County Wicklow. The Deputy raised it during the last Question Time. I reassure the Deputy that improving the accessibility, reliability and affordability of rural public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the programme for Government.  The NTA plays a central role in achieving this as it has statutory responsibility for securing the provision of public passenger transport services nationally, and for the scheduling and timetabling of these services in conjunction with the relevant transport operators. The NTA and the operators, including Bus Éireann, are in continuous dialogue regarding the operational needs, subject to funding and resource availability.  The NTA has advised the Department that plans to enhance route 132 are at an advanced stage. The Department of Transport sets the overall policy direction and funding framework for the delivery of public transport services nationwide, including Connecting Ireland, which has delivered over 180 new or improved services since 2022, connecting more than 240 towns and villages to the public transport network. The 2026 PSO funding allocation of €940 million represents a significant 43% uplift in the allocation from last year. This allocation will allow existing public transport services to operate reliably and sustainably throughout the year in the face of growing passenger demand and increased operational costs. In addition, a further €31 million has been secured for rural transport next year, a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland to meet demand, especially for the communities most dependent on these services. \n Deputy Edward Timmins  All those things are wonderful around the country, but they are having zero impact on the 132 service. After much correspondence, the NTA is now saying this cannot progress as the Department of Transport has placed a hold on uncommitted expenditure for new public transport services. Can this issue be resolved? Many people have approached me saying they would use the service but cannot because of the limited timetable. The last bus leaves Baltinglass at 3 o’clock in the afternoon and the last leaves Dublin at 5.30 p.m. In fact, there is now a proposal to abolish a Thursday service from Carnew, which joins this route in Baltinglass. Therefore, the service is actually being reduced.  The Department advises that it and the NTA are currently engaging in relation to funding the PSO programme. The Minister is saying funding is not a problem. To say I am deeply frustrated is an understatement. Can we please get to the bottom of this? \n Deputy Jerry Buttimer  I understand the Deputy’s frustration. He is right to be frustrated because it is important that we have connectivity. I am informed that the enhancement of route 132 is planned under Connecting Ireland. Operational decisions regarding service delivery are the responsibility of the NTA in collaboration with transport operators, subject to funding and resource availability. I will happily sit down with the Deputy and talk to him again about this because it is important that we enhance connectivity, do not discommode people further and allow people the convenience of transport connectivity and accessibility. As the Deputy knows quite well, post-budget discussions around the allocation of funding for the PSO programme are ongoing. It entails regular engagement between the NTA and operators on resource needs. I am acutely aware of the issues the Deputy has raised with me both here in the House and in private, and I will certainly work with him to ensure a service between Carnew and Baltinglass so the people of Baltinglass will not be discommoded further.  I do not have positive news for the Deputy right now, but I will sit down with him and talk to him further on the matter, because it is important that we enhance Connecting Ireland for the people of the area he has spoken about. \n Deputy Edward Timmins  I thank the Minister of State. I welcome the possibility of engaging with him further on the matter.  Another issue I have had is that many people contacted me complaining about the reliability of the service due to cancellations. Recently, I received a text describing how 20 people waited at the bus stop for the 9.40 a.m. 132 bus to Dublin, but it did not show up again. That is 20 people whose day and plans were ruined. If there is an issue, can a back-up plan be put in place? Another issue, which I have witnessed myself, one that is unforgivable, is buses departing earlier than the scheduled time and people missing them as a result. There must be zero tolerance for this. \n Deputy Jerry Buttimer  There is no excuse for people missing buses or buses leaving before the scheduled time. It goes back to Deputy Currie’s point about real-time information. The important point is that we have an increase in demand. There is a real commitment by the Government to ensure that the services we operate, particularly in the areas the Deputy mentioned, meet the need. Again, as I said to the Deputy, I will engage with the Deputy, the NTA and Local Link to ensure that we see services and accessibility as part of what he spoke about tonight. It is not about discommoding people but rather, offering accessibility and connectivity, as well as having that choice which we have not seen up to now.  As Minister of State with responsibility for rural transport, it is a core priority of mine and of the Department to ensure that commitments in terms of enhancing rural transport are met. I will happily engage with the Deputy further on the matter. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 111,
        "showAs": " 111. Deputy Edward Timmins asked the Minister for Transport the breakdown of the planned investment on the skeleton train service from Rosslare to Dublin; and if he will make a statement on the matter. [63504/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_111",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_69",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_69",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, in relation to the rail network.  The DART+ Coastal South project involves an improvement to DART services on the existing DART line south of Dublin city, with the current focus on enhancing services between Bray and Greystones. Iarnród Éireann have commenced with a non-statutory public consultation on the Emerging Preferred Option for DART+ Coastal South, Stage 1 Bray to Greystones Capacity Enhancements, which will run from October to December 2025.  In addition, the NTA's GDA Transport Strategy 2022-2042 includes a recommendation to extend the DART service to Wicklow town. I understand this extension can be facilitated through utilising the new battery-electric DART carriages, which are currently undergoing certification and safety testing. The NTA is currently examining this issue with a view to progressing the extension around 2029.  The recently concluded Review of the National Development Plan has confirmed the Department of Transport’s annual capital allocations from 2026 to 2030. The Department is currently reviewing key programmes and projects in the transport sector in the context of that capital funding envelope, including elements of the DART+ Programme, and a decision on a programme of delivery within the available funding will be made in the coming weeks.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Edward Timmins  Like the Minister, I have worked in and for small businesses in this country. The highest number of employed people in the country is in small businesses. Many of these businesses are an intrinsic part of their communities. They are also a crucial part of the economy and the social fabric of this State. What supports are in place for small companies and businesses to enhance their understanding of profit and loss and cash flow? \n Deputy Alan Dillon  I thank the Deputy for his question. It comes from an accountant and, with the Minister being an accountant, I feel less qualified to answer it but I will do my best.  The local enterprise offices, LEOs, are located in 31 local authorities to promote a suite of supports designed to assist small businesses to reduce their costs and become more productive and competitive. The LEOs provide consultancy and grants to small businesses across all sectors in the areas of lean, green and digital. These supports focus on enhancing productivity while improving competitiveness, and they can help business owners identify opportunities to save money, time and energy. The LEOs also play a crucial role in supporting small businesses to build financial capability, including a practical understanding of profit, loss and cash flow management.  Training programmes are scheduled based on local demand and delivered on a tailored basis to meet the specific needs of small businesses. LEOs are consistently encouraged to prioritise financial literacy when designing their training calendars. This year, the LEOs delivered a wide range of targeted courses to enhance the financial understanding of SMEs. Each course is designed to equip small businesses with practical skills in financial planning, cash flow forecasting and understanding profitability. Among the courses delivered were financial foundations for small businesses, managing cash flow in business, managing your cash flow, fundamentals in business finance and bookkeeping and accountancy for small businesses.  The LEOs also offer a start your own business training programme aimed at those who have a business idea or have recently set up a small business. This programme includes a dedicated finance module to ensure new entrepreneurs gain essential financial knowledge. \n Deputy Edward Timmins  I thank the Minister of State. That covers a lot of what I was looking for. These businesses include retail, restaurants, pubs, small family businesses and the self-employed. In my experience, many of them have a poor understanding of profit and loss. They do not understand the basics of gross profit and fixed overheads. If they understood them, they would know their break-even sales figure. This is fundamental to understanding viability. If they understand this, they can know using a weekly turnover figure how well they are doing. This means they can take corrective action before it is too late. Unfortunately, many only know they are not doing well when they see they cannot pay their VAT bill or their suppliers. Even then, they do not understand what the problem is. \n Deputy Alan Dillon  I absolutely agree with the points the Deputy raises. Financial literacy is a cornerstone of competitiveness and that is why we have the LEOs ensuring small businesses have the tools to manage their finances effectively. They are on hand to assist at county level, including financial mentoring, training workshops and management development programmes. It is important that owners who want to advance their financial planning skills are supported, that any perceived challenges around financial management are demystified and that business owners make informed decisions and avoid common pitfalls. For start-ups, we have the start your own business programme. That has a specific finance module wherein the LEOs provide specialist mentoring to entrepreneurs and owners on strategies around pricing, cash flow and profit and loss. \n Deputy Edward Timmins  In relation to taxes, we have a similar problem. Many businesses think the VAT they receive is part of their business cash, not fully understanding it is cash they collect on behalf of the State. I came across a business selling coffee. They thought the €4 they charge for the coffee was their income and the VAT was a cost. Similarly with PAYE, USC and PRSI, they sometimes use these taxes as cash flow for the business. Can the LEOs provide a basic tool to help small and not-so-small businesses navigate this apparently simple issue, which has driven many potentially successful businesses to the wall? Can such workshops be a regular offering by the LEOs? Can Revenue do the same? Can they inform small businesses of these supports? \n Deputy Alan Dillon  I appreciate the concerns the Deputy has raised. For any business owners, it is incumbent on the Government and the LEOs to ensure they are sustainable, have resilience built into their business plan and have access to the mentoring, training and advice that are essential to keeping businesses afloat. Raising the importance of financial literacy and ensuring businesses have access to training workshops is part of the local enterprise offering. They have peer-to-peer learning and engagement with key advisers within each local authority. We want to continue to support this through tailor-made programmes. The start your own business programme has an important financial module. Enterprise Ireland also invests in early-stage leadership development to ensure companies on that journey are supported. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_14",
        "debateSection": {
          "debateSectionId": "dbsect_16",
          "showAs": "Small and Medium Enterprises",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_16",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_16.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 14,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 14. Deputy Edward Timmins asked the Minister for Enterprise, Tourism and Employment the supports in place for small companies and businesses to enhance their understanding of profit and loss and cash flow; and if he will make a statement on the matter. [62194/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  All employees in Ireland are entitled to a safe and stable working environment. Workplace bullying, defined as repeated inappropriate behaviour, direct or indirect, whether verbal, physical or otherwise, threatens that stability. It can undermine employees’ right to dignity at work and can impact their mental and physical health.  Bullying in the workplace is a psychosocial hazard that needs to be managed by an employer like any other work-related health and safety hazard and risk. The role of the Health and Safety Authority(HSA) is to ensure that an employer has appropriate systems and processes in place to manage bullying as a psychosocial hazard, and to ensure an employer’s system of work is not one where bullying is facilitated or tolerated.  In relation to this issue, the HSA has prepared and published, jointly with the Workplace Relations Commission(WRC), a Code of Practice for Employers and Employees on the Prevention and Resolution of Bullying at Work.  This Code provides practical guidance for employers on identifying and preventing bullying at work arising from their duties under the Safety, Health and Welfare at Work Act 2005 as regard “managing and conducting work activities in such a way as to prevent, so far as is reasonably practicable, any improper conduct or behaviour likely to put the safety, health and welfare at work of his or her employees at risk”. The Code provides comprehensive guidance for employers on establishing both informal and formal mechanisms to deal with bullying complaints at enterprise level.  The WRC’s overarching role is to achieve harmonious working relations between employers and employees. The WRC encourages local discussion on, and resolution of, disputes and issues which arise in the workplace including cases of alleged bullying. The WRC delivers several services which may assist.  Workplace mediation provides a confidential, professional, efficient and effective process to assist all parties in reaching a mutually acceptable agreement or outcome to a dispute or claim. This approach often helps to avoid more formal processes. It is particularly suited to disputes involving individuals or small groups of workers who find themselves dealing with situations which may involve interpersonal differences, conflicts, difficulties in working together or breakdown in a working relationship.  Following the exhaustion of internal procedures, employees may have access to Adjudication Services under Section 13 of the Industrial Relations Act 1969. It is worth noting that a number of individual bullying grievances have been dealt with through mediation by the WRC Services over the past number of years. The Adjudication Service are independent adjudicators, and they investigate disputes referred to them by individuals or small groups of workers under specific legislation.  The HSA engages with employers through the inspection process to ensure that they have a policy in place regarding the prevention of bullying at work and the processing of bullying complaints. Where an adequate policy on workplace bullying does not exist, an employee can register a complaint with HSA Contact Centre. While the HSA does not get involved in mediating or investigating individual bullying complaints, when a complaint of workplace bullying is received, the HSA uses its statutory powers to ensure that an employer has a suitable workplace bullying policy in place to deal with the complaint and, if necessary, to assess whether or not the employer’s actions in dealing with the complaint were adequate. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_66",
        "debateSection": {
          "debateSectionId": "dbsect_99",
          "showAs": "Bullying in the Workplace",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_99",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_99.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 66,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 66. Deputy Edward Timmins asked the Minister for Enterprise, Tourism and Employment the strategies in place to reduce bullying in the workplace; and if he will make a statement on the matter. [62193/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The purpose of the means test is to ensure that resources are directed to those with the greatest need for income supports by the State.  The means test takes account of the income a person or couple has in terms of cash, property – other than the family home – and capital.  Applying a means-test ensures that the recipient has an income need and that scarce resources are targeted to those with the greatest need.  This approach supports an economically efficient and socially equitable allocation of scarce resources.  My Department is currently reviewing means testing across all its social assistance schemes.  I am due to receive this review shortly and I can assure the Deputy that I will consider it carefully.  The outcome of this review will be used to inform decisions regarding any further changes to means testing.  All prospective changes to means testing arrangements will have to be considered in both an overall policy and budgetary context. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_130",
        "debateSection": {
          "debateSectionId": "dbsect_152",
          "showAs": "State Pensions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_152",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_152.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 130,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 130. Deputy Edward Timmins asked the Minister for Social Protection if consideration is being given to reflecting inflation in the means test calculation for certain State benefits, such as the non-contributory State pension; and if he will make a statement on the matter. [62212/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Citizens Information Board (CIB), under the aegis of this Department, funds and supports eight Citizens Information Service (CIS) companies, to provide important information, advice and advocacy services to the public nationwide.  Each CIS is an independent limited company overseen by a voluntary Board of Directors and each company makes decisions independently on the delivery of services in their own regions.  The Citizens Information Service delivery companies currently provide information, advice and advocacy services through ninety Citizens Information Centres, twenty outreach centres and seven prison in-reach centres.  During Covid, volunteers were not active in the Citizens Information Services.  Post-Covid, the total number of Citizens Information locations has reduced, particularly the number of outreach locations due to a reduction in the availability of volunteers.  Citizens Information Services are actively seeking and supporting new volunteers to join their service and more information is available on www.citizensinformation.ie website. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_147",
        "debateSection": {
          "debateSectionId": "dbsect_168",
          "showAs": "Citizens Information Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_168",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_168.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 147,
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 147. Deputy Edward Timmins asked the Minister for Social Protection if there are plans to reintroduce Citizen Information offices in areas where they have been closed in recent years; and if he will make a statement on the matter. [62213/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector. €259 million of funding was made available for services in year 1 of the scheme, of which €210.8 million was entirely new funding to the sector.  Payments due to services worth €249.9 million were accrued in the first year of Core Funding. This includes allocations created under the temporary Interim Funding scheme, which was in place for the first two weeks of September 2022 to ensure providers continued to receive financial support before Employment Regulation Orders were introduced on 15 September 2022.  Core funding increased by 11% to reach €287 million for the second year of the scheme, which began in September 2023. This increased investment facilitated capacity growth in the sector, extended support for graduate leadership and the introduction of targeted supports for small and sessional services.  Payments due to services worth €283 million were accrued in the second year of Core Funding.  The funding available for Core Funding increased by another 15% to reach €331 million for the third year of the scheme which began in September 2024. This supported further growth in the sector with additional funding aimed towards capacity for children under the age of three. It also allowed for the strengthening of the targeted supports for small and sessional services.  Payments due to services worth €323.1 million were accrued in the third year of Core Funding. The programme year formally closed at the end of October 2025, however there may be some small adjustments to allocations in the coming weeks.  This September, I again increased the funding available for Core Funding to exceed €390 million for the current and fourth year of the scheme. This is an increase of over 50% since the scheme began in September 2022. The additional funding is supporting further capacity growth, the maintenance of a fee management system to benefit families and significant improvements to pay and conditions in this valued sector.  I was delighted to announce further investment in Core Funding in Budget 2026. The additional funding being made available in 2026 will see the allocation for Core Funding in the next programme year which begins in September 2026 increase to at least €436.54 million. That is an additional €43.90 million on the current full year allocation, or an 11% increase.  This increased investment will allow for further increases in capacity across the sector, and will support Partner Services in adhering to the fee management conditions of the grant including reductions in the maximum fee caps from September 2026.  In addition, the Government is committed to supporting further enhancements in Year 5 of Core Funding that will bring further improvements in pay for staff. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_58.xml"
            }
          },
          "debateSectionId": "dbsect_58",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_58"
        },
        "questionNumber": 100,
        "date": "2025-11-12",
        "showAs": " 100. Deputy Edward Timmins asked the Minister for Children, Disability and Equality the amount of funding provided to childcare service providers under the Core Funding model each year since its introduction; and if she will make a statement on the matter. [61580/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_100"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As part of the National Development Plan review the allocation for this Department has increased to €795 million over the next five years.  This increased funding will be used in part to provide additional early learning and childcare places through future capital programmes investing in expansion of existing providers.  The primarily focus for the additional capital expenditure in early learning and childcare will be on implementing the commitment to investment in State-led early learning and childcare facilities.  As announced in the context of Budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes.  This will include acquisitions of new buildings through the State-led early learning and childcare programme, continued investment in expansion of existing early learning and childcare operators through the Building Blocks scheme and a number of quality initiatives including supports to childminders.  Officials in the Department are currently examining options and detailed specifications for future Building Blocks schemes, and I expect to announce details in early 2026. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_101.xml"
            }
          },
          "debateSectionId": "dbsect_101",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_101"
        },
        "questionNumber": 141,
        "date": "2025-11-12",
        "showAs": " 141. Deputy Edward Timmins asked the Minister for Children, Disability and Equality the steps her Department is evaluating to assist childcare providers in constructing their own premises; and if she will make a statement on the matter. [61581/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_141"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_16",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_47",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_47",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_47.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 16. Deputy Edward Timmins asked the Tánaiste and Minister for Defence the steps being taken to encourage recruitment to the Defence Forces; and if he will make a statement on the matter. [60481/25] ",
        "questionNumber": 16,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 14 and 16 together.  I am advised that the strength of the Permanent Defence Force as of the 30 September 2025 stood at 7,641 personnel.  Government has introduced several key enabling measures to support and bolster Defence Forces recruitment and retention. These include increases in the maximum ages of recruitment and retirement respectively, the extension of private secondary healthcare to all personnel and the application of the provisions of the Working Time Directive across the Defence Forces subject to certain exemptions. The Patrol Duty allowance payable to Naval Service personnel at sea has been doubled after ten days at sea in a calendar year and the Naval Service tax credit has been extended for a further five years. There has also been significant progress on pay with all personnel benefiting in August of this year from the latest in a series of pay awards made under the terms of the current public service pay agreement.  Figures provided by the Defence Forces for 2024 and to date in 2025 indicate a stabilisation in the strength of the PDF. There were 708 personnel inducted in 2024, the highest in over five years. In 2024 there were 674 discharges, 81 fewer than the previous year and the lowest since 2020. Inductions for 2025 as at 30 September stood at 583 while discharges were 60 fewer than the same time last year. The Defence Forces are currently on track to induct more personnel this year than last.  To support the ongoing recruitment and retention measures, Budget 2026 has provided a record allocation of €1.49 billion for the Defence Sector which includes an allocation providing for the recruitment of at least a net additional 400 personnel per annum.  Recruitment to the Defence Forces remains ongoing through a range of competitions for General Service and for specialised Direct Entry positions.  Interest in a career in the Defence Forces grew significantly in 2024 as evidenced by a 30% increase in applications across all competitions. This strong growth has continued into 2025 with a further year on year increase of over 30% noted as at 30 September.  Whilst there are still undoubtedly challenges ahead, significant progress is being achieved on a number of fronts and the allocation of record levels of expenditure to the Defence sector coupled with the range of measures currently in train is illustrative of my intent in this regard. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_74",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_93",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_93",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_93.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 74. Deputy Edward Timmins asked the Tánaiste and Minister for Defence the steps being taken to increase our defence capabilities; and if he will make a statement on the matter. [60480/25] ",
        "questionNumber": 74,
        "answerText": " Tánaiste and Minister for Defence  My priority as Minister for Defence is to ensure that the operational capability of the Defence Forces is maintained and developed. This is to enable the Defence Forces to carry out the roles assigned by Government.  Capital funding of €1.7 billion has been allocated to Defence Development Plan for the period 2026-2030. The funding is an increase of €600 million (announced 23rd July in the National Development Plan) or 55% on the previous baseline figure of €1.1 billion. This significant increase reflects the government’s commitment to continue to increase investment in our Defence Forces.  The civil/military staffed Capability Development Unit, established in 2023 in response to a recommendation in the Commission on the Defence Forces to implement a top down Capability Development Planning Process, are preparing a Capability Development Programme, that will identify, at a high level, the Capability requirements for the Defence Forces out to 2040.  Many projects are being progressed across the Defence Forces to deliver enhanced capability. In terms of the Naval Service, the Naval Service Vessel Renewal and Replacement Programme includes various projects to upgrade, replace or purchase new equipment. Major projects include two Inshore Patrol Vessels purchased on a government-to-government basis from New Zealand, with LÉ Aoibhinn and LÉ Gobnait, commissioned in 2024, the Mid-Life Extension Programme for LÉ Róisín and LÉ Niamh which has now been completed and projects under the Naval Service vessel renewal and replacement programmes that are also being progressed. Other projects being progressed include the replacement of secondary armament across the fleet, the provision of 4 motor launches for the Naval Service Reserve along with enhanced sub-sea awareness and radar capabilities.  In relation to sub-sea awareness the recent announcement regarding investment in sonar capability is the first project within that new programme which will see the Naval Service acquire sonar capability which will be used to detect objects near cables and pipelines in Irish territorial waters and the EEZ. This new acquisition will enhance awareness below the surface, contributing to the overall maritime picture available to Naval Service and the wider Defence Forces.  Radar capabilities for the Naval Service are being progressed as part of a wider programme of work regarding military radar. A project team comprising senior civil and military personnel has been established to progress three elements to the Military Radar Programme:  • Land based Long Range Primary Radar;  • Ground Based Air Defence (GBAD) systems, to include a Counter-Unmanned Aerial Systems (C-UAS) capability; and  • Maritime (ship-borne) Radar.  When fully delivered, the Recognised Air Picture will incorporate this suite of military radar systems; which will have the capability to detect all aircraft traversing our airspace including any that may be operating with their transponders turned off.  This programme of work is ongoing and good progress has been made. A small handful of countries were invited to meet with the team to discuss our requirements, with a view to assessing options for delivery and finalising this phase of the Programme before the end of this year.  Full delivery of the Programme will be complex; but has been prioritised with a target date of 2028. That being said, elements of this capability will be rolled out in phases, starting in 2026, towards full delivery by the end of 2028.  Also in the air domain, capital investment in aircraft continues with the placing of the following contracts in recent years:  • Two new Airbus C-295 in Maritime Patrol Aircraft delivered in 2023.  • One new Airbus C-295 in a Military Transport configuration. This aircraft is in production and is scheduled for delivery in October 2025, with operationalisation shortly thereafter.  • One new Dassault Falcon 6X Strategic Reach Aircraft - a contract was awarded in December 2024. This aircraft is in production and is scheduled for delivery in December 2025, with operationalisation shortly thereafter.  • Four Airbus H145M Light Utility Multi-Role Helicopters, with these aircraft in production for phased delivery in 2027 and 2028.  In terms of Army capabilities, in recent years there has been significant investment in the armoured fleet of vehicles with the enhancement of force protection and mobility with the mid-life refit of the MOWAG Piranha III vehicles project nearing completion. To date 74 of the 80 vehicles have completed the Midlife Upgrade Programme and have returned to service. The final six vehicles are expected to complete the programme in early 2026. This programme will ensure the viability of the fleet beyond 2030.  A key recommendation of the Commission on the Defence Forces which has been accepted in principle is the “replacement of the existing APCs with a larger and enhanced fleet equipped with sufficient firepower for future overseas missions, and with ‘level 4’ armour across armour platforms where required”.  Investment in force protection capability is being maintained in line with the White Paper on Defence and the Equipment Development Plan.  Following a competition which concluded in 2024,deliveries of the new General Service Body Armour (known as IMBAS (Individual Modular Body Armour System)) are scheduled to commence in March 2026. The design and specification of this system has been developed by the Ordnance Corps on foot of inputs from combat branches with the intention of the provision to personnel of a system that meets international protection standards, is mission enabling and user friendly.  A tender competition is currently ongoing to procure a new operational combat helmet to complement this system with tenders expected for opening in December.  Following the delivery of new Chemical Biological, Radiological and Nuclear (CBRN) protection suits in 2024, an order is expected to be placed shortly on the framework established by the European Defence Agency (EDA) to enable the acquisition of further batches which will meet contingency needs.  A contract was awarded and is currently being implemented for a modern Software Defined Radio system which will enable the Defence Forces to rapidly adapt to emerging threats, enhance spectrum efficiency, and support multiple communication standards using software configuration, significantly improving the Defence Force’s communication capabilities and cyber resilience.  There is an on-going schedule of capital investment across a broad range of force protection measures, including the procurement of new thermal imaging targeting systems. Investment in transport, communications and information technology, weapons and ammunition systems continues in 2025.  These initiatives are an indication of the Government’s commitment to ensuring operational capabilities are maintained and developed in order to enable the Defence Forces to carry out the roles assigned by Government both at home and overseas, as set out in the White Paper on Defence. It will support the move to “Level of Ambition 2” as set out in the capability framework devised by the Commission on Defence. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_116",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_120",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_120",
          "showAs": "Illegal Dumping",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_120.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 116. Deputy Edward Timmins asked the Minister for Climate, Energy and the Environment if he will consider rolling out countrywide the Pure Mile Project that works successfully in County Wicklow and the Dublin uplands; and if he will make a statement on the matter. [60485/25] ",
        "questionNumber": 116,
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  PURE is a regional environmental partnership initiative which unites statutory and non-statutory interests in the Wicklow/Dublin Uplands, including relevant local authorities, Coillte, National Parks & Wildlife Service (NPWS) and the Wicklow Uplands Council to combat the problem of fly-tipping and small-scale illegal dumping in the scenic area encompassed by the Wicklow and Dublin Uplands.  The Department currently provides annual funding of €145,000 to support the work of the PURE Project.  Under the Waste Management Act, the primary responsibility for management and enforcement responses to illegal dumping lies with the local authorities. It is a matter for each local authority to determine the most appropriate awareness, enforcement, clean-up and disposal actions in relation to illegal dumping in their functional area, taking account of local circumstances and priorities.  While there are currently no plans to expand the work of the PURE project to other local authority areas, the Department continues to support the sector in tackling illegal dumping through the Anti-Dumping Initiative (ADI).  Over €20 million has been provided to local authorities under the ADI since it was launched in 2017, including almost €2.8 million in 2024, to encourage a collaborative approach between local authorities, community groups and other State Agencies to tackling illegal dumping. Funding provided under the ADI can be utilised by local authorities to organise clean-ups, purchase CCTV and other mobile recording equipment and put in place effective enforcement measures.  A further €3 million has been allocated to local authorities under the ADI in 2025. It is a matter for the local authorities to apply for this funding through the Waste Enforcement Regional Lead Authorities, who administer the scheme on behalf of the Department. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "questionNumber": 21,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Government is fully committed to providing financial certainty for infrastructure projects to support our international competitiveness and to ensure we meet the needs of our growing population.  The Review of the National Development Plan (NDP), published in July 2025, sets out a €275 billion public capital investment programme to 2035, the largest in the history of the State. The plan sets out sectoral capital allocations of €102.4 billion for the years 2026 to 2030; and a further €100 billion for 2030 to 2035. The setting of sectoral capital allocations gives Departments certainty about the funding available to them for investment in vital public infrastructure over the medium term.  The review includes an additional €34 billion relative to the previous 2021-2030 NDP including equity funding of €10 billion to 2030 to fund large strategic projects in energy, water and transport.  This is the largest ever capital investment plan in the history of the State and will enable the delivery of thousands of new homes, provide more childcare and school places, invest in children’s disability services and ensure better healthcare for all.  In the Review, Government prioritised investment in the critical economic growth enabling sectors – housing, water, energy and transport which will support the delivery of 300,000 new homes by 2030.  Departments are now developing sectoral investment plans that will outline the specific projects and programmes to be delivered over the next five years. These plans will provide a clear and timetabled pipeline of investment, enabling longer-term planning of infrastructure and the building up of construction sector capacity.  Budget 2026 builds on this. The Budget includes €19.1 billion in capital investment, an increase of €2 billion on 2025. This includes major investments in housing, water infrastructure, electricity grid capacity, and transport connectivity, all of which are essential to unlocking housing delivery and supporting economic growth.  My Department is also leading a comprehensive reform programme to accelerate infrastructure delivery.  A new Infrastructure Division has been established within my Department to drive this agenda. This Division is focused on identifying and removing barriers to delivery, particularly in the electricity, water and transport sectors which are critical enablers of housing, economic growth and public service provision.  I also chair the Accelerating Infrastructure Taskforce, with members including CEOs from semi-state agencies who are critical to economic infrastructure development, such as Uisce Éireann, the National Transport Authority, and ESB Networks, and independent senior members that bring their business and construction sector experience. The Taskforce oversees and applies practical, real-world insights into the Infrastructure Division’s work.  These measures demonstrate the Government’s commitment to providing sustainable and strategic public investment and also drive the infrastructure delivery reforms necessary to provide transformative infrastructure for Ireland’s future. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_57",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_57",
          "showAs": "Capital Expenditure Programme",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_57.xml"
            }
          }
        },
        "showAs": " 21. Deputy Edward Timmins asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will commit to long-term financial guarantees for infrastructure projects to facilitate longer-term planning; and if he will make a statement on the matter. [60203/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_21"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "questionNumber": 47,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 16, 47 and 50 together.  In line with the Programme for Government, a new Infrastructure Division has been established within the Department of Public Expenditure and Reform. Led by a Deputy Secretary General, the Infrastructure Division is tasked with accelerating the delivery of critical infrastructure across the State. It comprises a blend of experienced civil servants and sectoral experts with direct experience in infrastructure delivery, redeployed from key State agencies.  The work of the Infrastructure Division is supported by the Accelerating Infrastructure Taskforce, which I chair. The Taskforce was established in May of this year. It is comprised of six independent experts with extensive infrastructure delivery experience, alongside six ex-officio members drawn from semi-State bodies at the forefront of infrastructure development, as well as those with experience of the local government sector.  The role of the Taskforce includes:  • Providing strategic guidance and expert input to policy proposals to speed up infrastructure delivery;  • Providing guidance and advice to officials to ensure that barriers to infrastructure delivery are identified accurately and represent the most impactful barriers impeding timely and effective delivery;  • Providing guidance and advice on the development of a small number of high impact reform actions that are robust, time-bound and achievable; &  • Assisting with the oversight of the subsequent implementation of these reform actions by the Department’s Infrastructure Division, through challenge meetings with the Departments and Agencies responsible for implementation.  Since its formation the Accelerating Infrastructure Taskforce has met on a monthly basis and periodically, more frequently. It has provided invaluable support and guidance to my Department over this time. The Taskforce contributed to the work of my Department on the identification of the most important barriers to infrastructure, as per the report on barriers published in July. The Taskforce continues to be heavily involved with my Department's development of actions to overcome these barriers. This work is nearing its conclusion and I intend to present this report to Government in the coming weeks. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_52",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_52",
          "showAs": "Capital Expenditure Programme",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_52.xml"
            }
          }
        },
        "showAs": " 47. Deputy Edward Timmins asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on the steps taken by the new infrastructure task force; and if he will make a statement on the matter. [60204/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_47"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 55. Deputy Edward Timmins asked the Minister for Education and Youth for an update on the three secondary schools in west Wicklow (details supplied), which are awaiting building projects to commence; and if she will make a statement on the matter. [59747/25] ",
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_55",
        "questionNumber": 55,
        "answerText": " Minister for Education and Youth  The current status of the 3 secondary school projects referred to by the Deputy is as follows:  The Blessington Community College project has been devolved for delivery to Kildare and Wicklow Education and Training Board (KWETB).  The Project is currently at Stage 2b of the architectural design process. This stage allows for detailed design and planning, obtaining the necessary statutory permissions and the preparation of tender documents. A full grant of planning permission has been received for the school. KWETB have recently submitted the Stage 2b report to the Department and this is currently under review by the Departments Professional and Technical team. When this review is complete the Department will revert directly to KWETB regarding next steps. While at this early stage, it is not possible to provide a timeline for the completion of the project. KWETB will continue to engage directly with the school authorities to keep them fully informed of progress.  Regarding St Kevins CC Dunlavin, this project has been devolved to the National Development Finance Agency (NDFA) for delivery as part of a programme of school building projects. The project is currently at Stage 2b of the architectural planning design process with a full grant of planning permission received for the school. Again, while at this early stage, it is not possible to provide a timeline for the completion of the project. The NDFA will continue to engage directly with the school authorities to keep them fully informed of progress.  Finally, in relation to Scoil Chonglais Baltinglass, this project was approved funding under my Department’s Additional School Accommodation (ASA) scheme to provide 3 General classrooms, 1 Textiles room, 1 Music room, 1 DCG/Tech room, 1 Home Economics room, 2 Science laboratories with 1 Prep area and a 2 Classroom SEN base. This project has also been devolved for delivery to Kildare & Wicklow Education Training Board (KWETB).  Approval to Stage 2B (approval to planning) of the architectural design process was issued to KWETB in February 2025. While the onus is now on KWETB to liaise with the Design Team to progress the project, my officials will continue to work closely with the school authority and its design team to provide practical advice and assistance.  The Department is committed to ensuring appropriate school accommodation is available for all children in County Wicklow and will in the wider context outlined, ensure that these three projects - as for all projects on our school building programme - are subject to the due diligence required under the Public Infrastructure Guidelines.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_75",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_75.xml"
            }
          },
          "debateSectionId": "dbsect_75"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 79. Deputy Edward Timmins asked the Minister for Education and Youth for an update on a school (details supplied) where children were offered places for September 2025 and the classroom is not available yet; and if she will make a statement on the matter. [59748/25] ",
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_79",
        "questionNumber": 79,
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy is expanding its enrolment for the 2025/26 school year. As the school’s existing accommodation cannot facilitate additional pupils, it is necessary to undertake repurposing works to modular accommodation on the school site to provide further capacity and make it suitable for children with special education needs.  Planning permission for these works is required. On 10th October 2025, Kildare County Council issued a notice of decision to grant planning permission for the retention of existing accommodation on the school site and for repurposing works to the modular accommodation. There is a statutory period of 4 weeks to allow for any appeals to this decision to grant. Subject to no objections, the final grant of permission will be issued by Kildare County Council at the end of this period. Repurposing works will commence as soon as the final grant of permission has issued from the Council. It is intended that the works will then be completed by December.  The project has been devolved to the school patron, Kildare Wicklow ETB for delivery. The patron has made contingency arrangements for the pupils pending the completion of the repurposing works and will keep the families updated on the progress of these works. The priority is to ensure that the accommodation is made available for the children as soon as possible. ",
        "debateSection": {
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_98",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_98.xml"
            }
          },
          "debateSectionId": "dbsect_98"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 603. Deputy Edward Timmins asked the Minister for Enterprise, Tourism and Employment the Government’s plans to increase trade with EU partners; and if he will make a statement on the matter. [57163/25] ",
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_603",
        "questionNumber": 603,
        "answerText": " Minister for Enterprise, Tourism and Employment  The EU Single Market is a prime driver of Europe's prosperity and competitiveness and a safe haven shielding EU businesses from global uncertainties and market shocks. The EU Single Market is a critical and growing market for Irish exporters. A key focus for Enterprise Ireland is to further build on Irish companies presence in European markets to support Ireland's growth and resilience.  A key action from the Action Plan on Market Diversification is to conduct a review of trade missions and to take a more strategic approach to the planning of the trade mission programme. The EU and Single Market are key markets for Ireland for our enterprise and tourism agencies, and will remain a central focus in the planning of trade mission programmes in the years ahead. There are opportunities for deepening existing trade relationships with other EU partners in particular sectors and these will be explored as they are identified. ",
        "debateSection": {
          "showAs": "Trade Promotion",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_552",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_552.xml"
            }
          },
          "debateSectionId": "dbsect_552"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_74.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_74",
          "debateSectionId": "dbsect_74"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 109 and 139 together.  Syria remains in a state of transition, with the new authorities working to establish agreements and set out pathways towards inclusive governance while ensuring justice and accountability. Ireland and our EU partners are committed to supporting the emergence of a Syria that is equal, inclusive, and ensures the protection and integration of all communities.  It was welcome to see steps towards forming a stable and representative new government through the holding of parliamentary elections earlier this month. These are the first elections to take place since the fall of the Assad regime and were undertaken under a temporary electoral system. Two-thirds of the members were elected by representative electoral colleges and the balance will be appointed by President Al Sharaa.  There has been broad acceptance that these elections, limited as they were, represented a step forward for Syria. I hope that those elected and still to be appointed can play a positive role in rebuilding Syria.  I was pleased to see that International observers were invited to monitor the process and that it had included multiple consultative phases, mechanisms for appeal, and steps to increase women's participation and diverse representation. President Al Sharaa has a further opportunity through his nominations to increase the representation of women and minority groups.  It was disappointing that security concerns and lack of agreement with the local populations in Suwayda, Raqqa and Hasakah meant that voting was postponed there. Syria continues to differ from a legacy of sectarian and ethnic tensions, economic deprivation and humanitarian need, and external interference, in particular in the South West from Israel but also from Turkey in the North East and worrying reports of increasing Iranian influence. Overcoming this legacy includes challenging negotiations with the different religious and ethnic groupings to ensure an inclusive transition for all Syrians.  We welcome the return of Syria to international and regional organisations and its international engagement are important steps towards national stability.  Ireland pledged over €22 million to the Syrian crisis at the Brussels Conference in March this year and supported the early lifting of EU economic sanctions. The lifting of sanctions provides an opportunity for the Syrian people to access economic opportunities that will help them to rebuild their country.  Syria is discussed regularly at the EU Foreign Affairs Council and Ireland and its EU partners will continue to monitor progress and developments on the ground. ",
        "questionType": "written",
        "showAs": " 109. Deputy Edward Timmins asked the Tánaiste and Minister for Foreign Affairs and Trade the steps which have been taken by Ireland and the EU to ensure a stable and representative new government develops in Syria that respects minorities and the rule of law; and if he will make a statement on the matter. [57162/25] ",
        "questionNumber": 109,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_109"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_436.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_436",
          "debateSectionId": "dbsect_436"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  Under the EU-Survey on Income and Living Conditions, the EU-20 average disability employment gap is 20.2 percentage points; however due to the methodology used, it is difficult to make cross-country comparisons with accuracy.  Based on Census 2022, Ireland’s employment rate for people with disabilities was 49%, resulting in a disability employment gap of 22 percentage points. The National Disability Authority has advised that a change of question in the national census between 2016 and 2022 makes it impossible to compare data and that going forward, we should use 2022 data.  Nevertheless, the Government acknowledges that the disability employment gap is to wide and we are working to narrowing it. My Department provides a range of programmes and schemes to enable access to the workplace for disabled people, with the aim of increasing the employment participation rate of disabled people.  My Department's Intreo service is a single point of contact for all employment and income supports in the State. Disabled people can access mainstream employment schemes such as Community Employment and Tús as well as referral to tailored supports such as Employability, a service that offers a professional job-matching service, on-going support and advice and information on employment supports for disabled people.  Disabled people can make an appointment to meet with a Designated Disability Employment Personal Advisor to discuss employment and training options. There is now a Designated Disability Employment Personal Advisor in each of the 62 Intreo offices nationwide.  As stated previously in response to the Parliamentary Question to which the Deputy refers, the Workability programme, co-financed with the EU Employment, Inclusion, Skills, and Training Programme was established in 2024 by my Department. As of the 1st of September 2025, 4,005 people have engaged with 57 local, regional and national projects. 888 participants have exited the WorkAbility Programme with 318 participants finding employment and 134 participants commencing training. Its target is to support 13,000 disabled people into employment through these projects over its five-year lifetime.  In July 2022, my Department launched Early Engagement. The scheme aims to proactively engage with young disabled people or those in the early stages of disability or illness about options for education, training or employment. Over 35,000 people have been contacted and over 4,500 referrals have been made for further education or employment supports since the scheme launched.  Launched in 2024, the new Work and Access scheme addresses barriers to the workplace for disabled people, to increase the employment participation rate. Seven supports are available for disabled people and their employers including job coaches, work equipment, communication support and training. Supports are available for both the business premises and remote workplaces.  The Wage Subsidy Scheme supports employers to hire disabled people through a subsidy. In August 2024, my Department published a review of the scheme to make it more accessible and flexible. As a result, the minimum hours for the scheme were reduced from 21 to 15 hours. The scheme was expanded to those on Partial Capacity Benefit and to the community and voluntary sector.  An additional €3.7 million has been allocated to the scheme. In June this year, we launched the revamped scheme. A media campaign to raise awareness of this very beneficial scheme for employers and employees followed the launch. It is hoped that the implementation of the recommendations of the review will result in an expansion of the scheme.  Budget 2026 has provided for a further expansion to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit and provided for an increase in the subsidy rates.  My Department is committed to supporting disabled people into work and the Government recognises that more needs to be done to increase the employment participation rate. The Programme for Government commits to expanding successful programmes like WorkAbility and Work and Access and to work with employers and across Government to improve employment of disabled people, with a goal of reaching at least the EU average.  These commitments will be advanced over the lifetime of the Government in light of the prevailing policy and budgetary context.  I trust this clarifies the position of the Deputy. ",
        "questionType": "written",
        "showAs": " 526. Deputy Edward Timmins asked the Minister for Social Protection further to Parliamentary Question No. 305 of 25 September 2025, the means by which these programmes are increasing the participation rate, particularly as Ireland ranks last in the EU for participation of persons with disabilities in the workplace; the targets over the next five years to show progress in this area; and if he will make a statement on the matter. [57042/25] ",
        "questionNumber": 526,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_526"
      }
    },
    {
      "question": {
        "answerText": " Deputy Edward Timmins  The education and training boards, ETBs, offer many different post-leaving certificate, PLC, courses that often lead into third level education. In many cases these courses are suitable for leaving certificate students. What is the role of the ETBs in higher education and where they sit in the education hierarchy? \n Deputy James Lawless  The 16 ETBs are the backbone of further education and training, FET, context in local communities. They were established under the Education and Training Board Act 2013 and are funded and overseen by SOLAS, the further education and training authority, which is funded by my Department. The ETBs play a critical role in supporting inclusion, community involvement, outreach, developing critical skills, and underpinning the workforce development and lifelong learning agenda as part of the wider tertiary system. Provision in the FET sector includes accredited programmes at levels 1 to 6 on the national framework of qualifications, NFQ, as well as unaccredited options. This ranges from foundational skills such as literacy and numeracy, entry-level type courses, through to bridging programmes such as Youthreach, an incredibly important programme, at levels 3 and 4 going on to levels 5 and 6, including post-leaving certificate courses which involve progression to employment or higher education. The tertiary degrees are a wonderful initiative where a student can commence learning at a local ETB or further education centre, take a level 5 or level 6 qualification and go on to attend university for a level 7 or level 8 qualification. It takes away the fear factor or confidence factor of making that leap. They can take a smaller step locally but can then progress to a third level qualification beyond that.  Traineeships, apprenticeships and specific skills training focus on work-based learning and direct employment pathways through the ETBs. We have visited many local ETBs, as has Minister of State, Deputy Harkin. We have both gone around them over the past number of months and continue to be impressed by the work they do. They engage with the regional skills fora, with local employers and local industries, to ensure the needs of labour force is being met. ETBs also work with higher education institutions - the universities, the colleges, the technological universities - to create pathways from FET into higher education and qualifications beyond level 6. I mentioned the tertiary programmes where learners can start closer to home in a more comfortable, familiar setting without the attendant commuting, etc., and can progress to a third level institute beyond that. \n Deputy Edward Timmins  I ask that all ETB schools promote these courses within their schools, but also that the ETB colleges and courses are promoted within non-ETB schools. The ETBs also offer apprenticeships. Could relevant funding be allocated to promote these apprenticeship courses? The apprenticeships have been encouraged and have grown since the Tánaiste, Deputy Simon Harris, was Minister for higher education. Our leaving certificate is very academic orientated, and it is not suitable for everyone. School leavers who do not wish to pursue the CAO route need to be considered. Not everyone wants a college degree. On the other hand, as the Minister said, many ETBs offer tertiary courses that offer an entry to third level college, giving a new pathway to degree courses in many fields. This is a fantastic opportunity for those who are determined to go to third level, but who did not get the required CAO points for the course they wanted. These opportunities need to be promoted more. \n Deputy James Lawless  I fully agree with Deputy Timmins. There are a couple of ways to look at this. The promotion of further education options and apprenticeships is really important. We have a job of work to do as a country and a society in persuading people of that and advocating for it. I make the argument every day that apprenticeships and further education in general should never be seen as second best or some kind of rung below. They are absolutely equal, exciting, tangible and can be a very rewarding pathway into a career as a first-choice option. That is a message we need to repeat. We must align our access to education through combined pathways and continue to promote that message through guidance counselling and all those areas. It is key we do that. I have visited a number of ETB schools, which have both second level and further education going on in the building. I was in Gorey Institute of Further Education recently and Mullingar Community College not so long ago and a number of what we call dual schools. They could do a body of work promoting options within them. Indeed, non-ETB schools could do the same. I am not going to trespass on Minister for Education and Youth, Deputy McEntee's area because second level education and guidance counselling, etc., comes under her remit, but that is something we would all be supportive of. \n Deputy Edward Timmins  ETB courses are by and large free or very low cost. ETBs offer a range of short courses along with longer duration courses. Are these courses achieving their aim? What is the workforce-entry success for people who do these courses? Are the short-term courses achieving their aim or are they just being done as a tick-box exercise by people who are unemployed? Are they contributing to these people entering the labour market or following on to some apprenticeship or PLC course? In the area of disability, Ireland has the lowest labour participation rate in Europe. I understand some ETBs offer work-ready courses. Can the ETB play a bigger role in improving labour participation rate within the disability sector?  How closely aligned are the ETBs to industry? Can they build closer relationships with industry, as discussed earlier, and plan their training programmes to align with industry needs? This is a dynamic situation and should be kept under constant review. Regarding transport, can students access these courses and are transport links being developed? \n Deputy James Lawless  There is a lot there. If I do not get to it all in 60 seconds, I will come back to Deputy Timmins. ETBs provide a very valuable role across a number of areas and a number of goals. I never regard an educational course as a tick box. The pursuit of knowledge is a public good. Whether someone is in the labour force, is unemployed or has disabilities, it is always a benefit to the individual and to society if they progress their education to whatever extent, short or long. There are many different paths through it. We have early school leavers who avail of community training centres.  There are specialist training providers in the system for people with disabilities. There are community education organisations. Some learners will progress a FET qualification. They can then be QQI awarded and given points for that, which they can then use to apply to the CAO directly, coming through what we call a QQI pathway rather than the traditional leaving certificate points system. There are also the tertiary courses I mentioned. There are a number of different options. There is everything from specialist industrial skills to people pursuing knowledge and hobbies and gaining confidence to come outside the home and pursue education. There is a range of different courses and objectives. I would consider them all of significant value. ",
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 8,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_11.xml"
            }
          },
          "showAs": "Education and Training Boards"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_8",
        "showAs": " 8. Deputy Edward Timmins asked the Minister for Further and Higher Education, Research, Innovation and Science the role of the ETBs in higher education, and where they sit in the education hierarchy; and if he will make a statement on the matter. [56040/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Deputy Martin Daly  I ask the Minister to state, given the value placed on clusters of third level institutions and innovation hubs, whether there are clear pathways and supports in place for establishing and expanding such hubs, especially in the west. I raise that in the context of a very successful urological-surgical innovation hub based at Atlantic Technological University, ATU, in Galway, in collaboration with the University of Illinois Chicago. \n Deputy James Lawless  I propose to take Questions Nos. 7 and 25 together  Gabhaim buíochas le Teachta Daly. Deputy Timmins is on this question as well. The question refers to the collaboration between innovation hubs, industry and third level institutions. My Department has, I believe a strong economic focus; it should have and does have. I am committed to making sure this is an economic Ministry that drives the needs of industry and engages with industry, labour force planning and skills development and the critical role of research and development in driving that knowledge economy. We should be working very closely with industry and taking the lead from skills needs of the future. The national skills group is working on that and on understanding what the projected needs are while supporting and collaborating with industry.  That collaboration between the tertiary system across all the different educational frameworks and enterprise is critical. I have underpinned that through a number of strategic engagements with enterprise agencies such as IDA Ireland and Enterprise Ireland, with representative bodies such as IBEC, ISME and others, individual enterprises and multinationals and indeed many firms that are leading-edge in technology and research and who are active in Ireland, including in Deputy Daly's region. He will be familiar with them. Part of that is driven at a policy level through platforms, including the national skills council, which I mentioned; the regional skills forums, where we understand the current market needs and emerging needs of the labour force; real-time insights from partners working in sectors; and then programmes like Springboard+, Microcredentials and Microqualifications and Skills to Advance. These look at the skills needs and how industry and the education sector can work together and supply different course offerings that are tailored and flexible to the needs of the learner, particularly the working learner, who might take a full-time offering but will perhaps take a microcredit and plug one on top of the other to gain a further qualification.  There is also the Research Ireland accelerating research to commercialisation, ARC, hubs programme, cofunded by Department and the Government with support from the EU. It aims to establish new models for regional innovation and entrepreneurial training. That looks to accelerate the transition to the market of research coming from a higher education institute. It is from the fab to the lab, as we say in the case of semiconductors; similarly, it applies to many other fields as well. That is so important because academics are often performing an outstanding piece of work but they may not be equipped to take it to the next level - to the market, and to commercialise it or even bring it to mass production to benefit many more people.  I am engaging with the Deputy on the urology project he advocated for. It is a very interesting project. It is a good example of where we can take that industry collaboration and plug it into the research ecosystem. There is a synergy and it lifts all. I welcome it and I am quite keen to engage further on that one. There are many others, if we look at the ARC hub and for health and tech. I was at the Royal College of Surgeons in Ireland, RCSI, yesterday. It has a collaboration with the ATU on health technology. It has also been working through that. There is a western regional skills forum that allows business in counties Galway, Mayo and Roscommon to assess and develop skills for their employees and work in partnership with them.  On the technological universities more generally, one of their aims is to provide technical expertise rooted in the regions, working with and close to industry to allow that local and regional collaboration to progress. That is such an important project and I am very committed that. There are a number of initiatives I want to roll out further within the technological universities over the course of this year and subsequent years. There is a lot of work going on. A lot done, more to do. \n An Cathaoirleach Gníomhach (Deputy David Maxwell)  Deputy Daly is sharing time with Deputy Timmins. \n Deputy Martin Daly  I thank the Cathaoirleach Gníomhach. I was unsure.  I thank the Minister. In this model with the University of Illinois Chicago, extending into other areas of medicine is talked about. Urology is the template they have used in ATU. It provides expertise based on research and innovation. It has developed a venture studio model, which draws on the experience of world-class entrepreneurs and scientists that mentor researchers to bring their work to start-up. That is the important link. We have a lot of research going on but it is about bringing that research into the real world and mentoring the people who have done the research so they can bring it to business. That is what we are aiming for. I am assured it has a long track record in this area and because of its reputation, it has the ability to attract major investors.  I appreciate the Minister's engagement on this matter. He might make a statement as well on the new supercomputer collaboration with the University of Galway. \n Deputy James Lawless  Yes. \n Deputy Edward Timmins  I thank the Minister. He certainly seems well aware of the importance of the third level link with industry so he has certainly answered my first question.  I want to make another couple of points. I have seen examples over the years where third level institutes have linked in with industry. This has worked really well. It also offers graduates employment opportunities in industries located close to their colleges. This is especially true in the areas of technology, science and engineering. As well as benefiting graduates in the institutions, it also means the industries are more embedded in the area. Both the third level institutions and the industry feed off each other and offer huge benefits to both sides. I ask the Minister to do everything in his power to develop these relationships. \n Deputy James Lawless  I thank both Deputies. I will respond to Deputy Daly on the urology project. It is a project I am very keen to explore further and there are already a number of projects like that we are developing in the regions. The New Frontiers programme in Castlebar and Galway has a start-up ecosystem working with ATU, and perhaps the urology project could be done along the same lines.  On the supercomputer, I was very keen when I came into this Department that Ireland should remain at the leading edge of digital, quantum and artificial intelligence. That requires significant computing power. We need a supercomputer. All of the most advanced research activity generates huge datasets. Storage and computational power are needed to make sense of those and make discoveries. I initiated the process of procuring a new supercomputer that will be managed by the University of Galway. The Irish Centre for High-End Computing is already in the University of Galway. It is doing a tremendous job on that. In fact, the Galway-led bid we submitted to the European HPC facility came third out of 17. It was very highly ranked and strongly received. We are also pursuing an AI antenna, an artificial intelligence factory that plugs into Luxembourg and France and allows collaboration at an EU level in those areas. It is so important if we are to remain at the forefront. We are talking about digital technologies but there are also health informatics, digital public services and the power to assimilate and understand data for all kinds of modelling, such as climate and transport. Many areas of public need can now be met by that and require that power. I am keen that we remain at the forefront of that.  Deputy Timmins is absolutely right about collaboration with industry and how we make sure that lands and succeeds. Some of the things I want to embed or offer as ancillary supports for postgraduate students include communications and enterprise modules. Start-ups and spin-outs should be encouraged as well. Yes, we want researchers publishing citations, papers and publications but we also want to see campus companies beginning to come out again, giving enterprise a lift. There are some collaborations; iBio in UL is one such collaboration with industry. I would like to develop more programmes that are copartnered. \n Deputy Martin Daly  I thank the Minister. When speaking to the group of people involved in this project in Galway, one of the points they made was that there are many institutions in the United States which, in the current climate, are looking for bases in the European Union. Ireland has this opportunity. We talk about the threat of tariffs and the difficulties in getting new industry here. We will hold our existing industry, but the concern is that down the road research and development will move away from us. There is an opportunity to reverse this flow and get this expertise from world-class universities in the United States to base their research hubs in Ireland. They have assured me they can base their hub anywhere. I mentioned Ballinasloe, which is in my constituency, but they would be happy to base anywhere. With technology and the use of high-grade computers, they can carry out their research in collaboration with institutions in Ireland. \n Deputy James Lawless  I absolutely agree this is part of the response to the challenges posed by the changing trade and tariff situation. We are entering an age of deglobalisation. We also have many other factors to contend with. It is important we maintain that industrial base and that knowledge economy we fought so hard to develop over the past 30 or 40 years. The key to that is the knowledge economy and investment in research, innovation and education. In terms of stickiness, it is easier to move a factory offshore than it is to move a research hub because the deeper dive performed within the area, the harder it is to replicate it and move elsewhere. We need to continue and invest. That is why I am working with agencies like the IDA and Enterprise Ireland.  In terms of mobile talent, talent is our greatest natural asset, and we have some wonderful talent on this island. It is my job to nurture, foster, support and grow that through investment in education and all that we are doing. I am mindful there are many who may be considering relocating from the United States perhaps, or other jurisdictions due to changing trends in their home states. I recently put out a global talent initiative, which is a call to invite researchers from outside of Ireland, including the United States, to consider relocating here. Those people typically come in two categories, naming rising stars, which are young people on the up and who have made a name for themselves but are still forging their path through academia, and established people, who have a very strong record. Both types bring excitement, energy and often funding with them and can contribute significantly to the development of a particular area. I am going to single out Professor J.C. Seamus Davis, an academic in quantum computing in University College Cork. I visited his lab recently. He works in partnership with Tyndall National Institute. He is doing amazing, world-leading research in semiconductors, which is a key part of the global supply chain and a key part of Irish industry. He came through initiatives such as that a number of years ago. One or two people can bring such a critical mass with them that they can develop an entirely new hub or an entirely new research programme or collaboration.  I also intend to announce funding for a new research infrastructure programme in the next number of weeks which will set the foundation layer for equipment, laboratories, computing power and all the base layer that is required to build this because we need a solid foundation to let this work happen. It is critical to our economy and society that we should do so. ",
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 25,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_10",
          "debateSectionId": "dbsect_10",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_10.xml"
            }
          },
          "showAs": "Research and Development"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_25",
        "showAs": " 25. Deputy Edward Timmins asked the Minister for Further and Higher Education, Research, Innovation and Science the steps being taken to develop co-operation and relationships between third level institutions and industry; and if he will make a statement on the matter. [56041/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 97 and 110 together.  Embracing Ireland’s Outdoors , the National Outdoor Recreation Strategy 2023- 2027, was published in November 2022. The strategy was developed in collaboration with Comhairle na Tuaithe, the Countryside Council, and is a collaborative cross-Government, stakeholder-led strategy.  Embracing Ireland’s Outdoors will ensure that there is a joined up and coordinated approach to deliver maximum impact from the significant investment in the sector and to build on the natural advantages in place. Collaboration and stakeholder engagement was critical to the successful development of the strategy, and to its delivery to date.  The implementation of the strategy is being jointly led by my Department and Sport Ireland. Progress in delivering the strategy is being monitored through a strategy oversight group and quarterly meetings of Comhairle na Tuaithe.  The 2nd Progress report which provides an update on all strategy actions due to be delivered up to the end of June 2025 will shortly be published on my Department’s website. There has been good progress reported on most of the actions assigned for delivery up to mid-2025. Indeed, I spoke at the national outdoor recreation conference earlier this year and it was clear from the event that there are great steps being taken across the country to grow the sector for both economic, social and health benefits.  Some of the progress worth highlighting includes the new county structures that are being put in place to support outdoor recreation throughout each county. This includes the establishment of new County Outdoor Recreation Committees and the development of an Outdoor Recreation Plan in each county. These plans will guide the development of outdoor recreation in each county over the next 5 years. My Department is providing funding to support the development of the plans and, so far, 22 counties have commenced work on their plans.  Funding has also been provided for 6 County Outdoor Recreation Officer positions on a pilot basis for 3 years to co-ordinate the development and delivery of the county outdoor recreation plans in the selected counties. The pilot will be evaluated to consider if these positions should be rolled out further.  Other progress worth noting includes the amendments to the Occupiers Liability Act which help to limit the risk to landholders from those accessing land for recreational purposes. These amendments brought in important changes in respect of the duty of care provisions on landholders and included new reference to the voluntary assumption of risk. Comhairle na Tuaithe has developed an information booklet to explain these important reforms to farmers and recreational users.  Another key action in the strategy was the commitment to expand the number of trails on my Department’s Walks Scheme to 150. This is in recognition of the value of outdoor recreation amenities, not just for individual and community wellbeing, but also for the tourism impact these trails have on a local economy.  164 trails have now been approved in principle to join the Scheme, which exceeds the commitment in the strategy. To date, 112 of these trails have been fully brought onto the Scheme with 2,679 participant landowners now signed up. Work is ongoing to bring on the rest of the trails as soon as possible.  This is only a snapshot of some of the progress on the strategy to date. My Department, in conjunction with Sport Ireland will continue to implement the remaining strategy actions to address the challenges and support the opportunities of this exciting and growing sector. ",
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 110,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_120",
          "debateSectionId": "dbsect_120",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_120.xml"
            }
          },
          "showAs": "Sport and Recreational Development"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_110",
        "showAs": " 110. Deputy Edward Timmins asked the Minister for Rural and Community Development and the Gaeltacht for an update on the national outdoor recreation strategy, with particular emphasis on the walks scheme; and if he will make a statement on the matter. [56038/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Teacher Training",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_187.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_187",
          "debateSectionId": "dbsect_187"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  School placement is a central feature of initial teacher education (ITE), where student teachers are welcomed and supported by tutors from higher education institutions (HEIs), school principals, class teachers and the school community. Student teachers must successfully complete this element of the programme, which provides them with an opportunity to reflect on their identity as teachers, to develop and to become socialised into the profession. It is underpinned by a shared professional understanding that collaborative engagement with school placement provides professional learning opportunities for all involved.  There are no plans, at present, to introduce a grant for student teachers while on school placement as this element is viewed as training rather than employment, the principal aim and function of teaching practice being:  1) to help the student teacher develop practical skills through observing and reflecting on the professional teacher working with pupils in the classroom and  2) with support and supervision, to enable them to bring together the theoretical and practical elements of the course work with the aim of acquiring practical skills in classroom management, curriculum planning, and the organisation of pupils learning activities.  As school placement is a mandatory element of ITE programmes, state grants such as SUSI continue to be paid during school placement periods. For further information on financial supports available to students, please see [ Financial supports for students ]. ",
        "questionType": "written",
        "showAs": " 188. Deputy Edward Timmins asked the Minister for Education and Youth if she will consider giving student teachers a grant to cover the cost of supplying materials for class use by pupils while on their placements (details supplied); and if she will make a statement on the matter. [56043/25] ",
        "questionNumber": 188,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_188"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_597.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_597",
          "debateSectionId": "dbsect_597"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Bovine TB is an ongoing challenge for Irish farmers. I am acutely aware of the emotional and financial impacts of bovine TB on farmers, their families and rural Ireland. In recent years we have seen a significant increase in bTB levels nationally with over 6,000 farm families affected by a bTB outbreak in 2024 and herd incidence was at 6.04%.  The primary driver of the cost of the bTB programme is disease levels. In 2024, the bTB programme cost €100m, an increase of 35% on 2023. For this year up to 30th September just under €80 million has spent on the TB programme.  I secured an increased budget allocation of €85 million for bTB in Budget 2026, providing a total budget of €157 million. This additional funding is vital in addressing this disease and I am confident it will help drive down the incidences of bovine TB levels for future years.  This investment in the bTB programme will support additional targeted testing, additional resources for the wildlife programme and supporting on farm biosecurity through both direct support to farmers for improving biosecurity infrastructure on their farms and facilitating more engagement between farmers and their private veterinary practitioners through Targeted Advisory Service on Animal Health (TASAH) visits.  I published the Bovine TB Action Plan, “Addressing Bovine TB in Ireland”, on 9 September. The Action Plan follows extensive discussions with stakeholders in recent months. The Action Plan is based on scientific research and veterinary expertise. There are five measures, which are underpinned by 30 actions:  Support herds free of bTB to remain free  Reduce the impact of wildlife on the spread of bTB  Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  Help farmers improve all areas of on-farm biosecurity  Reduce the impact of known high-risk animals in spreading bTB  I am confident that the increased budget for 2026 will allow the revamped bTB programme to focus on tackling disease levels through the implementation of the measures laid out in the new bTB Action Plan and will support and enable farm families who are currently dealing with the stress of a TB outbreak to navigate a way out of a bTB restriction and protect those herds currently free from bTB from the stress of a bTB outbreak.  It is critical that this additional expenditure focusses on reducing disease levels. The objective of the new measures in the Bovine TB Action Plan is to reduce the number of farms affected by bTB and ultimately decrease costs for farmers and the taxpayer. ",
        "questionType": "written",
        "showAs": " 746. Deputy Edward Timmins asked the Minister for Agriculture, Food and the Marine the way in which the increase in TB expenditure announced in Budget 2026 will be spent; and if he will make a statement on the matter. [55108/25] ",
        "questionNumber": 746,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Edward Timmins",
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_746"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Edward-Timmins.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "showAs": "Edward Timmins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_76",
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I can advise the Deputy that there are currently seven overseas Visa Offices in addition to the Visa Office in Dublin. They are located in Abuja, Beijing, London, Moscow, Ankara, Abu Dhabi and New Delhi. In addition, the Department of Foreign Affairs and Trade process certain visa applications in Irish Embassies abroad under delegated sanction from my Department.  Processing times and decisions at the Dublin Visa Office and the Overseas Visa Offices can be checked at the following link:  www.irishimmigration.ie/visa-decisions/ .  I can assure the Deputy that while processing times can vary across the different Visa Offices and Irish Embassies the majority of visas are processed within stated target times. Most short term applications are determined in a matter of weeks. However, some applications can take considerably longer. Processing times for all applications are influenced by a number of factors. The time it can take varies depending on the type and complexity of application; individual circumstances; peak application periods; such as holidays or the start of the school year; and, crucially, the quality and completeness of the application lodged.  In 2024, approximately 201,000 visa applications, of all types, were received by my Department. This reflects an increase of 21%, compared to 2023, with over 35,000 additional applications received. These increases have continued, in the first eight months of 2025, my Department's Visa Division received approximately 151,000 visa applications and has issued over 134,000 decisions.  This reflects an increase in applications of 5% compared to the same period in 2024. My officials are working to meet the increased level of demand, and over 5,500 additional visa decisions have issued in the first eight months of 2025, compared to the same period in 2024.  The time it can take varies depending on the type and complexity of application; individual circumstances; peak application periods; such as holidays or the start of the school year; and, crucially, the quality and completeness of the application lodged.  Where an application is of poor quality or where essential documentation is missing, it will inevitably add substantial additional time to the decision making process. My Department’s website https://www.irishimmigration.ie/ and the online application AVATS system provides clear guidelines to assist the applicant in making good quality and complete applications.  Visa and pre-clearance applications provide legal avenues for people moving to Ireland for employment, study and family reasons and also to facilitate visitors who wish to travel for business and/or tourism. It is important to recall these applications are screening processes, designed to establish that the person has a legitimate reason to come to Ireland prior to travel. Verifying an application is an important part of our immigration system and the checks involved can take time to complete.  I understand that extended wait times can be frustrating for applicants, and I want to assure anyone who has made an application for a visa that my Department is doing everything possible to progress these applications as quickly as possible. Staffing levels are kept under ongoing review having regard to demands placed on my Department’s Immigration Service Delivery function generally. This year additional resources and staff have been assigned to my Department’s Visa Division in response to the growing demand for these services. ",
        "date": "2025-10-09",
        "questionNumber": 76,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_92",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_92.xml"
            }
          },
          "debateSectionId": "dbsect_92",
          "showAs": "Visa Applications"
        },
        "showAs": " 76. Deputy Edward Timmins asked the Minister for Justice, Home Affairs and Migration is there is a way to speed up the application process for short term visit visas, including for academics or for business conferences and meetings; and if he will make a statement on the matter. [54222/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  On 15 October 2024, my Department published a Ministerial Action Plan on Planning Resources to respond to capacity challenges in the planning sector. This Action Plan provides a detailed roadmap to increase the pool of planning and related expertise needed to ensure a planning system fit for future needs. It sets out 14 high-level actions that provide a coordinated pathway to ensure a sustainable pipeline of planning and related expertise into the future, addressing the areas of education, recruitment and retention, as well as measures to encourage greater innovation and efficiency.  Funding was secured in Budget 2025 to support delivery of the Action Plan and a Steering Group was established to coordinate and oversee the development of this Action Plan. This group remains in place to oversee the implementation and ongoing review of the Action Plan. Five Working Groups, the members of which are key stakeholders, have been established to progress grouped actions in the areas of education, national recruitment, international recruitment, system reform and innovation and efficiency. All of these working groups have met a number of times and the work of the groups is progressing well.  A copy of the Action Plan can be accessed on my Department’s website at the following link: www.gov.ie/en/publication/51194-ministerial-action-plan-on-planning-resources-october-2024/.  In October 2023, my Department conveyed approval to the filling of an initial 100 additional posts, subsequently increased to 101 posts, in the local authority planning sector under the first tranche of a programme of supports for planning resources. A further approval issued in January 2025 for 112 additional posts - 56 graduate planner posts and 56 staff officer posts - to support the Planning function within local authorities. Local authorities were notified of their allocation for Phase 2A graduate planner posts on 17 April 2025. A graduate planner recruitment campaign was launched on 13 May 2025 to attract graduate planners into Ireland’s Local Authorities (Action 4), which was supported by my Department.  The occupation of town planner has been added to the Critical Skills Occupation List (Action 9) which will allow eligible non-EEA professionals from outside of Europe to benefit from streamlined employment permit processes, making it easier for Irish employers to recruit and retain international talent in this vital sector.  My Department is currently working on a number of measures to increase staffing levels in the local government planning sector. In this regard, my Department is collaborating with the Local Government Management Agency on the delivery of a third tranche of supports to planning authorities. These supports include the provision of staffing resources and expertise to enable planning authorities to perform their functions efficiently and effectively.  Under Section 159 of the Local Government Act 2001, each Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which he/she is responsible. ",
        "by": {
          "showAs": "Edward Timmins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Edward-Timmins.D.2024-11-29",
          "memberCode": "Edward-Timmins.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 104,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_101",
          "debateSectionId": "dbsect_101",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_101.xml"
            }
          },
          "showAs": "Local Authorities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_104",
        "showAs": " 104. Deputy Edward Timmins asked the Minister for Housing, Local Government and Heritage given the significantly increased housing targets for local authorities, if his Department will ensure that the local authorities are adequately resourced to deal with the expected increased volumes of planning applications. [53892/25] "
      },
      "contextDate": "2025-10-08"
    }
  ]
}