{
  "head": {
    "counts": {
      "questionCount": 506,
      "resultCount": 506
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  This Government and I recognise the importance of early intervention for children with disabilities and ensuring they receive the right services at the right time.  The HSE has been developing a Single Point of Access referral model. This will ensure that children are referred to the appropriate healthcare service, whether that is Primary Care , Disability and Child and Adolescent Mental Health Service (CAMHS), at an early stage. As a result, children will not be put on multiple waiting lists or be passed from one service to another.  A National Single Point of Access (SPoA) Implementation Group was established in August 2025, to provide oversight of the implementation of SPoA project within each Regional Health Area (RHA) for Children's Community Services.  September 2025 six engagement events were held with key stakeholders involved in the delivery of Children’s Services including Children Disability Network Teams, CAMHS, Primary Care, family representatives, funded agencies and wider stakeholders to foster collaboration amongst all stakeholders  The HSE will continue the operationalisation of this initiative throughout 2026. To ensure smooth execution and oversight of the SPoA at a regional level, each of the six RHAs has prepared submit detailed implementation plans, aligned with national policy and local context.  The rollout will be supported by the continued development of the HSE Community Connects ICT system, which aims to bring all community health services onto one shared digital system.  I trust this information is of assistance to you, but should you have any further queries please do not hesitate to contact me. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 73. Deputy John Connolly asked the Minister for Children, Disability and Equality for an update on the implementation of a single-point-of-access system, which will make it easier for families of children considered to have a need to be referred to the right service, whether that is a children's disability network team, primary care or child and adolescent mental health services; and if she will make a statement on the matter. [72981/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_116",
          "debateSectionId": "dbsect_116",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_73",
        "questionNumber": 73
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 88. Deputy John Connolly asked the Minister for Children, Disability and Equality for an update on the implementation of a programme of acquisition and fit-out of State-led early learning and childcare services, as proposed in the programme for Government and budget 2026; and if she will make a statement on the matter. [72982/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_132",
          "debateSectionId": "dbsect_132",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_132.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_88",
        "questionNumber": 88
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  From the figures the Deputy has quoted, I will assume that he is referring to the General Government Balance, which is a wider measure than the Exchequer balance and incorporates the activity of all arms of Government.  At the time of Budget 2024, a General Government surplus of €14.6 billion was forecast for 2026, based on revenue of just under €141 billion and expenditure of €126.3 billion.  By the time of Budget 2026 earlier this year, the forecast for expenditure had risen to €147.3 billion, an increase of just under €21 billion. This increase in expenditure was partially offset by an upwards revision in forecast revenue to €152.4 billion, an €11.4 billion increase.  In line with Programme for Government commitments, my Department will be publishing a Medium-Term Fiscal Plan tomorrow. This will set out binding expenditure ceilings and fiscal forecasts for the period 2026-2030. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 219. Deputy John Connolly asked the Tánaiste and Minister for Finance the reason his Department has revised the forecasted Exchequer surplus in 2026 down to €5.1 billion from the predicted surplus of €14.6 billion in budget 2024; if his Department will provide fiscal forecasts for the Exchequer for 2027 and 2028; and if he will make a statement on the matter. [69847/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_233",
          "debateSectionId": "dbsect_233",
          "showAs": "Exchequer Returns",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_233.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_219",
        "questionNumber": 219
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Rent Tax Credit may be claimed by a parent for a student child where:  • the child concerned is undertaking an approved course and was under the age of 23 at the commencement of the year of assessment in which he or she first entered an approved course,  • the child’s residence in the property facilitates his or her attendance at or participation in that approved course,  • neither the parent nor the child is related to the landlord concerned, and  • the landlord has complied with their RTB obligations.  Where the claimant is jointly assessed to tax, the qualifying payment may be made by either the claimant or his or her spouse or civil partner, and the child concerned may be a child of either the claimant or his or her spouse or civil partner.  Revenue have advised me that it is not yet possible to provide comprehensive data for 2024 and 2025 is not available as the filing deadline in relation to self-assessed taxpayers has not yet passed. In 2023, 17,200 taxpayer units who claimed the RTC, indicated the claim was made in relation to a child. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 243. Deputy John Connolly asked the Tánaiste and Minister for Finance the number of persons who availed of the rent tax credit for a child renting accommodation while studying in qualifying third-level education in 2023, 2024 and 2025, in tabular form; and if he will make a statement on the matter. [69846/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_256",
          "debateSectionId": "dbsect_256",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_243",
        "questionNumber": 243
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The mental health and wellbeing of students is a priority for my Department, especially in light of the increased stress and anxiety levels students are experiencing in Third Level Education. My Department has progressed a number of initiatives, in partnership with the Higher Education Authority (HEA) and Higher Education Institutions (HEIs), over the last few years to address the broad spectrum of mental health and wellbeing issues faced by students.As autonomous bodies, the internal disbursement of this funding, including the funding of their student services, the employment of counselling staff, and the procurement of counselling and mental health services are a matter for the individual institutions.  As part of its broader sectoral objective of supporting students on their journey to success, in and through higher education, my Department has provided €31.9 million in additional funding through the HEA to HEIs since 2020. This funding is to further support HEIs in meeting the mental health and wellbeing needs of their student population and in implementing the National Student Mental Health and Suicide Prevention Framework and the Healthy Campus Charter and Framework. The additional funding was also used to augment coordination of capacity building on a national level through a number of National Projects.The HEA National Student Mental Health and Suicide Prevention Framework has been providing guidance to institutions on supporting student mental health and suicide prevention since 2020. It includes nine themes including actions that relate to drug and alcohol use.  Specifically, under the theme, ‘Lead’ institutions are asked to ‘audit the campus environment with a view to restricting access to lethal means’, other actions relate to students in higher risks groups which can include those with a history of drug or alcohol misuse and addressing risky behaviours. Based on the findings of a review report of the Framework published in July 2025, the HEA, in consultation with the HEA Student and Staff Health and Wellbeing Advisory Group, will oversee the revision of this Framework.The HEA Healthy Campus Charter and Framework is a framework through which institutions can address locally identified student needs and national health priorities using a whole campus approach.  Several national policies and strategies have been developed to support Ireland’s health and wellbeing in the keys areas of physical activity, obesity, tobacco, sexual health, mental health and drugs and alcohol. The HEA Healthy Campus Self-Evaluation Tool was developed to support institutions to self-assess their work in relation to student and staff health and wellbeing. It works across five pillars which are aligned to the Healthy Campus whole campus approach, an additional pillar ‘Health focus areas’ includes health topics such as alcohol use, illicit drug use and tobacco use and vaping. In each of these sections, HEIs can self-assess their work in relation to these topics, for example asking if they provide information, have policies, provide services, participate in national campaigns, or include information in any wellbeing curriculum. These self-assessed benchmarks support institutions to consider how they can improve their work in relation to drug use education, awareness and addiction prevention.  Some of the HEI Drug and Alcohol Use Initiatives and Programmes include: • UCC - Enabling Students and Higher Education Institution to Lead the Response on Drugs (E-SHEILD) Project  • University of Limerick - ‘#DrugDrivingAware A regional collaborative third level initiative: Developed by students for students’  • MTU - ‘A Healthy MTU’: An Investigation into the Dietary Behaviours and Alcohol Consumption Patterns of First Year Undergraduate Students During the Transition to Higher Education’  • Trinity College Dublin - Addiction Recovery and Wellbeing Group  Each Education and Training Board (ETB) has an overarching drug use policy, which individual FET centres adapt to meet their specific needs, supported by detailed procedures. Many centres partner with local drug task forces and other specialist agencies to deliver workshops and counselling. Youthreach Centres, for example, facilitate access to a range of supports for their learners, including personal counselling and drugs awareness initiatives.  SOLAS’ Reach and ALL Collaboration and Innovation Funds, provide significant funding to the Further Education and Training sector (FET) for a wide range of programmes that aim to raise awareness and reduce harm for individuals, families, and communities, including young people. Since 2020, over €2.5 million has been allocated for Community Education projects to provide targeted projects for people impacted by addiction, with many of these projects focusing on drug education and preventative education.Addiction studies courses are available across FET, from Level 5 modules in community development to programmes delivered in prison education units. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 789. Deputy John Connolly asked the Minister for Further and Higher Education, Research, Innovation and Science if his Department funds drug addiction prevention initiatives in further and higher education institutes; and if he will make a statement on the matter. [73685/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_755",
          "debateSectionId": "dbsect_755",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_755.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_789",
        "questionNumber": 789
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The table below reflects overall funding allocated to mental health in Higher Education, for the years that the Deputy requested:     Year    Total      2020    €5m      2021    €5m      2022    €5.9m      2023    €5m      2024    €6m      2025    €5m       The funding provided is for mental health and wellbeing in Higher Education Institutions and the allocation of funding is a matter for the HEIs, however some HEIs have directed this funding to support drug addition prevention initiatives. The table below highlights the funding allocated by SOLAS to Community Education for drug addiction prevention initiatives for the period 2020 to 2025 in Further Education:     Year    Total      2020    €255,171      2021    €414,945      2022    €292,781      2023    €519,392      2024    €801,676      2025    €224,793       I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 790. Deputy John Connolly asked the Minister for Further and Higher Education, Research, Innovation and Science the funding his Department has allocated to drug addiction prevention initiatives for each of the years 2020, 2021, 2022, 2023, 2024 and 2025, in tabular form. [73686/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_757",
          "debateSectionId": "dbsect_757",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_757.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_790",
        "questionNumber": 790
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 5. Deputy John Connolly asked the Taoiseach when the Cabinet committee on housing will meet next. [67579/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_5",
        "questionNumber": 5
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA), which regulates fares for services provided under Public Service Obligation (PSO) contracts, plays a central role in achieving this.  As the Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of €940m, provides a significant 43% uplift in the PSO allocation from 2025 to further support subsidised bus and rail services across Ireland, as well as maintaining targeted fares initiatives such as the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19-25, as part of the NTA's National Fares Strategy.  The previous Government decision did not include provisions for extending free travel for children under 9 to commercial bus operators. While the NTA is responsible for licensing commercial bus services, any decisions regarding fares charged by these services are managed by commercial operators themselves, who largely operate without any State subvention. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 257. Deputy John Connolly asked the Minister for Transport if his Department or the National Transport Authority has carried out an assessment of the impact on rural families of excluding commercial bus services from the under-nine free travel scheme; and if he will make a statement on the matter. [71323/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_171",
          "debateSectionId": "dbsect_171",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_171.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_257",
        "questionNumber": 257
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA), which regulates fares for services provided under Public Service Obligation (PSO) contracts, plays a central role in achieving this.  As the Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of €940m, provides a significant 43% uplift in the PSO allocation from 2025 to further support subsidised bus and rail services across Ireland, as well as maintaining targeted fares initiatives such as the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19-25, as part of the NTA's National Fares Strategy.  The previous Government decision did not include provisions for extending free travel for children under 9 to commercial bus operators. While the NTA is responsible for licensing commercial bus services, any decisions regarding fares charged by these services are managed by commercial operators themselves, who largely operate without any State subvention. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 258. Deputy John Connolly asked the Minister for Transport the measures to support children under the age of nine in rural and regional areas who are excluded from the Government’s free travel initiative due to reliance on commercial bus services; and if he will make a statement on the matter. [71324/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_258",
        "questionNumber": 258
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA), which regulates fares for services provided under Public Service Obligation (PSO) contracts, plays a central role in achieving this.  As the Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of €940m, provides a significant 43% uplift in the PSO allocation from 2025 to further support subsidised bus and rail services across Ireland, as well as maintaining targeted fares initiatives such as the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19-25, as part of the NTA's National Fares Strategy.  The previous Government decision did not include provisions for extending free travel for children under 9 to commercial bus operators. While the NTA is responsible for licensing commercial bus services, any decisions regarding fares charged by these services are managed by commercial operators themselves, who largely operate without any State subvention. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 259. Deputy John Connolly asked the Minister for Transport if his Department has considered extending the free fares for children under nine years-of-age to commercial bus operators; and if he will make a statement on the matter. [71325/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_173",
          "debateSectionId": "dbsect_173",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_259",
        "questionNumber": 259
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA), which regulates fares for services provided under Public Service Obligation (PSO) contracts, plays a central role in achieving this.  As the Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of €940m, provides a significant 43% uplift in the PSO allocation from 2025 to further support subsidised bus and rail services across Ireland, as well as maintaining targeted fares initiatives such as the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19-25, as part of the NTA's National Fares Strategy.  The previous Government decision did not include provisions for extending free travel for children under 9 to commercial bus operators. While the NTA is responsible for licensing commercial bus services, any decisions regarding fares charged by these services are managed by commercial operators themselves, who largely operate without any State subvention. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 260. Deputy John Connolly asked the Minister for Transport if officials or agencies under his remit, including the National Transport Authority, have conducted a cost-benefit analysis on extending the free fares scheme to include commercial bus operators for children under nine years-of-age; and if he will make a statement on the matter. [71326/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_174",
          "debateSectionId": "dbsect_174",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_174.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_260",
        "questionNumber": 260
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme which comprises five different projects in and around the GDA will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours.  As part of the DART+ programme, DART+ Fleet provides a ten-year procurement framework for electric and battery-electric train fleet. Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027, which will provide additional capacity on the line.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 268. Deputy John Connolly asked the Minister for Transport his plans to increase the carriage fleet of Irish Rail; and if he will make a statement on the matter. [71557/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_183",
          "debateSectionId": "dbsect_183",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_183.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_268",
        "questionNumber": 268
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, BusConnects is a transformative programme of investment in the bus system, providing better bus services across our cities, including Galway. BusConnects is the largest investment in the bus system in the history of the State, and is managed by the National Transport Authority (NTA).  The Cross-City Link is a 6.7km scheme that aims to create a Sustainable Transport Corridor from the northeast of Galway to the northwest, crossing Droichead an Dóchais (formerly known as the Salmon Weir Bridge). Once constructed, will help to improve travel times on the bus network and to improve connections for pedestrians and cyclists.  Galway City Council submitted a planning application in September 2022 to An Coimisiún Pleanála for the project. An Oral Hearing for the project was held in February 2024. An Coimisiún Pleanála granted planning permission in 2024; however, it is subject to judicial review, which is still ongoing.  The National Development Plan Review 2025 Sectoral Plan for Transport allocates funding to BusConnects Galway to commence the construction of Sustainable Transport Corridors, subject to the outcome of the planning process and any subsequent legal challenges.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 269. Deputy John Connolly asked the Minister for Transport for an update on the progression of the Cross City Link in Galway post the adjudication on the judicial review process; and if he will make a statement on the matter. [71559/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_184",
          "debateSectionId": "dbsect_184",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_184.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_269",
        "questionNumber": 269
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration (Deputy Colm Brophy)  I can advise the Deputy that there are currently seven overseas Visa Offices in addition to the Visa Office in Dublin. They are located in Abuja, Beijing, London, Moscow, Ankara, Abu Dhabi and New Delhi. In addition, the Department of Foreign Affairs and Trade process certain visa applications in Irish Embassies abroad under delegated sanction from my Department.  I can assure the Deputy that while processing times can vary across the different Visa Offices and Irish Embassies, the majority of visas are processed within stated target times.  The current processing times of applications for join family visas varies depending on the circumstances when the application is made. If a non-EEA national is moving to Ireland because they have been granted a Critical Skills Employment Permit they can apply for join family visas at the same time as their own employment visa. When these visas are applied for together, they are processed in tandem and are typically completed in under eight weeks. My Department aims to process join family visa applications made in other circumstances within 12 months.  I can assure the Deputy the majority of join family visas receive a first instance decision within the 12 month business target. In the first nine months of 2025 the average processing time for a join family application was approximately 100 days.  It should be noted that some applications can take considerably longer. Processing times for all applications are influenced by a number of factors. The time it can take varies depending on the type and complexity of application; individual circumstances; peak application periods; such as holidays or the start of the school year; and, crucially, the quality and completeness of the application lodged. Verifying an application is an important part of our immigration system and the checks involved can take time to complete.  I understand that extended wait times can be frustrating for applicants, and I want to assure anyone who has made an application for a visa that my Department is doing everything possible to progress these applications as quickly as possible.  In 2024, approximately 201,000 visa applications, of all types, were received by the Visa Division of my Department. This reflects an increase of 21%, compared to 2023, with over 35,000 additional applications received. These increases have continued, in the first nine months of 2025, my Department's Visa Division received approximately 166,000 visa applications and has issued over 153,000 decisions. This reflects an increase in applications of 5.5% compared to the same period in 2024. My officials are working to meet the increased level of demand, and over 8,200 additional visa decisions have issued in the first nine months of 2025, compared to the same period in 2024.  Processing times and decisions at the Dublin Visa Office and the Overseas Visa Offices can be checked at the following link:  www.irishimmigration.ie/visa-decisions/ . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 665. Deputy John Connolly asked the Minister for Justice, Home Affairs and Migration the average time currently being taken to consider applications for spousal visas to reside permanently with their spouses in Ireland, by country; the reasons for delays in processing these applications; and if he will make a statement on the matter. [72232/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_525",
          "debateSectionId": "dbsect_525",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_525.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_665",
        "questionNumber": 665
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 935. Deputy John Connolly asked the Minister for Health the staffing levels at the diabetic podiatry services in Galway city operating at St. Francis primary care centre at Newcastle, Galway; and if she will make a statement on the matter. [71532/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_749",
          "debateSectionId": "dbsect_749",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_749.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_935",
        "questionNumber": 935
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 936. Deputy John Connolly asked the Minister for Health the staffing cohort at diabetic podiatry services within each health area; and if she will make a statement on the matter. [71533/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_750",
          "debateSectionId": "dbsect_750",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_750.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_936",
        "questionNumber": 936
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 937. Deputy John Connolly asked the Minister for Health the staffing cohort at the Merlin Park podiatry clinic at Merlin Park Hospital, Galway; and if she will make a statement on the matter. [71554/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_751",
          "debateSectionId": "dbsect_751",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_751.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_937",
        "questionNumber": 937
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 938. Deputy John Connolly asked the Minister for Health the number of patients currently attending the diabetic podiatry services in Galway city; if a waiting list exists to access the services; and if she will make a statement on the matter. [71555/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_752",
          "debateSectionId": "dbsect_752",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_752.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_938",
        "questionNumber": 938
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 939. Deputy John Connolly asked the Minister for Health the number of patients currently attending the podiatry clinic at Merlin Park outpatients clinic at Merlin Park Hospital, Galway city; if a waiting list exists to access the services; and if she will make a statement on the matter. [71556/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_753",
          "debateSectionId": "dbsect_753",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_753.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_939",
        "questionNumber": 939
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 940. Deputy John Connolly asked the Minister for Health the number of patients currently attending the respiratory outpatient clinic at Merlin Park in Galway city; whether a waiting list exists to access the services; and if she will make a statement on the matter. [71558/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_754",
          "debateSectionId": "dbsect_754",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_754.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_940",
        "questionNumber": 940
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 29. Deputy John Connolly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to outline how the new infrastructure plan will accelerate the delivery of critical infrastructure in Galway; and if he will make a statement on the matter. [70736/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_29",
        "questionNumber": 29
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy John Connolly  Mo cheist ná chun a fhiafraí den Aire Oideachais agus Óige maidir le tionscadal na scoileanna beaga. Cad iad na pleananna atá sa Roinn chun cur le líon na scoileanna atá sa scéim faoi láthair agus chun stádas buan a thabhairt don tionscadal?  This question relates to the small schools project. The Minister will be aware that her predecessor, the Minister, Deputy Foley, started a pilot project for clustering small schools in support of the schools and easing the administrative burden on the principals of those schools. She deserves great credit for that initiative. I would like to see the project put on a firm footing into the future. \n Deputy Michael Moynihan  The programme for Government provides for a number of measures to support small schools, including the introduction of new national small school projects and training in new administrative supports. The Government is very aware that small schools are an important part of local communities and glue a community together, not just for the students and the school community but for generations to come as well.  The current small schools action plan research, established in 2021, is due to conclude at the end of the next school year. The current small schools project is being implemented on a pilot basis to support collaboration and sharing of resources among small schools in rural areas. It also enables them to collaborate, identify common challenges and trial innovative solutions.  Between them, the six clusters of small schools - two in Galway and one each in Donegal, Kerry, Wicklow and Waterford, respectively - consist of five schools per cluster. The feedback from the schools has been extremely positive. This is reflected in the interim evaluation report published by the Department. The independent review identifies potential areas for closer collaboration and an analysis of the scalability of actions already undertaken. As the project proceeds, a further evalution will take place.  Learning from the crucial evaluation of this project will be invaluable and will form a strong basis to inform future policy directions in relation to all small schools, including how the programme for Government can be delivered. \n Deputy John Connolly  The Minister of State has noted many of the positive elements of this scheme and how the schools, in the evaluation undertaken by the Department, reflected positively on it. As he said, there were two such clusters in County Galway, one in Gort agus ceann i gceantar Iorras Aithneach i gConamara. Bhí trí scoil sa scéim sin: Scoil na hAirde Móire, Scoil Mhuighnis agus Scoil an Aird Thiar. Other communities that have seen the benefit of the clustering project have contacted me pointing out that there are a number of similar small schools in their community and asking if the scheme can be expanded to include a new cluster in their community. That is a very fair call. The Minister of State noted that the administrative burden is reduced, the school staff get additional training and there is shared learning among the teachers and pupils. I request that this measure be extended and made permanent. \n Deputy Michael Moynihan  The importance of this project is that it will inform policy into the future in regard to small schools. In the first instance, I acknowledge the huge work that small schools do in every county in Ireland and in some city locations as well, due to having different demographics. These clusters are to understand the challenges small schools have. The Deputy is right that more schools are looking to get into the pilot scheme as fast as possible because they see the benefits of it. The evaluation of the pilot project will inform policy into the future in relation to schools. It is important that we understand them. Over the years, I have seen that, because of different dynamics or work practices, schools that were once struggling for numbers are now bursting at the seams and additional teachers are coming in. These small schools are hugely important for Ireland Inc. and the benefits of this project will inform policy. \n Deputy John Connolly  One of the most positive attributes of this scheme, with which I have some experience, is that it enabled principals who also have responsibility for teaching a class or multiple classes to do two important things. The first was to cluster their release days, so that when the principal is on a release day for administrative duties in the school, the same substitute teacher is there every day. This provided great consistency and continuity for the school and pupils. The person covering the release days did so in every cluster, meaning that the release days almost gave rise to a full-time position. That was one benefit of the scheme.  In the review the Minister of State mentioned, two concluding remarks indicate that the scheme should form part of future policy, hopefully in the near future because, as the Minister of State said, it is included in the programme for Government. One concluding remark was that no one project can overcome the challenges faced by small schools in rural areas but this scheme is a small step in the right direction. That is accurate. The second comes directly from the cluster in Gort, where a cluster administrative officer was appointed. Everyone agreed that this should be expanded to all small schools. \n Deputy Michael Moynihan  The project is a step in the right direction. The previous Minister in the Department, the Minister, Deputy Norma Foley, moved the initiative on. It is a clear indication of the importance of small schools in communities. We have visited a number of schools over the past eight or nine months. Some city schools are small too, for different reasons.  On having an administrator within the cluster, there is huge collaboration within the schools that are part of the cluster. They can benefit from co-operation, not just in regard to teaching but also in understanding the challenges. We are very committed to evaluating the project and understanding how we can best support schools in the future. For principals who have multiple classes in small schools, having administrative days and a guarantee that the same teacher will come in every week are also hugely important. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 100. D'fhiafraigh Deputy John Connolly den Minister for Education and Youth cmaidir le Tionscadal na Scoileanna Beaga, cad iad na pleananna atá ag a Roinn chun cur le líon na gcnuasach scoile atá ann agus chun stádas buan a thabhairt don tionscadal; agus an ndéanfaidh sí ráiteas ina thaobh. [69894/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_30",
          "debateSectionId": "dbsect_30",
          "showAs": "Scéimeanna Oideachais",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_30.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_100",
        "questionNumber": 100
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth  Under the terms of the School Transport Scheme, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the Department/Bus Éireann, having regard to ethos and language.  The School Transport 2030 report was published in early 2024 following a comprehensive analysis and review of the scheme as it currently operates. The recommended changes to the future operation of the scheme include expansion of the current eligibility criteria, addressing current operational challenges and moving towards better integration with public transport to ensure the best value for money to the Exchequer. It is proposed to expand access to the scheme so that an additional 100,000 pupils can be carried by 2030.  A phased implementation of the review’s recommendations began at the start of the 2024/2025 school year where the Department began testing the feasibility of a number of approaches through a series of pilot programmes; these pilot programmes are held in conjunction with the National Transport Authority, the Department of Transport and Bus Éireann.  A total of 14 pilot projects are underway in the current school year. These pilots are being evaluated to provide valuable insights into the impact of increased demand on the scheme, the potential for integrating public transport with school transport services, and opportunities to promote more sustainable modes of transport.  Existing pilots are continuing for this school year.? They are being monitored over the year and a further evaluation will take place at the end of the 2025/2026 school year.? The findings from these evaluations will guide the planning and implementation needed for a national rollout of a revised School Transport Scheme.  Work is also underway to identify where further pilot programmes may be conducted. A number of approaches are being examined including the use of a Geographic Information System (GIS) to identify how many additional children would become eligible and where they are located. A digital mapping project of all existing school bus routes has been developed and there is ongoing collaboration with the Department of Transport, Bus Éireann and the National Transport Authority in regard to planned expansion of public transport routes to explore where integration may be possible.  E-ticketing is already being trialled in some of the pilot areas, and will be rolled out to all pilot areas for pupils on dedicated school transport shortly.  Additional funding is being provided in 2026 to further strengthen and enhance our School Transport Services, ensuring continued support for families, schools, and communities right across the country.  This funding will allow for further progress in the implementation of School Transport 2030, focusing particularly on vital technology improvements, including e-ticketing, which should enable smarter route planning and maximise seat utilisation further improving scheme efficiency and effectiveness.  Not only will eTicketing replace the current printed paper tickets, eTicketing should also provide accurate information on ticket utilisation, which is currently not readily available.  Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 174. Deputy John Connolly asked the Minister for Education and Youth her plans to implement the recommendation of the review on school transport to enable an additional 100,000 students to be carried on the school transport scheme by 2030; and if she will make a statement on the matter. [69895/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_198",
          "debateSectionId": "dbsect_198",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_198.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_174",
        "questionNumber": 174
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy John Connolly  In a response to a previous question, the Minister outlined very well the supports available to students and families to assist in meeting the cost of accommodation and how he has increased those supports and made them available to a greater number of students. I wish to ask the Minister about the supply of student accommodation and the position of the Department regarding the publication of a new strategy for the provision of student accommodation. \n Deputy James Lawless  I thank the Deputy for his continued advocacy, support and championing of ideas for this sector. The national student accommodation strategy 2025 to 2035 is due to be published in the coming weeks and will be considered and agreed by Government before being officially launched. It is at a very advanced stage. The strategy aims to make higher education more accessible by addressing both affordability to ensure students can afford rents and secure accommodation and also the viability of supply, which the Deputy's question goes to, to ensure the units come into being quickly and are built out to meet that demand that very evidently exists.  By providing targeted financial supports and accelerating the development of purpose-built student accommodation, PBSA, the strategy aims to remove barriers that prevent students from accessing college and pursuing their academic goals. The strategy builds on wider Government initiatives to support viability of student accommodation such as rental legislation reform where I am working closely with the Minister for Housing, Local Government and Heritage on how rent pressure zones might apply to student accommodation; the budget 2026 VAT reduction on the sale of new apartments, which will be very helpful; the rent-a-room tax relief, which is a key measure involving up to €14,000 per householder tax free; and the introduction of streamlined design standards under the Planning and Development (Amendment) Act 2025. This is a revised set of guidelines published in June 2025 setting out a blueprint for student accommodation that delivers maximum beds per block, uses clever use of space and shared facilities such as lounge rooms and laundry rooms and seeks an optimal return on available bed usage. They are some of the measures I am introducing.  I will say hello to the students from Athy as well while they are here today. It is good to have them in the audience. \n Deputy John Connolly  It is very welcome that we would have a strategy over the coming weeks. We need it. The third level sector needs it. It is anxious to hear what will be included in it. The Minister gave some indication about how the strategy will use other policy areas or other departures in Government policy recently to make sure we can stimulate and incentivise the development and provision of student accommodation.  There are a number of options in terms of incentivising people to rent out spare capacity in their homes, incentivising the private sector to get involved and public-private partnerships. If they had the choice, most people would plump for purpose-built student accommodation with some association with the third level institution in close proximity to it. I hope the strategy can include some incentivisation in that area. Could the Minister address allowing technological universities to borrow and the framework for the preparation of that, which could help in meeting that goal of developing purpose-built student accommodation? \n Deputy Michael Cahill  I have a question about the funding of Killarney Technology Innovation Centre. The Minister or one of his officials might engage with Conor O'Leary, Sean Counihan and the team there. I acknowledge the work of the Minister on the Pretty Polly site. I ask him to ensure that in the new year, Kerry Education and Training Board will progress the project. Could he also try to resolve the green cert issue in MTU in Tralee for the students?  If I may be a little cheeky, I wish the Cromane ladies team the very best in the all-Ireland final in Parnell Park on Sunday. I congratulate Ballymacelligott, An Ghaeltacht and Dingle on winning the junior, intermediate and senior Munster finals last weekend. \n Deputy James Lawless  I have to wish Sallins the best of luck on Sunday in its own intermediate final, so we have to get that in as well on the day.  I will take Deputy Cahill's question first and then revert to Deputy Connolly. It was good to visit Killarney and Tralee recently along with Deputy Cahill, the Minister for Children, Disability and Equality, and the Minister of State, Deputy Michael Healy-Rae. It was a good visit. The Pretty Polly site is moving ahead. I know this is very important to Deputy Cahill. I was pleased to be able to confirm the progression of that site very recently, which I know was welcomed locally as well. There are still a number of steps to go through in terms of the different gates but the education and training board is progressing that project. I was delighted to visit the education and training board that day as well. The breadth of apprenticeships, in particular the wind turbine maintenance apprenticeship and the hospitality apprenticeships, and some of the other courses and skills on display that day were very strong. I thank Councillor Norma Moriarty, who is the chair of the education and training board, who gave a great tour that day. That was particularly interesting. Deputy Cahill mentioned Killarney Technology Innovation Centre. I might get one of my officials to come back to him with details on that. An issue was raised on my visit to the MTU campus in Tralee. It was mentioned that students were not receiving the green cert despite taking an agricultural course. I am engaged with discussions on that. I met the students that day and committed to coming back on that. \n Deputy John Connolly  Given the liberty we have been shown, I have to wish Athenry ladies camogie team the best of luck in the all-Ireland final at the weekend.  I look forward to the publication of the strategy. I hope that we can see some incentivisation of the third level sector to provide accommodation in close proximity to the institutions and that it will be available to students at a reasonable cost. The Minister outlined very well the supports he has provided and the increased supports he has provided. Could the Minister tell me the borrowing framework for the technological universities? It could help a lot if we could get some clarity on it. \n Deputy James Lawless  The Deputy made a number of points. I totally agree with him that the provision of serviced sites on or adjacent to campuses is key. There is a significant earmarked fund within the student strategy and my national development plan budget to allow for those sites to progress, and to be identified and serviced, with facilities where necessary. The local infrastructure housing activation fund, LIHAF, was used in the housing sector and the technological sector student accommodation programme is under way. The Deputy might be interested that in his own area, nine submissions are in for ATU Galway. Queen Street accommodation, with 345 beds, has been developed and is due to be completed in 2026. At the end of November 2025, over 4,000 rent-a-room, or digs, beds were made available across Galway. I presume that is positive news in the Deputy's area. It is just to apprise him of that.  On the borrowing framework, intense engagement is under way between my Department and the Departments of Finance and public expenditure with regard to a financial framework that will allow the technological universities partner with the private sector to deliver accommodation on or adjacent to the campuses. That will be very positive for the sector. I hope to unveil that very soon. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 205. Deputy John Connolly asked the Minister for Further and Higher Education, Research, Innovation and Science the position regarding the publication of his Department's strategy for the provision of student accommodation and if he will make a statement on the matter.  [67831/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_44",
          "debateSectionId": "dbsect_44",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_44.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_205",
        "questionNumber": 205
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Under the Free Fees Initiative (FFI), the State provides funding toward the tuition fee costs of  eligible undergraduate higher education students with students paying the student contribution. As part of Budget 2026, I am permanently reducing this charge from €3,000 to €2,500 per academic year.  The State pays the student contribution (in full or part) on behalf of students who qualify under the student grant scheme. In the current academic year eligible students are availing of a 15% increase in income thresholds, compared to 2024/25, and next year, as part of Budget 2026, the income threshold for the €500 student contribution grant will increase from €115,000-€120,000. Combined with the permanent fee reduction, this means that eligible undergraduate students whose households earning are under €120,000 will pay no more than €2,000 towards the student contribution charge in the 2026/27 academic year.  In 2024/25, over 148,000 students availed of the Free Fees Initiative. Data for 2025/2026 is not available at this time.  Please see below data from SUSI as of 9th December 2025, showing the number of undergraduate students awarded and paid 100% student contribution, 50% student contribution, and €500 student contribution for the 2024/25 academic year. Processing for the 2025/26 academic year is still ongoing, so the figures for this year are awards only.     -     2024/25      2024/25      2025/26*        Grant Rate Band      Awarded      Awarded & Paid      Awarded       100% Student Contribution      50,224      45,576      54,716      50% Student Contribution      4,171      3,886      4,425      €500 to Student Contribution      18,317      17,324      19,078          Grand Total        72,712        66,786         78,219      * Processing for 2025/26 is still ongoing so figures are subject to change.  The Deputy asked for the number of and proportion of undergraduate students who receive support from SUSI. The HEA, on their Key Facts & Figures dashboard, provides a thorough profile of the student population in higher education institutions. The latest dashboard includes figures from 2017/18 to 2023/24 and is available on the HEA website. The data on 2024/2025 & 2025/26 is not available on the HEA website at this time.  Students | Statistics | Higher Education Authority (https://hea.ie/statistics/data-for-download-and-visualisations/students/)  It is important to note that not all courses which are listed as full-time on the HEA data set are eligible for Student Grant Support. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 239. Deputy John Connolly asked the Minister for Further and Higher Education, Research, Innovation and Science the number of and proportion of undergraduate students who receive support from SUSI to cover 100% student contribution, the number who receive support to cover 50% student contribution, and the number who receive €500 student contribution, in tabular form; and if he will make a statement on the matter. [67830/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_252",
          "debateSectionId": "dbsect_252",
          "showAs": "Third Level Costs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_252.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_239",
        "questionNumber": 239
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  While my department does not have an automatic entitlement to provide consular assistance to the person referred to by the Deputy, I can confirm that officials in my Department, including in the relevant Irish mission, are aware of this case and are providing consular assistance to this individual who holds dual Irish and Russian citizenship  As with all consular cases, a dedicated consular officer has been assigned to the family of the Irish citizen who has been detained and they remain in contact. The consular officer has provided support and advice to the citizen and their family in accordance with the Department’s Consular Assistance Charter.  I wish to assure the Deputy that officials in my Department will continue to provide all appropriate consular assistance to the citizen. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 269. Deputy John Connolly asked the Minister for Foreign Affairs and Trade the efforts her Department is making to raise the issue with the Russian authorities of the incarceration of an Irish citizen (details supplied), in a pre-trial detention facility in Chelyabinsk, Russia, for over two months without charge; and if she will make a statement on the matter. [71028/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_283",
          "debateSectionId": "dbsect_283",
          "showAs": "Irish Prisoners Abroad",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_283.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_269",
        "questionNumber": 269
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, BusConnects is a transformative programme of investment in the bus system, providing better bus services across our cities, including Galway. BusConnects is the largest investment in the bus system in the history of the State, and is managed by the National Transport Authority (NTA).  The NTA published its final new bus network for Galway in December 2023. The redesign of the bus network is one of the key elements of BusConnects Galway, which aims to transform the city’s bus system, making public transport more useful to more people.  In 2023, the NTA carried out an extensive review of the bus network in Galway, in collaboration with Galway City Council, Galway County Council, local bus operators, and with the specialised expertise of transport designers Jarrett Walker and Associates. In April 2023, a draft new network was published, and the feedback and submissions received informed the final new bus network published in December 2023.  The new bus network will enable more people to avail of public transport, resulting in increased access to a greater number of schools and workplaces across Galway City, Bearna, and Oranmore. Once this network is implemented, circa 67% of residents will live within 400 metres of a high frequency bus route (running every 15 minutes or better).  The NTA plans to commence the implementation of the new Galway bus network in the coming years, subject to funding and operational readiness. As part of BusConnects, the NTA is also advancing work on the Sustainable Transport Corridor, the Cross-City Link, which will improve travel times on the bus network and improve connections for pedestrians and cyclists. Other parts of the BusConnects programme, such as simpler fares, will be delivered with the new bus network.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply with 10 days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 325. Deputy John Connolly asked the Minister for Transport the current status of the implementation of a new bus network for Galway city; and if he will make a statement on the matter. [71029/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_338",
          "debateSectionId": "dbsect_338",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_338.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_325",
        "questionNumber": 325
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 326. Deputy John Connolly asked the Minister for Transport to outline the new Local Link routes that have commenced to date in 2025; and if he will make a statement on the matter. [71030/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_339",
          "debateSectionId": "dbsect_339",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_339.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_326",
        "questionNumber": 326
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally, including implementation of the Connecting Ireland Rural Mobility Plan. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 327. Deputy John Connolly asked the Minister for Transport for an update on the implementation of all routes planned for County Galway in the Connecting Ireland Rural Mobility Plan; and if he will make a statement on the matter. [71031/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_327",
        "questionNumber": 327
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally, including the implementation of the Connecting Ireland Rural Mobility Plan. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 328. Deputy John Connolly asked the Minister for Transport when his Department will commence the development of the next Rural Ireland Mobility Plan; and if he will make a statement on the matter. [71032/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_341",
          "debateSectionId": "dbsect_341",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_341.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_328",
        "questionNumber": 328
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 408, 409 and 410 together.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, over 200 SEN Repurposing projects have been delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My department has invested over €234m in capital expenditure since 2020 in Galway. This investment has supported the completion of 82 school building projects including 3 new school buildings. Currently 22 projects are in construction, of which 1 is a new school building.  The current status of all projects is set out under item number ten at the following link (www.gov.ie). This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.  Attached find a list of larges cale school building projects in County Galway at pre-stage 1, stage 1 and stage 2a. It should be noted that some projects may remain at a particular stage longer than anticipated due to a range of factors, including planning-related issues, challenges within the design process, and complex site conditions.   Large scale projects  ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 408. Deputy John Connolly asked the Minister for Education and Youth the number of new school development projects in County Galway currently at pre-stage 1 of the development process; the date each project commenced, in tabular form; and if she will make a statement on the matter. [71024/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_408",
        "questionNumber": 408
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 408, 409 and 410 together.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, over 200 SEN Repurposing projects have been delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My department has invested over €234m in capital expenditure since 2020 in Galway. This investment has supported the completion of 82 school building projects including 3 new school buildings. Currently 22 projects are in construction, of which 1 is a new school building.  The current status of all projects is set out under item number ten at the following link (www.gov.ie). This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.  Attached find a list of larges cale school building projects in County Galway at pre-stage 1, stage 1 and stage 2a. It should be noted that some projects may remain at a particular stage longer than anticipated due to a range of factors, including planning-related issues, challenges within the design process, and complex site conditions.   Large scale projects  ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 409. Deputy John Connolly asked the Minister for Education and Youth the number of new school development projects in County Galway currently at stage 1 of the development process; the date each project entered stage 1, in tabular form;; and if she will make a statement on the matter. [71025/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_409",
        "questionNumber": 409
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 408, 409 and 410 together.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, over 200 SEN Repurposing projects have been delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My department has invested over €234m in capital expenditure since 2020 in Galway. This investment has supported the completion of 82 school building projects including 3 new school buildings. Currently 22 projects are in construction, of which 1 is a new school building.  The current status of all projects is set out under item number ten at the following link (www.gov.ie). This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.  Attached find a list of larges cale school building projects in County Galway at pre-stage 1, stage 1 and stage 2a. It should be noted that some projects may remain at a particular stage longer than anticipated due to a range of factors, including planning-related issues, challenges within the design process, and complex site conditions.   Large scale projects  ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 410. Deputy John Connolly asked the Minister for Education and Youth the number of new school development projects in County Galway currently at stage 2A of the development process; the date each project entered stage 2A, in tabular form; and if she will make a statement on the matter. [71026/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_410",
        "questionNumber": 410
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Regional Spatial and Economic Strategy (RSES) developed by the Northern and Western Regional Assembly (NWRA) sets out a co-ordinated Metropolitan Area Strategic Plan (MASP) for the Galway Metropolitan Area and it provides a framework for development plans and investment prioritisation over the plan period.  The monitoring of implementation of MASPs, as a key part of the RSES, including through the publication of monitoring reports, is a function of the respective regional assemblies.  Accordingly the Deputy may wish to address this query to the NWRA. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 437. Deputy John Connolly asked the Minister for Housing, Local Government and Heritage for an update on the implementation of the Galway Metropolitan Area Strategic Plan; and if he will make a statement on the matter. [71033/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_431",
          "debateSectionId": "dbsect_431",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_431.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_437",
        "questionNumber": 437
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  An Coimisiún Pleanála (An Coimisiún) is the national independent statutory body with responsibility for the determination of planning appeals and direct applications for strategic infrastructure and other developments under the Planning and Development Act 2024, as amended, and certain other Acts.  The Planning and Development Act 2024, includes a number of new provisions relating to An Coimisiún Pleanála, as part of a significant restructure. The Act will introduce statutory time periods for decision making for all consent processes, including, for the first time, for An Coimisiún Pleanála. This will bring increased certainty to the planning consent processes, for both the public and stakeholders involved in the delivery of key infrastructure such as housing and renewable energy.  For An Coimisiún processes, timelines are being introduced for appeals as well as the various consents applications made directly to them.  It is important to acknowledge that a certain percentage of cases, due to particular circumstances, such as complexity, requests for further information from applicants for permission or further submissions from other participants including third parties, will not meet the 18 week target.  The latest figures received by my Department from An Coimisiún Pleanála shows that 59% of all cases were disposed of within the 18 week target. Performance against this target continues to improve, as 77% of all cases disposed in October 2025 were within the target. 100% of large scale residential appeals have been disposed within the target in 2025. An Coimisiún's processes have continued to improve throughout the year, in preparation for the introduction of statutory timelines for planning decisions as part of the Planning and Development Act 2024.  Arrangements have been put in place by all bodies under the aegis of my Department to facilitate the provision of information directly to members of the Oireachtas. This provides a speedy, efficient and cost effective system to address queries directly to the relevant bodies. The contact email address for An Coimisiún Pleanála in this regard is Oireachtasqueries@pleanala.ie ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 438. Deputy John Connolly asked the Minister for Housing, Local Government and Heritage the current timelines being met by An Coimisiún Pleanála for the assessment of planning appeals and planning applications made to An Coimisiún Pleanála; and if he will make a statement on the matter. [71034/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_432",
          "debateSectionId": "dbsect_432",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_432.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_438",
        "questionNumber": 438
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  There are a number of Programme for Government commitments relating to the credit union sector, which are as follows:  Retain a dedicated Minister for Financial Services, Credit Unions and Insurance.  Position credit unions as community centric financial institutions integral to their local communities, small businesses and farmers.  Engage with the Central Bank to review credit union lending limits to enhance their ability to serve members.  Support the digital transition for credit unions in adopting new technologies and to comply with the Digital Operational Resilience Act.  Expand the role of Ireland’s credit union sector in the housing market.  Amend the legislation to bring the credit union sector into the scope of the Dormant Accounts Act.  Draft a five-year strategy for the credit union sector to ensure it can fully leverage new opportunities.  Firstly, acknowledging the importance of credit unions, the Government retained a dedicated Minister for Financial Services, Credit Unions and Insurance, Minister Robert Troy T.D. Minister Troy and Department of Finance officials are working on all these Government commitments, in conjunction with the sector.  One very important Government commitment was to engage with the Central Bank of Ireland to review credit union lending limits. I am pleased to confirm that this work has been completed and revised lending limits are now in place.  In December 2024, the Central Bank of Ireland published Consultation Paper 159 on Proposed Changes to the Credit Union Lending Regulations which sought views on proposals for targeted changes to house lending and business lending credit union lending regulations. The previous Minister for Finance and the Minister of State with responsibility for credit unions engaged on multiple occasions with the Central Bank of Ireland prior to, and during consultation on the lending limits.  Amending regulations commenced on 30 September 2025, permitting the sector to advance up to €6.61 billion in house lending and €3.30 billion in business lending, based on sector total assets of €22.05 billion. This is a significant increase from previous permitted lending limits of €2.9 billion at 30 June 2024.  The amendment of these regulations reflects the competence and capability of credit unions to grow their respective loan books in a prudent manner, and to futureproof their offering to support homeowners and businesses. I welcome the amended regulations as it will allow credit unions to compete more effectively in the mortgage and business lending market.  One of the other main commitments for credit unions in the Programme for Government, is to draft a five-year strategy for the sector. I and the Minister of State with responsibility for credit unions intend to co-sponsor a workplan with the credit union sector to determine its strategic purpose. A sector wide strategic plan and a focused deployment of credit union resources will support the expansion of financial services to all credit union members.  I expect that in the short term both I and the Minister for State will have the opportunity to consider this plan, including resource commitment and the estimated timelines to delivery of the strategic purpose for the sector. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 19. Deputy John Connolly asked the Tánaiste and Minister for Finance if he will report on the progress being made with regard to the Programme for Government commitments on credit unions; and if he will make a statement on the matter. [63917/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_39",
          "debateSectionId": "dbsect_39",
          "showAs": "Credit Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_39.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_19",
        "questionNumber": 19
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Future Forty: A Fiscal and Economic Outlook to 2065 , published by my Department earlier this month, explores the key drivers of Ireland’s economy and public finances over the next forty years. The report follows a similar approach to scenario analysis and anticipatory governance seen in other countries such as Australia, Canada and the UK.  It examines the long-term impacts of global megatrends and other structural shifts, focusing on seven critical areas: climate change and the green transition, demographics, housing, healthcare, digitalisation, deglobalisation and potential EU expansion.  The report presents a Central Scenario for our population, economy and public finances, but also examines over 2,000 alternative scenarios using differing assumptions. Future Forty does not identify which scenario is most likely to occur, however there are clear patterns which emerge across all trends and projections.  Our population will continue to age, which will impact the future supply of workers. This trend, alongside slowing capital and productivity growth as well as the growing threat of climate change, will create challenges for our economy. Living standards will continue to rise but the rate of improvement will likely be less pronounced than in recent decades. Continued inward migration, alongside measures to boost investment and improve productivity levels, will be vital to sustain growth in the long run.  The report finds that population ageing and slowing economic growth will have considerable impacts on our public finances. The cost of health and long-term care services will rise, as will the cost of pensions. These pressures will be accompanied by the cost of tackling climate change and accelerating the green transition, as well as significantly increasing the supply of housing available in Ireland. Furthermore, there is a risk that Ireland will be unable to rely on exceptionally high levels of corporation tax receipts in the medium-to-long term, which would reduce the volume of resources available to cover these costs.  Future Forty is not a prediction, it is a guide to better understand how domestic and global trends might materialise in the coming decades, and the challenges and opportunities they will present for Ireland. Although the exact path of our future is uncertain, the risks are tilted to the downside. Therefore, the report concludes that we must use this next decade of opportunity to improve efficiencies, increase our resilience and invest for the long-term. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 55. Deputy John Connolly asked the Tánaiste and Minister for Finance for an overview of Future Forty, the long-term fiscal and economic assessment of Ireland’s needs out to 2065 which he published recently; and if he will make a statement on the matter. [63918/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_73",
          "debateSectionId": "dbsect_73",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_55",
        "questionNumber": 55
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  State Pension (Non-Contributory) is a means-tested payment for people aged 66 and over, habitually residing in the State, who do not qualify for a state pension contributory, or who only qualify for a reduced rate contributory pension based on their social insurance record. For the purposes of the means-test, from application stage through the lifetime of a claim, an applicant must provide full and up to date details of any income(s), asset(s), savings and investment(s) held, including any changes that occur.  Social welfare legislation provides that means tests take account of the income and assets of the person (and their spouse or partner, if applicable) applying for the relevant scheme. The means assessment includes income from sources such as employment, self-employment, occupational pensions and maintenance payments. It also includes property owned, other than the family home, and capital such as savings, shares, and other investments. Income earned under the rent-a-room tax relief scheme is exempt from the means test.  An applicant can have savings or assets of up to €20,000 and earnings of up to €200 per week from paid employment and still qualify for a full State Pension (Non-Contributory). The first €30 per week of means does not affect the rate of the pension. After that first €30, your pension is reduced by €2.50 for every €2.50 of means. If a person’s assessed weekly means is over €292.51, they will not be eligible to receive a State Pension (Non-Contributory) Pension.  If a person is farming or leasing their land, the net income is assessed in the means test. The net income is worked out by taking the gross income (ie. income before tax, and deducting any relevant expenses). If a person owns land that is not productively used or leased, the Department assesses it on its capital value instead. However, this may not apply in the case of certain family settlements involving the transfer of ownership of a farm.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 533. Deputy John Connolly asked the Minister for Social Protection the way in which the means from farm income are assessed for a State pension (non-contributory) in respect of a person that is nearly 90 years-of-age and whose son farms their land in return for being allowed retain all farm income, including agriculture grants in lieu of their labour, thus ensuring that this land is being put to productive use; and if he will make a statement on the matter. [69155/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_463",
          "debateSectionId": "dbsect_463",
          "showAs": "Farm Household Incomes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_463.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_533",
        "questionNumber": 533
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Many families avail of the National Childcare Scheme (NCS) as a way to reduce the cost of their early learning and childcare. NCS subsidies are awarded as an hourly rate, along with a maximum number of weekly hours that the subsidy will be paid for. The accurate recording of a child’s attendance is a core obligation under the Child Care Act 1991 (Early Years Services) Regulations 2016 for early years providers and is one of the conditions set out in the NCS funding agreement.  In brief, if a child under-attends for eleven consecutive weeks followed by one full week of attendance, no action will be taken and the child's subsidy will not be revised. The child can follow this attendance pattern indefinitely and the award will not be revised. It is only if continual under-attendance is recorded for a consecutive 12 weeks that the award will be revised to reflect the child's actual hours.  In full detail, if a child attends fewer than their agreed hours for a consecutive 8 week period, the provider must notify the scheme administrator and a warning will issue to the parent alerting them to the situation. This warning does not represent a subsidy revision. At this point, if the child attends their agreed hours for a full week after this warning is issued, then no further action is taken. However, if the under-attendance continues for a further four consecutive weeks, the number of subsidised hours awarded under the Scheme will be revised to reflect the average number of hours that were actually attended by the child over the previous 12-week period.  If some cases, the provider can apply for an exemption based on special circumstances that allows the child to under-attend for a further 4 consecutive weeks, for a total of 16 weeks under-attendance. Special circumstances may include the need to attend certain medical or therapeutic appointments.  As a condition of the scheme, providers are required to maintain an attendance record for each child in the service and provide this record for inspection on request. The attendance record must show the time the child entered and left the service. It is important that these records are maintained both to ensure that Exchequer funding is being used for times the child is actually in care, and as a child safeguarding measure. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 791. Deputy John Connolly asked the Minister for Children, Disability and Equality further to Parliamentary Question No. 769 of 25 November 2025, if under the current national childcare scheme attendance compliance rules, a pattern of under-attendance for seven consecutive weeks followed by one week of full attendance would effectively reset the under-attendance count; if such a pattern could be repeated indefinitely for the duration of the scheme without triggering any compliance consequences for either the provider or the parent; and if she will make a statement on the matter. [69672/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_640",
          "debateSectionId": "dbsect_640",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_640.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_791",
        "questionNumber": 791
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Naoise Ó Cearúil  Táim ag tógáil na ceiste seo ar son an Teachta John Connolly. Mar is eol don Aire, tá géarchéim thithíochta ann sa Ghaeltacht. Cén féidearthachtaí atá ann d'Údarás na Gaeltachta obair le hUisce Éireann agus le húdaráis áitiúla chun tithíocht a thógáil do phobal na Gaeilge agus na Gaeltachta, go háirithe leis an bplean Tithe a Sheachadadh, Pobail a Thógáil 2025-2030? \n Deputy Dara Calleary  Gabhaim buíochas leis an Teachta Ó Cearúil agus leis an Teachta Connolly. Aithníonn an Rialtas go bhfuil fáil ar mheascán oiriúnach de thithe cuí ríthábhachtach chun inmharthanacht pobail rathúla Gaeltachta a chinntiú. Dá réir, foilseofar ár ráiteas náisiúnta pleanála do thithíocht sa Ghaeltacht chun soiléireacht agus leanúnachas a chur ar fáil den chóras pleanála maidir le cosaint na Gaeilge. Gealltar sa chlár Rialtais go leanfar ag obair le hÚdarás na Gaeltachta agus le páirtithe leasmhara eile chun a chinntiú go bhfuil soláthar leordhóthanach tithíochta agus seirbhísí pobail ar fáil sna ceantair Ghaeltachta. De réir Acht na Gaeltachta, 2012, tá an t-údarás freagrach as forbairt eacnamaíoch, teanga, sóisialta agus cultúrtha laistigh de na 26 limistéar pleanála teanga. Tacaíonn Údarás na Gaeltachta le níos mó ná 9,000 fostaithe i gcliantchomhlachtaí dá chuid.  Beidh soláthar tithíochta do chainteoirí Gaeilge atá fostaithe sna comhlachtaí seo, sa tionscal, i ngnóthaí eile san earnáil phríobháideach agus i gcomhlachtaí san earnáil phoiblí ag feidhmiú laistigh den Ghaeltacht ríthábhachtach sa Ghaeltacht. Tá sé seo mar rún againn chun deis a thabhairt do chainteoirí Gaeilge fanacht ina gcónaí sa Ghaeltacht.  Ina theannta sin, tá Údarás na Gaeilge le roinnt blianta anuas tar éis saineolas a fhorbairt maidir le cúrsaí fuíolluisce tríd a bheith ag freastal ar a gcuid líonra páirceanna gnó agus le heastáit tionsclaíochta atá faoina chúram. Tá sé i gceist go ndéanfar measúnú ar an fhéidearthacht go bhforbródh Údarás na Gaeltachta, in éineacht le hUisce Éireann agus na húdaráis áitiúla, suíomhanna seirbhísithe ó phunann maoine an údaráis a bheadh feiliúnach do thithíocht do chainteoirí Gaeilge laistigh de na limistéir pleanála teanga. Tá sé ar intinn agam go mbeidh cruinniú agam le príomhfheidhmeannach an údaráis chun an teagmháil sin le hUisce Éireann agus an gá le comhoibriú idir an dá eagraíocht a phlé, ní hamháin do chúrsaí tionscail ach do chúrsaí tithíochta freisin. \n Deputy Naoise Ó Cearúil  Is dea-nuacht é sin. Mo bhuíochas leis an Aire go bhfuil sé ag buaileadh le príomhfheidhmeannach Údarás na Gaeltachta le breathnú air seo agus ar na féidearthachtaí atá ann. Mar is eol dó, tá grúpaí éagsúla ann ar nós BÁNÚ agus Tinteán atá ag déanamh iarracht an cás seo a chur os comhair an phobail. An cás ná nach bhfuil tithíocht nó cead pleanála á fháil ag muintir na Gaeltachta agus go bhfuil sé deacair dóibh fanacht sa Ghaeltacht agus go mbeadh daonra óg sa Ghaeltacht freisin. Tá sé sin fhíorthábhachtach go háirithe do thodhchaí na Gaeltachta agus go mbeadh sé tarraingteach do dhaoine óga agus do phobal labhartha na Gaeilge chomh maith b’fhéidir bogadh go dtí an Ghaeltacht. É sin ráite, fáiltím roimh an dea-nuacht ar maidin go mbuailfidh an tAire leis an bpríomhfheidhmeannach agus go mbreathnóidh sé ar na féidearthachtaí atá ann ó thaobh pleanála de. \n Deputy Conor D. McGuinness  Tá a fhios agam go bhfuil an tAire an-dáiríre agus tiomanta mar gheall ar an gceist áirithe seo. Tá an plean tithíochta a nochtaigh an tAire tithíochta cúpla seachtaine ó shin lag ina iomlán ach tá sé thar a bheith lag i dtaobh cúrsaí Gaeltachta ach go háirithe. Ba mhaith liom rud éigin a chur ar an taifead anseo. Tá dhá píosa talún sa Rinn, i nGaeltacht na nDéise, ceann amháin gur leis Údarás na Gaeltachta í agus ceann eile gur cheannaigh an chomhairle áitiúil le tamall anuas. Tá na seirbhísí uisce timpeall orthu. Chun a cead a thabhairt d’Uisce Éireann, tá infheistíocht an-mhór curtha isteach aici sa Rinn le cúpla bliain anuas. Tá córas iomlán séarachais nua timpeall air seo agus tá cosáin. An rud atá in easnamh ná toil pholaitiúil ón Rialtas seo chun dul i ngleic leis seo agus tithe a thógáil. Tá an t-údarás áitiúil tar éis iarratas a chur isteach sa Sean Phobal, an dara leathpharóiste i nGaeltacht na nDéise, i gcomhair tithíocht shóisialta. Tá sé sin fós leis an Roinn, cúig bliana i ndiaidh don iarratas dul isteach. Is í sin an fhadhb atá ann i dtaobh an ghéarchéim tithíochta. \n Deputy Dara Calleary  Aontaím leis an Teachta agus táimid ag iarraidh é sin a phlé. Ar mhiste leis an Teachta McGuinness na sonraí sin a chur chugam go díreach agus déanfaidh mé iarracht breathnú orthu? Is é sin an saghas ruda go gcaithfimid obair air; áiteanna a bhfuil talaimh agus sites cosúil leis sin ann. Pléifidh mé an píosa le príomhfheidhmeannach an údaráis nuair a bhuailim leis. Tá sé tábhachtach go mbainfear úsáid as an talamh atá ag an údarás nach bhfuil sé ag úsáid do chúrsaí tionscal. Tá sé tábhachtach freisin go leanfaidh sé ar aghaidh leis na pleananna tionsclaíochta agus poist a chruthú sa Ghaeltacht. Tá talamh ar fáil le haghaidh tithíocht nach mbeidh an t-údarás in ann a úsáid le haghaidh cúrsaí gnó nó fostaíochta. Ba cheart go mbeadh muid in ann é sin a dhéanamh. Tá sé tábhachtach freisin go bhfuil tuiscint ní hamháin ag an údarás ach ag na húdaráis áitiúla nó na comhairlí contae áitiúla faoi chomh réidh is atá na talún sin agus na sites sin. Beidh suim agam na sonraí on Rinn a fheiceáil. \n Deputy Naoise Ó Cearúil  Nuair a bhreathnaímid ar ról an údaráis go dtí seo agus poist á gcruthú aige, is dócha go bhfuil sé deacair poist a chruthú nuair nach bhfuil éinne ann chun obair sna poist sin. Go dtí seo, bhí mise ag ceapadh an t-am ar fad go raibh na cumhachtaí sin ag na comhairlí áitiúla ó thaobh cead pleanála de agus ó thaobh pleanáil timpeall an chontae, go háirithe sna contaetha sin a bhfuil Gaeltacht iontu. Is léir, áfach, nach raibh na comhairlí contae go dtí seo ag déanamh idirdhealú idir an Ghaeltacht agus áiteanna eile nach bhfuil sa Ghaeltacht maidir le dul chun cinn na Gaeilge agus pobal na Gaeltachta agus cead pleanála a thabhairt dóibh sin i gcomparáid le daoine atá ag tógáil tithe samhraidh, mar shampla. Fáiltím go mór roimh an méid atá ráite ag an Aire inniu. Ba bhreá liom cloisteáil conas a éiríonn leis an gcruinniú sin leis an bpríomhfheidhmeannach, más féidir an t-eolas sin a roinnt linn ina dhiaidh, agus faoin obair a dhéanfaidh an t-údarás agus an Roinn lena chéile as seo amach. \n Deputy Dara Calleary  Táimid ag obair leis an údarás ach tá sé tábhachtach go bhfuil na húdaráis áitiúla ag obair freisin agus go bhfuil siad ag cur béime ar chúrsaí pleanála sa Ghaeltacht agus ag obair leis an Roinn tithíochta. Beidh mé ag obair leis an Aire tithíochta ar an bhfadhb seo agus ar an dúshlán. Tá sé tábhachtach go bhfuil cinnteacht againn faoi stádas na talún sin agus faoi stádas na sites atá ag an údarás agus fios a bheith againn an bhfuil siad réidh don pleanáil. Luaim ní hamháin cúrsaí seirbhíse, cúrsaí uisce nó séarachais ach freisin dlí pleanála agus gach rud mar sin. Is é seo príomhthosaíocht na Roinne tithíochta agus beidh mé ag obair leis an Aire. Tuigeann sé. Bhí cruinniú ag an mbeirt againn le BÁNÚ agus le Tinteán i rith an tsamhraidh faoi seo. Beimid ag obair agus beimid ag cur béime air sin. Má tá sonraí ag aon Teachta faoi thalamh nó faoi site sa Ghaeltacht, iarraim orthu na sonraí sin a chur chugam agus déanfaidh mé obair orthu. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 17. D'fhiafraigh Deputy John Connolly den Minister for Rural and Community Development and the Gaeltacht cé na féidearthachtaí atá ann d'Údarás na Gaeltachta obair le hUisce Éireann agus le húdaráis áitiúla chun tacú le tógáil tithíochta do phobail Ghaeilge mar atá curtha san áireamh sa phlean Tithe a Sheachadadh, Pobail a Thógáil 2025-2030; agus an ndéanfaidh sé ráiteas ina thaobh. [68405/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Cúrsaí Tithíochta",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_17",
        "questionNumber": 17
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  My Department is responsible for a range of initiatives tackling deprivation and revitalising communities in both rural and urban areas. Key programmes include the Social Inclusion and Community Activation Programme (SICAP), the Empowering Communities Programme and providing funding for the Dublin North East Inner City initiative.  My Department is making significant progress in revitalising communities through the ongoing work of these programmes and is well placed to play its part in the development of new initiatives for our urban communities, both in Dublin and elsewhere.  The commitment in the Programme for Government regarding an Urban Communities Initiative is included in the section on Rejuvenating our Capital City Centre, which also refers to the Dublin North East Inner City initiative. However, I know that other urban areas outside Dublin city would also be suitable for such an initiative.  My Department is currently examining ways in which this commitment could be delivered in the context of our role in community development in urban areas.  SICAP is our country’s primary social inclusion intervention - a national programme that is delivered in both rural and urban areas by Local Development Companies, helping those in the greatest need to address high and persistent levels of deprivation through targeted, locally-led approaches. €48.9m in funding was allocated for SICAP delivery in 2025. The programme encourages partnerships between individuals, community organisations, and public sector agencies to address diverse community needs.  My Department's Empowering Communities Programme (ECP) was developed in line with Government commitments to expand the Dublin North East Inner City approach to other areas. It focusses on smaller areas experiencing significant disadvantage, identified using the Pobal HP Deprivation Index. Commencing in 2022, 17 projects are currently supported under the Empowering Communities Programme. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 26. Deputy John Connolly asked the Minister for Rural and Community Development and the Gaeltacht the progress his Department has made towards the development of a scheme to tackle urban disadvantage; and if he will make a statement on the matter. [68404/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_26",
        "questionNumber": 26
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 428, 429, 443, 444, 448 and 510 together.  The Community Pharmacy Agreement 2025 was published on the 18th of September 2025, following the successful conclusion of negotiations with the Irish Pharmacy Union (IPU). The Agreement is supported by a €75 million new investment across 2025 and 2026.  The Agreement marks a significant milestone in the strategic collaboration between the Department of Health, the Health Service Executive (HSE), and the IPU. It sets out a comprehensive and ongoing pathway to modernise and expand the role of community pharmacy in Ireland’s healthcare system.  The Agreement is available on the Department of Health’s website at the following link: www.gov.ie/en/department-of-health/publications/community-pharmacy-agreement-2025/.  It is important to note that the Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied monthly, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed in the pharmacy across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use.  The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  Phased dispensing support is currently available for medical card holders under the General Medical Services (GMS) Scheme for the following reasons:  Reason 1 - at the request of a patient's physician.  Reason 2 - due to the inherent nature of a medicinal product i.e. product stability and shelf life.  Reason 3 - where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  Reason 4 - in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, from January 2026, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  • Psychotropics;  • Opioids;  • Codeine; and  • Pregabalin and gabapentin.  The approved list of medications under these classes will be provided by the HSE in due course.  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse.  Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  The salient point here is that appropriate phased dispensing is not being removed in this Agreement.  The introduction of improved controls around phased dispensing is being done in a way which puts patient safety first and allows the State to repurpose funding to be used to implement new patient-centred services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service.  The Agreement is designed to support the delivery of safe, equitable, and efficient healthcare, and to ensure that community pharmacists are better equipped to contribute to national health priorities through structured engagement, sustainable funding, and integrated service delivery.  Under the Agreement, a Strategic Collaboration Group will be established from early 2026 which will provide a structured forum for dialogue and joint consideration of strategic issues shaping the future of community pharmacy in Ireland.  The Agreement also includes the establishment of a rolling annual medicines optimisation programme with dedicated annual funding. The Strategic Collaboration Group will be tasked with exploring the best way to utilise this fund. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 448. Deputy John Connolly asked the Minister for Health further to Parliamentary Question No. 1825 of 4 November 2025, the steps her Department expects pharmacies to charge for this service; the supports or alternatives available for low-income individuals who require blister packs for safe medication management but cannot afford the additional cost (details supplied); and if she will make a statement on the matter. [68663/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29",
          "showAs": "John Connolly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_381",
          "debateSectionId": "dbsect_381",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_381.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_448",
        "questionNumber": 448
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 43 and 48 together.  On 14 February 2024, the then Taoiseach, along with Prime Minister Sanchez of Spain, wrote to the President of the European Commission requesting an urgent review of whether Israel was complying with its human rights obligations under the EU-Israel Association Agreement. Furthermore, the letter requested that the Commission propose appropriate measures for the consideration of the Council, should it find that Israel was in breach of its obligations.  A review of the EU-Israel Association Agreement, initiated by the Foreign Affairs Council in May 2025, found that actions taken by the Israeli government represented a breach of essential elements relating to respect for human rights and democratic principles. In the months following , the European Commission put forward a number of proposals, one of which was to suspend the core trade-related provisions of the Association Agreement. This would have the effect of removing the preferential tariffs afforded to goods from the State of Israel under the terms of the Association Agreement.  Ireland welcomed the Commission proposals and encouraged fellow Member States to support them.  Notwithstanding the positive and welcome recent developments with regard to a ceasefire and hostage release deal in Gaza, Ireland along with other Member States, has made clear its view that the proposals should remain on the table. In her State of the Union address, the President of the European Commission was clear on the rationale for tabling the package of proposals, which remains valid.  The Government has always been of the view that the EU-Israel Association Agreement must be interpreted and applied in accordance with the obligations of the EU and its Member States under international law. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_75.xml"
            }
          },
          "debateSectionId": "dbsect_75",
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_75"
        },
        "questionNumber": 43,
        "date": "2025-11-27",
        "showAs": " 43. Deputy John Connolly asked the Minister for Foreign Affairs and Trade the position of the Government on the continuation, in its current format, of the EU-Israeli trade agreement; and if she will make a statement on the matter. [66127/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_43"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The consistent position of successive Irish Governments is that Ireland does not recognise Britain’s claim of sovereignty over Rockall. Accordingly, Ireland does not accept that a 12 nautical mile (22km) territorial sea exists around Rockall.  We understand that the UK takes a different view.  Reaching an agreement on issues relating to Rockall continues to be important for the Government. Officials in my Department and in the Department for Agriculture, Food, Fisheries and the Marine, remain in contact with the relevant Scottish and UK authorities on this issue.  The matter has been raised with the First Minister of Scotland, John Swinney, and the Cabinet Secretary for the Constitution, External Affairs and Culture, Angus Robertson, with agreement that we would continue to work together to seek to seek a resolution.  The Government is seeking to address the issues involved through this engagement, reflecting long-standing fisheries patterns in the area. We hope that a resolution - which is in all of our mutual interests - can be found to the issues involved. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_82.xml"
            }
          },
          "debateSectionId": "dbsect_82",
          "showAs": "Rockall Island Ownership",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_82"
        },
        "questionNumber": 54,
        "date": "2025-11-27",
        "showAs": " 54. Deputy John Connolly asked the Minister for Foreign Affairs and Trade for an update on contacts with Scottish and UK authorities on reaching an agreement on issues relating to Rockall; and if she will make a statement on the matter. [66126/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_54"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I have engaged Mr. Kieran Mulvey as a Facilitator to work with seafood representative groups in order to identify and articulate issues, priorities and opportunities for the sector.  This engagement, in addition to my own engagement with the sector, will assist me in setting the Terms of Reference for a Fisheries Sector Strategy next year. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_131.xml"
            }
          },
          "debateSectionId": "dbsect_131",
          "showAs": "Fishing Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_131"
        },
        "questionNumber": 135,
        "date": "2025-11-27",
        "showAs": " 135. Deputy John Connolly asked the Minister for Agriculture, Food and the Marine for an update on the programme for Government commitment to publish a five-year Fisheries Sector Strategy that will include an examination of the processing sector; and if he will make a statement on the matter. [66125/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_135"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Programme for Government acknowledges the vital role of farmers as a driving force in the rural economy and as custodians of the landscape while ensuring sustainable food production for a growing world population.  Strengthening farm incomes is a priority for this Government. We will continue to support the suckler sector with targeted exchequer supports and with other EU co-funded supports that are available to all farmers through the CAP Strategic Plan (CSP).  In Budget 2026, I secured an allocation of €131 million for the livestock sector, which will ensure the continuation of existing dedicated supports, including those worth over €79m to the suckler sector in 2026.  Those supports consist of €51.2m for the multi-annual CSP Suckler Carbon Efficiency Programme and €28m for the annual Beef Welfare Scheme (BWS). The budget for the current BWS in 2025 was an increase of €8m, or 40%, on the preceding year of 2024. The scheme attracted approximately 24,500 participants and payments are scheduled to issue in early December.  It is standard practice for my Department to consult the farm organisations on the design and implementation of various schemes that affect their members. The popularity of the current beef schemes are due to the straightforward, practical and beneficial measures put in place.  In addition, there are many other multi-annual schemes available under the current CSP, which is worth €9.8 billion to farmers and rural communities between 2023 and 2027. These include basic income payments as well as agri-environment, investment and organic farming schemes.  I am committed to continue providing suckler farmers with meaningful supports aimed at promoting a viable, resilient and sustainable suckler sector. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_147.xml"
            }
          },
          "debateSectionId": "dbsect_147",
          "showAs": "Agriculture Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_147"
        },
        "questionNumber": 154,
        "date": "2025-11-27",
        "showAs": " 154. Deputy John Connolly asked the Minister for Agriculture, Food and the Marine for an update on the Programme for Government commitment to increase scheme supports for suckler farmers and ensure straightforward measures to encourage uptake; and if he will make a statement on the matter. [66124/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_154"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The information requested by the Deputy is set out in the following table:      CD Unit      ACTIVE FOR DUTIES      INACTIVE       Carlow    20    3      Cavan    89    29      Clare    67    4      Cork City    59    35      Cork N&E    66    8      Cork West    49    6      Donegal    41    10      Dublin    270    52      Galway    159    29      Kerry    62    26      Kildare    65    1      Kilkenny    42    5      Laois    63    0      Leitrim    18    4      Limerick    45    8      Longford    26    5      Louth    54    17      Mayo    41    10      Meath    119    34      Monaghan    61    9      Offaly    28    9      Roscommon    41    15      Sligo    103    24      Tipperary    82    26      Waterford    59    32      Westmeath    45    7      Wexford    92    11      Wicklow    48    2      National    1,914    421      Overall total        2,335      ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_186.xml"
            }
          },
          "debateSectionId": "dbsect_186",
          "showAs": "Civil Defence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_186"
        },
        "questionNumber": 204,
        "date": "2025-11-27",
        "showAs": " 204. Deputy John Connolly asked the Minister for Defence the number of participants in the civil defence in each local authority; and if he will make a statement on the matter. [67099/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_204"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to sustainable mobility, including the provision of funding to the National Transport Authority (NTA) in support of Transport for Ireland (TfI) public bike-sharing schemes in Galway, Limerick, Cork and Waterford.  Details related to the operation of these schemes are a matter for the NTA. Accordingly, I have referred your question to the NTA for a more detailed reply. If you do not receive a reply within 10 working days, please contact my private office. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_221.xml"
            }
          },
          "debateSectionId": "dbsect_221",
          "showAs": "Transport Infrastructure Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_221"
        },
        "questionNumber": 260,
        "date": "2025-11-27",
        "showAs": " 260. Deputy John Connolly asked the Minister for Transport the position regarding the introduction of an e-bike rental scheme for Galway City; and if he will make a statement on the matter. [67183/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_260"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 315 and 316 together.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  Project delivery is managed as part of an overall capital programme, in line with the Government's Infrastructure Guidelines and taking account of budgetary parameters. Delays can occur in large capital programmes for many reasons, including factors beyond my department’s control, such as site acquisition and statutory permissions. These are managed as effectively as possible, prioritising the most urgent projects where capacity is already fully utilised, and deploying modular accommodation where near-term additional space is needed.  It should be noted that some projects may remain at a particular stage longer than anticipated due to a range of factors, including planning-related issues, challenges within the design process, and complex site conditions.  The table below lists the new school building projects in County Galway at stage 2b and stage 3.     Roll Number    School Name    Townland    Current Stage Of Project    Stage 2b/ Stage 3 Commencement Date      17444H    SN Seosamh Naofa    Athenry    Stage 3    24/03/2015      19529C    Scoil Mhuire    Moycullen    Stage 2b    15/10/2021      20042E    Scoil an Chroi Naofa    Ballinasloe    Stage 2b    12/05/2011      20237T    Gaelscoil Riada    Athenry    Stage 3    09/02/2023      20462D    Cuan na Gaillimhe CMS    Galway City    Stage 2b    14/11/2025      20465J    Gort NS    Gort    Stage 3    01/07/2022      62960H    St Joseph's College    Galway City    Stage 2b    02/02/2023      76102K    Coláiste an Eachréidh    Baile Átha an Rí    Stage 3    09/02/2023      ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_271.xml"
            }
          },
          "debateSectionId": "dbsect_271",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_271"
        },
        "questionNumber": 315,
        "date": "2025-11-27",
        "showAs": " 315. Deputy John Connolly asked the Minister for Education and Youth the number of new school development projects in County Galway currently in Stage 2B of the development process; the date each project entered stage 2B, in tabular form; and if she will make a statement on the matter. [67087/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_315"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 315 and 316 together.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  Project delivery is managed as part of an overall capital programme, in line with the Government's Infrastructure Guidelines and taking account of budgetary parameters. Delays can occur in large capital programmes for many reasons, including factors beyond my department’s control, such as site acquisition and statutory permissions. These are managed as effectively as possible, prioritising the most urgent projects where capacity is already fully utilised, and deploying modular accommodation where near-term additional space is needed.  It should be noted that some projects may remain at a particular stage longer than anticipated due to a range of factors, including planning-related issues, challenges within the design process, and complex site conditions.  The table below lists the new school building projects in County Galway at stage 2b and stage 3.     Roll Number    School Name    Townland    Current Stage Of Project    Stage 2b/ Stage 3 Commencement Date      17444H    SN Seosamh Naofa    Athenry    Stage 3    24/03/2015      19529C    Scoil Mhuire    Moycullen    Stage 2b    15/10/2021      20042E    Scoil an Chroi Naofa    Ballinasloe    Stage 2b    12/05/2011      20237T    Gaelscoil Riada    Athenry    Stage 3    09/02/2023      20462D    Cuan na Gaillimhe CMS    Galway City    Stage 2b    14/11/2025      20465J    Gort NS    Gort    Stage 3    01/07/2022      62960H    St Joseph's College    Galway City    Stage 2b    02/02/2023      76102K    Coláiste an Eachréidh    Baile Átha an Rí    Stage 3    09/02/2023      ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Connolly",
          "memberCode": "John-Connolly.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Connolly.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_271.xml"
            }
          },
          "debateSectionId": "dbsect_271",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_271"
        },
        "questionNumber": 316,
        "date": "2025-11-27",
        "showAs": " 316. Deputy John Connolly asked the Minister for Education and Youth the number of new school development projects in County Galway currently in stage 3 of the development process; the date each project entered stage 3, in tabular form; and if she will make a statement on the matter. [67088/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_316"
      },
      "contextDate": "2025-11-27"
    }
  ]
}