{
  "head": {
    "counts": {
      "questionCount": 480,
      "resultCount": 480
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Tusla, the Child and Family Agency, is required by law to be independent in its work as set out in Section 8 (11) of the Child and Family Agency Act.  It is important to state that while Tusla acts as the guardian of children in care, care orders under the Act are granted by the Courts. Court oversight of the granting of care orders is a key aspect of upholding the rights of parents and families, and ensuring that children are taken into care only where it is found that they are unlikely to receive the care or protection they need unless a Court makes a care order in respect of that child.  Tusla has advised that it recognises the importance of children living with their families, where possible. Where a child has been taken into care, Tusla works to achieve reunification where this is in the best interests of the child. In the interest of improving the support network around children, even where that child may be in care, Tusla has stated that its workers advocate on behalf of parents to secure support services. These could include addiction or mental health services, housing and income supports, as well as parenting and family supports.  In the event that a child remains in care long-term, Tusla has advised that the supports it offers to parents seeks to assist the parent in maintaining regular contact with the child by means of family access, where parent, child and siblings may visit or spend time with each other.  In respect of protecting children in care from harm, the Child Care Act 1991 is the primary piece of legislation governing the alternative care system. The Act is a wide-ranging piece of legislation, which, at its core, seeks to promote the welfare of children who may not be receiving adequate care and protection.  Consequently, the Act sets out a detailed statutory framework, which includes but is not limited to provisions requiring Tusla to have regard to the best interests of the child, the thresholds for bringing children into care, the types of placements where they may be cared for, and the responsibilities of the State in respect of looking after these children.  The placement of children in alternative care is also governed by Regulations and Standards for Foster Care, Residential Care, and Special Care. These Regulations and Standards set out the detailed criteria against which Tusla is inspected in its provision of alternative care services. The application of these Regulations and Standards promotes safe and high-quality practice in alternative care. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 615. Deputy Conor Sheehan asked the Minister for Children, Disability and Equality given the repeated failures within TUSLA highlighted in the media and raised in the Dáil Éireann including cases where babies were removed from breastfeeding mothers, the reason children are not immediately returned to their parents when a placement breaks down, particularly where the parent has been assessed as safe and is already caring for other children; the criteria TUSLA relies on to keep children in care in these circumstances; the accountability which exists when reunification is delayed without lawful or child-centred reasons; and if she will make a statement on the matter. [73593/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_588",
          "debateSectionId": "dbsect_588",
          "showAs": "Child and Family Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_588.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_615",
        "questionNumber": 615
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  While the EU Advisory Committee on Health and Safety recommended the recognition of COVID-19 (not long-COVID) as an occupational illness in health and social care settings, recognition of COVID-19 nationally as an occupational illness falls under the remit of the Minister for Social Protection. After reviewing the EU recommendation, the Minister for Social Protection found that COVID-19 did not meet the requirements to be recognised as an occupational illness in the context of the Occupational Injuries Benefit Scheme and the Social Welfare Consolidation Act. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 633. Deputy Conor Sheehan asked the Minister for Health if she will declare Covid-19 an occupational illness, as has been done in many other European Union member states, so that healthcare workers suffering from long-Covid can continue to access financial supports; and if she will make a statement on the matter.  [73290/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_607",
          "debateSectionId": "dbsect_607",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_607.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_633",
        "questionNumber": 633
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 634. Deputy Conor Sheehan asked the Minister for Health if the mechanism for interscheme transfer from one GP training programme to another can be reinstated (details supplied); and if she will make a statement on the matter. [73294/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_608",
          "debateSectionId": "dbsect_608",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_608.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_634",
        "questionNumber": 634
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 371, 374, 391, 398 and 410 together.  Monitored Dosage Systems, known as “blister packs” or compliance aids, are systems that enable the individual medicine doses for any medication to be organised according to the prescribed dose schedule. These are ordinarily provided once a month and packaged to indicate when medication should be taken.  The State has never agreed to fund this and there has never been a fee associated with monitored dosage systems under the Pharmacy contract. This has always been the case and has been repeated in several HSE circulars to pharmacists.  I recognise that for certain patients, or their carers, the use of blister packs to simplify adherence with their dosage schedule can be helpful and they rely heavily on the provision of these products.  However, it is important to recognise that phased dispensing and blister packing are not the same thing. The State funds phased dispensing for medical card holders. It does not, however, fund Monitored Dosage Systems.  The community pharmacy contract has supported phased dispensing since 1996 for patient safety reasons and will continue to do so. Phased dispensing requires the patient to present to the pharmacy on multiple occasions in the month (e.g., each week) when it would be unsafe for the patient to receive the totality of their medication in one supply occasion, or if the shelf life of the medicine requires it. Community pharmacies receive additional fees for this service – which has only ever been in place for medical card holders.  The changes agreed under the Community Pharmacy Agreement – now paused until later in quarter 1 2026 – will introduce improved controls to align phased dispensing to specified high risk drugs, where a patient safety concern may exist. This will ensure that patients on high-risk medicines, such as anti-psychotics or opioids, are appropriately targeted with support.  Psychotropic medications represent a class of medication that are high risk, have a high dependency potential, and carry a significant risk of misuse. They are often prescribed in the management of conditions where cognitive or functional impairments justify closer monitoring through phased supply.  The State has not imposed a new charge on blister packs. This remains a private service provided by pharmacies. It is also understood that different approaches are taken by community pharmacies in respect of funding the use of Monitored Dosage Systems for medical card holders.  • Some have been blister packing their patient’s medicines for free,  • Some have been charging the patient privately for providing that service, and,  • Some have submitted claims for phased dispensing to the HSE when in reality they were using Monitored Dosage Systems. The State has never agreed to this last practice, and it is inappropriate claiming to do so.  It remains open to pharmacies to charge patients or not for the use of Monitored Dosage Systems as a private service, as many currently do. It is important where a pharmacy charges a fee for any professional service, that they provide updated information to patients in line with the new Pricing Transparency Guidelines, which came into effect on 1st December.  In addition, community pharmacies can, and do, use a variety of means to assist their patients including:  • counselling,  • reminder charts,  • the “Know Check Ask system” with the HSE, and  • tools like picture or large-print labels and alarms.  All of these are aimed at improving understanding and adherence to medication. This remains a key part of the service and support that pharmacies provide to patients. There is no change in that regard.  The HSE Health App ‘My medicines list’ provides a secure place for patients to record a list of their medicines, which can be useful for pharmacy or hospital visits. It also allows people to see a list of their medicines received through the Drugs Payment Scheme or Medical Card Scheme. Keeping a list can help patients know their medicines. It can also help when patients are discussing their medicines with a healthcare professional.  These measures can assist older people, people with disabilities, and people with multiple conditions, to ensure that they manage their medicines safely. Patients should talk to their pharmacist directly about the best way to manage their medicines. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 371. Deputy Conor Sheehan asked the Minister for Health if she will intervene to ensure that patients are not charged for blister packs of medications prepared by pharmacists; and if she will make a statement on the matter. [72621/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_371",
        "questionNumber": 371
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) is leading the development and rollout of strategic park and ride sites nationwide through the Park and Ride Development Office (PRDO).  The Programme for Government commits to working with local authorities and relevant agencies to develop affordable Park and Ride facilities on the outskirts of major towns and cities.  The NTA established the PRDO in February 2020. The function of the PRDO is to enable and advance the delivery of strategic Park & Ride sites in collaboration with Local Authorities and transport agencies across all regions of the State by providing full time specialist resources on these projects.  The Limerick & Shannon Metropolitan Area Transport Strategy, 2040 (LSMATS) was published by NTA in November 2022, setting out the vision for Park and Ride (P&R) for the region over this time horizon. While the LSMATS covers the period up to 2040, this is not the target date for the completion of projects developed under the strategy. My Department and the NTA will continue to hold project timelines under regular review with a view to accelerating key projects, where funding and resources allows. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 266. Deputy Conor Sheehan asked the Minister for Transport his views on a matter (details supplied) regarding Park &amp; Ride facilities; and if he will make a statement on the matter. [71458/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_181",
          "debateSectionId": "dbsect_181",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_266",
        "questionNumber": 266
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The issue raised by the Deputy, where homeowners are unable to secure insurance cover due to pyrite or defective concrete, is one the Government recognises as challenging for affected households.  Insurance companies operate independently when determining the availability and pricing of their products, and neither I, as Tánaiste and Minister for Finance, nor the Central Bank of Ireland has the legal authority to compel insurers to offer cover for specific risks. These restrictions derive from the EU’s Solvency II Directive , which expressly prevents Member States from intervening in insurers’ pricing or underwriting decisions.  Insurers rely on their own claims’ histories, risk assessments, and cost projections when deciding whether to provide cover. Factors such as inflation in building materials and labour are also influencing premium levels across the sector.  For homeowners seeking additional information, Insurance Ireland operates an Insurance Information Service for any queries, complaints or difficulties in relation to obtaining insurance, which can be contacted by telephone at 01 676 1914 or via email at feedback@insuranceireland.eu. Similarly, Brokers Ireland, the representative body for insurance brokers in Ireland, has access to a wide range of providers and products, and can offer advice for customers when sourcing cover. Brokers Ireland can be reached by telephone at 01 661 3067.  Furthermore, where homeowners are dissatisfied with an insurer’s decision, they have the option of making a complaint to the Financial Services and Pensions Ombudsman (FSPO). The FSPO can be contacted either by email at info@fspo.ie or by telephone at 01 567 7000.  In addition to the issue of insurance coverage, my officials have been advised by the Department of Housing, Local Government and Heritage that the Defective Concrete Blocks (DCB) Grants Scheme provides for homeowners to claim a Government grant of up to 100% of remedial costs (including demolition and rebuild) subject to meeting eligibility requirements and the overall grant scheme cap. Following Government approval, the overall grant cap increased from €420,000 to €462,000 in October 2024.  Designated local authorities under the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 can  administer the grant scheme and any queries relating to the scheme should be addressed to the relevant designated local authority in the first instance. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 361. Deputy Conor Sheehan asked the Tánaiste and Minister for Finance the options available to homeowners whose house insurance company will not cover them for pyrite/defective concrete; and if he will make a statement on the matter. [71456/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_261",
          "debateSectionId": "dbsect_261",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_361",
        "questionNumber": 361
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Construction Products Regulations ((EU) No 305/2011 (CPR) sets out rules for the marketing of construction products, including aggregates for concrete and concrete blocks, in the EU.  Where a construction product covered by a harmonised standard is being placed on the EU market, the CPR requires the manufacturer to draw up a ‘declaration of performance’ and affix a ‘CE’ marking to the product. In order to do so, manufacturers must test and declare the performance of their construction products using a common technical language prescribed in the harmonised standard. Typically, the manufacturer shall carry out:  an assessment of the performance of the construction product on the basis of testing (including sampling), calculation, tabulated values or descriptive documentation of that product;  factory production control;  testing of samples taken at the manufacturing plant by the manufacturer in accordance with the prescribed test plan.  Notified Bodies are designated by my Department to carry out third party tasks in accordance with the systems of assessment and verification of constancy of performance as provided for in Annex V of the CPR. The notified factory production control certification body shall decide on the issuing, restriction, suspension or withdrawal of the certificate of conformity of the factory production control on the basis of the outcome of the following assessments and verifications carried out by that body:  initial inspection of the manufacturing plant and of factory production control;  continuing surveillance, assessment and evaluation of factory production control.  The National Standards Authority of Ireland (NSAI), is Ireland’s official standards body and is an autonomous body under the aegis of the Minister for Enterprise Trade and Employment. NSAI has produced additional guidance to some harmonised standards, under the CPR, in the form of Standard Recommendations (SRs) which set out appropriate minimum performance levels for specific intended uses of certain construction products in Ireland.  Ultimately, the manufacturer is responsible for compliance with the CPR and in particular for the Declaration of Performance/CE marking of the construction product he or she is placing on the market, having full knowledge of the raw material (as is legally required by the CPR via the relevant harmonised European Standards) and having regard to the end product’s suitability for use in construction works in accordance with the relevant Standard Recommendations published by the National Standards Authority of Ireland.  In respect to enforcement of the CPR, each of the building control authorities (local authorities) have been designated as the principal market surveillance authorities for construction products that fall within the scope of the CPR, within their administrative areas. In addition, Dublin City Council - National Building Control and Market Surveillance Office, NBCMSO, has been appointed as a competent authority for the carrying out of market surveillance functions on a nationwide basis.  Building control authorities will liaise with NBCMSO to support compliance with the CPR and to determine appropriate action on enforcement matters, as they arise.  Market surveillance activity should enable non-compliant products to be identified and kept or taken off the market with unscrupulous and/or criminal economic operators prosecuted and penalised for their actions. In this context, it is important to note that the overarching objective of a market surveillance authority is to ensure that compliant products are placed on the market. Where non-compliance is identified, market surveillance activities should be designed to encourage economic operators to take appropriate corrective actions to redress the position within a reasonable period of time.  Market surveillance authorities have significant powers including to obtain access to the place of manufacture or storage, request technical information, select samples of the construction product and carry out evaluations, examination or tests on such samples. Where construction products are placed on the market which do not comply with the requirements set out in the CPR, market surveillance authorities have powers to direct the relevant economic operator to take the necessary corrective actions to bring the product into compliance. Where this does not work, there are further procedures that may result in the product being withdrawn or recalled from the market, its use subject to special conditions, or the products availability on the market being prohibited or restricted.  Separate to the above, the NSAI have published I.S. 465:2018 which is solely intended for use by those who intend to provide assessment and testing services for dwellings that are suspected of being affected by defective concrete blocks. As such, I.S. 465:2018 does not have a bearing on the rules for placing construction products on the market in accordance with the CPR.  Finally, it should be noted that a number of State agencies are currently responsible for regulating different aspects of quarries as set out below.  Planning authorities may grant planning permission for a development on lands such as a quarry. A person is not entitled solely by reasons of a planning permission to carry out development.  When making a decision on a planning application for a quarry, the relevant planning authority is required to have regard to the particular local circumstances of the proposed development and may attach appropriate conditions to the permission on a case by case basis.  My Department issued statutory Guidelines to Planning Authorities on Quarrying and Ancillary Activities in April 2004, to which planning authorities must have regard when considering a planning application for a quarry. The Guidelines include planning guidance on the attachment of appropriate conditions to quarry-related permissions.  Where blasting is required, the issuing of a permit for the use of explosives in the extractive industry, or for other purposes, is a matter for An Garda Síochána, which falls within the remit of my colleague, the Minister for Justice, whose Department has issued the Guide to Explosives Legislation in Ireland.  The Environmental Protection Agency (EPA), which is under the remit of my colleague, the Minister for Climate, Energy and the Environment published guidelines in 2006 on Environmental Management in the Extractive Industry, which complement the 2004 Quarrying Guidelines issued by my Department and include advice on the management of environmental issues associated with blasting in quarries, such as pollution, noise and vibration.  Furthermore, the Health and Safety Authority (HSA) - which is under the remit of my colleague, the Minister for Enterprise, Tourism and Employment - is responsible for the enforcement of health and safety in the workplace, including specific requirements in relation to the operation of quarries under the Safety, Health and Welfare at Work (Quarries) Regulations 2008, the Safety, Health and Welfare at Work (Quarries) (Amendment) Regulations, 2013 and their associated guidance. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 546. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage the process for quarry testing; the person or body responsible for sourcing/choosing the samples; whether the testing process will be updated in view of the status of the review of IS465; and if he will make a statement on the matter. [71454/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_430",
          "debateSectionId": "dbsect_430",
          "showAs": "Quarrying Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_430.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_546",
        "questionNumber": 546
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Information on the Defective Concrete Blocks Grant Scheme including government legislation, guidelines and the application process is readily available on the Government website at www.gov.ie/en/department-of-housing-local-government-and-heritage/services/defective-concrete-blocks-grant-scheme/?referrer=http://www.gov.ie/defectiveconcreteblocks/.  The scheme is administered by local authorities and is currently open to applications in five counties, namely Clare, Donegal, Limerick, Mayo and Sligo. These designated local authorities also provide extensive online information regarding the scheme and via walk in services.  My Department has also been supportive of applications by designated local authorities for Defective Concrete Blocks Community Facilitators. Their role is to support and guide the homeowner through the application process and facilitate access to relevant support services.  I am satisfied that the communication mechanisms that I have referenced are sufficient at this time to inform people about the defective concrete blocks issue and the options open to then should they suspect their home is damaged as a result of such blocks. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 547. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage if his Department will run an awareness campaign urging people to come forward if they suspect they have defective concrete in their homes; and if he will make a statement on the matter. [71455/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_431",
          "debateSectionId": "dbsect_431",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_431.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_547",
        "questionNumber": 547
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Extension of Work Permit Conditions (EWPC) application from the person referred to by the Deputy continues to be processed by my Department.  It is important to note that no two applications are the same and some take longer than others to process. Each EWPC application is evaluated individually and the time taken to process an application varies based on a number of factors such as the number of applications on hand, the complexity of the case and the quality of the application received.  Applicants can now directly check the status of their immigration application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at: [ www.portal.irishimmigration.ie/en/ ]  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 674. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration the position regarding an Extension of Work Permit Condition (EWPC) application (details supplied); the reason for the delay in processing this application; and if he will make a statement on the matter. [71401/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_535",
          "debateSectionId": "dbsect_535",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_535.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_674",
        "questionNumber": 674
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 683, 701, 702 and 703 together.  Last month Minister O'Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  As part of this, I intend to make a number of changes to the legislation on the granting of citizenship.  One policy change which I have already made relates to the residency requirements of a person granted international protection to be granted citizenship, came into effect on 8 December 2025.  I want to clarify for the Deputy that International Protection applicants are not eligible to apply for naturalisation. Only individuals who have been granted an International Protection declaration and who have accrued the required period of reckonable residence in the State can be considered for Irish citizenship.  Previously, individuals granted international protection status could apply for citizenship after a time period of three years. Effective from 8 December 2025 persons granted international protection will generally be required to have five years of reckonable residence in the State before they can apply for citizenship.  Applications for citizenship received before 8 December 2025 will continue to be processed under the previous three year rule, while applications submitted on or after that date will be assessed in line with the new five year residency requirement. This change brings citizenship applicants with international protection status in line with most other citizenship applicants.  It is important to note that applications for naturalisation are not prioritised on the basis of an applicant's length of residence in the State. Rather, applications are processed in the order in which they are received, subject to the completion of all necessary checks.  All applications for a certificate of naturalisation are assessed individually based on the provisions of the Irish Nationality and Citizenship Act 1956, as amended.  Detailed information on how to apply for naturalisation and other resources is available on my Department’s Immigration website here: ww.irishimmigration.ie/how-to-become-a-citizen/ . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 683. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration if the proposed changes to the immigration system will apply retrospectively to people who are already in the system; and if he will make a statement on the matter. [71457/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_541",
          "debateSectionId": "dbsect_541",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_541.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_683",
        "questionNumber": 683
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational matter for the HSE, I have referred the question to the HSE for a direct reply. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1092. Deputy Conor Sheehan asked the Minister for Health the amount spent by the HSE on acquiring the shingles vaccine in 2023, 2024 and 2025; the number of people administered the shingles vaccine by county in 2023, 2024 and 2025; and if she will make a statement on the matter. [72313/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_906",
          "debateSectionId": "dbsect_906",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_906.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1092",
        "questionNumber": 1092
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Irish Palestine Scholarship Programme (IPSP) is part of the Ireland Fellows global scholarship programme run by the Government of Ireland providing opportunities for candidates to choose from a wide variety of courses at 19 higher education institutions in Ireland. The Ireland Fellows Programme, which is delivered by the Department of Foreign Affairs and Trade, is a longstanding international development initiative grounded in the belief that education is central to creating a better world and fostering long-term sustainable change. The programmes leverages Ireland's world-class higher education institutions to empower individuals from eligible developing countries, enabling them to acquire advanced skills and knowledge that they can apply upon returning home  Further details of the IPSP including the operation of the application and selection process, the number of available places and the supports available to successful applicants can be found at: www.ireland.ie/en/ramallah/about/ireland-palestine-scholarship-programme/#about ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1153. Deputy Conor Sheehan asked the Minister for Further and Higher Education, Research, Innovation and Science the financial supports available to students from Gaza who are accepted into programmes in Irish universities; and if he will make a statement on the matter. [71333/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_970",
          "debateSectionId": "dbsect_970",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_970.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1153",
        "questionNumber": 1153
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  In May 2024, Government introduced a package of supports for SMEs which included a commitment to ensure an enhanced SME Test will be applied to all new major policy initiatives or regulatory measures.  While the initial focus of the SME Test was on primary legislation, the enhanced SME Test must be applied to both primary and secondary legislation, new policies, and changes to regulatory compliance requirements that could potentially impact SMEs.  My department does not have responsibility for immigration permissions in the English language education sector, but works with other government departments to ensure application of the SME Test to legislation where there are potential impacts on SMEs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 375. Deputy Conor Sheehan asked the Minister for Enterprise, Tourism and Employment his plans to apply the enhanced SME test to the English language education sector in relation to the stamp 2 visa changes; and if he will make a statement on the matter. [70910/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_371",
          "debateSectionId": "dbsect_371",
          "showAs": "Visa Agreements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_371.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_375",
        "questionNumber": 375
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The administration of acquisitions under the Second Hand Acquisitions Programme, including for tenancy sustainment (via tenant in situ), is delegated to the local authorities.  Critically, 'tenant in situ' is not a scheme. Rather it is a policy tool available to local authorities to prevent social housing supported households in the private rented sector from falling into homelessness. It should only be used as a last resort by local authorities when all other options have been exhausted. Accordingly, as it is not a scheme, and there is no application or 'expression of interest' process for landlords or tenants, there can be no appeal mechanism. Ultimately, it is for each local authority to determine whether a tenant in situ acquisition is the appropriate policy response in a given situation. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 448. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage if he will consider introducing an appeals mechanism for tenant-in-situ refusals; and if he will make a statement on the matter. [71177/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_439",
          "debateSectionId": "dbsect_439",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_439.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_448",
        "questionNumber": 448
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 464 and 465 together.  The Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this strategy with the aim to publish Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  As part of this strategic approach, I am reviewing the area of student permissions, with a particular focus on English Language students. This work is aimed at ensuring that the system remains robust and rules-based, supports high-quality education providers, and continues to offer a positive experience for genuine students coming to Ireland.  Ireland welcomes international students who wish to travel here in order to pursue a course of study, thereby providing economic and other benefits to Ireland, as well of course as to the students themselves.  At Government level, the administration and management of international student programmes is within the remit of the Department of Further and Higher Education, Research, Innovation and Science (DFHERIS), with my Department having responsibility for visa and related residency policies.  Minister O'Callaghan and I have met recently with the Minister for Further and Higher Education, Research, Innovation and Science (DFHERIS), James Lawless, to discuss this work and explore how our departments can continue to collaborate effectively on this work.  Given that this review into student permissions is at its initial stages, there are no current plans for immediate public or sectoral consultation at this juncture. However, my Department will consider its engagement with the English Language sector once more detailed proposals are developed.  I hope to bring forward proposals in this area in the coming months. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 464. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration his plans to carry out a public consultation in relation to the changes to stamp 2 permissions; and if he will make a statement on the matter. [70908/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_454",
          "debateSectionId": "dbsect_454",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_454.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_464",
        "questionNumber": 464
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 464 and 465 together.  The Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this strategy with the aim to publish Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  As part of this strategic approach, I am reviewing the area of student permissions, with a particular focus on English Language students. This work is aimed at ensuring that the system remains robust and rules-based, supports high-quality education providers, and continues to offer a positive experience for genuine students coming to Ireland.  Ireland welcomes international students who wish to travel here in order to pursue a course of study, thereby providing economic and other benefits to Ireland, as well of course as to the students themselves.  At Government level, the administration and management of international student programmes is within the remit of the Department of Further and Higher Education, Research, Innovation and Science (DFHERIS), with my Department having responsibility for visa and related residency policies.  Minister O'Callaghan and I have met recently with the Minister for Further and Higher Education, Research, Innovation and Science (DFHERIS), James Lawless, to discuss this work and explore how our departments can continue to collaborate effectively on this work.  Given that this review into student permissions is at its initial stages, there are no current plans for immediate public or sectoral consultation at this juncture. However, my Department will consider its engagement with the English Language sector once more detailed proposals are developed.  I hope to bring forward proposals in this area in the coming months. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 465. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration if he will engage with the English language education sector (details supplied); and if he will make a statement on the matter. [70909/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_454",
          "debateSectionId": "dbsect_454",
          "showAs": "Departmental Consultations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_454.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_465",
        "questionNumber": 465
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 493 and 494 together.  Ensuring transparency and promoting a greater understanding of the family law system is critical to maintaining and building trust in it. At the same time, those who seek the assistance of the Courts in resolving their family justice disputes need to be assured that their privacy, and that of their children, will be maintained at what can be very difficult times for them. In recognising the need for a balance between these two positions, the Family Justice Strategy committed to undertaking a review the operation of the in-camera rule in family law proceedings.  Further to this commitment, an independent research report was published in the operation of the rule in May 2025. The report contains 21 recommendations. These include the need to retitle the rule to ensure its purpose is understood by all family court users; that it is clearly and consistently defined; and that its operation does not impede parties accessing support outside Court. A number of the recommendations also related to the promotion of greater transparency, while ensuring that the privacy of those seeking the court’s help, as well as any children about whom proceedings relate, is protected.  Officials from my Department are currently considering the findings and recommendations of the report in the context of development policy proposals for reform. Officials are also examining how family court proceedings operate in other jurisdictions, to see what can be learned from them. This includes developments in England and Wales such as the roll out of open reporting and Transparency Orders in Family Law proceedings.  It is important to note that, as the law currently stands in Ireland, section 40 of The Civil Liability and Courts Act 2004 explicitly permits solicitors, barristers, and individuals approved by the Minister for Justice, Home Affairs and Migration to attend and report on Family Law cases. Furthermore, under The Courts and Civil Law (Miscellaneous Provisions) Act 2013, members of the media can attend Family Law proceedings and report on what occurs, on an anonymised basis, when granted permission by the presiding judge. Those who are permitted to attend under the aforementioned provisions, are subjected to restrictions on what they may report, and this must be done on an anonymised basis to protect the identities of the parties involved.  My Department has also recently concluded a tender for a Private Family Law Reporting Project. The overall aim of the Project is to provide transparency for the public, while ensuring that children’s and parents’ rights to privacy are upheld. It will also increase awareness and understanding of family law proceedings, while building confidence and trust in the judicial determination of such disputes. Once established, it is expected that the project will run for three years.  Given that the privacy of all parties involved in-camera Family Law proceedings – and those who may be the subject of them, such as children – are an important consideration, any policy proposals developed will need to ensure this privacy continues. At the same time, such proposals will also consider how clarity can be provided regarding the scope of the rule and its impact for those involved in proceedings, and enhance understanding of family law proceedings across society. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 493. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration the timeframe for implementation of the recommendations of the report into the review of the operation of the in camera rule in family law proceedings; and if he will make a statement on the matter. [71178/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_471",
          "debateSectionId": "dbsect_471",
          "showAs": "Family Law Cases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_471.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_493",
        "questionNumber": 493
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 493 and 494 together.  Ensuring transparency and promoting a greater understanding of the family law system is critical to maintaining and building trust in it. At the same time, those who seek the assistance of the Courts in resolving their family justice disputes need to be assured that their privacy, and that of their children, will be maintained at what can be very difficult times for them. In recognising the need for a balance between these two positions, the Family Justice Strategy committed to undertaking a review the operation of the in-camera rule in family law proceedings.  Further to this commitment, an independent research report was published in the operation of the rule in May 2025. The report contains 21 recommendations. These include the need to retitle the rule to ensure its purpose is understood by all family court users; that it is clearly and consistently defined; and that its operation does not impede parties accessing support outside Court. A number of the recommendations also related to the promotion of greater transparency, while ensuring that the privacy of those seeking the court’s help, as well as any children about whom proceedings relate, is protected.  Officials from my Department are currently considering the findings and recommendations of the report in the context of development policy proposals for reform. Officials are also examining how family court proceedings operate in other jurisdictions, to see what can be learned from them. This includes developments in England and Wales such as the roll out of open reporting and Transparency Orders in Family Law proceedings.  It is important to note that, as the law currently stands in Ireland, section 40 of The Civil Liability and Courts Act 2004 explicitly permits solicitors, barristers, and individuals approved by the Minister for Justice, Home Affairs and Migration to attend and report on Family Law cases. Furthermore, under The Courts and Civil Law (Miscellaneous Provisions) Act 2013, members of the media can attend Family Law proceedings and report on what occurs, on an anonymised basis, when granted permission by the presiding judge. Those who are permitted to attend under the aforementioned provisions, are subjected to restrictions on what they may report, and this must be done on an anonymised basis to protect the identities of the parties involved.  My Department has also recently concluded a tender for a Private Family Law Reporting Project. The overall aim of the Project is to provide transparency for the public, while ensuring that children’s and parents’ rights to privacy are upheld. It will also increase awareness and understanding of family law proceedings, while building confidence and trust in the judicial determination of such disputes. Once established, it is expected that the project will run for three years.  Given that the privacy of all parties involved in-camera Family Law proceedings – and those who may be the subject of them, such as children – are an important consideration, any policy proposals developed will need to ensure this privacy continues. At the same time, such proposals will also consider how clarity can be provided regarding the scope of the rule and its impact for those involved in proceedings, and enhance understanding of family law proceedings across society. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 494. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration his views on transparency orders under the family court reporting pilot, as introduced in England and Wales; if he has given consideration to introducing these in Ireland, notwithstanding that they were not included as a recommendation in the report into the review of the operation of the in camera rule in family law proceedings; and if he will make a statement on the matter. [71179/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_471",
          "debateSectionId": "dbsect_471",
          "showAs": "Family Law Cases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_471.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_494",
        "questionNumber": 494
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 559. Deputy Conor Sheehan asked the Minister for Health whether she and the HSE will implement a dedicated space for rheumatology patients at Cork University Hospital; and if she will make a statement on the matter. [70911/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_530",
          "debateSectionId": "dbsect_530",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_530.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_559",
        "questionNumber": 559
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 590. Deputy Conor Sheehan asked the Minister for Health if she intends to expand the opening hours of minor injury units at St. John's, Ennis and Nenagh; and if she will make a statement on the matter. [71180/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_563",
          "debateSectionId": "dbsect_563",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_563.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_590",
        "questionNumber": 590
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 591. Deputy Conor Sheehan asked the Minister for Health the additional clinical capacity and services she intends to deploy at St. John's, Ennis and Nenagh hospitals in order to relieve pressure at University Hospital Limerick, Dooradoyle; and if she will make a statement on the matter. [71181/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_564",
          "debateSectionId": "dbsect_564",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_564.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_591",
        "questionNumber": 591
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  While my Department is the competent authority for the import and export of firearms, An Garda Síochána has a range of functions with regard to the operation of firearms legislation, including the issuing of firearms certificates and authorisations and is the competent authority for the licensing of firearms within the State. The Firearms (Firearm Certificates for Non-Residents) Act 2000 gives the authority for granting licences to Superintendents of An Garda Síochána. Superintendents, when considering firearms licence applications, are considered 'persona designata' and cannot have their decision-making process fettered in any way. Neither I, as Minister for State, nor my Department, have any role in the issuing or otherwise of firearms certificates.An Garda Síochána have provided the attached table, outlining figures for the number of firearms applications with the status of ‘certificate printed’, for the period 2020-2025 to date, where the firearm type was either ‘pistol’ or ‘revolver’.  The following table counts firearms applications with status ‘certificate printed’ by application year where the firearm type was either ‘pistol’ or ‘revolver’.     Division    2020    2021    2022    2023    2024    *2025      Clare/Tipperary    42    30    45    45    44    49      Cork City    17    19    50    31    31    39      Cork County    28    37    56    38    55    51      D.M.R. Eastern    29    38    40    31    46    57      D.M.R. North Central    <    <    <    <    <    <      D.M.R. Northern    62    78    119    82    126    111      D.M.R. South Central    10    13    <    <    14    <      D.M.R. Southern    41    53    39    57    76    39      D.M.R. Western    30    53    83    66    77    67      Donegal    37    55    39    36    70    46      Galway Div    22    27    25    26    29    23      Kerry    23    38    32    28    45    29      Kildare/Carlow    72    98    140    126    141    154      Laois/Offaly    29    37    46    49    53    55      Limerick    28    21    52    38    36    55      Louth/Cavan/Monaghan    38    79    65    49    94    85      Mayo/Roscommon/Longford    12    22    21    24    32    20      Meath/Westmeath    54    44    69    80    69    67      Sligo/Leitrim    12    11    16    14    15    15      Waterford/Kilkenny    18    31    24    31    48    34      Wexford/Wicklow    74    112    119    96    134    136      < fewer than 10                             * to 7th December 2025 ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 266. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration the number of firearm licenses issued for handguns, broken down by county, between 2020 and 2025, in tabular form; and if he will make a statement on the matter. [70653/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_210",
          "debateSectionId": "dbsect_210",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_210.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_266",
        "questionNumber": 266
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 320. Deputy Conor Sheehan asked the Minister for Health when routine specialist dental services will be reinstated for a school (details supplied); if she will review the long waiting lists for specialist dental procedures for children with special needs, to ensure timely access to care; and if she will make a statement on the matter. [70597/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_267",
          "debateSectionId": "dbsect_267",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_267.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_320",
        "questionNumber": 320
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  ESB is a commercial State body, under the aegis of my Department, established under the Electricity Supply Act 1927. ESB is a body corporate and a separate legal entity to the Department. This is a matter for ESB, therefore, the Deputy may wish to contact ESB directly via Oireachtas@esb.ie in relation to the Question raised. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 95. Deputy Conor Sheehan asked the Minister for Climate, Energy and the Environment if he will extend the statutory notice period by which the ESB must notify affected parties of scheduled works taking place that will result in disruption to service from one week; and if he will make a statement on the matter. [69102/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_106",
          "debateSectionId": "dbsect_106",
          "showAs": "Electricity Supply Board",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_106.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_95",
        "questionNumber": 95
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. As a commercial semi-state body, Córas Iompair Éireann (CIÉ) are responsible for the provision of pension schemes for their employees.  Regarding the recent engagement between CIÉ and the Trade Union Group (TUG) on the matter of the CIÉ Pension Schemes, the Department acknowledges the longstanding tradition within CIÉ of ensuring that terms and conditions of employees, which include pension provision, are negotiated collectively with recognised Trade Unions.  I welcome the constructive and collaborative approach of the Trade Union Group and CIÉ management in reaching agreement on a pathway forward, which is aimed at balancing the objectives of supporting the future sustainability of the schemes, protecting existing benefits for members of the scheme (including pensioners), and contributing to the overall financial stability of the CIÉ Group.  I acknowledge the positive outcome from the ballot held on the CIÉ Pension Proposal for both Schemes, which was agreed by CIÉ and the TUG in May of this year.  In line with the appropriate processes and compliance with all applicable requirements, my Department will continue to engage with CIÉ as well as financial advisors at NewERA, the Pensions Authority and the Department of Public Expenditure, Infrastructure, Public Services, Reform and Digitalisation on the next steps in progressing the agreement and bringing CIÉ pensions onto a more stable footing for the benefit of active, and retired scheme members.  Decisions regarding pension increases are ultimately a matter for the CIÉ Board as informed by actuarial advice and is subject to requirements imposed by statute and scheme rules. Accordingly, I have referred this aspect of the Deputy's question to CIÉ for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 183. Deputy Conor Sheehan asked the Minister for Transport when the statutory instrument to allow the CIÉ pensioners to receive their pay increase will be enacted; and if he will make a statement on the matter. [69080/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_174",
          "debateSectionId": "dbsect_174",
          "showAs": "Public Sector Pensions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_174.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Department of Justice, Home Affairs and Migration (Department) published their 'Sectoral Investment Plan: Justice Sector' (plan) on the 4th of December 2025. The plan includes capital projects for An Garda Síochána over the period of 2026 to 2030.  The second half of the plan published by the Department aims to bring several capital projects to construction for An Garda Síochána in 2029; including a new Garda Station for Castletroy, Co. Limerick.  On the basis of the priorities now published within the Department's plan, the Office of Public Works will be engaging with An Garda Síochána and the Department to identify and acquire a suitable site to support the Department's objectives. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 329. Deputy Conor Sheehan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an update on the site identification process for a site for a Garda station (details supplied); and if he will make a statement on the matter. [69060/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_294",
          "debateSectionId": "dbsect_294",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_294.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_329",
        "questionNumber": 329
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Affordability and the chance to own a home is at the heart of Government’s housing policy, as embodied within the new housing plan, Delivering Homes, Building Communities 2025 – 2030. The plan reinforces and expands the range of existing measures being implemented by Government to tackle the issues of supply and affordability, under a new Starter Homes Programme, which will deliver an average of 15,000 affordable housing supports annually to 2030.  In order to further drive the delivery of affordable housing under the new plan, local authorities will shortly commence the preparation of new Housing Delivery Action Plans (HDAP’s), for review by my Department, setting out how the Starter Homes Programme will be implemented within their area. These plans will be completed and published by the local authorities in 2026.  Each local authorities HDAP will be informed by the Housing Needs and Demand Assessment framework, which will identify annual affordable housing needs within their area. In preparing their HDAP, local authorities will engage and collaborate with their delivery partners, including the Land Development Agency and the Approved Housing Bodies. That engagement and delivery partner output will inform the local authority in planning their delivery to meet annual affordable need to 2030.  Quarterly housing delivery reports will continue to be published on the Department's website, to track affordable delivery output in each local authority area to 2030. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 484. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage when each local authority will be required to publish its Housing Delivery Action Plan; the target for the delivery of cost rental and affordable purchase homes by local authorities, approved housing bodies and the Land Development Agency is under Delivering Homes Building Communities from 2025 to 2030; and if he will make a statement on the matter. [69094/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_421",
          "debateSectionId": "dbsect_421",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_421.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_484",
        "questionNumber": 484
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Report of the Approved Housing Body Strategic Forum, published in November 2025, presents an ambitious and transformative vision for the AHB sector and sets out a roadmap of policy development reforms to enable the realisation of that vision over the years ahead.  While the vision outlined in the report is underpinned by a programme of reform for the sector over the next decade, my Department has been continually progressing policies to strengthen the sector since I came into office.  Work is already underway on several policy development reforms outlined within the Report of the Approved Housing Body Strategic Forum, as committed to in the National Housing Plan; Delivering Homes, Building Communities 2025 - 2030.  Furthermore, my Department will shortly establish a Sectoral Reform Working Group, involving key stakeholders, which will be tasked with progressing work on the more transformational policy development recommendations throughout the period of the National Housing Plan.  My Department is currently finalising the Terms of Reference for this Group, and has been in ongoing engagement with sectoral representative bodies and other key stakeholders to ensure membership of the working group includes those organisations and experts that will be needed to advance the ambitious policy development agenda over the coming years.  It is my intention that the Working Group will be established and commence its work in early Q1 2026. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 485. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage when the sectoral reform working group will be established; and if he will list the attendees; and if he will make a statement on the matter. [69095/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_422",
          "debateSectionId": "dbsect_422",
          "showAs": "Departmental Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_422.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_485",
        "questionNumber": 485
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The public wastewater networks and combined wastewater and storm water networks is the responsibility of Uisce Éireann. The storm water network in an urban area is the responsibility of the local authority.  Uisce Éireann has statutory responsibility for all aspects of water services planning, delivery and operation at national, regional and local levels. This includes any floods arising from public watermains, and responding to complaints received from members of the public. As Minister, I have no role in these matters.  Uisce Éireann has established a dedicated team to deal with representations and queries from public representatives. The team can be contacted via email to oireachtasmembers@water.ie or by telephone on a dedicated number, 0818 578 578. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 486. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage if Uisce Éireann or the local authority are responsible for foul water accumulations running from public roads into the back gardens of private residences (details supplied); and if he will make a statement on the matter. [69105/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_423",
          "debateSectionId": "dbsect_423",
          "showAs": "Water Quality",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_423.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_486",
        "questionNumber": 486
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 830. Deputy Conor Sheehan asked the Minister for Health the number of WTE speech and language therapists posts, by grade, that were filled at Kings Island Primary Care Centre in the years of 2024 and to-date in 2025, in tabular form; and if she will make a statement on the matter. [69017/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_680",
          "debateSectionId": "dbsect_680",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_680.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_830",
        "questionNumber": 830
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 831. Deputy Conor Sheehan asked the Minister for Health the number of WTE public health nurse posts filled within CHO3 in each of the years of 2023, 2024 and to-date in 2025, in tabular form; and if she will make a statement on the matter. [69018/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_681",
          "debateSectionId": "dbsect_681",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_681.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_831",
        "questionNumber": 831
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 832. Deputy Conor Sheehan asked the Minister for Health the number of WTE consultant cardiologists based at University Hospital Limerick in each of the years of 2023, 2024 and to-date in 2025, in tabular form; and if she will make a statement on the matter. [69019/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_682",
          "debateSectionId": "dbsect_682",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_682.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_832",
        "questionNumber": 832
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  It is recognised that endometriosis is a significant health issue for women in Ireland today and the HSE acknowledges that it is a difficult condition to diagnose and treat because of the variation of presentations which can impact the physical and mental wellbeing of patients. Endometriosis is a chronic disease with high recurrence rates, for which there is no definitive cure.  On 18 October I launched the National Framework for the management of Endometriosis. The Framework sets out for the first time in Ireland a defined clinical pathway for women with endometriosis, which spans primary to secondary care to specialist complex care in tertiary settings.  Most women experiencing signs and symptoms of endometriosis present to their local GP in the community. In line with clinical guidelines GPs are encouraged to initiate treatment for suspected endometriosis and may refer women with suspected endometriosis to general gynaecology services in their local hospital.  Regional Specialist Centres for moderate cases have been established in the Rotunda, the Coombe, and Limerick, with clinics under further development in Galway and the National Maternity Hospital.  Two supra-regional specialist centres, in Tallaght and Cork, have been established for the management of complex endometriosis cases.  All endometriosis sites are operational and taking referrals. Treatment including surgical intervention is being provided across the network.  Additional funding has been provided this year to expand these services through the recruitment of more personnel to provide multidisciplinary care at both supra-regional and regional level.  The Framework was officially published in October of this year. Funding of over €5 million has already been invested in specialist endometriosis services since 2021. In addition, endometriosis surgeries have been and continue to be performed in other acute gynaecology services.  The HSE has carried out an analysis of the short term and medium-term requirements to build adequate capacity, improve clinical pathways and increase expertise within our endometriosis services. The HSE’s budget for 2026 will be €27.4 billion, an increase of 6.2% on 2025. This investment will enable expansion and improvement in our health services, including endometriosis.  The Endometriosis Surgery Abroad Interim Scheme commenced from the 18 October and will operate in addition to the existing treatment abroad pathways, including the EU Treatment Abroad Scheme, the EU Cross Border Directive and Northern Ireland Planned Healthcare Schemes. The interim scheme will cover costs for the transport abroad and for healthcare provided, paid directly to the hospital.  Where a person accesses private healthcare in Ireland there is no facility for the cost of that care to be reimbursed by the public health system. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 886. Deputy Conor Sheehan asked the Minister for Health if the new endometriosis framework will be applied retrospectively to provide reimbursement and supports to those who were forced to pay for treatment privately prior to the introduction of the framework; and if she will make a statement on the matter. [69182/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_732",
          "debateSectionId": "dbsect_732",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_732.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_886",
        "questionNumber": 886
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The National Transport Authority (NTA) is the independent transport regulator of the small public service vehicle (SPSV) sector, and I am not involved in the day-to-day operations of that sector.  Section 24 of the Consolidated Taxi Regulation Acts 2013 & 2016 empowers the NTA Board to make a “Maximum Fares Order” fixing the maximum fare that may be charged by the driver of a taxi for any journey. The current maximum fares order took effect in December 2024, and a maximum fare review is carried out approximately every 2 years. The NTA has conducted these reviews since 2011. Hackneys and limousines agree their fares in advance and do not use a meter.  The Taxi Regulation (Maximum Fares) Order 2024 increased taxi fares by an average of 9% and ensures that taxi fares continue to reflect the rising costs associated with operating a taxi in Ireland. This increase includes a special rate for the weekend peak, year-round, to incentivise more drivers to service the night-time economy. The 2024 Order built on the 2022 Maximum Fares Order in which a 12% increase on fares was introduced.  As set out in the legislation, charging more than this maximum fare can lead to a prosecution, however, charging below the maximum fare is permitted. I understand that the Uber Fixed Price offer does not breach the maximum fare regulatory provisions for taxis or constitute an offence associated with the misuse of taximeters.  I issued a letter to the NTA on 19 November last asking that they clarify the regulatory position on the Uber fixed price fare for the information of taxi operators and public representatives alike. I also recently met with the Advisory Committee on SPSVs, whose role it is to provide advice to the Minister and the NTA in relation to issues relevant to SPSVs and their drivers, where the matter was discussed. I intend to further engage with SPSV sectoral representatives on this issue, once I receive the regulatory clarification from the NTA.  In relation to student discounted fares on public transport, the NTA has responsibility for the regulation of fares charged to passengers in respect of public transport services provided under public service obligation (PSO) contracts. In light of the NTA's responsibility in this area, I have forwarded your question to the NTA for further information. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 206. Deputy Conor Sheehan asked the Minister for Transport his views on a matter (details supplied); and if he will make a statement on the matter. [68611/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Taxi Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_206",
        "questionNumber": 206
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The information requested by the Deputy is currently being compiled by my department and will be provided as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 291. Deputy Conor Sheehan asked the Minister for Education and Youth the amount spent in the years 2020 to 2025 on prefabricated classrooms, in tabular form; and if she will make a statement on the matter. [68863/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_291",
        "questionNumber": 291
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I should explain that applications relating to the provision of funding for issues relating to an existing school building, including for asbestos remediation, can fall under a number of different delivery mechanisms including, most frequently, the Emergency Works Scheme.  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation. An emergency is deemed to be a situation which poses an immediate risk to health, life, property, or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The Department does not have a centralised record of schools where asbestos has been removed and the associated costings. It may be the case that the asbestos discovery and removal has been instigated by other works in a school.  Where asbestos is discovered it is dealt with in accordance with the appropriate guidelines.  Please note that it is open to a school to make an application for EWS funding for an emergency situation in their school. Schools can do this by completing the online Emergency Works Application Form available through the Esinet system. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 292. Deputy Conor Sheehan asked the Minister for Education and Youth the number of schools where asbestos was found to be present, and the amount spent on the management and removal of asbestos in schools, between 2020 and 2025, in tabular form; and if she will make a statement on the matter. [68864/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_278",
          "debateSectionId": "dbsect_278",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_278.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_292",
        "questionNumber": 292
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 354. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage the criteria considered when the threshold for entry to the Croí Cónaithe scheme was set at 20-units; if a viability study was carried out to ensure that schemes below 20 units are more viable, than those above 20-units; if there is scope for this to be reconsidered; and if he will make a statement on the matter. [68979/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_329",
          "debateSectionId": "dbsect_329",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_354",
        "questionNumber": 354
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The Wild Salmon and Sea Trout Tagging Scheme Regulations 2018 (S..I. No. 585/2018) as amended, inter alia, provide for measures regarding the use of logbooks for salmon and sea trout angling.  Currently, I have no plans to amend these provisions dealing with logbooks. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 32. Deputy Conor Sheehan asked the Minister for Climate, Energy and the Environment his plans to change the rules governing the logbook for salmon or sea trout angling, allowing anglers to retrospectively produce a logbook as was the case previously; and if he will make a statement on the matter. [67681/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_36",
          "debateSectionId": "dbsect_36",
          "showAs": "Angling Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_36.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_32",
        "questionNumber": 32
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The NTA is the independent transport regulator of the small public service vehicle (SPSV) sector, and I am not involved in the day-to-day operations of that sector.  Ireland's SPSV regulatory framework requires that all drivers and vehicles are licensed, as a means of protecting the consumer and helping ensure public safety. Furthermore, no special regulations have been developed to govern the carriage of passengers by passenger cars which are not SPSVs. Therefore, the classic model where anyone with a car and the relevant App may provide taxi services, does not exist here. The protection of the consumer and personal safety are vital objectives and must continue to be central to how the SPSV industry is regulated and operated.  Uber has been operating as a licensed dispatch operator in Ireland since 2014 and, as it is considered a transport service which offers the carriage of passengers for reward, it is subject to the same regulations as all SPSVs in Ireland. A SPSV dispatch operator is an individual or organisation that provides a service for taking bookings for SPSV services that are delivered by someone else, or who provides a service that enables intending passengers to arrange the hire of an SPSV themselves. The NTA grants dispatch operator licences to individuals or companies, such as Uber which meets set criteria. Dispatch operators have an important role to play in providing a first-class service to the travelling public and improving the delivery of door-to-door services to people with disabilities.  Section 24 of the Consolidated Taxi Regulation Acts 2013 & 2016 empowers the NTA Board to make a “Maximum Fares Order” fixing the maximum fare that may be charged by the driver of a taxi for any journey. The current maximum fares order took effect in December 2024, and a maximum fare review is carried out approximately every 2 years. The NTA has conducted these reviews since 2011. Hackneys and limousines agree their fares in advance and do not use a meter.  The NTA's most recent fare review was undertaken between November 2023 and March 2024. During this review, the NTA took account of the most significant economic issues that were relevant to the SPSV sector which included: inflation and cost of living, fuel prices and energy supply, geopolitical uncertainty and increased public transport availability. Following this review, and a public consultation on the matter, the NTA introduced the Taxi Regulation (Maximum Fares) Order 2024 which increased taxi fares by an average of 9%. This came into operation on 1 December 2024 and ensures that taxi fares continue to reflect the rising costs associated with operating a taxi in Ireland. This increase includes a special rate for the weekend peak, 12 midnight to 4.00am, on Friday night into Saturday morning and Saturday night into Sunday morning, year-round, to incentivise more drivers to service the night-time economy. This built on the 2022 Maximum Fares Order in which a 12% increase on fares was introduced.  As set out in the legislation, charging more than this maximum fare can lead to a prosecution, however, charging below the maximum fare is permitted.  I issued a letter to the NTA on 19 November last asking that they clarify the regulatory position on the Uber fixed price fare for the information of taxi operators and public representatives alike. I also met with the Advisory Committee on SPSVs on 27th November whose role it is to provide advice to the Minister and the NTA in relation to issues relevant to SPSVs and their drivers, where the matter was discussed. I intend to further engage with SPSV sectoral representatives on this issue, once I receive the regulatory clarification from the NTA.  SPSV operators are self-employed and may decide whether (or not) to sign-up with a licensed dispatch operator, such as Uber. They are not obliged to be affiliated with any dispatch operator but where they choose to do so, they are free to contract with a dispatch operator of their choice. They also decide on their own hours of work within the SPSV regulatory framework. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 146. Deputy Conor Sheehan asked the Minister for Transport his views on taxi regulation matters (details supplied); and if he will make a statement on the matter. [68094/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_132",
          "debateSectionId": "dbsect_132",
          "showAs": "Taxi Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_132.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_146",
        "questionNumber": 146
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  My Department is working on measures to strengthen competition and consumer protection, in line with both commitment from the Programme for Government and actions from the Action Plan on Competitiveness and Productivity, which includes targeted reforms within the CCPC’s remit . The Department  is undertaking a review of the current legislative framework governing consumer protection fines, with the objective of strengthening enforcement provisions and ensuring greater deterrence against breaches.  Traders in Ireland are free to set and change their prices for goods and services, based on demand, once they do so independently and in line with consumer protection legislation.  Dynamic pricing is a common practice in sectors such as the airline and hotel industry, where prices vary based on demand and timing. The practice is not prohibited if it complies with consumer protection law. Price gouging is not legally defined but generally refers to charging excessive prices during crises.  Consumer law requires traders to provide certain information to consumers before purchase and prohibits misleading, aggressive, or unfair practices. This includes the total price, inclusive of taxes and fees, allowing consumers to make the informed decision in advance of the sale, whether to purchase or not.  The CCPC is the independent statutory body which enforces these rules and can act against any non-compliance. Any consumer who feels they have been misled or subjected to unfair pricing practices can contact the CCPC. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 194. Deputy Conor Sheehan asked the Minister for Enterprise, Tourism and Employment the action his Department will take to protect consumers in terms of price gouging arising from dynamic pricing used by airlines; and if he will make a statement on the matter. [67861/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_178",
          "debateSectionId": "dbsect_178",
          "showAs": "Aviation Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_178.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_194",
        "questionNumber": 194
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The State Examination Commission (SEC) has statutory responsibility for the administration of the State certificate examinations.  In view of this, I have asked the SEC to respond directly to you with the information you have requested. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 246. Deputy Conor Sheehan asked the Minister for Education and Youth if an educational facility (details supplied) is required to attain examinations centre status in order for students to submit coursework for Leaving Certificate 2026 in light of the recent guidance in the Coursework Rules &amp; Procedures 2025-2026 issued by the State Examinations Commission; and if she will make a statement on the matter. [67616/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_230",
          "debateSectionId": "dbsect_230",
          "showAs": "State Examinations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_230.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_246",
        "questionNumber": 246
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Tailte Éireann is an independent Government agency under the aegis of my Department. Tailte Éireann provide a property registration system, property valuation service, and national mapping and surveying infrastructure for the State. Under Section 8(6) of the Tailte Éireann Act 2022. Tailte Éireann is independent in the performance of its functions.  Tailte Éireann’s Central Filing Repository in Santry which houses filed Instruments has reopened and Tailte Éireann is accepting Copy Instrument requests for all Instruments. The recent closure led to service disruption for the Copy Instrument service in respect of access to Instruments dated pre-2006.  It is understood from Tailte Éireann that remedial works to remove asbestos and ensure safe access for Tailte Éireann's staff and all those accessing the facility continues to be carried out by the Office of Public Works (OPW) as accommodation provider. The works will be fully completed by 10 December 2025.  Tailte Éireann understands the difficulties the recent closure caused to customers and regrets any inconvenience. Tailte Éireann will provide further updates via its website, www.tailte.ie. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 341. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage if there is difficulty or delays accessing documents dated prior to 2006 held by Tailte Éireann due to asbestos contamination in a building storing them; and if he will make a statement on the matter. [67691/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_341",
        "questionNumber": 341
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 308 and 353 together.  I am happy to give an update on the progress on the review of exempted development that has been made so far in 2025, including the successful public consultation that took place over the Summer when there was significant engagement with the public and relevant stakeholders on exempted development regulations, with over 900 submissions received via the online consultation portal.  These submissions have been reviewed over the autumn and will inform the new draft Exempted Development Regulations which will be implemented on a phased basis, by theme, with the exemptions relating to domestic dwellings being prioritised and forthcoming in the coming months.  When completed, the new draft Exempted Development regulations are subject to Environmental consideration, before being laid before the Houses of the Oireachtas. This will also necessitate engagement with the Joint Oireachtas Committee for Housing, Local Government and Heritage.  It is intended that new Regulations under the Act of 2024 will be signed into law in tandem with the commencement of Part 2 and Part 4 of the Act of 2024 and the updated exempted development provisions will form part of the new Regulations.  In the meantime, the provisions of the Planning and Development Act 2000, as amended (Act of 2000), and associated Planning and Development Regulations 2001 (Regulations of 2001) remain in force until the relevant sections of the Act of 2024 are commenced and the corresponding sections of the Act of 2000 are repealed. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 353. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage his plans to conduct an environmental impact assessment in terms of the revised exempted development provisions; and if he will make a statement on the matter. [68009/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_353",
        "questionNumber": 353
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department operates a number of funding programmes that assist local authorities to work in partnership with Approved Housing Bodies (AHBs) to acquire and construct social and affordable housing units.  Certain AHBs within the sector have sought the introduction of a ‘construction-specific’ funding model to address alleged issues of viability, including but not limited to funding construction interest payments, as well as a mechanism to reflect the payment of management costs that are applicable on the date of completion of housing schemes.  In this regard, my Department operates the Payment and Availability - Capital Advance Leasing Facility (P&A-CALF) Funding Scheme, which provides finance to AHBs, via local authorities, for the acquisition, construction and maintenance of social housing units.  A project is currently underway within my Department to examine the overall financial impact of the P&A-CALF Funding Scheme on the main AHBs that have utilised the Scheme since its establishment in the year 2011. Indecon International Economic and Strategic Consultants have been appointed by my Department to assist in this research, and an element of Indecon's work is to examine whether a construction-specific funding model for AHBs should be developed to help mitigate the construction risk process and enhance construction viability for the AHB sector.  The consultants are due to report in April 2026, and I will further consider the merits or otherwise of a construction-specific funding model for the AHB sector when this work is to hand. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 356. Deputy Conor Sheehan asked the Minister for Housing, Local Government and Heritage his plans to develop a construction specific funding model for the AHB sector to allow the sector to increase its direct delivery capacity; and if he will make a statement on the matter. [68097/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_318",
          "debateSectionId": "dbsect_318",
          "showAs": "Approved Housing Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_318.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_356",
        "questionNumber": 356
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 392 and 393 together.  While the Department of Justice, Home Affairs and Migration is the competent authority for the import and export of firearms, An Garda Síochána has a range of functions with regard to the operation of firearms legislation - including the issuing of firearms certificates and authorisations - and remains the competent authority for the licensing of firearms within the State.  The Firearms (Firearm Certificates for Non-Residents) Act 2000 gives the authority for granting licences to Superintendents of An Garda Síochána. Superintendents, when considering firearms licence applications, are considered 'persona designata' and cannot have their decision-making process fettered in any way. As such, neither I as Minister, nor my Department has any role in the issuing or otherwise of firearms certificates.  I am advised by An Garda Síochána that the attached table provides figures for the number of firearms certificates issued by Garda Division between 2020 and 2025, and the total number of refusals for each year. A breakdown of refusals by Garda Division is not possible due to low volumes and the need for excessive redaction.  [<a skillset//data.oireachtas.ie/ie/oireachtas/debates/questions/supportingDocumentation/2025-12-02_pq-392_en.docx\">Firearms Certificates</a>] ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 392. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration the number of firearm certificates issued, broken down by county, between 2020 and 2025, in tabular form; and if he will make a statement on the matter. [67274/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_352",
          "debateSectionId": "dbsect_352",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_392",
        "questionNumber": 392
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 392 and 393 together.  While the Department of Justice, Home Affairs and Migration is the competent authority for the import and export of firearms, An Garda Síochána has a range of functions with regard to the operation of firearms legislation - including the issuing of firearms certificates and authorisations - and remains the competent authority for the licensing of firearms within the State.  The Firearms (Firearm Certificates for Non-Residents) Act 2000 gives the authority for granting licences to Superintendents of An Garda Síochána. Superintendents, when considering firearms licence applications, are considered 'persona designata' and cannot have their decision-making process fettered in any way. As such, neither I as Minister, nor my Department has any role in the issuing or otherwise of firearms certificates.  I am advised by An Garda Síochána that the attached table provides figures for the number of firearms certificates issued by Garda Division between 2020 and 2025, and the total number of refusals for each year. A breakdown of refusals by Garda Division is not possible due to low volumes and the need for excessive redaction.  [<a skillset//data.oireachtas.ie/ie/oireachtas/debates/questions/supportingDocumentation/2025-12-02_pq-392_en.docx\">Firearms Certificates</a>] ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 393. Deputy Conor Sheehan asked the Minister for Justice, Home Affairs and Migration the number of firearm certificates refused, broken down by county, between 2020 and 2025, in tabular form; and if he will make a statement on the matter. [67275/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_352",
          "debateSectionId": "dbsect_352",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_393",
        "questionNumber": 393
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Dentists Act 1985 establishes the Dental Council as the regulatory body for the dental profession in Ireland. As such, issues concerning the registration of dentists are a matter for the Dental Council to consider.  The Dental Council recommends that applicants allow for the registration process to take three months. While it aims to finalise applications as quickly as possible, delays can occur due to incomplete applications or if additional information is required.  As the matters you have raised relate to operational Dental Council matters, the correspondence has been forwarded to the Dental Council who will respond to your directly. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 562. Deputy Conor Sheehan asked the Minister for Health the status of an application to the Dental Council (details supplied); the reason for the delay in processing same; and if she will make a statement on the matter. [67556/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_498",
          "debateSectionId": "dbsect_498",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_498.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_562",
        "questionNumber": 562
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 593. Deputy Conor Sheehan asked the Minister for Health the number of persons prescribed the weight loss drug ozempic, by county from 2023 to date in 2025, in tabular form. [67730/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_528",
          "debateSectionId": "dbsect_528",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_528.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_593",
        "questionNumber": 593
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, I have asked the HSE for an update in this matter.  The HSE has advised that it is committed to providing access to as many medicines as possible, in as timely a fashion as possible, from the resources available (provided) to it.  The HSE robustly assesses applications for pricing and reimbursement to make sure that it can stretch available resources as far as possible and to deliver the best value in relation to each medicine and ultimately more medicines to Irish citizens and patients.  HSE decisions on which medicines are reimbursed by the taxpayer are made on objective, scientific and economic grounds.  There are formal processes which govern applications for the pricing and reimbursement of medicines, and new uses of existing medicines, to be funded and / or reimbursed.  The HSE considers the following criteria prior to making any decision on pricing / reimbursement, in line with the Health (Pricing and Supply of Medical Goods) Act 2013:  (1) The health needs of the public,  (2) The cost effectiveness of meeting health needs by supplying the item concerned rather than providing other health services,  (3) The availability and suitability of items for supply or reimbursement,  (4) The proposed costs, benefits, and risks of the item or listed item relative to therapeutically similar items or listed items provided in other health service settings and the level of certainty in relation to the evidence of those costs, benefits and risks,  (5) The potential or actual budget impact of the item or listed item,  (6) The clinical need for the item or listed item,  (7) The appropriate level of clinical supervision required in relation to the item to ensure patient safety,  (8) The efficacy (performance in trial), effectiveness (performance in real situations) and added therapeutic benefit against existing standards of treatment (how much better it treats a condition than existing therapies) and,  (9) The resources available to the HSE.  In terms of the specific details of the application for pricing and reimbursement of tirzepatide (Mounjaro®):  Type 2 diabetes mellitus  • The HSE received an application for pricing and reimbursement of tirzepatide (Mounjaro®) on the 24th January 2024 from Eli Lilly (the applicant) for the treatment of adults with insufficiently controlled type 2 diabetes mellitus as an adjunct to diet and exercise: as monotherapy when metformin is considered inappropriate due to intolerance or contraindications, or in addition to other medicinal products for the treatment of diabetes.  • The first step in the process is the submission of a Rapid Review dossier (a clinical and economic dossier) to the National Centre for Pharmacoeconomics (NCPE) for assessment. The HSE commissioned the Rapid Review process on the 24th January 2024.  • The NCPE Rapid Review assessment report was received by the HSE on the 6th February 2024. A full health technology assessment (HTA) was recommended to assess the clinical effectiveness and cost effectiveness of tirzepatide (Mounjaro®) compared with the current standard of care.  • The HSE commissioned a full HTA on the 1st March 2024 as per agreed processes.  • The NCPE publishes details of medicines where the HSE has commissioned a Rapid Review assessment and / or a full health technology assessment on their website. The website is updated at regular intervals and includes assessment outcomes and updates on reimbursement for each individual medicine and indication listed. Details of the assessment(s) of tirzepatide (Mounjaro®) for Type 2 diabetes mellitus are available at: Tirzepatide (Mounjaro®). HTA ID: 24003 | National Centre for Pharmacoeconomics  • The HSE Corporate Pharmaceutical Unit (CPU) is the interface between the HSE and the Pharmaceutical Industry in relation to medicine pricing and reimbursement applications.  • The Drugs Group is the national committee which the HSE has in place to make recommendations on the pricing and reimbursement of medicines. The membership of the HSE Drugs Group includes public interest members. The pharmacoeconomic report will be reviewed by the HSE Drugs Group along with the outputs of any commercial negotiations, and any patient group submission(s) received. The HSE Drugs Group will consider all of the evidence and make a recommendation to the HSE Senior Leadership Team.  • The decision making authority in the HSE is the HSE Senior Leadership Team. The HSE Senior Leadership Team decides on the basis of all the demands it is faced with (across all services) whether it can fund a new medicine, or new use of an existing medicine, from the resources that have been provided to it in line with the Health (Pricing and Supply of Medical Goods) Act 2013.  Weight management  • The HSE received an application for pricing and reimbursement of tirzepatide (Mounjaro®) on the 24th June 2024 from Eli Lilly (the applicant) indicated as an adjunct to a reduced-calorie diet and increased physical activity for weight management, including weight loss and weight maintenance, in adults with an initial Body Mass Index (BMI) of 30 kg/m2 (obesity) or 27 kg/m2 to < 30 kg/m2 (overweight) in the presence of at least one weight-related comorbid condition (e.g., hypertension, dyslipidaemia, obstructive sleep apnoea, cardiovascular disease, prediabetes, or type 2 diabetes mellitus).  • The first step in the process is the submission of a Rapid Review dossier (a clinical and economic dossier) to the National Centre for Pharmacoeconomics (NCPE) for assessment. The HSE commissioned the Rapid Review process on the 24th June 2024.  • The NCPE Rapid Review assessment report was received by the HSE on the 30th July 2024. A full HTA was recommended to assess the clinical effectiveness and cost effectiveness of tirzepatide (Mounjaro®) compared with the current standard of care.  • The HSE commissioned a full Health Technology Assessment (HTA) on the 27th August 2024 as per agreed processes.  • The NCPE publishes details of medicines where the HSE has commissioned a Rapid Review assessment and / or a full health technology assessment on their website. The website is updated at regular intervals and includes assessment outcomes and updates on reimbursement for each individual medicine and indication listed. Details of the assessment(s) of tirzepatide (Mounjaro®) for weight management are available at: Tirzepatide (Mounjaro®). HTA ID: 24024 | National Centre for Pharmacoeconomics  • The HSE Corporate Pharmaceutical Unit (CPU) is the interface between the HSE and the Pharmaceutical Industry in relation to medicine pricing and reimbursement applications.  • The Drugs Group is the national committee which the HSE has in place to make recommendations on the pricing and reimbursement of medicines. The membership of the HSE Drugs Group includes public interest members. The pharmacoeconomic report will be reviewed by the HSE Drugs Group along with the outputs of commercial negotiations, and any patient group submission(s) received. The HSE Drugs Group will consider all of the evidence and make a recommendation to the HSE Senior Leadership Team.  • The decision making authority in the HSE is the HSE Senior Leadership Team. The HSE Senior Leadership Team decides on the basis of all the demands it is faced with (across all services) whether it can fund a new medicine, or new use of an existing medicine, from the resources that have been provided to it in line with the Health (Pricing and Supply of Medical Goods) Act 2013.  • Both applications remain under consideration with the HSE. The HSE cannot make any comment on possible outcomes from the ongoing process.  As tirzepatide (Mounjaro®) is not reimbursed the HSE has no record of the number of patients prescribed tirzepatide (Mounjaro®). In terms of the private market the HSE has no oversight of medicines prescribed privately to patients. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 594. Deputy Conor Sheehan asked the Minister for Health the number of persons prescribed the weight loss drug mounjaro, by county, from 2023 to date in 2025, in tabular form. [67731/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_529",
          "debateSectionId": "dbsect_529",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_529.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_594",
        "questionNumber": 594
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Economic Social Intervention Fund is a matter for my colleague, the Minister for Housing, Local Government and Heritage.  At the same time, my Department continues to prioritise investment in community infrastructure across the country. The Community Centre Investment Fund was introduced to provide high quality, accessible, community spaces that are available to all groups in all communities in both rural and urban areas. Some €110 million has been allocated since 2022 for the enhancement and refurbishment of existing community centres and for the construction of new centres where such a need has been identified.  I am committed to delivering further iterations of the fund in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. A new iteration of the scheme is expected to be in place next year to further support community centres such as the one referred to by the deputy.  My Department also supports community facilities with enhancement works through a range of other funding streams including through the CLÁR programme, LEADER and the Town and Village Renewal Scheme. I would encourage any interested organisations to check my Department’s website for information on funding opportunities and announcements. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 730. Deputy Conor Sheehan asked the Minister for Rural and Community Development and the Gaeltacht considering the reduction of regeneration funding in Limerick with the completion of the programme and specifically the phasing out of Economic Social Intervention Funding, if he will allocate additional funding for a centre (details supplied); and if he will make a statement on the matter. [68096/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-Sheehan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-Sheehan.D.2024-11-29",
          "showAs": "Conor Sheehan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_657",
          "debateSectionId": "dbsect_657",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_657.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_730",
        "questionNumber": 730
      },
      "contextDate": "2025-12-02"
    }
  ]
}