{
  "head": {
    "counts": {
      "questionCount": 129,
      "resultCount": 129
    }
  },
  "results": [
    {
      "contextDate": "2019-06-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-26/writtens/mul@/dbsect_92.xml"
            }
          },
          "debateSectionId": "dbsect_92",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-26/writtens/dbsect_92",
          "showAs": "Special Educational Needs Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-06-26/pq_97",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 97,
        "showAs": " 97. Deputy Helen McEntee asked the Minister for Education and Skills the reason the number of special needs assistants in a school (details supplied) is being reduced from four to three; and if he will make a statement on the matter. [27047/19] ",
        "answerText": " Minister for Education and Skills  The National Council for Special Education (NCSE) is responsible for allocating a quantum of Special Needs Assistant (SNA) support for each school annually taking into account the assessed care needs of children qualifying for SNA support enrolled in the school.  The NCSE allocates SNA support to schools in accordance with the criteria set out in Department Circular 0030/2014, which is available on my Department's website at www.education.ie, in order that students who have care needs can access SNA support as and when it is needed.  In considering applications for SNA support for individual pupils, the NCSE take account of the pupils' needs and consider the resources available to the school to identify whether additionality is needed or whether the school might reasonably be expected to meet the needs of the pupils from its current level of resources.  SNAs are not allocated to individual children but to schools as a school based resource.  SNA allocations to all schools can change from year to year as children with care needs leave the school, as new children with care needs enrol in a school and as children develop more independent living skills and their care needs diminish over time.  The NCSE Appeals Process may be invoked by a parent or a school where it is considered that a child was not granted access to SNA support because the requirements outlined in Circular 0030/2014 were not complied with. Schools may also appeal a decision, where the school considers that the NCSE, in applying Department policy, has not allocated the appropriate level of SNA support to the school to meet the special educational and/or care needs of the children concerned.  Where a school has received its allocation of SNA support for 2019/20, but wishes new enrolments or assessments to be considered, which were not taken into account when the initial allocation was made, they may continue to make applications to the NCSE.  The closing date for receipt of appeals in regard to SNA allocations is Friday 27th September 2019.  As this question relates to a particular school, I have referred the question to the NCSE for their direct reply. I do not have a role in making determinations in individual cases. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-06-26",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2019-06-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-26/writtens/mul@/dbsect_180.xml"
            }
          },
          "debateSectionId": "dbsect_180",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-26/writtens/dbsect_180",
          "showAs": "Medical Conditions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-06-26/pq_186",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 186,
        "showAs": " 186. Deputy Helen McEntee asked the Minister for Health the status of the ongoing investigation into Guillain-Barre syndrome; and if he will make a statement on the matter. [27141/19] ",
        "answerText": " Minister for Health  I have referred this PQ to the Health Service Executive for a direct reply as the HSE previously carried out the investigation into this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-06-26",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "question": {
        "date": "2016-05-24",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-24/writtens/dbsect_206",
          "showAs": "Waste Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-05-24/writtens/mul@/dbsect_206.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_206"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 231. Deputy Helen McEntee asked the Minister for the Environment, Community and Local Government the criteria for the proposed pay-by-weight charges including if he will provide concessions for families who generate more refuse due to health issues; and if he will make a statement on the matter. [11462/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-05-24/pq_231",
        "questionNumber": 231,
        "answerText": " Minister for the Environment, Community and Local Government  I propose to take Questions Nos. 231 and 239 together.  My Department has met groups that represent people with special needs to discuss and explore the impact of pay-by-weight charging on households with special needs. My Department has also been in consultation with the HSE and the waste management industry to discuss the issue and to try to find a workable and fair solution to this important matter. Notwithstanding the complexity of the issues involved, I am hopeful that a number of possible solutions being explored as a matter of urgency can address these difficult issues. "
      },
      "contextDate": "2016-05-24"
    },
    {
      "question": {
        "date": "2016-02-02",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/dbsect_294",
          "showAs": "Disability Services Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/mul@/dbsect_294.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_294"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 340. Deputy Helen McEntee asked the Minister for Health the status of funding being allocated to an organisation (details supplied); and if he will make a statement on the matter. [4139/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-02-02/pq_340",
        "questionNumber": 340,
        "answerText": " Minister of State at the Department of Health (Deputy Kathleen Lynch)  The Government will provide funding of €1.56 billion to the Disability Services Programme in 2016. The quantum of service to be provided with that funding, and the key service deliverables and priorities for the Disability Services Programme, are outlined in the HSE’s National Service Plan for 2016. The HSE is committed to protecting frontline services for people with disabilities to the greatest possible extent, and to maintaining a consistent level of service to that provided in 2015.  As the Deputy's question relates to service matters, I have arranged for the question to be referred to the Health Service Executive (HSE) for direct reply to the Deputy. If the Deputy has not received a reply from the HSE within 15 working days, he can contact my Private Office and they will follow the matter up with the HSE. "
      },
      "contextDate": "2016-02-02"
    },
    {
      "question": {
        "date": "2016-02-02",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/dbsect_513",
          "showAs": "Road Tolls",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-02-02/writtens/mul@/dbsect_513.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_513"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Transport",
          "roleType": null
        },
        "showAs": " 581. Deputy Helen McEntee asked the Minister for Transport, Tourism and Sport the status of the high cost of tolls for commuters from north County Meath using the M3 on a daily basis (details supplied).  [4140/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-02-02/pq_581",
        "questionNumber": 581,
        "answerText": " Minister for Transport, Tourism and Sport  As Minister for Transport, Tourism and Sport, I have responsibility for overall policy and funding in relation to the national roads programme. The planning, design and implementation of individual road projects is a matter for the Transport Infrastructure Ireland (formerly known as the NRA) under the Roads Acts 1993-2015 in conjunction with the relevant local authority.  More specifically, the statutory power to levy tolls on national roads, to make toll bye-laws and to enter into toll agreements with private investors in respect of national roads is vested in TII under Part V of the Roads Act 1993 (as amended by the Planning and Development Act 2000 and the Roads Act 2007).  Accordingly I am forwarding your question to TII for direct reply. Please advise my private office if you do not receive a reply within 10 working days. "
      },
      "contextDate": "2016-02-02"
    },
    {
      "question": {
        "date": "2016-01-27",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-27/writtens/dbsect_82",
          "showAs": "Paramilitary Groups",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-27/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_82"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 10. Deputy Helen McEntee asked the Minister for Justice and Equality her efforts to combat criminality by paramilitary organisations in the Leinster and Ulster Border region, further to the agreement of A Fresh Start - The Stormont House Agreement and Implementation Plan; and if she will make a statement on the matter.  [45028/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-27/pq_10",
        "questionNumber": 10,
        "answerText": " Minister for Justice and Equality  The talks leading to A Fresh Start - The Stormont House Agreement and implementation Plan included a focus on tackling cross-Border organised crime as part of the series of measures to support a culture of lawfulness and bring an end to paramilitarism in Northern Ireland.  The Agreement includes out a new structure to enhance and intensify North-South co-operation in tackling cross-Border organised crime, including that linked to paramilitarism. The Agreement establishes a Joint Agency Task Force to enhance efforts to tackle cross-Border organised crime and to facilitate the investigation and prosecution of those involved in it. The Joint Agency Task Force proposal was designed by the parties to the Agreement to build on the excellent North-South law enforcement co-operation that is taking place already.  A trilateral ministerial meeting was held on 21 December last to finalise the Joint Agency Task Force proposal. Along with the Minister for Foreign Affairs and Trade, I was happy to welcome the Secretary of State for Northern Ireland, Theresa Villiers MP, the Northern Ireland Justice Minister, David Ford MLA, the then First Minister, Peter Robinson MLA and deputy First Minister, Martin McGuinness MLA, to Dublin for the meeting. This trilateral meeting fulfilled the commitment under the Agreement to hold such a meeting of the Irish and British Governments and the Northern Ireland Executive. All Ministers were at one on the need to maintain a priority focus on tackling cross-Border organised crime between the jurisdictions.  The new Joint Agency Task Force will step up and intensify that co-operation at both the strategic and operational levels. Building on the current successes, I expect the agencies involved to further improve overall co-ordination in terms of strategic direction against the priority areas of organised crime identified and also in terms of the co-ordinated and joint deployment of front line operations aimed at disrupting, prosecuting and reducing cross-border organised crime.  The Task Force will be led by the police and revenue services and will be jointly chaired at a very senior level by a Deputy Commissioner of An Garda Síochána and an Assistant Chief Constable of the PSNI. This is essential to providing strong strategic direction and oversight to the front-line operational side.  The Task Force will integrate representatives from not only the police and revenue services, but also from other law enforcement agencies, including the Criminal Assets Bureau and the UK National Crime Agency, who can bring a particular expert focus on targeting and seizing the assets of those involved in organised crime. We know from our experience that seizing the proceeds of crime is a key means of undermining organised crime. The relevant law enforcement agencies with a remit to tackle, for example, environmental crime, such as illegal waste dumping, or immigration offences such as human trafficking for forced labour will be integrated into the Task Force.  The Task Force will provide a report on its work to the Justice Ministers North and South at their six-monthly Ministerial meetings under the framework of the Inter-Governmental Agreement on co-operation on criminal justice matters. It is the intention that these reports will be made public.  The joint chairs of the Task Force have already had a scoping meeting and the arrangements are being made for a meeting of the full Strategic Oversight Group in the near future. "
      },
      "contextDate": "2016-01-27"
    },
    {
      "question": {
        "date": "2016-01-26",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/dbsect_49",
          "showAs": "Civil Defence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-26/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_49"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Defence",
          "roleType": null
        },
        "showAs": " 71. Deputy Helen McEntee asked the Minister for Defence further to section 9 of his White Paper on Defence, his ambitions for strengthening the technological capacity of civic defence organisations which provide such important civic and community services in County Meath and throughout Ireland. [2650/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-26/pq_71",
        "questionNumber": 71,
        "answerText": " Minister for Defence  The White Paper on Defence, which was published in August 2015, sets out the policy framework for the Defence Organisation for the next ten years and beyond. The White Paper affirms the Government’s commitment to the continued development of Civil Defence.  The future of Civil Defence will be developed around its central strategic objective of supporting the Principal Response Agencies, (that is, an Garda Síochána, the HSE and the local authorities,) in a variety of emergency and non-emergency situations. This includes the large number of support roles set out in the Framework for Major Emergency Management (MEM) including assistance in dealing with a wide range of emergencies at national and local level.  Civil Defence will utilise new technologies that assist in delivering its core services. For example, Remotely Piloted Aircraft Systems (RPAS) are now being used by Civil Defence in missing persons searches. Civil Defence has also acquired TETRA radios allowing for efficient communications with the PRAs during emergencies.  Civil Defence has a well developed radio communications system. This operates on a national, regional and local level. For example, Meath Civil Defence has a very fine command and control vehicle which it makes available in support of the PRAs. These communication capabilities will be further developed according to need.  The Department of Defence will continue to provide, within available resources, the supports necessary to fulfil the mission of Civil Defence, including fit-for-purpose equipment, uniforms and Personal Protective Equipment. "
      },
      "contextDate": "2016-01-26"
    },
    {
      "question": {
        "date": "2016-01-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/dbsect_49",
          "showAs": "Fertiliser Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_49"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 21. Deputy Helen McEntee asked the Minister for Agriculture, Food and the Marine his efforts at the European Council of Ministers and his engagements with the European Commission to ensure a concerted European Union approach to tackling fertiliser prices; his efforts to support crop-production enterprises which are encountering historically high fertiliser prices and difficult market prices for produce; and if he will make a statement on the matter. [2201/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-21/pq_21",
        "questionNumber": 21,
        "answerText": " Minister for Agriculture, Food and the Marine  The Irish Fertiliser Industry does not currently manufacture nutrients in Ireland. The industry is almost entirely reliant on the importation of nutrients which are subsequently sold on as straights or blended into compound products. The predominant nutrient form used in the Irish context is Calcium Ammonium Nitrate (C.A.N) with over 80% of Nitrogen used in this form. Fertilisers are the second highest input cost on Irish farms after feedingstuffs. Fertiliser usage has seen a downward trend on Irish farms over the past 20 years and this is likely to be linked to enhanced efficiency of use, environmental controls and price increases.  Europe as a whole is also dependent on imports to meet the demand. Approximately 20% of supplies are imported into Europe. Fertiliser price, primarily nitrogen, is strongly linked to the price of natural gas, with the fuel input constituting over 75% of Nitrogen manufacturing cost. As a result, most fertilisers are produced in areas where local oil supplies are available at low cost. As a result the Middle-East, North Africa, Russia and the USA still maintain a competitive advantage over Europe in the manufacture of Nitrogen. While fuel prices have decreased considerably in recent times, it remains more economical to manufacture Nitrogen in regions outside of the European Union where natural gas is produced and pricing is more competitive. Phosphates and Potassium are also in limited supply within Europe. Rising global demand for fertiliser has also increased pressure on supplies across Europe. Currency exchange rates also impact and with the Euro trading weakly against the dollar this has contributed to the upward pressures on fertiliser prices. "
      },
      "contextDate": "2016-01-21"
    },
    {
      "question": {
        "date": "2016-01-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/dbsect_57",
          "showAs": "Dairy Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2016-01-21/writtens/mul@/dbsect_57.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_57"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 28. Deputy Helen McEntee asked the Minister for Agriculture, Food and the Marine if he will increase milk production; his efforts to ensure banks afford credit flexibility to farmers while the  dairy sector consolidates its expansion, given the market turbulence in adjusting to the abolition of dairy quotas and given significant borrowings by dairy farmers; and if he will make a statement on the matter.  [2202/16] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2016-01-21/pq_28",
        "questionNumber": 28,
        "answerText": " Minister for Agriculture, Food and the Marine  Production decisions are made by producers, taking prevailing market conditions as well as their efficiency of production and price of inputs into account. The abolition of dairy quotas in April 2015 allows farmers the freedom to make these production decisions on a commercial basis.  The price of milk and dairy commodities is determined by a range of factors, including supply and demand at international level. Food commodity markets including dairy markets have been characterised by significant levels of volatility for a number of years and this trend has continued throughout 2015 and into early 2016.  Factors contributing to global price volatility in 2015 include the Russian ban and the softening of Chinese demand on one side, coupled with increased production among key global producers including the EU on the supply side. The longer term demographic and demand perspectives remain positive and Irish dairy farmers are well placed to take full advantage of rising global demand.  I maintained ongoing contact with the Irish banks and have indicated the need to show flexibility in their dealings with farmers experiencing temporary cash flow difficulties in 2015 and into 2016. At the dairy forum in late September, I again reiterated these calls to the three main banks in attendance.  The Irish dairy sector is cost competitive and Teagasc figures indicate that Irish farmers have relatively low levels of indebtedness compared to counterparts in competitor countries. The banks assured me that they are sensitive to the temporary pressures on dairy farmers and will be flexible in their dealings with them. Banks have stressed the need for early engagement from those who see early financial pressure.  I am also in regular contact with the banks, co-ops and others about the development of lending products for farmers that are better adapted to the volatile global markets in which we operate.  The Government has also been proactive of course. Initiatives include provisions allowing dairy and other farmers to use income averaging over five years when it comes to paying income tax bills. This offers respite to the sector from a cash flow perspective. Furthermore, I have also ensured that priority has been given to measures for the dairy sector in the Rural Development Plan. The agreement at the Council of Agriculture Ministers late last year to increase the rate of single Farm Payment advance to 70% has been of assistance from a cash plan perspective as have the EU targeted aid payments for the sector, matched at national level, which on completion will have injected approaching €25 million in liquidity into the sector.  Also of relevance in this respect was my decision to make a 3 year interest free instalment arrangement available to all those affected by superlevy. This option has been availed of by approximately 3,700 producers and will be of assistance to farmers facing cash flow difficulties arising from super levy in the final year of the milk quota regime. "
      },
      "contextDate": "2016-01-21"
    },
    {
      "question": {
        "date": "2015-12-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-17/writtens/dbsect_52",
          "showAs": "Tourism Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-17/writtens/mul@/dbsect_52.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_52"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "showAs": " 23. Deputy Helen McEntee asked the Minister for Foreign Affairs and Trade further to his Dáil statement on 30 April 2015 regarding his efforts as Minister to promote Ireland's trade and export markets through his work with embassies, agencies and businesses, if he will update Dáil Éireann on his Department’s efforts to promote a particular initiative (details supplied).  [45027/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-17/pq_23",
        "questionNumber": 23,
        "answerText": " Minister for Foreign Affairs and Trade  I am pleased to have this opportunity to update the Deputy further on my Department’s promotion of ‘Ireland’s Ancient East’ since her question of 3 November 2015 on the same initiative.  While tourism falls under the portfolio of my Ministerial colleague, Paschal Donohoe, T.D., Minister for Transport, Tourism and Sport, the Deputy is no doubt aware of my own personal interest in promoting the high-quality tourism offerings available in our region.  Our Embassy network works closely with Tourism Ireland promoting Ireland as a tourism destination overall, in addition to specific initiatives such as ‘Ireland’s Ancient East’, and in highlighting individual regional attractions which might resonate in a particular market at a particular time.  I would like to bring to your attention a number of Embassy-supported events from around the world which promoted ‘Ireland’s Ancient East’, very often in close cooperation with Tourism Ireland, the State agency responsible for the overseas promotion of tourism to the island of Ireland. These events are in addition to those I mentioned in my previous response to the Deputy, intended to be representative rather than exhaustive, and do not take account of the Embassy network’s broader promotion of ‘Ireland’s Ancient East’ on social media or in an informal manner in the context of other events that promote Ireland.  The Embassy of Ireland in Norway has promoted the ‘Ireland’s Ancient East’ campaign via the organisation of a roundtable event with several Norwegian tour operators in conjunction with Tourism Ireland’s Nordic branch office. As part of this discussion there was a particular focus on the ‘Ireland’s Ancient East’ promotion.  Further afield, the Embassy of Ireland in China has worked with Tourism Ireland on promoting ‘Ireland’s Ancient East’ since June 2015. Tourism Ireland launched this destination during this year's China Sales Mission which took place in Beijing, Shanghai, Guangzhou and Chengdu. In addition, a bespoke trade and consumer ezine themed on ‘Ireland's Ancient East’ was widely circulated in September.  The Embassy of Ireland in Australia works with Tourism Ireland to promote tourism generally. During Canberra’s annual multicultural festival in February 2015, ‘Ireland’s Ancient East’ was promoted at the Ireland stand. More recently, the Deputy Consul General in Sydney attended a key trade event held at Sydney Tower on 2 November 2015 in which Tourism Ireland promoted ‘Ireland’s Ancient East’.  On a more general level, Ireland’s Permanent Mission to UNESCO in Paris assists in obtaining UNESCO recognition of appropriate sites in Ireland, which could include sites falling under the region covered by ‘Ireland’s Ancient East’.  Looking ahead, there are plans in train for promotion of ‘Ireland’s Ancient East’ in 2016, including across the key German market and, in February, the Embassy of Ireland in Denmark will support a Tourism Ireland-hosted workshop in Copenhagen aimed at the whole Scandinavian travel industry which will mark the official launch of ‘Ireland’s Ancient East’ in the Nordic region.  In 2016, Tourism Ireland in China will continue to promote Ireland's Ancient East through trade, digital and publicity channels. The month long St. Patrick’s Day festival, which is organised in several major cities by Team Ireland in China, will provide a major platform for promoting Ireland, including all of its tourism destinations. Promotional material highlighting ‘Ireland's Ancient East’ will be provided to partners in the travel industry during sales calls and at trade training sessions throughout 2016. In the second half of 2016 there will be an online campaign focussed on the region.  In South Africa, at the AGM of the Embassy-supported BISA (Business Ireland Southern Africa) network in Pretoria on Friday 13 November, the Tourism Ireland agent based in South Africa presented ‘Ireland’s Ancient East’ to the representatives present from Irish Business Networks in Johannesburg, Cape Town, Durban and Harare.  If the Deputy has specific thoughts on how the Embassy network, working closely with the State agencies and Department of Transport, Tourism and Sport, might additionally promote or showcase ‘Ireland’s Ancient East’ and other tourism initiatives, I would be very happy to discuss these with her. "
      },
      "contextDate": "2015-12-17"
    },
    {
      "contextDate": "2015-12-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-16/writtens/mul@/dbsect_66.xml"
            }
          },
          "debateSectionId": "dbsect_66",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-16/writtens/dbsect_66",
          "showAs": "Greenways Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-16/pq_21",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 21,
        "showAs": " 21. Deputy Helen McEntee asked the Minister for Transport, Tourism and Sport the status of a proposed project (details supplied), including its potential to unlock significant tourism sector employment opportunities; and if he will make a statement on the matter. [44876/15] ",
        "answerText": " Minister for Transport, Tourism and Sport  I am reiterating the information I supplied the Deputy with in response to the same question on 11 November last.  Under the National Cycle Network funding programme 2014-2016 Meath County Council submitted a proposal to my Department for the development of the Boyne Valley to Lakelands County Greenway.  While it was recognised that the proposal had considerable merit it was not possible to provide funding at that time given that the number of applications received far exceeded the resources available.  I met with a delegation from Meath County Council earlier this year to discuss progress on this project since the application was submitted in 2013. I was glad to learn that in the meantime the project team had progressed the detailed design and preparation of contract documents for the project while continuing to explore potential funding sources.  The cost of delivering the entire greenway is estimated to be in the region of €2.4 million. I understand from my meeting with the Council delegation that the project can be delivered in 2 phases. Phase 1 could run for a distance of 8 km from the town park in Navan to Wilkinstown which would represent a valuable amenity in itself.  Phase 2 will run from Wilkinstown to Kingscourt. Cavan County Council are also keen to commence this section of the greenway and the planning and design elements are at an advanced stage.  Given that all Department funding for the purpose of delivering greenways is now fully committed up until 2016, I would urge the Council to continue to progress this project in so far as their own resources allow. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-16",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-12-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-16/writtens/mul@/dbsect_194.xml"
            }
          },
          "debateSectionId": "dbsect_194",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-16/writtens/dbsect_194",
          "showAs": "Schools Building Projects Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-16/pq_153",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 153,
        "showAs": " 153. Deputy Helen McEntee asked the Minister for Education and Skills if a site for a school (details supplied) in County Meath has been confirmed. [45529/15] ",
        "answerText": " Minister for Education and Skills  I can confirm for the Deputy that the building project for the school in question will be constructed on the school's existing site.  The project is currently at an early stage of architectural planning and the stage 1 initial sketch design report was recently furnished to my Department for review. Upon completion of this review and subject to no issues arising, the project will be authorised to complete stage 2(a) which is the developed design stage, including the preparation of documentation to lodge for statutory approvals. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-16",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-12-15",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/mul@/dbsect_59.xml"
            }
          },
          "debateSectionId": "dbsect_59",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/dbsect_59",
          "showAs": "Wind Energy Guidelines"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-15/pq_50",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 50,
        "showAs": " 50. Deputy Helen McEntee asked the Minister for Communications, Energy and Natural Resources the status of his engagement with the Department of the Environment, Community and Local Government concerning justifiable and important environmental concerns expressed by the people of County Meath relating to Ireland's wind energy guidelines and the proposed North-South interconnector project; and if he will make a statement on the matter. [44828/15] ",
        "answerText": " Minister for Communications, Energy and Natural Resources  In December 2013, the Department of Environment, Community and Local Government began a review of the existing Wind Energy Development Guidelines. The review focused on the specific issues of noise, proximity, and shadow flicker. Submissions were received from around 7,500 organisations and members of the public during the public consultation period.  This is a very technical area and the engagement between the two departments is on-going. Studies have been obtained on various aspects of the issues, particularly noise - including separation distance - and detailed assessments of various options have been undertaken by the two Departments.  Any revisions to the guidelines following the conclusion of deliberations will be introduced by issuing the revised guidelines to planning authorities under Section 28 of the Planning and Development Act 2000, as amended.  In terms of the proposed North-South Transmission Line project, EirGrid, in discharging its duties as operator and developer of the national transmission grid, engages with communities and citizens on an on-going basis.  There has been extensive public consultation on the North-South Transmission Link project including statutory consultation as required under Regulation (EU) No. 347/2013 on guidelines for trans-European energy infrastructure and Section 182A of the Planning and Development Act, 2000, as amended.  EirGrid has also opened offices in Navan, Cootehill, and Carrickmacross and has appointed Community Liaison Officers and Agricultural Liaison Officers who are all involved in outreach to the local communities along the intended route of the North-South Transmission Line project. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-15",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-12-15",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/mul@/dbsect_425.xml"
            }
          },
          "debateSectionId": "dbsect_425",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/dbsect_425",
          "showAs": "Health Care Professionals"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-15/pq_485",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 485,
        "showAs": " 485. Deputy Helen McEntee asked the Minister for Health his plans to protect public health safety by distinguishing the difference between physiotherapists and physical therapists and to protect both titles under one register for use by members of the physiotherapy profession; and when he will make a ruling on this in order to protect the public and rule out any more confusion (details supplied). [45450/15] ",
        "answerText": " Minister for Health  The Physiotherapists Registration Board will soon make the necessary bye-laws under the Health and Social Care Professionals Act 2005 to allow it to establish its register early next year. The title of physiotherapist will, as a consequence, be protected for the exclusive use of the board's registrants when the register's 2 year transitional period ends in 2018.  I am currently examining the issue of also protecting the title of physical therapist under the Act. In the rest of the English speaking world the titles of physical therapist and physiotherapist are interchangeable and their users are qualified physiotherapists. In Ireland, however, the title is used by a number of practitioners who are not physiotherapists but who are competing with physiotherapists in the private sector in the provision of musculoskeletal therapies.  Earlier this year, having consulted with the Health and Social Care Professionals Council, I wrote to a number of relevant organisations regarding my proposal to protect the title of physical therapist as a variant of the title of physiotherapist and invited them to submit their views. The submissions are now being examined and I expect that I will make a decision on the matter before the end of the year that ensures public protection and appropriately addresses the legitimate concerns of all parties. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-15",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-12-15",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/mul@/dbsect_516.xml"
            }
          },
          "debateSectionId": "dbsect_516",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/dbsect_516",
          "showAs": "Renewable Energy Generation Targets"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-15/pq_600",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 600,
        "showAs": " 600. Deputy Helen McEntee asked the Minister for Communications, Energy and Natural Resources if Ireland can reach its 2020 climate change and energy security targets without constructing industrial wind farms in residential areas; if he will request EirGrid to engage meaningfully with local communities in counties Cavan, Monaghan and Meath regarding regional environmental concerns in respect of proposals for an interconnector project connecting the North of Ireland’s energy grid with that of the Republic of Ireland; and if he will make a statement on the matter.  [44052/15] ",
        "answerText": " Minister for Communications, Energy and Natural Resources  The 2009 EU Renewable Energy Directive set Ireland a legally binding target of meeting 16% of our energy requirements from renewable sources by 2020 and in order to reach that target, Ireland is committed to 40% of electricity demand from renewable sources. In 2014 8.6% of our energy consumption came from renewables, and renewables accounted for 22.7% of our electricity consumption. In setting a target for electricity from renewable sources, the Government has not set specific targets for given renewable technologies. To date, wind energy as the most cost effective of the technologies available to Ireland, has been the largest driver of growth in renewable electricity. The Government recognises that wind must be complemented by other policies to meet our renewable energy ambitions. In addition to our onshore wind resource, bioenergy, solar and other technologies may play a critical role in diversifying our renewable generation portfolio over the period to 2020.  In terms of the proposed North-South Transmission Link project, EirGrid, in discharging its duties as operator and developer of the national transmission grid, engages with communities and citizens on an on-going basis. There has been extensive public consultation on the North-South Transmission Link project including statutory consultation as required under Regulation (EU) No. 347/2013 on guidelines for trans-European energy infrastructure and Section 182A of the Planning and Development Act, 2000, as amended.  EirGrid has also opened offices in Navan, Cootehill, and Carrickmacross and has appointed Community Liaison Officers and Agricultural Liaison Officers who are all involved in outreach to the local communities along the intended route of the North-South Transmission Line project. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-15",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-12-15",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/mul@/dbsect_561.xml"
            }
          },
          "debateSectionId": "dbsect_561",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-15/writtens/dbsect_561",
          "showAs": "Tourism Promotion"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-15/pq_658",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 658,
        "showAs": " 658. Deputy Helen McEntee asked the Minister for Transport, Tourism and Sport the status of his efforts to develop the Ireland’s Ancient East project; and if he will make a statement on the matter. [44877/15] ",
        "answerText": " Minister for Transport, Tourism and Sport  While my Department provides the capital funding for investment in tourism propositions such as Ireland's Ancient East, it is not directly involved in developing or managing these, as this is an operational matter for the Board and Management of Fáilte Ireland.  I have therefore referred the Deputy's question to Fáilte Ireland for direct reply.  Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-15",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "question": {
        "date": "2015-12-10",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-10/writtens/dbsect_65",
          "showAs": "Wind Energy Guidelines",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-10/writtens/mul@/dbsect_65.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_65"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 38. Deputy Helen McEntee asked the Minister for the Environment, Community and Local Government the status of his engagements with the Department of Communications, Energy and Natural Resources on his stated objective to update wind energy guidelines; if industrial wind farms are appropriate for residential areas; and if he will make a statement on the matter. [44051/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-10/pq_38",
        "questionNumber": 38,
        "answerText": " Minister of State at the Department of the Environment, Community and Local Government  In December 2013, my Department published proposed “draft” revisions to the noise, setback distance and shadow flicker aspects of the 2006 Wind Energy Development Guidelines. These draft revisions proposed:  - the setting of a more stringent day and night noise limit of 40 decibels for future wind energy developments,  - a mandatory minimum setback distance of 500 metres between a wind turbine and the nearest dwelling for amenity considerations, and  - the complete elimination of shadow flicker between wind turbines and neighbouring dwellings.  A public consultation process was initiated on these proposed draft revisions to the Guidelines, which ran until 21 February 2014. My Department received submissions from 7,500 organisations and members of the public during this public consultation process. It is intended that the revisions to the 2006 Wind Energy Development Guidelines will be finalised as soon as possible. In this regard, account has to be taken of the extensive response to the public consultation in framing the final guidelines. Further work is also advancing to develop technical appendices to assist planning authorities with the practical application of the noise measurement aspects of the Wind Guidelines. My Department is advancing work on the Guidelines in conjunction with the Department of Communications, Energy and Natural Resources.  The revisions to the Wind Energy Development Guidelines 2006, when finalised, will be issued under Section 28 of the Planning and Development Act 2000, as amended. Planning authorities, and, where applicable, An Bord Pleanála are required to have regard to guidelines issued under Section 28 in the performance of their functions under the Planning Acts.  Proposals for the location of individual wind farms are a matter for the relevant developer taking account of several criteria including connectivity to the national grid.  When considering individual planning applications for such developments and the appropriateness of their location, planning authorities, including An Bord Pleanála where relevant, are required to have regard to local area and county development plans, local authority renewable energy strategies, the Wind Energy Development Guidelines issued under Section 28 of the Planning and Development Act 2000, as amended, and other relevant matters including existing residential development, existing wind energy developments, the local landscape and the natural and built heritage.  The 2006 Wind Energy Development Guidelines provide a guide to the analysis of suitable areas for wind energy by planning authorities, when preparing their development plans and renewable energy strategies. "
      },
      "contextDate": "2015-12-10"
    },
    {
      "question": {
        "date": "2015-12-09",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-09/writtens/dbsect_41",
          "showAs": "Schools Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-09/writtens/mul@/dbsect_41.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_41"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 12. Deputy Helen McEntee asked the Minister for Education and Skills if she needs to be more assertive with local authorities in setting out the parking and road safety requirements of schools; if her remit, which includes administrative responsibility for over 3,000 rural schools, requires a formal school car parking policy that takes account of the reliance on car transport in rural areas; if the shortage of parking facilities in three schools (details supplied) in County Meath is a significant safety concern for teachers, parents, pupils and public representatives; what is required to address these risks; and if she will make a statement on the matter. [43695/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-09/pq_12",
        "questionNumber": 12,
        "answerText": " Minister for Education and Skills  In general, individual school authorities are responsible, in the first instance, for ensuring the safety and welfare of children and others in their care.  The issue of road safety measures outside the vested site areas of schools on public roads, such as road signage, traffic calming measures etc., is a matter, for the relevant Local Authority. Local Authorities have the power to decide on road safety measures outside schools to ensure that measures are in place to protect the safety of local school children. My Department has no function in this matter.  I wish to advise the Deputy that my Department's Technical Guidance Document – TGD-020 sets out the general principles of Universal Design in schools, which includes guidance on car parking, set-down/pick up areas. In the case of school building projects, parking provision should be as stated in the guidance documents, subject to the planning requirements of the relevant Local Authority. "
      },
      "contextDate": "2015-12-09"
    },
    {
      "question": {
        "date": "2015-12-09",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-09/writtens/dbsect_68",
          "showAs": "Schools Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-09/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_68"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 39. Deputy Helen McEntee asked the Minister for Education and Skills if she needs to interact more directly and more proactively with local authorities in respect of road safety at rural schools; her views on the experiences of parents, teachers and pupils at three schools (details supplied) in County Meath, as examples of the problems that are arising from what she may regard as a current policy deficit; and if she will make a statement on the matter. [43696/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-09/pq_39",
        "questionNumber": 39,
        "answerText": " Minister for Education and Skills  In general, individual school authorities are responsible, in the first instance, for ensuring the safety and welfare of children and others in their care.  The issue of road safety measures outside the vested site areas of schools on public roads, such as road signage, traffic calming measures etc., is a matter, for the relevant Local Authority. Local Authorities have the power to decide on road safety measures outside schools to ensure that measures are in place to protect the safety of local school children. My Department has no function in this matter.  I wish to advise the Deputy that my Department's Technical Guidance Document – TGD-020 sets out the general principles of Universal Design in schools, which includes guidance on car parking, set-down/pick up areas. In the case of school building projects, parking provision should be as stated in the guidance documents, subject to the planning requirements of the relevant Local Authority. "
      },
      "contextDate": "2015-12-09"
    },
    {
      "question": {
        "date": "2015-12-08",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/dbsect_46",
          "showAs": "Built Heritage Jobs Leverage Scheme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/mul@/dbsect_46.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_46"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Arts",
          "roleType": null
        },
        "showAs": " 63. Deputy Helen McEntee asked the Minister for Arts, Heritage and the Gaeltacht the status of the recently announced built heritage investment fund; and if she will make a statement on the matter. [43457/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-08/pq_63",
        "questionNumber": 63,
        "answerText": " Minister for Arts, Heritage and the Gaeltacht  Funding for the protection of built heritage will continue to be provided by my Department via a number of schemes, which will be either directly administered or delivered through local authorities and agencies such as the Heritage Council. This year my Department operated a Structures at Risk Fund to enable conservation works to heritage structures, in both private and public ownership, protected under the Planning and Development Acts 2000, as amended, which are deemed to be at significant risk of deterioration. This fund, which has an allocation of €624,000 in 2015, is administered through the local authorities and encourages the regeneration and reuse of heritage properties and helps to secure the preservation of protected structures which might otherwise be lost. This fund, which is now closed, was open to two applications per local authority.  The Heritage Council, which my Department funds, also provides grants for the protection and preservation of the built heritage. It is primarily a matter for the Heritage Council to decide how its funding should be allocated across the range of research, education and conservation programmes it supports annually having regard to competing priorities for limited resources. The announcement of any proposed grant schemes can be monitored on www.heritagecouncil.ie .  The remainder of my Department’s built heritage capital budget for 2015 is focused on the conservation and presentation of the State's heritage portfolio, which is managed by the Office of Public Works.  The recently announced new €2 million investment scheme for the repair and conservation of protected structures – the Built Heritage Investment Scheme – will operate, via the Local Authorities, on the same model as the very successful Built Heritage Jobs Leverage Scheme (BHJLS), which ran in 2014, and is expected to support a significant number of projects across the country and create employment in the conservation and construction industries, while helping to regenerate urban and rural areas. This announcement will come as a welcome boost to the custodians of heritage properties.  It seeks to encourage the investment of private capital in a number of small-scale, labour intensive projects to repair and conserve historic structures and to support the employment of skilled and experienced conservation professionals, craft workers and trades people. Protected structures, proposed protected structures and structures that contribute to the character of an Architectural Conservation Area will be eligible for assistance.  The minimum level of funding awarded will be €2,500 with up to a maximum of €10,000 generally applicable, while up to a maximum of €15,000 will be available to the 6 city local authorities. The State’s contribution to each project must be matched by a similar contribution from the private sector per application. The scheme will operate through 2016 and will be administered by the local authorities, all of which have been informed of their allocations and the process and timelines involved.  With respect to 2016, my Department is currently finalising its consideration of the funding available for the protection and conservation of the built heritage next year in the context of its overall allocations. I will publish details of the funding schemes for 2016 as soon as these are finalised. "
      },
      "contextDate": "2015-12-08"
    },
    {
      "question": {
        "date": "2015-12-08",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/dbsect_60",
          "showAs": "Built Heritage Jobs Leverage Scheme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/mul@/dbsect_60.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_60"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Arts",
          "roleType": null
        },
        "showAs": " 76. Deputy Helen McEntee asked the Minister for Arts, Heritage and the Gaeltacht the supports she provides to protect the built heritage; and if she will make a statement on the matter. [43456/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-08/pq_76",
        "questionNumber": 76,
        "answerText": " Minister for Arts, Heritage and the Gaeltacht  Funding for the protection of built heritage will continue to be provided by my Department via a number of schemes, which will be either directly administered or delivered through local authorities and agencies such as the Heritage Council. This year my Department operated a Structures at Risk Fund to enable conservation works to heritage structures, in both private and public ownership, protected under the Planning and Development Acts 2000, as amended, which are deemed to be at significant risk of deterioration. This fund, which has an allocation of €624,000 in 2015, is administered through the local authorities and encourages the regeneration and reuse of heritage properties and helps to secure the preservation of protected structures which might otherwise be lost. This fund, which is now closed, was open to two applications per local authority.  The Heritage Council, which my Department funds, also provides grants for the protection and preservation of the built heritage. It is primarily a matter for the Heritage Council to decide how its funding should be allocated across the range of research, education and conservation programmes it supports annually having regard to competing priorities for limited resources. The announcement of any proposed grant schemes can be monitored on www.heritagecouncil.ie .  The remainder of my Department’s built heritage capital budget for 2015 is focused on the conservation and presentation of the State's heritage portfolio, which is managed by the Office of Public Works.  The recently announced new €2 million investment scheme for the repair and conservation of protected structures – the Built Heritage Investment Scheme – will operate, via the Local Authorities, on the same model as the very successful Built Heritage Jobs Leverage Scheme (BHJLS), which ran in 2014, and is expected to support a significant number of projects across the country and create employment in the conservation and construction industries, while helping to regenerate urban and rural areas. This announcement will come as a welcome boost to the custodians of heritage properties.  It seeks to encourage the investment of private capital in a number of small-scale, labour intensive projects to repair and conserve historic structures and to support the employment of skilled and experienced conservation professionals, craft workers and trades people. Protected structures, proposed protected structures and structures that contribute to the character of an Architectural Conservation Area will be eligible for assistance.  The minimum level of funding awarded will be €2,500 with up to a maximum of €10,000 generally applicable, while up to a maximum of €15,000 will be available to the 6 city local authorities. The State’s contribution to each project must be matched by a similar contribution from the private sector per application. The scheme will operate through 2016 and will be administered by the local authorities, all of which have been informed of their allocations and the process and timelines involved.  With respect to 2016, my Department is currently finalising its consideration of the funding available for the protection and conservation of the built heritage next year in the context of its overall allocations. I will publish details of the funding schemes for 2016 as soon as these are finalised. "
      },
      "contextDate": "2015-12-08"
    },
    {
      "question": {
        "date": "2015-12-08",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/dbsect_598",
          "showAs": "Commemorative Events",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/mul@/dbsect_598.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_598"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Arts",
          "roleType": null
        },
        "showAs": " 647. Deputy Helen McEntee asked the Minister for Arts, Heritage and the Gaeltacht the context of the commemorative projects in 2016 that will reflect on the lives and deaths of 3,500 Irish soldiers who died in combat at the Somme in northern France in 1916, if the industrial-scale slaughter at the Battle of the Somme demonstrates the vital need for institutions that facilitate and strengthen peace and unity in Europe, if her planned commemorations for 1916 will account for this sad lesson of history; and if she will make a statement on the matter. [43508/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-08/pq_647",
        "questionNumber": 647,
        "answerText": " Minister for Arts, Heritage and the Gaeltacht  Since its inception in 2012, the Decade of Centenaries has been engaged in delivering a balanced chronological commemorative programme with selected focused events in each year. There is a commitment to marking each milestone in a way that is inclusive, tolerant and respectful, and the events and activities undertaken have been aimed at fostering such an approach in conjunction with the various partners involved in these projects  The Government has recently published a programme for next year to commemorate the 100th Anniversary of the Somme in 1916, which it regards as an important event to be marked both in Ireland and at the Somme.  The programme includes 4 strands:  - Ceremonial;  - Historical and Educational Reflection;  - Cultural; and  - Community Participation.  It is important that each generation has that opportunity to become aware of the past and the ways in which history can shape our present and influence our future. It is my hope that the commemorative events and activities being planned for 2016 at home and in Europe will go some way to achieving this and that the range of planned activities, including exhibitions, discussions, cultural activities and youth engagement, will help new generations explore the impacts and implications of the catastrophic events at the Battle of the Somme. "
      },
      "contextDate": "2015-12-08"
    },
    {
      "question": {
        "date": "2015-12-08",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/dbsect_599",
          "showAs": "Archaeological Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-08/writtens/mul@/dbsect_599.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_599"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Arts",
          "roleType": null
        },
        "showAs": " 648. Deputy Helen McEntee asked the Minister for Arts, Heritage and the Gaeltacht the impact of archaeological and heritage policy on the ambitions of the community that is deemed to be in the buffer zone of a significant heritage site (details supplied) in County Meath, if local families share custody of that heritage and archaeological legacy with the wider nation, if that policy should take account of the views of local communities and natural justice; and if she will make a statement on the matter. [43509/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-08/pq_648",
        "questionNumber": 648,
        "answerText": " Minister for Arts, Heritage and the Gaeltacht  A new Management Plan for the site referred to by the Deputy is currently being finalised by my Department. This follows a public consultation process on the draft Plan. All submissions received will be taken into account before the Plan is advanced to a stage where it is ready for submission to the relevant authorities for approval. The new Management Plan will acknowledge the rights of local people and communities, who have actively participated in the successful conservation, preservation and promotion of the site with regard to sustainable socio-economic growth and development. It will also acknowledge the need for the Plan itself to assist communities to sustain and develop social cohesion and the local economy.  Actions envisaged for the new Plan in that context include:  - establishing a Community Forum to discuss issues relating to the site in general and to make observations on the implementation of the Plan;  - working with the local authorities to develop a guidance document which provides advice on siting and design in relation to residential and agricultural development within the area of the site;  - working with the local authorities to facilitate consultation with applicants regarding the siting and design of developments affecting the site and the scope of any necessary impact assessments;  - working with the local authorities and other relevant agencies to promote and encourage sustainable economic development in the area, particularly in tourism and agriculture.  In this way, the Plan will seek to meet, in a mutually supportive way, the provisions laid down by the relevant authorities for securing the management aims for sites of this nature, while, at the same time, ensuring that local communities and residents have an active and participative role.  I should emphasise that the main instrument for regulating and controlling physical planning within a county is the development plan which, under the Planning and Development Acts, must be renewed every 6 years, following approval by the elected members. The legislation provides for extensive consultation with the general public, who are offered the opportunity to make submissions or observations on draft development plans which must be considered by the planning authority. As set out above, the Management Plan will itself seek to create effective mechanisms to assist and facilitate local residents in their interactions with the planning system. "
      },
      "contextDate": "2015-12-08"
    },
    {
      "question": {
        "date": "2015-12-03",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-03/writtens/dbsect_55",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-03/writtens/mul@/dbsect_55.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_55"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 29. Deputy Helen McEntee asked the Minister for Health for an overview on surgical waiting lists at Our Lady of Lourdes Hospital in Drogehda, County Louth, and at Our Lady’s Hospital in Navan, County Meath, as of 1 November 2015, 1 November 2014, 1 November 2012 and 1 November 2010; and if he will make a statement on the matter. [42715/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-03/pq_29",
        "questionNumber": 29,
        "answerText": " Minister for Health  The National Treatment Purchase Fund (NTPF) is responsible for the collection, collation and publication of Inpatient and Day Case waiting lists. Waiting list information is published on the NTPF website at the end of each month. The information is presented in different report formats, i.e. by National/Trend, by Hospital/Group, and by Specialty.  The most recent Inpatient/Day Case waiting list data for Our Lady of Lourdes Hospital Drogheda & Our Lady's Hospital Navan, for end of October 2015, may be found at  http://www.ntpf.ie/home/pdf//2015/10/hospitals/in-patient/0500.pdf and the most recent Outpatient Waiting List may be found at http://www.ntpf.ie/home/pdf//2015/10/hospitals/out-patient/0500.pdf.  In relation to the particular query raised, as this is a service matter, I have asked the HSE to respond to you directly. If you have not received a reply from the HSE within 15 working days please contact my Private Office and my officials will follow the matter up. "
      },
      "contextDate": "2015-12-03"
    },
    {
      "question": {
        "date": "2015-12-03",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-03/writtens/dbsect_74",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-03/writtens/mul@/dbsect_74.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_74"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 46. Deputy Helen McEntee asked the Minister for Health the status of his efforts to improve overcrowding challenges at Our Lady of Lourdes Hospital in Drogheda, County Louth; and if he will make a statement on the matter. [42714/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-03/pq_46",
        "questionNumber": 46,
        "answerText": " Minister for Health  Last December I convened the ED Taskforce to provide focus and momentum in dealing with the challenges presented by ED overcrowding. Significant progress has been made to date on the ED Taskforce Plan implementation.  Additional funding of €117m has been provided in 2015 to relieve pressures on acute hospitals including reducing delayed discharges, lowering the waiting time for Fair Deal funding and providing additional transitional care beds and home care packages. Funding has been made available to support the acute hospital system over the winter period by providing additional bed capacity and other initiatives to support access to care.  A new modular build was recently opened at Our Lady of Lourdes Hospital consisting of an eight bay Clinical Decision Unit, a four bay Surgical Assessment Unit and 12 in-patient beds are opening which will allow the hospital to release this cohort of patients from the Emergency Department. This will facilitate appropriate space for patient streaming, observation and treatment in a designated space. Our Lady of Lourdes Hospital is one of the sites that have been the subject of particular focus with the SDU in supporting them to implement solutions.  All hospitals have escalation plans to manage not only patient flow but also patient safety in a responsive, controlled and planned way that supports and ensures the delivery of optimum patient care. I co-signed the ED Congestion Escalation Directive recently to ensure that progress made to date on overcrowding is sustained and deepened. The Directive requires hospitals to implement their Escalation Plan whenever the Emergency Department experiences overcrowding and it is expected that this will add to the progress made on overcrowding so far. "
      },
      "contextDate": "2015-12-03"
    },
    {
      "question": {
        "date": "2015-12-03",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-03/writtens/dbsect_105",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-03/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_105"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 75. Deputy Helen McEntee asked the Minister for Health further to a Dáil debate (details supplied) on 12 November 2015, if he will update Dáil Éireann on his ambitions to provide equal access to pre-school children with disabilities; his efforts to ensure that 15 children in County Meath will be able to avail of the free early childhood care and education scheme year; and if he will make a statement on the matter. [42501/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-03/pq_75",
        "questionNumber": 75,
        "answerText": " Minister of State at the Department of Health  The Early Childhood Care and Education (ECCE) Programme, is the responsibility of the Minister for Children and Youth Affairs. While certain flexibilities had been built into the ECCE Programme to facilitate the inclusion of children with a disability, the Minister for Children and Youth Affairs was conscious for some time of the difficulty experienced by some children with a disability in accessing and benefitting fully from this Programme. With this in mind, he requested that an Inter-Departmental Group, led by his Department, be established with a brief to bring forward recommendations to address this issue. Representatives of my Department and the Health Service Executive participated on this Group.  The Group has concluded its work and its recommendations have been fully accepted by Government. As part of Budget 2016, the Minister for Children and Youth Affairs announced the necessary funding to implement the new model of supports for children with a disability with costs for these supports estimated to be €15 million in 2016 and full year costs estimated to be €33 million from 2017 onwards.  The model of supports was launched on 18 November last by the Minister for Children and Youth Affairs with my full support and the support of my Government colleague Jan O'Sullivan T.D., Minister for Education and Skills. I believe that this Group has identified a practical, workable model for meeting the needs of children with a disability and the allocation of funding is clear evidence of the Government's commitment to supporting such children. The new model will provide supports including enhanced continuing professional development for early years practitioners; grants for equipment, appliances and minor alterations; and access to therapeutic intervention.  Improving access to therapy services for children in primary care and in disability services is a particular priority for the Government. Building on additional investment in recent years, funding of €8 million is being provided to the HSE in 2016 to expand, inter alia, the provision of speech and language therapy in primary care and the further development of early intervention therapy services under the Progressing Disabilities Programme. It is anticipated that the development of early intervention services in particular, as part of the roll-out of the new inclusive pre-school supports model, will help children with a disability to access mainstream pre-school settings.  It should be noted that while the HSE has no statutory obligation to provide assistant supports for children with special needs wishing to participate in the ECCE Programme, it has, to date, worked at local level and in partnership with the relevant disability service providers to address individual needs as they arise. This has been done, for example, by funding special pre-schools that cater specifically for children with disabilities. In some limited cases at local level, disability services have also facilitated children with a disability to attend mainstream pre-schools by providing assistant supports where possible and where resources are available.  My Department has asked the HSE for a report on the specific matter raised by the Deputy pertaining to pre-school children in County Meath. I will be in further communication with the Deputy in due course. "
      },
      "contextDate": "2015-12-03"
    },
    {
      "contextDate": "2015-12-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-02/writtens/mul@/dbsect_96.xml"
            }
          },
          "debateSectionId": "dbsect_96",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-02/writtens/dbsect_96",
          "showAs": "Early Childhood Care and Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-02/pq_36",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 36,
        "showAs": " 36. Deputy Helen McEntee asked the Minister for Children and Youth Affairs further to a Topical Issue debate (details supplied) on 12 November 2015, for an update on his efforts to provide equal access to pre-school for all children, including children with a disability or disabilities; and if he will make a statement on the matter. [42502/15] ",
        "answerText": " Minister for Children and Youth Affairs  The Early Childhood Care and Education (ECCE) Programme provides for free pre-school education for children before they commence primary school.  I have been conscious for some time of the difficulty experienced by some children with a disability in accessing and benefiting fully from this Programme. With this in mind, I requested that an Inter-Departmental Group, led by my Department be established, with a brief to bring forward recommendations to address this issue.  I am pleased to inform the Deputy that the Group concluded its work and the recommendations of this Group were fully accepted and funded by Government. I announced, as part of Budget 2016, the necessary funding to implement the new model of supports for children with a disability with costs for these supports estimated to be €15m in 2016 and with full year costs estimated to be €33m from 2017 onwards.  I believe that this Group has identified a practical, workable model for meeting the needs of children with a disability and the allocation of funding is clear evidence of the Government's commitment to supporting such children.  Moving forward from funding to implementation, I am very pleased to say that, on 18 November last, the model of supports was launched by myself, together with my Government colleagues, Jan O’Sullivan, TD, Minister for Education and Skills and Kathleen Lynch, TD, Minister of State at the Department of Health.  When established, the new model will focus on the developmental level of children with disabilities, their functional ability and their needs. It will not focus on diagnosis, recognising that many children may not have a formal diagnosis at the time of presenting to pre-school.  The model, when fully operational, will deliver seven levels of support to enable the full inclusion and meaningful participation of children with disabilities in the ECCE Programme. These supports, which move from universal to highly targeted supports based on the needs of the child, include: enhanced continuing professional development for early years practitioners; grants for equipment, appliances and minor alterations, increased capitation for certain children with very complex needs, as well as access to therapeutic intervention.  The new model will take some time to be fully established as capacity needs to be built in the early years sector, but the planned front-loading and on-going investment will result in all children with a disability having their pre-school needs met. The implementation of all seven levels of supports is the next step in the process and in that regard, two groups have been established to oversee and implement the new model.  The first group, the Cross Sectoral Implementation Group, will oversee and monitor implementation, while the second group, the Project Group, will implement the model for roll-out by September 2016, recognising that some elements will take somewhat longer to fully implement as capacity needs to be built into the system.  In the meantime, the Deputy should be aware that currently the ECCE Programme makes special provision for children with a disability to access the ECCE programme. Measures include an exemption from the upper age limit for qualification where a child is developmentally delayed and would benefit from starting primary school at a later age. In addition, children with special needs can apply to have the pre-school year split over two years on a pro-rata basis, for example availing of the Programme for 2 days a week in the first year and for 3 days a week in the second year and this will continue to be an option for parents. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-02",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-12-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-01/writtens/mul@/dbsect_58.xml"
            }
          },
          "debateSectionId": "dbsect_58",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-01/writtens/dbsect_58",
          "showAs": "Garda Deployment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-01/pq_72",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 72,
        "showAs": " 72. Deputy Helen McEntee asked the Minister for Justice and Equality the need for additional Garda Síochána resources in communities (details supplied) in County Meath; if she will request a report from the Garda Commissioner on plans to improve policing in the relevant communities; and if she will make a statement on the matter. [42287/15] ",
        "answerText": " Minister for Justice and Equality  As the Deputy will appreciate, the Garda Commissioner is responsible for the distribution of personnel, among the Garda Regions, Divisions, and Districts. Garda management keep this distribution under continuing review taking into account crime trends and policing priorities so as to ensure that the best possible use is made of these resources.  I have been informed by the Garda Commissioner that Kilcock is in the Kildare Garda Division and forms part of Leixlip Garda District and as of 31 October 2015, the latest dates for which figures are readily available there are 9 gardaí assigned to Kilcock Garda station. This station is open 3p.m. to 6p.m. Friday to Saturday and from 3p.m. to 5p.m. on Sundays subject to manpower availability with a Public Access Call Box (P.A.C.B.) to Leixlip, which is approximately 19Km away.  The number of Gardaí assigned to Ashbourne and Duleek on the 31 October 2015, was at 43 and 4 respectively. Duleek Garda station is opened subject to manpower availability with a Public Access Call Box (P.A.C.B.) to Ashbourne which is opened 24 hours a day. I have also been informed by the Garda Commissioner that Dunore is patrolled by members attached to the neighbouring Drogheda District, which is approximately 6Km away.  I can assure the Deputy that this Government is committed to delivering an effective, responsive police service to protect our communities and respond to emerging crime trends. An essential component of our strategy to achieve this is on-going, seamless recruitment of trainee Gardaí. To this end the first intake since 2009 of new recruits commenced training at the Garda College, Templemore, in September of last year. To date there have been six intakes of Garda Trainees to the Garda College, giving a total intake of 550. So far 295 of the new Garda Trainees have attested as members of An Garda Síochána. On attestation, new probationer Gardaí are assigned to stations throughout the country by the Garda Commissioner, where they are assigned to mainstream uniform policing duties. I am assured by Garda management that the needs of all Garda Divisions are fully considered when determining the allocation of newly attested Gardaí and that 15 and 5 of these newly attested Gardaí have been assigned to the Kildare and Meath Garda Divisions respectively.  The Deputy will be aware that I announced the opening of a recruitment campaign for new members of An Garda Síochána last Friday 27 November. This new campaign is necessary to fulfil the Government’s commitment to recruit 600 Gardaí in 2016.  The 600 new Gardaí to be recruited next year will bring to 1,150 the total number of new recruits since the reopening of the Garda College in September 2014. The Public Appointments Service (PAS) is organising the recruitment competition on behalf of the Garda Commissioner and applications may be made through the PAS website at www.publicjobs.ie . The closing date for applications is Tuesday 5 January 2016.  In relation to emerging crime trends, Operation Thor, which was launched by the Garda Commissioner recently is a multi-stranded national operation which builds on previous and current Garda operations to tackle crime, particularly burglaries the number of which, as we know, increase with the advent of the long winter nights, in both urban and rural communities nationwide. Operation Thor is made possible by the increased investment in policing by this Government, including an allocation of €5 million to specifically support this new Operation.  It entails a broad range of activities to tackle burglars, organised crime gangs and prolific offenders as well as working with communities to prevent crime. These activities include: additional high-visibility patrols in identified burglary hot-spots; increased use of checkpoints to tackle the criminal gangs using the national road network; the use of new high powered vehicles by the armed Regional Response Units; efforts to disrupt the stolen goods market; programmes to help reduce re-offending by prolific offenders; a high-profile national crime prevention awareness campaign, and targeted crime prevention advice for local communities and enhanced supports for victims.  I am confident that this comprehensive operation by An Garda Síochána, supported by Government investment in Garda resources and personnel, will disrupt the activities of burglars, organised crime gangs and prolific offenders and will improve the safety of all our communities across the country. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-01",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-12-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-01/writtens/mul@/dbsect_86.xml"
            }
          },
          "debateSectionId": "dbsect_86",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-12-01/writtens/dbsect_86",
          "showAs": "Garda Deployment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-12-01/pq_99",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 99,
        "showAs": " 99. Deputy Helen McEntee asked the Minister for Justice and Equality if there is a need for a greater Garda Síochána presence in three County Meath communities (details supplied), one of which is policed at night by gardaí who are based at a Garda Síochána station 46.1 kilometres away; her views on the security requirements of those communities, including at night; and if she will make a statement on the matter. [42286/15] ",
        "answerText": " Minister for Justice and Equality  As the Deputy will appreciate, the Garda Commissioner is responsible for the distribution of personnel, among the Garda Regions, Divisions, and Districts. Garda management keep this distribution under continuing review taking into account crime trends and policing priorities so as to ensure that the best possible use is made of these resources.  I have been informed by the Garda Commissioner that Kilcock is in the Kildare Garda Division and forms part of Leixlip Garda District and as of 31 October 2015, the latest dates for which figures are readily available there are 9 Gardai assigned to Kilcock Garda station. This station is open 3p.m. to 6p.m. Friday to Saturday and from 3p.m. to 5p.m. on Sundays subject to manpower availability with a Public Access Call Box (P.A.C.B.) to Leixlip, which is approximately 19Km away.  The number of Gardaí assigned to Ashbourne and Duleek on the 31 October 2015, was 43 and 4 respectively. Duleek Garda station is opened subject to manpower availability with a Public Access Call Box (P.A.C.B.) to Ashbourne which is opened 24 hours a day. I have also been informed by the Garda Commissioner that Dunore is patrolled by members attached to the neighbouring Drogheda District, which is approximately 6Km away.  I can assure the Deputy that this Government is committed to delivering an effective, responsive police service to protect our communities and respond to emerging crime trends. An essential component of our strategy to achieve this is on-going, seamless recruitment of trainee Gardaí. To this end the first intake since 2009 of new recruits commenced training at the Garda College, Templemore, in September of last year. To date there have been six intakes of Garda Trainees to the Garda College, giving a total intake of 550. So far 295 of the new Garda Trainees have attested as members of An Garda Síochána. On attestation, new probationer Gardaí are assigned to stations throughout the country by the Garda Commissioner, where they are assigned to mainstream uniform policing duties. I am assured by Garda management that the needs of all Garda Divisions are fully considered when determining the allocation of newly attested Gardaí and that 15 and 5 of these newly attested Gardaí have been assigned to the Kildare and Meath Garda Divisions respectively.  The Deputy will be aware that I announced the opening of a recruitment campaign for new members of An Garda Síochána last Friday 27 November. This new campaign is necessary to fulfil the Government’s commitment to recruit 600 Gardaí in 2016.  The 600 new Gardaí to be recruited next year will bring to 1,150 the total number of new recruits since the reopening of the Garda College in September 2014. The Public Appointments Service (PAS) is organising the recruitment competition on behalf of the Garda Commissioner and applications may be made through the PAS website at www.publicjobs.ie . The closing date for applications is Tuesday 5 January 2016.  In relation to emerging crime trends, Operation Thor, which was launched by the Garda Commissioner recently is a multi-stranded national operation which builds on previous and current Garda operations to tackle crime, particularly burglaries the number of which, as we know, increase with the advent of the long winter nights, in both urban and rural communities nationwide. Operation Thor is made possible by the increased investment in policing by this Government, including an allocation of €5 million to specifically support this new Operation.  It entails a broad range of activities to tackle burglars, organised crime gangs and prolific offenders as well as working with communities to prevent crime. These activities include: additional high-visibility patrols in identified burglary hot-spots; increased use of checkpoints to tackle the criminal gangs using the national road network; the use of new high powered vehicles by the armed Regional Response Units; efforts to disrupt the stolen goods market; programmes to help reduce re-offending by prolific offenders; a high-profile national crime prevention awareness campaign, and targeted crime prevention advice for local communities and enhanced supports for victims.  I am confident that this comprehensive operation by An Garda Síochána, supported by Government investment in Garda resources and personnel, will disrupt the activities of burglars, organised crime gangs and prolific offenders and will improve the safety of all our communities across the country. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-12-01",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-19/writtens/mul@/dbsect_45.xml"
            }
          },
          "debateSectionId": "dbsect_45",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-19/writtens/dbsect_45",
          "showAs": "National Monuments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-19/pq_16",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 16,
        "showAs": " 16. Deputy Helen McEntee asked the Minister for Public Expenditure and Reform the status of his Department's effort to address an issue of significant heritage concern (details supplied); and if he will make a statement on the matter. [39264/15] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform  The Kells High Crosses are significant historical artefacts and, as such, are protected under National Monument legislation. There has been a concern in recent years about the deteriorating condition of the Crosses and, as the Deputy mentions, there is evidence of some accelerated weather and environmental erosion on some of the panels of the West and South Crosses in particular. Understanding that there was a clear risk to the Monuments, the Office of Public Works carried out a detailed technical study of the Crosses during 2014 and presented the lead Department involved, the Department of Arts Heritage and the Gaeltacht, with a full assessment of the issues involved together with some options for them to consider. Following a full assessment of this report, the Department has recently instructed the Office of Public Works to pursue the option of in situ enclosure of the West and South Crosses within structures that will provide the necessary environmental protection for the future. Additionally, as a first step, the OPW is instructed to complete a detailed 3D laser scan of the structures to establish their current condition and point to weaknesses in the fabric. This work is under way currently. The proposed erection of an environmental shelter for the Crosses will be, in itself, a complex and challenging undertaking. There are a number of international comparators for a project such as this. The OPW is evaluating the options available and consulting with relevant authorities who have undertaken similar works elsewhere before deciding how best to proceed. Once a viable plan has been devised, the project will proceed under the joint management of the OPW and DAHG.  In the short term, and to protect the Crosses from the worst of the Winter weather, the OPW is considering the provision of a temporary cover for the crosses. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-19",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_409.xml"
            }
          },
          "debateSectionId": "dbsect_409",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_409",
          "showAs": "Teacher Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_495",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 495,
        "showAs": " 495. Deputy Helen McEntee asked the Minister for Education and Skills the number of teachers employed in primary schools in County Meath in September of each of the years 2010 to 2015 to date; and if she will make a statement on the matter. [39999/15] ",
        "answerText": " Minister for Education and Skills  The information requested by the Deputy for the years 2010 to 2014 is available in the table below. The information for the 2015/2016 academic year is not yet available.   Teachers in Mainstream Primary Schools, Co. Meath 2010-2015      -    2010/2011    2011/2012    2012/2013    2013/2014    2014/2015      Teaching Teachers    883    907    925    947    965      Non-teaching Principals    52    52    57    57    59      Other Teachers  (Full Time Equivalent)    285    295    284.5    290.5    310      Total Teachers    1220    1254    1267    1295    1334    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_410.xml"
            }
          },
          "debateSectionId": "dbsect_410",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_410",
          "showAs": "Teacher Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_496",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 496,
        "showAs": " 496. Deputy Helen McEntee asked the Minister for Education and Skills the number of teachers employed in post-primary schools in County Meath in September of each of the years 2010 to 2015 to date; and if she will make a statement on the matter. [40000/15] ",
        "answerText": " Minister for Education and Skills  Information relating to teaching posts allocated at post primary level is not disaggregated by county. The Statistics Section of my Department's website contains extensive data relating to schools at primary and post-primary level, including the number of teaching posts allocated to schools (See table 3) http://www.education.ie/en/Publications/Statistics/Key-Statistics/Key-Statistics-2014-2015.pdf. The most recent published information relates to the 2014/2015 school year. Data in relation to the 2015/16 school year will be published later in the current school year.  Teacher allocations to all schools are approved annually by my Department in accordance with established rules based on recognised pupil enrolment. The criteria for the allocation of posts are communicated to school managements annually and are available on the Department website. In accordance with these rules each school management authority is required to organise its subject options within the limit of its approved teacher allocation.  The recruitment and appointment of teachers to fill teaching posts is a matter for the individual school authority, subject to procedures agreed under Section 24(3) of the Education Act 1998 (as amended by the Education (Amendment) Act 2012). The deployment of teaching staff in the school, the range of subjects offered and ultimately the quality of teaching and learning are in the first instance a matter for the school management authorities. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_411.xml"
            }
          },
          "debateSectionId": "dbsect_411",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_411",
          "showAs": "Departmental Expenditure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_497",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 497,
        "showAs": " 497. Deputy Helen McEntee asked the Minister for Education and Skills the capital expenditure on primary education in County Meath in each of the years 2011 to 2014; the expected outturn for 2015; and if she will make a statement on the matter. [40001/15] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 497 to 500, inclusive, together.  Capital expenditure incurred in the primary and post-primary sectors in the years 2011 to date in 2015 in County Meath is as follows:  2011 - €22.0 million  2012 - €19.9 million  2013 - €41.2 million  2014 - €24.0 million  2015 - €28.2 million  I refer the Deputy to my statement on 29 September 2015 on the announcement of the Building on Recovery: Infrastructure and Capital Investment 2016-2021.  Over the next six years some €3.8 billion in direct funding will be invested in education projects. An additional €200 million in PPP funding over the life time of the capital programme will result in more than €4 billion in public investment.  As the investment in the primary and post-primary sectors over the period 2016-2021 will involve the provision of permanent school places under the Large Scale Projects Programme, the Additional Accommodation Programme and the Prefab Replacement Initiative as well as expenditure on site acquisitions, ICT investment, summer works schemes, emergency works and the issue of the minor works grant as well as other smaller programmes, it is not possible over such a range of activities to determine likely expenditure on a county basis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_411.xml"
            }
          },
          "debateSectionId": "dbsect_411",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_411",
          "showAs": "Departmental Expenditure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_498",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 498,
        "showAs": " 498. Deputy Helen McEntee asked the Minister for Education and Skills the capital expenditure on post-primary education in County Meath in each of the years 2011 to 2014; the expected outturn for 2015; and if she will make a statement on the matter. [40002/15] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 497 to 500, inclusive, together.  Capital expenditure incurred in the primary and post-primary sectors in the years 2011 to date in 2015 in County Meath is as follows:  2011 - €22.0 million  2012 - €19.9 million  2013 - €41.2 million  2014 - €24.0 million  2015 - €28.2 million  I refer the Deputy to my statement on 29 September 2015 on the announcement of the Building on Recovery: Infrastructure and Capital Investment 2016-2021.  Over the next six years some €3.8 billion in direct funding will be invested in education projects. An additional €200 million in PPP funding over the life time of the capital programme will result in more than €4 billion in public investment.  As the investment in the primary and post-primary sectors over the period 2016-2021 will involve the provision of permanent school places under the Large Scale Projects Programme, the Additional Accommodation Programme and the Prefab Replacement Initiative as well as expenditure on site acquisitions, ICT investment, summer works schemes, emergency works and the issue of the minor works grant as well as other smaller programmes, it is not possible over such a range of activities to determine likely expenditure on a county basis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_411.xml"
            }
          },
          "debateSectionId": "dbsect_411",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_411",
          "showAs": "Departmental Expenditure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_499",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 499,
        "showAs": " 499. Deputy Helen McEntee asked the Minister for Education and Skills the expected capital expenditure on primary education in County Meath over the course of the Government’s capital investment plan 2016 to 2021; and if she will make a statement on the matter. [40003/15] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 497 to 500, inclusive, together.  Capital expenditure incurred in the primary and post-primary sectors in the years 2011 to date in 2015 in County Meath is as follows:  2011 - €22.0 million  2012 - €19.9 million  2013 - €41.2 million  2014 - €24.0 million  2015 - €28.2 million  I refer the Deputy to my statement on 29 September 2015 on the announcement of the Building on Recovery: Infrastructure and Capital Investment 2016-2021.  Over the next six years some €3.8 billion in direct funding will be invested in education projects. An additional €200 million in PPP funding over the life time of the capital programme will result in more than €4 billion in public investment.  As the investment in the primary and post-primary sectors over the period 2016-2021 will involve the provision of permanent school places under the Large Scale Projects Programme, the Additional Accommodation Programme and the Prefab Replacement Initiative as well as expenditure on site acquisitions, ICT investment, summer works schemes, emergency works and the issue of the minor works grant as well as other smaller programmes, it is not possible over such a range of activities to determine likely expenditure on a county basis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_411.xml"
            }
          },
          "debateSectionId": "dbsect_411",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_411",
          "showAs": "Departmental Expenditure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_500",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 500,
        "showAs": " 500. Deputy Helen McEntee asked the Minister for Education and Skills the expected capital expenditure on post-primary education in County Meath over the course of the Government’s capital investment plan 2016 to 2021; and if she will make a statement on the matter. [40004/15] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 497 to 500, inclusive, together.  Capital expenditure incurred in the primary and post-primary sectors in the years 2011 to date in 2015 in County Meath is as follows:  2011 - €22.0 million  2012 - €19.9 million  2013 - €41.2 million  2014 - €24.0 million  2015 - €28.2 million  I refer the Deputy to my statement on 29 September 2015 on the announcement of the Building on Recovery: Infrastructure and Capital Investment 2016-2021.  Over the next six years some €3.8 billion in direct funding will be invested in education projects. An additional €200 million in PPP funding over the life time of the capital programme will result in more than €4 billion in public investment.  As the investment in the primary and post-primary sectors over the period 2016-2021 will involve the provision of permanent school places under the Large Scale Projects Programme, the Additional Accommodation Programme and the Prefab Replacement Initiative as well as expenditure on site acquisitions, ICT investment, summer works schemes, emergency works and the issue of the minor works grant as well as other smaller programmes, it is not possible over such a range of activities to determine likely expenditure on a county basis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_413.xml"
            }
          },
          "debateSectionId": "dbsect_413",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_413",
          "showAs": "State Examinations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_502",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 502,
        "showAs": " 502. Deputy Helen McEntee asked the Minister for Education and Skills if extra concessions will be made for a leaving certificate student (details supplied) in County Meath; and if she will make a statement on the matter. [40062/15] ",
        "answerText": " Minister for Education and Skills  The State Examinations Commission has statutory responsibility for operational matters relating to the certificate examinations.  The State Examinations Commission operates a scheme of Reasonable Accommodations in the Certificate examinations.  In view of this I have forwarded your query to the State Examinations Commission for direct reply to you. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/mul@/dbsect_478.xml"
            }
          },
          "debateSectionId": "dbsect_478",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-17/writtens/dbsect_478",
          "showAs": "Foreshore Licence Applications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-17/pq_572",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 572,
        "showAs": " 572. Deputy Helen McEntee asked the Minister for the Environment, Community and Local Government the number of foreshore leases which fell due for rent review and the actual number of rent reviews that were finalised by the State in each of the years 2011 to 2015 to date in tabular form; and if he will make a statement on the matter. [40480/15] ",
        "answerText": " Minister of State at the Department of the Environment, Community and Local Government  Rent reviews generally fall due every 5 or 7 years, depending on the particular rent review clause included in a foreshore lease or licence. During the period in question, the Valuation Office did not have the capacity to provide a service to my Department in respect of rent reviews. These circumstances would have resulted in potential significant costs for my Department, if external valuation services were to be engaged to carry out rent reviews arising. Taking account of scarce resources, it was not possible to carry out rent reviews during this period.  However, in more recent times, my Department has re-engaged with the Valuation Office in terms of initial valuations of leases and licences and it is proposed to recommence rent reviews from 2016 onwards.  The information requested is set out in the following table:     Year    Number of Rent Reviews Falling Due      2011    16      2012    39      2013    47      2014    53      2015    41      Total    196*     * The above figure includes 33 cases with annual rents of less than €100. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-17",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-12/writtens/mul@/dbsect_113.xml"
            }
          },
          "debateSectionId": "dbsect_113",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-12/writtens/dbsect_113",
          "showAs": "Commemorative Events"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-12/pq_33",
        "to": {
          "roleType": null,
          "showAs": "Arts",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 33,
        "showAs": " 33. Deputy Helen McEntee asked the Minister for Arts, Heritage and the Gaeltacht the status of the Ireland 2016 centenary programme and the community participation element of the programme; and if she will make a statement on the matter. [39544/15] ",
        "answerText": " Minister for Arts, Heritage and the Gaeltacht  The Ireland 2016 Centenary Programme, which was launched on 31 March, includes a rich diversity of programmes and events, complementary and additional to the formal State occasions, which will run throughout 2016 to commemorate the centenary of the 1916 Easter Rising. The Programme will be an invitation to everyone on the island of Ireland and to the global Irish community to shape and engage in a diverse range of historical, cultural and artistic activities – all designed to facilitate reflection, commemoration, celebration, debate and analysis and an active imagining of our future. Officials of my Department have facilitated an intensive consultation period over the last few months, including active engagement with schools, universities, colleges, business and voluntary organisations, arts and culture institutions, historical societies and representative groups – at home and with our Diaspora around the world – to inform, to stimulate debate and discussion about 2016, and to foster programme initiatives. Work has been ongoing to implement a comprehensive programme and planning is well underway for the range of initiatives within the seven programme strands.  Among the key milestones achieved to date are the following:  - I was delighted to host the first of the State ceremonial events of the Ireland 2016 Centenary Programme on 1 August to commemorate the funeral of O'Donovan Rossa in Glasnevin Cemetery, in the presence of President Michael D Higgins and the Taoiseach, Enda Kenny, T.D;  - An allocation of €22 million in capital funding is being provided through my Department’s Vote in 2015 for the ‘Permanent Reminder’ projects. These capital projects are progressing well and launch dates have been agreed and events are currently being planned. Some €31m will be allocated next year;  - The Global and Diaspora Programme was launched on 29 June and was very positively received at home and abroad;  - On 6 August, the Arts Council announced 9 major arts projects to commemorate 1916;  - The launch of the National Flag Initiative took place on 14 September, with the first in a series of deliveries by the Defence Forces of the National Flag and the Proclamation to over 3,300 national schools across the country. Over 1,500 flags have been delivered and have been very well received;  - The grants programme for Irish language projects under the ‘An Teanga Bheo’ strand of the Programme has been completed and were recently announced;  - The Education Programme strand was launched on 22 September for the primary, post-primary and third-level education sectors;  - Consultation is ongoing with relevant stakeholders in Northern Ireland, including official, political, media, artistic and NGO stakeholders;  - The National Cultural Institutions are planning a range of innovative exhibitions and projects and all are progressing well;  - Culture Ireland launched their official Programme “I am Ireland”on 3 October.  Under the 'Community Participation' strand of the programme, over 83 public consultations, facilitated by the local authorities, have taken place nationwide. Each of the local authorities has now developed a rich and diverse series of events and projects that will take place around the country next year. Arising from this, I, together with An Taoiseach and my Government colleagues, launched 31 individual local authority plans on 8 October. I have allocated €1 million in 2015 in current funding to support this process.  Further information in relation to the various events, activities and initiatives taking place under each of the above strands can be found on my Department’s dedicated website at www.ireland.ie, as well as the 31 county plans that were launched last month. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-12",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-11/writtens/mul@/dbsect_50.xml"
            }
          },
          "debateSectionId": "dbsect_50",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-11/writtens/dbsect_50",
          "showAs": "Greenways Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-11/pq_11",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 11,
        "showAs": " 11. Deputy Helen McEntee asked the Minister for Transport, Tourism and Sport for an update on a proposed project (details supplied); his views that this project has potential to unlock significant tourism sector employment opportunities; and if he will make a statement on the matter. [39055/15] ",
        "answerText": " Minister for Transport, Tourism and Sport  Under the National Cycle Network funding programme 2014-2016 Meath County Council submitted a proposal to my Department for the development of the Boyne Valley to Lakelands County Greenway.  While it was recognised that the proposal had considerable merit it was not possible to provide funding at that time given the number of applications received far exceeded the resources available.  I met with a delegation from Meath County Council earlier this year to discuss progress on this project since the application was submitted in 2013.  I was glad to learn that in the meantime the project team had progressed the detailed design and preparation of contract documents for the project while continuing to explore potential funding sources.  The cost of delivering the entire greenway is estimated to be in the region of €2.4 million.  I understand from my meeting with the council delegation that the project can be delivered in 2 phases - Phase 1 could run for a distance of 8 km from the town park in Navan to Wilkinstown which would represent a valuable amenity in itself.  Phase 2 will run from Wilkinstown to Kingscourt.  Cavan County Council are also keen to commence this section of the greenway and the planning and design elements are at an advanced stage.  Given all Department funding for the purpose of delivering greenways is now fully committed up until 2016 I would urge the Council to continue to progress this project is so far as their own resources allow with a view to submitting an application to my Department under the next funding call which I would anticipate will be announced in 2016.  I would like to remind my colleague however that in light of my decision to pause planning for the Galway to Dublin greenway I have stated that construction will commence on the Meath and Kildare sections of that route in 2016. It is expected that this section will open in 2017 and a complete route from Maynooth to Athlone will provide a superb amenity for everyone to enjoy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-11",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "contextDate": "2015-11-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-11/writtens/mul@/dbsect_65.xml"
            }
          },
          "debateSectionId": "dbsect_65",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-11/writtens/dbsect_65",
          "showAs": "Road Network"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-11/pq_25",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 25,
        "showAs": " 25. Deputy Helen McEntee asked the Minister for Transport, Tourism and Sport for an update on a project (details supplied) in County Meath. [39054/15] ",
        "answerText": " Minister for Transport, Tourism and Sport  As the Deputy is aware, as Minister for Transport, Tourism & Sport, I have responsibility for overall policy and funding in relation to the national roads programme.  The planning, design and implementation of individual road projects (such as the Slane Bypass) is a matter for Transport Infrastructure Ireland (formerly known as the NRA) under the Roads Acts 1993 to 2015 in conjunction with Meath County Council.  The transport element of the recently announced Capital Plan, provides a total of €6bn for roads over seven years. Of this, €4.4bn of this programme will be devoted to essential maintenance and strengthening works on our network, restoring our roads to the quality levels required. The Plan has provided that a number of schemes (including the Slane Bypass), targeting bottlenecks in the road network, will be progressed subject to planning. TII is in the process of drawing up an implementation programme for the projects included in the Capital Plan and in the case of the proposed Slane Bypass, this will require the submission of the scheme to an Bord Pleanála for consideration. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2015-11-11",
        "by": {
          "showAs": "Helen McEntee",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27"
        }
      }
    },
    {
      "question": {
        "date": "2015-11-10",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-10/writtens/dbsect_43",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-10/writtens/mul@/dbsect_43.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_43"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 79. Deputy Helen McEntee asked the Minister for Communications, Energy and Natural Resources for an update on his engagements with the Department of the Environment, Community and Local Government in respect of updating Ireland’s wind energy guidelines; his views on whether Ireland can reach its 2020 energy security targets without the construction of industrial wind farms in residential areas; and if he will make a statement on the matter.  [38941/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-10/pq_79",
        "questionNumber": 79,
        "answerText": " Minister for Communications, Energy and Natural Resources  The overarching objective of the Government’s energy policy is to ensure secure and sustainable supplies of competitively priced energy to all consumers.  The 2009 EU Renewable Energy Directive set Ireland a legally binding target of meeting 16% of our energy requirements from renewable sources by 2020. In order to meet this target, Ireland is committed to meeting 40% of electricity demand from renewable sources, 12% renewables in the heating sector and 10% in transport. Provisional figures provided by the Sustainable Energy Authority of Ireland for 2014 show that 22.7% of electricity was met from renewable sources.  Ireland is making good progress with regard to renewable energy deployment. It is estimated that a total of between 3,500 MW and 4,000 MW of onshore renewables generation capacity will be required to allow Ireland to meet its electricity target. As the most cost effective of the technologies available to Ireland, wind energy will make the largest contribution to bridging the gap to meeting the electricity target.  In December 2013, the Department of the Environment, Community and Local Government began a review of the existing Wind Energy Development Guidelines. The review focused on the specific issues of noise, proximity, and shadow flicker. Submissions were received from around 7,500 organisations and members of the public during the public consultation period.  This is a very technical area and the engagement between the two departments is ongoing. Technical studies have been obtained on various aspects of the issues, particularly noise - including separation distance - and detailed assessments of various options have been undertaken by the two Departments.  Any revisions to the guidelines following the conclusion of deliberations, will be introduced by issuing the revised guidelines to planning authorities under Section 28 of the Planning and Development Act 2000, as amended. "
      },
      "contextDate": "2015-11-10"
    },
    {
      "question": {
        "date": "2015-11-10",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-10/writtens/dbsect_46",
          "showAs": "North-South Interconnector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-10/writtens/mul@/dbsect_46.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_46"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 82. Deputy Helen McEntee asked the Minister for Communications, Energy and Natural Resources if he will provide an update on his engagements with EirGrid in respect of the proposed North-South energy interconnector; and if he will make a statement on the matter.  [38942/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-10/pq_82",
        "questionNumber": 82,
        "answerText": " Minister for Communications, Energy and Natural Resources  As the Deputy will be aware, EirGrid made a formal application for the North South Transmission Link Project to An Bord Pleanála on 9 June 2015. I am constrained, therefore, in what I can say in relation to the project other than the provision of factual information.  The North South Transmission Link project is part of EirGrid’s Grid25 plan to upgrade the national electricity transmission system between now and 2025. It is a strategically urgent project that will remove restrictions limiting cross-border power flows between Ireland and Northern Ireland thus strengthening security of electricity supply throughout the island of Ireland.  In discharging its duties as operator and developer of the national transmission grid, EirGrid engages with communities and citizens on an ongoing basis. In December 2014 it completed a comprehensive review of its existing consultation process and has been working since then to implement the commitments arising from the review including: developing a participative, more community based approach; changing fundamentally its culture and processes so as to develop stronger engagement and relationships with stakeholders; and encouraging more effective discussion on energy and critical infrastructure.  EirGrid has opened offices in Navan, Cootehill and Carrickmacross and has appointed Community Liaison Officers and Agricultural Liaison Officers who are all involved in outreach to the local communities along the intended route of the North South Transmission Link project. There has been extensive public consultation on the North South Transmission Link project including statutory consultation as required under Regulation (EU) No. 347/2013 on guidelines for trans-European energy infrastructure and Section 182A of the Planning and Development Act, 2000, as amended. "
      },
      "contextDate": "2015-11-10"
    },
    {
      "question": {
        "date": "2015-11-10",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-10/writtens/dbsect_447",
          "showAs": "State Examinations Commission",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-10/writtens/mul@/dbsect_447.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_447"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 484. Deputy Helen McEntee asked the Minister for Education and Skills if extra concessions will be made for the leaving certificate (details supplied); and if she will make a statement on the matter.  [39190/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-10/pq_484",
        "questionNumber": 484,
        "answerText": " Minister for Education and Skills  The State Examinations Commission has statutory responsibility for operational matters relating to the certificate examinations.  The State Examinations Commission operates a scheme of Reasonable Accommodations in the Certificate examinations. In view of this I have forwarded your query to the State Examinations Commission for direct reply to you. "
      },
      "contextDate": "2015-11-10"
    },
    {
      "question": {
        "date": "2015-11-05",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-05/writtens/dbsect_61",
          "showAs": "Climate Change Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-05/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_61"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 29. Deputy Helen McEntee asked the Minister for the Environment, Community and Local Government his views on whether Ireland can reach its 2020 climate change and energy security targets without construction of industrial wind farms in residential areas; and if he will make a statement on the matter. [37234/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-05/pq_29",
        "questionNumber": 29,
        "answerText": " Minister for the Environment, Community and Local Government  The extent of the challenge to reduce greenhouse gas emissions, in line with our EU commitments, is well understood by Government, as reflected in the National Policy Position on Climate Action and Low-Carbon Development, published in April 2014, and in the Climate Action and Low-Carbon Development Bill 2015 , recently passed by the Dáil and currently at Committee Stage in the Seanad. The National Policy Position provides a high-level policy direction for the adoption and implementation by Government of plans to enable the State to move to a low-carbon economy by 2050. Proposed statutory authority for the plans is set out in the Climate Action and Low-Carbon Development Bill 2015 .  In anticipation of enactment of the planned legislation, work is already underway on developing a low carbon plan, the National Mitigation Plan, the primary objective of which will be to track implementation of measures already underway and to identify additional measures within the longer term to reduce greenhouse gas emissions and progress the overall national low carbon transition agenda to 2050. The first iteration of the National Mitigation Plan will place particular focus on putting the necessary measures in place to address the challenge to 2020, but also in terms of planning ahead to ensure that appropriate policies and measures will be in place beyond that. In this context, key sectors in the low carbon transition process (electricity, transport, built environment and agriculture) are currently developing sectoral mitigation measures in tandem with Strategic Environmental Assessment (SEA) and Appropriate Assessment (AA) processes during which measures will be further developed and prioritised.  For each year between 2013 and 2020, Ireland has a greenhouse gas (GHG) emission reduction target under the 2009 Effort Sharing Decision (ESD) No. 406/2009/EC. For the year 2020 itself , the target set for Ireland is that emissions should be 20 per cent below their value in 2005. This is jointly the most demanding 2020 reduction target allocated under the ESD and one shared only by Denmark and Luxembourg. The target for each of the years 2014 through 2019 is on a straight-line trajectory between the targets for 2013 and 2020.  The Environmental Protection Agency (EPA) published in May 2015 new annual emission limits and projected emissions for 2020 which indicate that Ireland’s emissions in 2020 could be in the range of 9-14% below 2005 levels. However, even in the worst case scenario (i.e., a 9% reduction), Ireland could be very close to meeting its cumulative compliance obligations for the period 2013-2020 (ESD 2009), which on average require a 12% reduction relative to 2005, given over-compliance in the early years of the 8-year period.  With regard to energy security considerations, the overarching objective of the Government’s energy policy is to ensure secure and sustainable supplies of competitively priced energy to all consumers. The 2009 EU Renewable Energy Directive set Ireland a legally binding target of meeting 16% of our energy requirements from renewable sources by 2020. In order to meet this target, Ireland is committed to meeting 40% of electricity demand, 12% of heating and 10% of transport power from renewable sources. Provisional figures provided by the Sustainable Energy Authority of Ireland for 2014 show that 8.6% of Ireland's overall energy requirement was met by renewable energy.  Electricity generated from renewable sources is playing an increasingly important role as part of our energy mix. In 2014, 22.7% of gross electricity generation was from renewables including hydro, wind, biomass, landfill gas and biogas. While the progress to date is encouraging, significant challenges remain, particularly in the heat and transport sectors.  The REFIT schemes underpin the development of a range of renewable electricity technologies, including hydro, biomass combustion, biomass combined heat and power, landfill gas and onshore wind. These schemes will be closed to new applications at the end of this year. In terms of renewable heat, in addition to existing measures such as Part L of the Building Regulations, the 2014 Draft Bioenergy Plan recommended the introduction of a Renewable Heat Incentive (RHI) for larger heat users to change to heating solutions that produce heat from renewable sources.  On 31 July last, the Minister for Communications, Energy and Natural Resources launched two separate consultations on new support schemes, one for renewable electricity and one for a proposed Renewable Heat Incentive. While the initial phase of both consultations closed on 18 September 2015, there will be two further opportunities to contribute at key stages in the design of any new scheme. Those consultations will be informative regarding the technologies that will assist in meeting our future renewable energy targets. Subject to Government approval and State Aid clearance from the European Commission, the new schemes would become available in 2016.  As regards renewable transport, Ireland aims to meet its target mainly through the use of sustainable biofuels. Increasing usage of electric vehicles will also make a contribution. Further increases to the obligation rate in the Biofuels Obligation Scheme will be required in the context of achieving our 2020 target. A public consultation, initiated by the Minister for Communications, Energy and Natural Resources, concluded on 30 October.  From a planning perspective, proposals for the location of individual wind farms are a matter for the relevant developer, taking account of several criteria, including connectivity to the national grid. When considering individual planning applications for such developments and the appropriateness of their location, planning authorities, including An Bord Pleanála where relevant, are required to have regard to local area and county development plans, local authority renewable energy strategies, the 2006 Wind Energy Development Guidelines issued under Section 28 of the Planning and Development Act 2000, as amended, and other relevant matters, including existing residential development, existing wind energy developments, the local landscape and the natural and built heritage. "
      },
      "contextDate": "2015-11-05"
    },
    {
      "question": {
        "date": "2015-11-05",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-05/writtens/dbsect_63",
          "showAs": "Wind Energy Guidelines",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-05/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_63"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 31. Deputy Helen McEntee asked the Minister for the Environment, Community and Local Government if he will provide an update on his engagements with the Minister for Communications, Energy and Natural Resources in respect of updating Ireland's wind energy guidelines; and if he will make a statement on the matter. [37233/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-05/pq_31",
        "questionNumber": 31,
        "answerText": " Minister for the Environment, Community and Local Government  In December 2013, my Department published proposed “draft” revisions to the noise, setbacks and shadow flicker aspects of the 2006 Wind Energy Development Guidelines. These draft revisions proposed:  - the setting of a more stringent day and night noise limit of 40 decibels for future wind energy developments,  - a mandatory minimum setback of 500 metres between a wind turbine and the nearest dwelling for amenity considerations, and  - the complete elimination of shadow flicker between wind turbines and neighbouring dwellings.  A public consultation process was initiated on these proposed draft revisions to the Guidelines, which ran until February 21 2014. My Department received submissions from 7,500 organisations and members of the public during this public consultation process.  It is intended that the revisions to the 2006 Wind Energy Development Guidelines will be finalised as soon as possible. In this regard, account has to be taken of the extensive response to the public consultation in framing the final guidelines. Further work is also advancing to develop technical appendices to assist planning authorities with the practical application of the noise measurement aspects of the Wind Guidelines. My Department is advancing work on the Guidelines in conjunction with the Department of Communications, Energy and Natural Resources.  The revisions to the Wind Energy Development Guidelines 2006, when finalised, will be issued under Section 28 of the Planning and Development Act 2000, as amended. Planning authorities, and, where applicable, An Bord Pleanála are required to have regard to guidelines issued under Section 28 in the performance of their functions under the Planning Acts. "
      },
      "contextDate": "2015-11-05"
    },
    {
      "question": {
        "date": "2015-11-04",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-04/writtens/dbsect_41",
          "showAs": "Information and Communications Technology",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-04/writtens/mul@/dbsect_41.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_41"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Jobs",
          "roleType": null
        },
        "showAs": " 16. Deputy Helen McEntee asked the Minister for Jobs, Enterprise and Innovation his Department's efforts in respect of a proposal by a company (details supplied); if he will update Dáil Éireann on the overarching strategy for Ireland in respect of such enterprise; and if he will make a statement on the matter. [37151/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-04/pq_16",
        "questionNumber": 16,
        "answerText": " Minister for Jobs, Enterprise and Innovation  The investment in this particular case will involve an expenditure of about €200m on a Data Centre. I myself met the company earlier this year to discuss the proposal and I arranged that IDA Ireland was closely engaged with them during the development of the initiative.  The provision of major Data Centres is a significant feature of our wider work to develop the Digital Economy in Ireland and to broaden the footprint of the ICT sector here. What has become known as ‘Big Data’ is a growth area and one with significant potential to create highly skilled jobs here. The construction of Data Centres generates a significant number of construction jobs and expenditure on goods and services and, after completion, while the number of ongoing permanent jobs is usually modest, such Centres have a significant life span.  My Department and its Agencies therefore actively pursue the development of these Centres in Ireland and we have been very successful in doing so. Major world players such as Google, Microsoft, Digital Reality, Amazon, IBM, EMC and ADOBE have made significant investments over recent years. While most such Centres are located in or close to Dublin, a very welcome announcement earlier this year was the decision of Apple to locate in County Galway and the Centre the Deputy refers to in her question will be located in County Meath.  In order that we have the right conditions in place to improve our attractiveness, we have addressed a range of issues. These include ensuring that a top-class telecoms infrastructure is in place, that appropriate electricity supplies are to hand, that suitably skilled staff are available, that we have strong Data Protection legislation and that Research Capabilities in related key technologies are in place, including the funding of Research and Technology Centres. "
      },
      "contextDate": "2015-11-04"
    },
    {
      "question": {
        "date": "2015-11-04",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-04/writtens/dbsect_61",
          "showAs": "Foreign Direct Investment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-04/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_61"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Jobs",
          "roleType": null
        },
        "showAs": " 35. Deputy Helen McEntee asked the Minister for Jobs, Enterprise and Innovation for an update on the Government's engagement with a company (details supplied) and a local authority in respect of a planned project that proposes to create a significant number of jobs; and if he will make a statement on the matter. [37150/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-04/pq_35",
        "questionNumber": 35,
        "answerText": " Minister for Jobs, Enterprise and Innovation  I met this company in June last to discuss their plans for a proposed Data Centre and shortly afterwards their planning application was lodged. Prior to that decision to proceed, IDA Ireland had worked closely with the company in support of its plans and I am very pleased that the company chose to commit to what is a very significant investment project. This company is a world leader in its field and already has a major facility in Ireland employing a large number of highly skilled staff. In this and other similar cases, there is constant State engagement, mainly through IDA Ireland, to work on any relevant ongoing issues and to promote new investment.  With regard to the planning process, this is obviously dealt with in an independent manner by the statutory authorities. It is very gratifying that Meath County Council, in granting planning permission, was able to process the application well within the prescribed timescale, despite the significance and complexity of the project. In addition, when an appeal was lodged with Bord Pleanála in mid-August last, that body was able to make a decision on the case in about half of its normal 4 month processing period. Its decision to approve the project was made on 23 October last and, in addition, Bord Pleanála at the same time also approved the electricity connection, which was required separately under the Critical Infrastructure planning provisions, and that decision was also made well ahead of the anticipated deadline.  I now look forward to the construction of this facility with the creation of a significant number of construction jobs and to the creation of permanent jobs when the facility is operational, and to its ongoing contribution to the development of the Digital Economy in Ireland. "
      },
      "contextDate": "2015-11-04"
    },
    {
      "question": {
        "date": "2015-11-03",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-03/writtens/dbsect_34",
          "showAs": "Trade Strategy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-03/writtens/mul@/dbsect_34.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_34"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "showAs": " 111. Deputy Helen McEntee asked the Minister for Foreign Affairs and Trade further to his Dáil statement on 30 April 2015 regarding his efforts, as Minister, to promote Ireland's trade and export markets through his work with embassies, agencies and businesses, if he will update Dáil Éireann on his Department's efforts to promote a particular initative (details supplied); and if he will make a statement on the matter. [36984/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-03/pq_111",
        "questionNumber": 111,
        "answerText": " Minister for Foreign Affairs and Trade  I warmly welcomed the announcement earlier this year by my colleague, Minister Paschal Donohoe, T.D., and Mr. Niall Gibbons, CEO of Tourism Ireland, of the ‘Ireland’s Ancient East’ tourism offering. Ireland has a rich archaeological heritage that is worthy of being celebrated and shared with the world.  The Embassy network works closely with Tourism Ireland and its representatives overseas, regularly promotes Irish tourism – including ‘Ireland’s Ancient East’ – through its extensive network of social media sites, and supports tourism-promotion events in the network’s countries of accreditation. To give two examples from the past six weeks, at the beginning of October, the Ambassador to France supported the launch in Paris of ‘Ireland’s Ancient East’ at the IFTM (International French Travel Market), the largest travel trade exhibition in France, which attracts almost 30,000 visitors each year including influential tour operators and travel agents, as well as business tourism decision-makers and leading French travel media. On 22 September, the Embassy of Ireland in Copenhagen hosted a tourism promotion event with Tourism Ireland Nordics, to promote ‘Ireland’s Ancient East’ to tourism agents in Denmark.  In my response to the Spring Statement of 30 April 2015, I gave a broad outline of the extensive work of my Department in promoting Ireland’s trade, tourism, investment and education services overseas.  In this work, my Department and its Embassy network work closely with other Government Departments, including the Departments of Agriculture, Food and the Marine; Education and Skills; Jobs, Enterprise and Innovation; and Transport, Tourism and Sport, as well as with the relevant State agencies – Bord Bia, Enterprise Ireland, IDA Ireland, Tourism Ireland and Science Foundation Ireland. Moreover, each of these is represented at Ministerial or CEO level on the Export Trade Council, which I chair. The ETC co-ordinates the implementation of the Government Trade, Tourism and Investment Strategy and its Review, which was published in February 2014. It met most recently on 6 October last.  The Embassy network, comprising over 80 missions, plays a frontline trade promotion role. The network proactively addresses market access issues, supports Irish businesses seeking to grow overseas, holds promotional events for, and in association with, State agencies and actively contributes to the organisation and conduct of Enterprise Ireland Ministerial-led trade missions and events overseas. In each of Ireland’s priority markets, Local Market Teams, chaired by the Ambassador, bring together the diplomats and State agency representatives present in the market to devise and implement annual Local Market Plans to steer Ireland’s trade, tourism, investment and educations efforts overseas. These annual plans and implementation reports are reviewed by the Export Trade Council each year.  Our air connectivity continues to grow, not least through the efforts of our Local Market Teams in lobbying for greater air access by supporting negotiations for increased capacity and expanded services on air routes to Ireland. There are regular welcome announcements of new routes and increased frequency on existing routes by airlines serving Irish airports. For instance, in late October, Aer Lingus announced an increase in the number of US destinations it serves by 50%, and will begin operating new direct flights from Dublin to Los Angeles, Newark and Hartford (Connecticut) next year. Such an expansion of routes represents a prime opportunity for tourism initiatives such as ‘Ireland’s Ancient East’ to be marketed to key overseas audiences, in addition to facilitating increased bilateral trade and investment. "
      },
      "contextDate": "2015-11-03"
    },
    {
      "question": {
        "date": "2015-11-03",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-03/writtens/dbsect_44",
          "showAs": "Consular Services Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2015-11-03/writtens/mul@/dbsect_44.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_44"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Helen-McEntee.D.2013-03-27",
          "memberCode": "Helen-McEntee.D.2013-03-27",
          "showAs": "Helen McEntee"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "showAs": " 121. Deputy Helen McEntee asked the Minister for Foreign Affairs and Trade for an update on his Department's efforts to support the families and friends of Irish students who lost their lives in Berkeley in California in the United States of America in June 2015; and if he will make a statement on the matter. [36985/15] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2015-11-03/pq_121",
        "questionNumber": 121,
        "answerText": " Minister for Foreign Affairs and Trade  The tragedy in Berkeley, California in June claimed the lives of six young Irish citizens and a further seven Irish students suffered serious injuries. Our response was led by my Department in Dublin and by our Consulate General in San Francisco, the latter reinforced by additional experienced officers from our Embassy in Washington.  The Department quickly activated its Emergency Consular Response Centre to provide immediate consular assistance to those affected by the tragic incident. Practical assistance was provided to the families of the deceased and injured Irish citizens, with designated liaison officers being assigned to assist families making arrangements for travel and repatriation. On arrival in San Francisco families were met by an expert Consular team, who provided consular assistance and guidance during a very difficult time.  The Consul General and his team in San Francisco played a crucial role, liaising with the families of the victims, with other J1 students and with the local authorities. An incident Centre at the City Hall in Berkeley was established by the Consul General with the assistance of the local authorities and local Irish community groups. Minister Deenihan and the Irish Ambassador in Washington travelled to San Francisco to support the families and to attend memorial events, demonstrating the solidarity of the people and government of Ireland.  In the weeks and months that have followed the incident, the Consul General and his team, and the Consular Division of my Department here in Dublin have continued to provide sustained consular support to the injured students recovering in hospital and to their families, and to the families of those who tragically lost their lives.  I would like to reiterate my appreciation for the valuable support of the Dublin Airport Authority and of Aer Lingus, who showed such flexibility and generosity in facilitating arrangements for the repatriation of the deceased and injured students and their families back home to Ireland. My Department also liaised closely with the HSE and with concerned parties, including the J1 travel companies and the educational institutions in Ireland, in the days and weeks following the incident.  I wish to reassure the Deputy that officials of my Department will continue to liaise with the families of those affected by the tragedy and will continue to provide them with any consular assistance they require. "
      },
      "contextDate": "2015-11-03"
    }
  ]
}