{
  "head": {
    "counts": {
      "questionCount": 151,
      "resultCount": 151
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Health  After a hearing in the Labor Court in June, it was recommended that a final extension of the current Special Scheme to the 31st of December 2025, at which point anyone remaining on the scheme should transition to the Public Service Sick Leave Scheme. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme. The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 902. Deputy Ann Graves asked the Minister for Health the Government’s rationale for ceasing the financial support on 31 December for healthcare staff who contracted life changing COVID infections, though no fault of their own, in their workplace, in the early pandemic; and can the Minister consider continuing this financial support. [69335/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_749",
          "debateSectionId": "dbsect_749",
          "showAs": "Covid-19 Pandemic Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_749.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_902",
        "questionNumber": 902
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including setting fares and licensing dispatch operators, is a matter for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  Given the NTA's responsibility in this area, I have referred your question to the NTA for further information. Please advise my private office if you have not received a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 64. Deputy Ann Graves asked the Minister for Transport to carry out a review of the dispatch operator licensing system; to introduce an amendment or regulation clearly prohibiting fares below the taximeter; and to introduce stronger rules ensuring fare parity, transparency, and protection of driver incomes. [67341/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "showAs": "Taxi Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_64",
        "questionNumber": 64
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  There are a range of protections under employment law for employees facing redundancy or the loss of their job.  Redundancy is where an employee loses their job because their employer is closing their business or reducing the number of staff. It occurs when a job no longer exists, an employee is let go and they are not replaced. This is set out in the Redundancy Payment Act 1967, as amended.  Where a genuine redundancy situation arises, an employee with more than two years’ service with that employer and who is in insurable employment within the meaning of the Social Welfare Acts is entitled to a statutory redundancy payment.  In general, dismissal of an employee due to redundancy is not deemed to be an unfair dismissal. An employee with more than one year’s service is protected under the Unfair Dismissals Act 1977, as amended. In such cases, an employer must be able to demonstrate that the redundancy is genuine and the selection criteria and the redundancy process is substantively and procedurally fair.  Under the Work Life Balance and Miscellaneous Provisions Act 2023, all employees have the right to make a statutory request for remote working. By law, their employer must provide a reasoned written response to this request. The Workplace Relations Commission (WRC) has a published Code of Practice which provides practical guidance on such requests here: www.workplacerelations.ie/en/what_you_should_know/codes_practice/code-of-practice-for-employers-and-employees-right-to-request-flexible-working-and-right-to-request-remote-working/.  In addition, under the Employment Equality Act 1998, as amended, discrimination on the grounds of disability is prohibited. Employers are required to consider “reasonable accommodations” for persons with a disability.  Where an employee believes their employer has breached their employment rights, they can make a complaint to the WRC. In most cases, complaints must be made within 6 months of the alleged breach. The WRC can extend this to 12 months if the employee demonstrates reasonable cause. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 186. Deputy Ann Graves asked the Minister for Enterprise, Tourism and Employment the protections in place to protect people, from being made redundant, who have a medical condition that prevents them from working in the workplace but are working satisfactorily and productively from home. [67376/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_170",
          "debateSectionId": "dbsect_170",
          "showAs": "Employment Rights",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_170.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_186",
        "questionNumber": 186
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The State Examinations Commission (SEC) has responsibility for the operation and delivery of the State examinations, including the grading of Leaving Certificate projects, and Additional Assessment Components.  In view of this, I have asked the SEC to respond directly to the Deputy on this point. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 220. Deputy Ann Graves asked the Minister for Education and Youth if consideration will be given to finding a proper AI detection system in order that second-level senior certificate cycle projects can be graded fairly, and any cheaters identified and excluded from the process. [67426/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_204",
          "debateSectionId": "dbsect_204",
          "showAs": "Artificial Intelligence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_204.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_220",
        "questionNumber": 220
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Transition Year is a valuable programme for students that offers opportunities to develop future life skills, for personal, social and academic development and to experience other aspects of adult and working life. Transition Year can bring a unique and important value into the lives of students.  The management authority of each school carries responsibility for making decisions regarding the Transition Year programme in that school. Each school designs its own Transition Year programme, within set guidelines, to suit the needs and interests of its students.  Currently, the Transition Year programme is supported by the Transition Year Grant, which is paid on a per capita basis each year in addition to regular capitation payments to all post-primary schools in the free scheme. As part of the capitation package in Budget 2024, the rate of the Transition Year Grant was restored to the pre-2011 level of €100 per student in post-primary schools.  Transition Year is also supported through the payment of teachers’ salaries and the provision of capital funding to schools. The number of students in Transition Year is taken into account when the teaching allocation available to a school is determined, in line with the relevant circulars.  Under the final phase of the Post-Primary Schoolbooks Scheme, free schoolbooks and core classroom resources are being provided to all students in post-primary schools in the Free Education Scheme from the current school year. Under this scheme the per capita rate paid to schools for students in Transition Year is €142 in line with recognised student enrolment.  The Post-primary Schoolbooks Scheme removes the cost from families of funding schoolbooks and core classroom resources for students in post-primary schools in the Free Education Scheme. Schools may use any surplus funding to provide additional classroom resources, defined in the scheme guidance as the supporting materials for any subject, required by students to complete projects and practical elements of the curriculum, beyond schoolbooks and core classroom resources. Expenditure under additional classroom resources is limited to expenditure that, up to the commencement of the scheme, was borne by parents/guardians, either by providing the item themselves or by paying a fee to the school to provide the item. Schools are required to inform parents/guardians of the classroom resources now covered under the scheme. Where additional classroom resources are required but cannot be covered under the scheme, parents/guardians must be advised of how these items will be provided. Schools should either provide parents/guardians with a list of the specific items that they are required to purchase or provide them with information of the fee that the school will charge and a list of items that the school will provide for this fee.  No mandatory charge or fee may be levied on parents or students in respect of instruction in any subject of the school curriculum where all students are expected to take part. This applies to all recognised schools in the Free Education Scheme.  It is also permissible for a school to seek payments in respect of extra-curricular activities provided such activities are not obligatory and individual pupils can choose whether or not to participate. No pupil should be disadvantaged in their learning due to the non-payment of fees.  If a parent is concerned about a requested payment, they can contact the school to discuss. Schools should support parents that are struggling to pay, through offering different methods of payment options including instalments, or fee waivers considering the individual circumstance.  Under the redevelopment of Senior Cycle, I am committed to ensuring that in the future, every student in every school who wishes to participate in the programme will have the opportunity to do so.  The Programme for Government and the Senior Cycle Redevelopment Implementation Support Measures document contain commitments to work with students and schools to identify and address any barriers that remain to ensuring that all student who wish to avail of Transition Year can do so.  At present, over 99% of schools indicate that they offer a Transition Year programme, however, not every school is able to accommodate every student who wishes to participate. The 2024/25 school year saw a continued trend of record participation in TY with over 60,000 students enrolled or just over 80% of the number of students enrolled in Third Year in the previous year.  My officials are currently assessing the level of unmet demand for access to TY, identifying the causes, and determining how to allow schools meet that demand. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 222. Deputy Ann Graves asked the Minister for Education and Youth further to Parliamentary Question No. 553 of 12 November 2025, if there is financial assistance available for parents/guardians who cannot afford the cost of transition year in certain schools. [67433/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_207",
          "debateSectionId": "dbsect_207",
          "showAs": "School Costs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_207.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_222",
        "questionNumber": 222
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Under the provisions of the Education Act 1998, the board of management is the body charged with the direct governance of a school. Section 24 of the Education Act 1998 (as amended by the Education (Amendment) Act 2012), provides that the appointment, suspension and dismissal of teachers are the responsibility of boards of management of recognised schools or, where the employer is a person other than a board, by that person.  While the Department sets out the composition of boards of management and rules of procedure it is not directly involved in the management of schools. The Department does not have the legal powers to instruct a school to follow a particular course of action regarding individual complaint cases, or to investigate individual complaints except where the complaint involves a refused enrolment, expulsion or suspension, in accordance with section 29 of The Education Act, 1998.  The principal is responsible for the day-to-day management of the school, including guidance and direction of the teachers and non-teaching staff of the school. The principal is accountable to the board for that management.  Circulars 0048/2018 and 0049/2018 provide the procedures for boards of management to adhere to in relation to professional competences issues and general disciplinary matters for teachers and principals in Education and Training Board (ETB) schools, and Primary, Secondary and Comprehensive Schools, respectively. Circular 0050/2018 provides for the suspension and dismissal of principals of community national schools. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 223. Deputy Ann Graves asked the Minister for Education and Youth the role of the board of management regarding holding principals to account in secondary schools. [67434/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Schools Administration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_223",
        "questionNumber": 223
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Applications for social housing support are assessed by the relevant local authority, in accordance with the eligibility and need criteria set down in section 20 of the Housing (Miscellaneous Provisions) Act 2009, as amended, and the associated Social Housing Assessment Regulations 2011, as amended.  A household shall be ineligible for social housing support if that household has alternative accommodation it could reasonably be expected to use to meet its housing need. However, where an applicant for social housing support owns accommodation occupied by a spouse, from whom they are formally separated or divorced, a deed of separation is sufficient to set aside this ineligibility ground. It is not necessary to await judicial separation or divorce to get a decision on social housing support in these cases.  Local authorities may provide such households with social housing support under the Rental Accommodation Scheme (RAS) or the Housing Assistance Payment (HAP) scheme until ownership of the family home is resolved in a formal separation or divorce settlement.  Support in these circumstances will be reviewed by the local authority at prescribed intervals and the household will not be able to transfer to other forms of social housing support while ownership of the family home remains to be determined. However, where the household ultimately qualifies for the full range of social housing supports, the length of time the household was supported under RAS or HAP will be reckonable for the purposes of determining the household’s relative priority for a transfer to local authority social housing. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 319. Deputy Ann Graves asked the Minister for Housing, Local Government and Heritage the housing supports in place for male victims of domestic violence who owned the family home, continue to pay the mortgage due to the fact children remain in the family home, and had to flee the home due to violence and whose wife was never on the mortgage. [67436/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_292",
          "debateSectionId": "dbsect_292",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_292.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_319",
        "questionNumber": 319
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The accommodation needs of victims of domestic violence are met through a joined-up service delivery model provided by Cuan with the close involvement of the various housing authorities nationwide. These services were formerly under the remit of Tusla.  The Rent Supplement scheme is administered by my Department. Access to Rent Supplement can be provided by Cuan-funded service providers. This provides victims of domestic violence with a fast-track approval and screening process with a simplified means test to get immediate access to Rent Supplement so that they are not prevented from leaving their home because of financial concerns.  A list of national and local service providers for victim-survivors of domestic, sexual and gender-based violence can be found on www.alwayshere.ie.  The standard Rent Supplement means test does not apply to these applicants for an initial three-month period. After three months, a further three-month extension may be provided, subject to the usual Rent Supplement means assessment.  After six months, if the tenant has a long-term housing need, they can apply to their local housing authority for social housing supports and, if eligible, will be able to access the Housing Assistance Payment. As the Deputy may be aware, the Department of Housing, Local Government and Heritage is responsible for the Housing Assistance Payment.  Furthermore, my Department may provide financial assistance under Additional Needs Payments to assist those who have essential expenses, such as rent deposits, rent in advance and household bills, that they cannot pay from their weekly income at this time.  A key Programme for Government commitment is to “Examine how the social protection system can better support people fleeing domestic violence”. I am very aware that my Department has a role to play in supporting victims of domestic violence and my officials continue to engage with Cuan to examine how we can improve the services available to such victims.  If the Deputy has concerns about a particular case, I would ask her to bring it to the attention of my Department.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 365. Deputy Ann Graves asked the Minister for Social Protection the financial supports in place for male victims of domestic violence whose domestic abuse payment cease soon. [67437/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_326",
          "debateSectionId": "dbsect_326",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_365",
        "questionNumber": 365
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) and ensuring that victims and survivors receive the support and care they need is an absolute priority for me. Cuan, the statutory domestic, sexual and gender-based violence agency is committed to providing safe and accessible accommodation and support services for victims and survivors of DSGBV.  As the Deputy's question relates to work being carried out under the remit of Cuan, I have referred it to the Agency for direct response. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 399. Deputy Ann Graves asked the Minister for Justice, Home Affairs and Migration the supports in place for male victims of domestic violence in Fingal, County Dublin. [67435/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_358",
          "debateSectionId": "dbsect_358",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_399",
        "questionNumber": 399
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 517, 520, 528, 530, 531, 532, 533, 534, 578, 589 and 598 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, proposals for screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 528. Deputy Ann Graves asked the Minister for Health the position regarding adding spinal muscular atrophy to the national heel prick test (details supplied). [67350/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_528",
        "questionNumber": 528
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 554. Deputy Ann Graves asked the Minister for Health the number of WTE consultant orthopaedic surgeons with a special interest in knee and replacement surgery at Beaumont Hospital in 2024 and to-date in 2025 that are only dealing in the treatment of public patients; and the average waiting time to see a consultant orthopaedic surgeon for the first time as an outpatient at the hospital, in tabular form. [67528/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_490",
          "debateSectionId": "dbsect_490",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_490.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_554",
        "questionNumber": 554
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 555. Deputy Ann Graves asked the Minister for Health the number of WTE clinical specialist radiographers posts that were filled at CHI Temple Street in 2023, 2024 and to-date in 2025, in tabular form. [67529/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_491",
          "debateSectionId": "dbsect_491",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_491.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_555",
        "questionNumber": 555
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 556. Deputy Ann Graves asked the Minister for Health the number of children who were scheduled for scoliosis treatment or surgery in either Britain or the US for the period of January 2025 to November 2025; and the number who are scheduled for such treatment or surgery in either Britain or the US over the next three months. [67530/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_492",
          "debateSectionId": "dbsect_492",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_492.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_556",
        "questionNumber": 556
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 557. Deputy Ann Graves asked the Minister for Health if her Department has provided any resourcing or staffing to HSE to support expanded infectious disease screening at ports of entry. [67531/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_493",
          "debateSectionId": "dbsect_493",
          "showAs": "Infectious Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_493.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_557",
        "questionNumber": 557
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 558. Deputy Ann Graves asked the Minister for Health the number of WTE secretaries filled working within the neurology department of Beaumont Hospital in the years of 2023, 2024 and to-date in 2025, in tabular form. [67532/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_494",
          "debateSectionId": "dbsect_494",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_494.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_558",
        "questionNumber": 558
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 186. Deputy Ann Graves asked the Minister for Transport to consider increasing the frequency of bus services on routes (details supplied) or finding alternative solutions to ensure that passengers are not left stranded and can rely on public transportation for their daily commute. [65151/25] ",
        "debateSection": {
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_200",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_200",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_200.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ann Graves",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 186,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Dublin Bus. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_186",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 752. Deputy Ann Graves asked the Minister for Children, Disability and Equality to ensure that children in afterschool care receive AIMs support; and to consider granting funding to afterschool programmes that require special needs assistants for the children that would avail of SNAs in their mainstream school environment. [65196/25] ",
        "debateSection": {
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_668",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_668",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_668.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ann Graves",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 752,
        "answerText": " Minister for Children, Disability and Equality  The Access and Inclusion Model (AIM) was introduced in 2016 to ensure that children with disabilities can fully access and participate in the Early Childhood Care and Education (ECCE) programme, a universal two year pre-school programme available to all children within the eligible age range of 2 years and 8 months to 5 years and 6 months.  AIM provides a suite of universal and targeted supports across seven levels, tailored to meet the needs of children and pre-school settings. Importantly, access to AIM support does not require a formal diagnosis.  AIM does not operate a Special Needs Assistant (SNA) model. Instead, AIM Level 7 support provides additional funding to pre-schools where a child requires extra assistance. This funding enables providers to reduce the child-to-adult ratio in the pre-school room or to fund an extra staff member as a shared resource with other children in the ECCE setting. In recognition of best practice in this area, this support is designed to improve inclusion and ensure meaningful participation of all children in the room.  In line with commitments under First 5: A Whole-of-Government Strategy for Babies, Young Children and their Families, an independent evaluation of AIM has been completed. The findings are informing the extension of AIM beyond the ECCE programme and identifying potential enhancements to the model.  The first phase of this expansion commenced in September 2024, extending AIM supports for ECCE-age children for up to three additional hours per day during term time, and up to six additional hours outside of term time.  Work is now underway on a tailored model to extend AIM to children under three years of age, ensuring it meets the specific needs of this younger cohort.  Consideration will also be given, at a later stage, to extending AIM to children attending school-age childcare. It is critical that any extension of AIM supports to this age cohort is evidence-based and reflective of need. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_752",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 382,
        "showAs": " 382. Deputy Ann Graves asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation further to Parliamentary Question No. 95 of 5 November 2025, if he will clarify the specific information concerning charities that are subject to an FOI request; and if he will clarify if a charity or institution is in receipt of tax payers money, including a theatre (details supplied), should the organisation be subject to the Freedom of Information Act 2014. [63275/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "showAs": "Ann Graves",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_382",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_322",
          "showAs": "Freedom of Information",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_322",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Section 6(1) of the Freedom of Information Act 2014 sets out various criteria by which it may be determined whether or not FOI applies to a body. In general terms, the criteria in Section 6 relate to the extent of State involvement in the governance structures of an organisation. The manner in which an organisation is set up, and its associated governance structure, is, in more determinative of its being subject to FOI than the organisation's funding source.  In the case of charities, if a charitable organisation has not been set up under legislation, or is not run by a State body, then it would not typically be subject to FOI. However, the legislation allows, in principle, for access to records physically held by a charity \" if and insofar as \" they relate to a service to be provided to a public sector body that is subject to FOI. Such a request should be processed in accordance with the legislation by the relevant public sector body.  Freedom of Information requests are decided on a case-by-case basis, depending on the contents of the records concerned. As such, it would be the decision of the public sector body in receipt of the FOI request to determine whether or not a charity is a service provider in the context of a specific request. When making its decision, it should pay heed to the nature of the working relationship, if any, between the public body and the organisation. Comprehensive review mechanisms are available under the Freedom of Information Act where a requester is dissatisfied with the decision they receive.  I trust this clarifies matters for the Deputy. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1072,
        "showAs": " 1072. Deputy Ann Graves asked the Minister for Health the amount raised through parking charges at car parks in hospitals across the State from 2023 to date in 2025, by year, in tabular form. [63279/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Ann Graves",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1072",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_857",
          "showAs": "Hospital Facilities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_857",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_857.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  This Government is committed to delivering on Ireland’s responsibility to address the climate crisis.  The Environmental Protection Agency’s (EPA’s) most recent emissions reporting confirms that Ireland has recorded overall greenhouse gas (GHG) emission reductions for a third consecutive year, with a decrease of 6.8% in 2023 followed by a further 2% reduction in 2024. However, EPA projections show that more progress must be made.  It is clear that to meet our ambitious targets we need to further accelerate emissions reductions. We have established a number of cross-departmental taskforces which are supporting the delivery of measures in key sectors across the economy.  Our strengthened climate governance and delivery framework will help build on the momentum we have achieved in delivering climate solutions, for example:  • Electricity generation from renewables has increased fivefold since 2005.  • Onshore Wind energy provided 48% of Ireland’s power last February and last January Ireland hit the important milestone of hitting 5GW of installed onshore wind capacity.  • The 2025 ZEVI target for electrical vehicle sales of 195,000 was surpassed in October.  The Budget 2026 allocation provides continued support for renewable energy research, including investment in the SEAI's National Energy Research Development and Demonstration Funding Programme, which invests in innovative energy research projects and provides supports to industry and academia to accelerate solutions for Ireland's transition to a clean and secure energy future.  In relation to environmental policy and regulations, my Department is currently progressing a Bill to amend the Air Pollution Act that will provide robust legislation to protect people across Ireland from the harmful impacts of air pollution and strengthen the suite of enforcement tools available to Local Authorities to tackle the sale and supply of non-compliant solid fuels.  The Circular Economy Act 2022 provides the legal framework to reduce waste and keep resources in use for longer. This includes measures like the successful introduction of a the Deposit Return Scheme for plastic bottles and cans and placing levies on single-use items. My Department has just concluded a public consultation on Ireland’s Second Whole of Government Circular Economy Strategy, which, when published in early 2026, will support a range of innovative measures to further reduce waste and deliver on the potential to increasing our circularity.  The policies outlined above will be kept under review to ensure that they remain responsive to Ireland's evolving climate and environmental challenges, and are fit for the purpose of meeting our domestic and international commitments. ",
        "to": {
          "showAs": "Climate",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_204.xml"
            }
          },
          "debateSectionId": "dbsect_204",
          "showAs": "Climate Action Plan",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_204"
        },
        "questionNumber": 257,
        "date": "2025-11-12",
        "showAs": " 257. Deputy Ann Graves asked the Minister for Climate, Energy and the Environment in view of the Intergovernmental Panel on Climate Change highlighting the urgency of reducing carbon emissions, accelerating the transition to renewable energy, and strengthening environmental policies, in further noting that Ireland has made progress with the Climate Action Plan, more ambitious measures are needed to meet our legally binding targets under the Climate Act 2021 and the EU Green Deal, the actions the Government has taken support policies that cut carbon emissions, increase funding for renewable energy research and advocate for stricter environmental regulations. [62033/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_257"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Finance  I am advised by Revenue that the VAT rating of goods and services is subject to EU VAT law, with which Irish VAT law is obliged to comply. In general, the VAT Directive provides that all goods and services are liable to VAT at the standard rate, unless they are either specifically exempt from VAT or they fall within the categories listed in Annex III of the Directive, to which Member States may apply lower VAT rates subject to certain rules.  In compliance with the Directive Ireland applies a VAT exemption to the provision of childcare services. This means that childcare providers do not register for VAT, do not charge VAT on the supply of the supply of their services and, consequently, have no VAT recovery entitlement on their input costs.  This VAT exemption ensures that childcare providers are not required to add VAT onto the price they charge their customers. There is no discretion under the Directive to disapply the VAT exemption from the supply of childcare services. There is also no discretion under the Directive to introduce a new tax provision to relieve childcare providers of VAT that they incur in the course of their business. ",
        "to": {
          "showAs": "Finance",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_338.xml"
            }
          },
          "debateSectionId": "dbsect_338",
          "showAs": "Tax Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_338"
        },
        "questionNumber": 393,
        "date": "2025-11-12",
        "showAs": " 393. Deputy Ann Graves asked the Minister for Finance to consider entering discussions with the childcare provider groups and for the issue of VAT and rates to be looked at with regard to be VAT neutral as opposed to being VAT negative (details supplied). [62040/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_393"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Under the provisions of the Education Act, 1998 the Board of Management is the body charged with the direct governance of a school.  No mandatory charge or fee may be levied on parents or pupils in respect of instruction in any subject of the school curriculum where all pupils are expected to take part. This applies to all recognised schools in the Free Education Scheme.  A school may, however, seek payment to cover the cost of learning materials where the amount sought by the school is consistent with the costs involved and the level of materials provided. It is also permissible for a school to seek payments in respect of extra-curricular activities provided such activities are not obligatory and individual pupils can choose whether or not to participate. No pupil should be disadvantaged in their learning due to the non-payment of fees.  If a parent is concerned about a requested payment, they can contact the school to discuss. Schools should support parents that are struggling to pay, through offering different methods of payment options including instalments, or fee waivers considering the individual circumstance. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_476.xml"
            }
          },
          "debateSectionId": "dbsect_476",
          "showAs": "School Costs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_476"
        },
        "questionNumber": 553,
        "date": "2025-11-12",
        "showAs": " 553. Deputy Ann Graves asked the Minister for Education and Youth if her Department has a role in putting a cap on transition year fees in secondary schools to ensure lower income families can afford these fees. [62092/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_553"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The number of SNA posts allocated to a school in any individual school year is a matter for the Special Educational Needs Officer (SENO) and that function resides within the National Council for Special Education (NCSE).  As the number of standard SNA posts is determined by the specific needs of each individual school population, and as these needs may vary from year to year due to changes in student enrolment and the evolving requirements of students, arising from factors such as treatment interventions and supports external to the school environment, it is not possible to guarantee that a standard post will be available for every SNA currently in position.  To address the issue of casualisation of employment amongst SNAs, where a school/ETB has an additional allocation of standard SNA hours/posts (e.g. an additional allocation of standard SNA hours/posts or an SNA has left the employment) then that additional allocation of hours/posts must be offered to any existing part-time SNAs in standard SNA posts in that school, in order of seniority, before the employer has recourse to these arrangements.  This means that before an employer opts to recruit further persons as SNAs, they must ensure that all existing part-time SNAs in standard posts in their employment, in order of seniority, have been offered a full-time position in the school or, in the case of ETBs, a full-time position in a school within the ETB scheme.  The purpose of the SNA Supplementary Assignment arrangements is to facilitate eligible SNAs who are being made redundant by one employer in filling SNA vacancies that may become available in another school / ETB.  The Supplementary Assignment Panel allows eligible SNAs who are being made redundant in one school to be considered for SNA vacancies that arise in other schools. It ensures that experienced SNAs in standard posts are supported in continuing their employment when their current post is surplus to the needs of the school they were initially employed in.  Circular 43/2025 [ Recruitment of Special Needs Assistants (SNAs) - Supplementary Assignment Arrangements for the 2025/2026 school year ] (www.gov.ie/en/department-of-education/circulars/recruitment-of-special-needs-assistants-snas-supplementary-assignment-arrangements-for-the-20252026-school-year/) outlines comprehensive details and appropriate steps required to be implemented by schools. The circular defines a standard SNA post as a post which is part of the NCSE quantum of SNA support to a school.  It also clarifies that a substitute or cover SNA post means where a substitute or cover SNA is appointed on a temporary basis to cover a vacancy when an SNA in a standard post is on an approved leave of absence such as: maternity leave, sick leave, career break, job-sharing etc. SNAs employed on a temporary basis, as defined are not eligible for inclusion on the Supplementary Assignment Panel.  For inclusion on the Supplementary Assignment Panel, a SNA must have a minimum of one year’s continuous service in a standard SNA post.  It should be noted that my Department is currently developing a Workforce Development Plan for Special Needs Assistants. As part of this initiative, a new SNA Redeployment Scheme is being designed to facilitate the transfer of eligible SNAs from schools with staffing levels above their approved allocation to schools with identified SNA vacancies. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_477.xml"
            }
          },
          "debateSectionId": "dbsect_477",
          "showAs": "School Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_477"
        },
        "questionNumber": 554,
        "date": "2025-11-12",
        "showAs": " 554. Deputy Ann Graves asked the Minister for Education and Youth when an SNA is under a temporary and fixed term contract, and is actively looking for a permanent role, the reason they can only be placed on a panel when they have a permanent role. [62110/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_554"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the [ Teaching Council Registration Regulations, 2025 ] (www.teachingcouncil.ie/assets/uploads/2025/10/SI.2025.0482_TC_Registration_Regulations.pdf). As set out in the Schedule to the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule to the Regulations.  Under the Teaching Council Acts 2001-2015 the Teaching Council is the body with the statutory authority and responsibility for the regulation of the teaching profession in Ireland including the registration of teachers in the state.  As a statutory body, the Teaching Council is mandated by law to properly determine and to authenticate the relevant standards and qualifications of all applicants for registration, including those who have qualified outside of Ireland.  Given the importance and impact of teaching which affects the lives of learners, the Teaching Council has a responsibility to safeguard entry to the profession in a way that supports quality teaching and learning. The Council also has a responsibility to ensure that all teachers entering the profession have met the same standards. The standards for Initial Teacher Education (ITE) in Ireland are set out in the Council's policy ‘[ Céim: Standards for Initial Teacher Education’ ] (www.teachingcouncil.ie/assets/uploads/2023/08/ceim-standards-for-initial-teacher-education.pdf).  All teacher education programmes in Ireland must be aligned with Céim to gain professional accreditation with the Teaching Council. Therefore, the qualifications of teachers who qualified out-of-state are assessed to ensure they are of a comparable standard to those achieved by graduates of accredited initial teacher education programmes in Ireland. All applications from teachers who qualified outside of the Republic of Ireland are processed in line with the EU Directive 2005/36/EU and are assessed under its general system in the same manner, regardless of whether the applicant qualified within or outside of the EU. Further details on this process can be found on the Teaching Council website (www.teachingcouncil.ie/i-am-applying-to-register/qualified-outside-of-ireland/).  To assist with teacher supply challenges, in the Teaching Council’s recently revised Registration Regulations, 2025, which were effected on 16 October 2025, a mechanism has been created which provides for teachers who completed a teacher education qualification in another country, but have not completed any mandated induction or post-qualification employment period there, to apply for registration and complete Droichead (induction) here in the Republic of Ireland. Specific eligibility and qualification requirements apply to this mechanisms and it is open for applications until 30 December 2027. Overseas qualified teacher applying for registration must complete their programme of study and submit a complete application before this date. Further information in relation to the timebound provision including the eligibility criteria can be found on the Teaching Council website. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_478.xml"
            }
          },
          "debateSectionId": "dbsect_478",
          "showAs": "Teaching Qualifications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_478"
        },
        "questionNumber": 555,
        "date": "2025-11-12",
        "showAs": " 555. Deputy Ann Graves asked the Minister for Education and Youth if her Department has put in place a pathway for those qualified as primary school teachers with a recognised British teaching qualification, who have not completed the two-year induction period in that jurisdiction, to allow them to complete their induction in Ireland. [62112/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_555"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the deputy refers has been approved to enter my Department’s pipeline of school building projects under the Additional School Accommodation (ASA) Scheme. This approval is to facilitate the provision of a four-class Special Educational Needs (SEN) base with associated ancillary facilities, and two SEN classrooms, under my Department’s Devolved SEN Repurposing and Modular Accommodation Programme.  The project, approved under the ASA Scheme, is currently progressing through Stage 1, and my Department is awaiting the submission of an early design report from the appointed design team for review. Responsibility now rests with the school to progress the project in line with the established process.  The project, approved under the Department’s Devolved SEN Repurposing and Modular Accommodation Programme, is currently in the delivery phase and construction has commenced on site.  At the time of the most recent assessment, the school was considered to have sufficient mainstream accommodation. If the school now anticipates that its current capacity will not accommodate projected enrolment, it is open to them to apply under the ASA scheme for consideration.  Any such application will be evaluated in the context of the Department’s National Development Plan (NDP) implementation framework, as well as the specific needs and capacity of the school and the broader School Planning Area.  My department will continue to engage with the school authority to provide practical advice and assistance for the progression of this much needed project. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_480.xml"
            }
          },
          "debateSectionId": "dbsect_480",
          "showAs": "School Enrolments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_480"
        },
        "questionNumber": 557,
        "date": "2025-11-12",
        "showAs": " 557. Deputy Ann Graves asked the Minister for Education and Youth if her Department has any plans to increase capacity in a school (details supplied) to cater for the growing number of applicants in the area. [62119/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_557"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Government is committed to consideration of remediation costs already incurred as part of the drafting of the Apartments and Duplex Defects Remediation Statutory Scheme.  A Retrospective Costs Pathfinder project using a representative sample of Multi-Unit Developments (MUDs) has been established to identify an appropriate process to address retrospective issues more broadly. In particular, the Pathfinder project will support development of a robust process around:  • Alignment with the existing Interim Remediation Scheme processes;  • Supporting Documentation and Timeframes;  • Certification and Standardisation of Evidence;  • Verification and Payment processes.  As the design of the retrospective element of the Statutory Scheme will be informed by the outcomes of the Retrospective Costs Pathfinder project, it is not currently possible to provide further details of how retrospective payment will operate in practice. The aim is to identify a process that provides a streamlined approach, ease of engagement by applicants and ensures good governance regarding Exchequer funding. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_558.xml"
            }
          },
          "debateSectionId": "dbsect_558",
          "showAs": "Fire Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_558"
        },
        "questionNumber": 640,
        "date": "2025-11-12",
        "showAs": " 640. Deputy Ann Graves asked the Minister for Housing, Local Government and Heritage if persons who have already paid and are out of pocket for fire safety defects in apartment blocks will be reimbursed under the retrospective payments scheme. [62039/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_640"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The First Home Scheme, which launched in July 2022, is a shared equity scheme, designed to help bridge the gap for eligible first-time buyers, eligible homebuyers, and self-builders, between their deposit and mortgage, and the price of their new home (within price ceilings established across the country). Full details are available on the First Home Scheme website: www.firsthomescheme.ie.  The First Home Scheme Designated Activity Company (DAC) is fully responsible for the operation of the First Home Scheme on behalf of all shareholders, including price ceiling reviews. At its launch, the First Home Scheme Designated Activity Company (DAC) announced it would review all price ceilings at 6-month intervals. The DAC take into account a range of factors as part of these reviews, including the median price and volume of new builds purchased by first time buyers in each local authority area.  At the end of June 2025, the First Home DAC published the outcome of its sixth scheduled review of the price ceilings that apply to qualifying homes and subsequently revised price ceilings. New price ceilings were agreed for 16 local authority areas, including homes in the four Dublin local authority areas.  The price ceilings for Dublin increased to €500,000 which came into effect on 1 July 2025. The First Home Scheme DAC will continue to monitor the price ceilings, including in the four Dublin local authority areas as part of any future review. The next review is expected to take place in December.  More information on price-ceiling reviews is available at the following link: www.firsthomescheme.ie/about-the-scheme/property-price-ceilings/. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_559.xml"
            }
          },
          "debateSectionId": "dbsect_559",
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_559"
        },
        "questionNumber": 641,
        "date": "2025-11-12",
        "showAs": " 641. Deputy Ann Graves asked the Minister for Housing, Local Government and Heritage if his Department has carried out a review of the first home scheme; and if his Department has agreed to raise the price ceiling for Dublin properties. [62081/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_641"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Statutory and operational responsibility for the delivery of child protection and welfare services is a matter for Tusla, the Child and Family Agency. The Deputy is seeking information in relation to an operational matter for Tusla. Consequently, I have referred the matter to Tusla, and requested that a direct response be provided to the Deputy. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_765.xml"
            }
          },
          "debateSectionId": "dbsect_765",
          "showAs": "Child Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_765"
        },
        "questionNumber": 896,
        "date": "2025-11-12",
        "showAs": " 896. Deputy Ann Graves asked the Minister for Children, Disability and Equality the training and resources which are provided to Tusla to assist staff in identifying and supporting victims of grooming; and if she will make a statement on the matter. [61996/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_896"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health (Deputy Mary Butler)  ADHD has long been recognised as one of the most common psychiatric disorders in children and it is now known to persist into adulthood. Core symptoms include inattention, hyperactivity and impulsivity.  This National Clinical Programme is based on multi-disciplinary community teams to diagnose and treat ADHD in adults. As Minister, I'm proud to have launched the Model of Care for Adult ADHD and to have resourced the establishment of the teams envisioned by the Model of Care. The ADHD Programme is funded with total funding of over €5 million on a recurring annual basis. As a result, there are 8 teams funded, with 7 teams are currently operational. Additional funding was secured by myself as Minister in Budget 2025 to roll out all further teams envisaged in the Model of Care. Work is ongoing by the HSE to to operationalise these teams as soon as possible.  In relation to the additional specific information requested regarding this individuals options for an ADHD assessment, as this is an operational matter , I have referred it to the HSE for direct reply to you ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_968.xml"
            }
          },
          "debateSectionId": "dbsect_968",
          "showAs": "Mental Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_968"
        },
        "questionNumber": 1112,
        "date": "2025-11-12",
        "showAs": " 1112. Deputy Ann Graves asked the Minister for Health the options available to a person (detail supplied) to have an assessment to get correct medication. [62123/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1112"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health (Deputy Mary Butler)  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_969.xml"
            }
          },
          "debateSectionId": "dbsect_969",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_969"
        },
        "questionNumber": 1113,
        "date": "2025-11-12",
        "showAs": " 1113. Deputy Ann Graves asked the Minister for Health if she will ensure that a person (details supplied) is moved to a location as soon as possible; and if she will make a statement on the matter. [62124/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1113"
      },
      "contextDate": "2025-11-12"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 11,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works (OPW) can confirm that there is a schedule of maintenance and capital works planned for Swords Garda Station to include the following:  A new perimeter boundary and upgrading of the car park.  Upgrade to the prisoner processing area  Replacement of the single glazed glazing to triple glazing  The replacement of the existing roof covering and upgrading of roof insulation.  These works are included in the 2026 OPW work-plan, with a phased commencement during 2026 - 2027.  The commencement/completion dates for the scheduled works are subject to the final sign off of operational and design requirements by An Garda Síochána and where necessary, the completion of compliant tendering processes.  The occupational capacity of the station and any further refurbishment plans are a matter for An Garda Síochána.  OPW consulted An Garda Síochána Estate Management team and confirm there are no additional upgrade works planned for Swords Garda Station at this time. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_47",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_47",
          "showAs": "Office of Public Works",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_47.xml"
            }
          }
        },
        "showAs": " 11. Deputy Ann Graves asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will consider upgrading Swords Garda station to ensure it is fit for purpose. [53794/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_11"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 52,
        "questionType": "written",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Passport Service is successfully responding to demand, and has issued over 833,000 passports to date this year. Virtually all complete passport applications are being processed within or before advertised turnaround times.  With regards to the deputy's query, please see the table below for the number of passports issued in each of the first nine months of 2025:      Month      Passports Issued       Jan    89,729      Feb    91,213      Mar    97,293      Apr    99,489      May    99,722      Jun    82,636      Jul    81,956      Aug    61,902      Sep    69,498       I ask the Deputy to encourage her constituents to apply online for the quickest, cheapest and most efficient service. Passport Online can be used by citizens 24 hours a day, 7 days a week. The Passport Online service is available for all types of applications, including renewal and first time applications for newborns, children, and adults. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Foreign",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_84",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_84",
          "showAs": "Passport Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_84.xml"
            }
          }
        },
        "showAs": " 52. Deputy Ann Graves asked the Tánaiste and Minister for Foreign Affairs and Trade the number of Irish passports issued in each of the first nine months of 2025, in tabular form. [60252/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_52"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 77,
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Irish Rail. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_106",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_106",
          "showAs": "Park-and-Ride Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_106.xml"
            }
          }
        },
        "showAs": " 77. Deputy Ann Graves asked the Minister for Transport the amount raised through parking charges at both car parks at Connolly and Heuston stations in 2023, 2024 and to date in 2025, in tabular form. [60245/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_77"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 78,
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA), including light rail.  The Department of Transport's annual capital allocations from 2026 to 2030, and the Government's overall capital expenditure ceilings to 2035, were confirmed in the recently published National Development Plan Review 2025. My Department is reviewing key programmes and projects in the transport sector in the context of that capital funding envelope and a decision on a programme of delivery with this level of capital investment will be made in the coming months. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_107",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_107",
          "showAs": "Rail Network",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_107.xml"
            }
          }
        },
        "showAs": " 78. Deputy Ann Graves asked the Minister for Transport if funding has been made available in 2026 to lengthen the existing carriages on the Red Luas Line. [60246/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_78"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 95,
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Freedom of Information Act 2014 greatly expanded the number of organisations that are subject to the legislation, setting out broad criteria at Section 6, by which it may be determined whether or not a body is subject to FOI. At present, approximately 600 organisations are subject to FOI, which is designed to promote openness, transparency and accountability in the public sector.  In general, private companies and charities are not FOI bodies in their own right under the terms of the 2014 Act. However, the legislation allows, in principle, for access to records physically held by a company or charity \" if and insofar as \" they relate to a service to be provided to a public sector body that is subject to FOI. Such a request should be processed in accordance with the legislation by the relevant public sector body. Similarly, information relating to funding or other arrangements with the public sector may be requested under FOI through the relevant public body, rather than directly from the private entity concerned.  Therefore, although private companies and charities are not usually subject to FOI in themselves, relevant information may nevertheless be accessible under FOI where such entities have a sufficiently close connection with public sector bodies. As such, there are no plans at present to make the Abbey Theatre subject to the Freedom of Information Act in its own right.  I trust this clarifies matters for the Deputy. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_125",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_125",
          "showAs": "Freedom of Information",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_125.xml"
            }
          }
        },
        "showAs": " 95. Deputy Ann Graves asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if there are plans to include the Abbey Theatre under FOI. [60247/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_95"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 139,
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  The overall capital allocations for the Courts Service for the years 2024-2026 are set out in the table below.     -    2024* €m    2025 * €m    2026** €m      Court Service Capital Allocation    67.5    67.5    71.5     *As per the Revised Estimates Volume  ** As per Budget 2026 ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_165",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_165",
          "showAs": "Court Accommodation",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_165.xml"
            }
          }
        },
        "showAs": " 139. Deputy Ann Graves asked the Minister for Justice, Home Affairs and Migration the capital budget allocation for the Court Services in 2024, 2025 and 2026, in tabular form. [60248/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_139"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 140,
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  Management of the courts, operational matters and logistical functions are the responsibility of the judiciary and Courts Service, which are independent in exercising their functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. The Courts Service has a dedicated email address for the provision of information to members of the Houses of the Oireachtas at: oireachtasenquiries@courts.ie  Refurbishment works are an operational matter for the Courts Service. Therefore, I have referred your question to the Courts Service for their direct reply. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_166",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_166",
          "showAs": "Court Accommodation",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_166.xml"
            }
          }
        },
        "showAs": " 140. Deputy Ann Graves asked the Minister for Justice, Home Affairs and Migration the nature of refurbishment works that were carried out at Swords District Court in 2023, 2024 and to date in 2025, in tabular form. [60249/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_140"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 161,
        "questionType": "written",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Children",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_187",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_187",
          "showAs": "Disability Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_187.xml"
            }
          }
        },
        "showAs": " 161. Deputy Ann Graves asked the Minister for Children, Disability and Equality the locations within CDNTs where hydrotherapy pools are based and fully staffed; and the opening hours of each of those pools, in tabular form. [60250/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_161"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 162,
        "questionType": "written",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Children",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_188",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_188",
          "showAs": "Disability Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_188.xml"
            }
          }
        },
        "showAs": " 162. Deputy Ann Graves asked the Minister for Children, Disability and Equality the number of WTE occupational therapists and speech and language therapists, by grade that are based in each CDNT within CHO9 in 2023, 2024 and to-date in 2025, in tabular form. [60251/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_162"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 168,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_194",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_194",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_194.xml"
            }
          }
        },
        "showAs": " 168. Deputy Ann Graves asked the Minister for Health the current capacity of the HSE to deliver bone anchored hearing aid services; the number of individuals awaiting BAHA's; and the number of surgeons who deliver this procedure within the State. [60243/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_168"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 169,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_195",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_195",
          "showAs": "Hospital Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_195.xml"
            }
          }
        },
        "showAs": " 169. Deputy Ann Graves asked the Minister for Health the number of new critical care beds delivered in 2024 and to date in 2025, by site, in tabular form. [60244/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_169"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29"
        },
        "questionNumber": 175,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_202",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_202",
          "showAs": "Hospital Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_202.xml"
            }
          }
        },
        "showAs": " 175. Deputy Ann Graves asked the Minister for Health if she will ensure that funding for a multidisciplinary FND team (MDT) is made available in the Mater and Beaumont hospitals and beyond to ensure that patients (details supplied) have full access to the same services that are provided in St. James’s Hospital. [60292/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_175"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 864. Deputy Ann Graves asked the Minister for Education and Youth to outline her Department’s plans to increase the number of SNAs and special education places, and to improve school buildings, school funding, school transport, teacher recruitment and retention for schools in Fingal east (details supplied).  [59770/25] ",
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_864",
        "questionNumber": 864,
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  In 2026, over €3 billion will be spent supporting children with special educational needs. It will ensure that specialist capacity continues to grow by providing 3,000 specialist places. The majority of these places will be available in special classes within mainstream schools. It will increase our special educational posts by 860 special education teacher and over 1,700 special needs assistant (SNA) posts. This will mean we will have over 46,500 professionals dedicated to supporting students with special educational needs in our schools. This is one of the highest annual increases in posts to date and is a firm reminder of this government’s commitment to supporting students with special educational needs.  Budget 2026 has also afforded a number of new initiatives such as funding for the roll out of the Education Therapy Service (ETS), the introduction of extra SET hours for post-primary schools to support coordination and transition efforts and indeed a special school package to support the unique challenges these schools face.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  407 new special classes were sanctioned for the 2025/26 school year. Of these 103 are in County Dublin, 81 at primary and 22 at post-primary level. This brings to 705 the number of special classes currently in operation in the county. There are also 420 special schools in County Dublin with approximately 2,7400 students enrolled. Two of these are of the five new special schools for the 2025/26 school year and are located in Lucan and Belmayne.  The NCSE is currently collating the data and information received by 1 October through the parents notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is envisioned that the majority of these special classes will be sanctioned by 31 December 2025.  I would like to stress that the NCSE will continue to support all children made known to them after the 1 October deadline, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required. ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_790",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_790.xml"
            }
          },
          "debateSectionId": "dbsect_790"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1735. Deputy Ann Graves asked the Minister for Health to review the case of a person (details supplied) regarding the provision of blood tests. [58202/25] ",
        "by": {
          "memberCode": "Ann-Graves.D.2024-11-29",
          "showAs": "Ann Graves",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1735",
        "questionNumber": 1735,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Departmental Reviews",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1491",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1491.xml"
            }
          },
          "debateSectionId": "dbsect_1491"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_424",
          "debateSectionId": "dbsect_424"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a weekly allowance paid to people with a specified disability who are aged 16 or over and under the age of 66. This disability must be expected to last for at least one year and the allowance is subject to a medical assessment, a means test and the habitual residency conditions.  The Department periodically reviews claims in payment to ensure that there is continued entitlement. In this case, a means review of the DA claim commenced on 29 August 2024.  The person concerned provided some, but not all, of the information that was requested. A follow up letter then issued on 17 October 2024 informing him of the information that was still required to complete the means review.  Means are any income belonging to the person in receipt of DA and their spouse, civil partner, or cohabitant, property, (except their own home) or an asset that could bring in money or provide them with an income. Means include earnings from employment, financial assets and amounts held in a bank account.  On 06 November 2024, a means review was carried out and the person concerned was assessed with weekly means of €132.50, effective from 23 October 2024. This led to the DA payment for the person concerned reducing to €99.50. They were also notified of their right to request a review and/or appeal of this decision.  The person concerned is currently in receipt of a reduced rate of DA of €111.50 per week.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "showAs": " 514. Deputy Ann Graves asked the Minister for Social Protection to please review the case of a person (details supplied) in the hope that his son can maintain his social welfare because of the extenuating circumstances. [56644/25] ",
        "questionNumber": 514,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_514"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_425.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_425",
          "debateSectionId": "dbsect_425"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  The marriage bar was a legal requirement for women in the Irish civil service and some areas of the public service to retire from employment after marriage. While the legislation applied only to the civil and public sector, a similar policy was adopted by other sectors, such as the banking sector. The marriage bar for civil servants was removed from Irish legislation in 1973.  The marriage bar was also applied by many countries internationally, including some European countries. The application of the marriage bar, and its duration, varied across countries and particular sectors of employment.  In Ireland, the impact of the marriage bar on pension entitlements for women, including State Pension eligibility, varied depending on the sector they worked in and whether they returned to paid employment after the bar was lifted. It is worth remembering that most civil and public servants recruited prior to 1995 are not entitled to the State Pension (Contributory) and would not have been entitled to it had they continued working as a civil or public servant, regardless of gender and marital status, due to the application of a modified PRSI rate.  My Department is not aware of any restitution by EU Member States in relation to any marriage bars that may have been in place.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "showAs": " 515. Deputy Ann Graves asked the Minister for Social Protection the EU Member States that made restitution for historically discriminatory social welfare, particularly in the case of women who have lost out on pension payments due to the marriage bar preventing them from working; and if he will make a statement on the matter. [56658/25] ",
        "questionNumber": 515,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_515"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_462.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_462",
          "debateSectionId": "dbsect_462"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Justice  I can advise the Deputy that the visa applications referred to were created on 13 January 2025. The applications together with supporting documentation were received by the South Africa Visa Desk on 27 January 2025 where they await examination and processing.  My Department’s business target for join family visa applications is 12 months. It must be made clear that these are business targets for the immigration service. The business target reflects the detailed and often complex assessment that is required to be carried out in relation to applications for family reunification.  While I acknowledge the personal difficulties an applicant might be experiencing; it is not possible to give a definitive date as to when these applications will be finalised. All applications are processed in chronological order, based on date order of receipt.  While every effort is made to process applications as soon as possible, processing times will vary having regard to the volume and complexity of applications, the possible need for the Immigration Service Delivery function of my Department to investigate, inquire into, or seek further information, and the resources available.  The Dublin Visa Office have established a dedicated “South Africa desk” to process applications from residents of South Africa. Target processing times and weekly decision reports, for this desk, are available at the following link:  www.irishimmigration.ie/south-africa-visa-desk/  I am acutely aware that join family applications are very important for the people impacted. I understand that people are eager to have their families join them in Ireland, and I am committed to improving the service my Department provides.  The person concerned can now directly check the status of their visa application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at:  www.portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "showAs": " 567. Deputy Ann Graves asked the Minister for Justice, Home Affairs and Migration the status of a visa application for a person (details supplied); the reason for the delay; when the person's application will be processed. [56641/25] ",
        "questionNumber": 567,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_567"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Addiction Treatment Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_708.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_708",
          "debateSectionId": "dbsect_708"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Health   Budget 2026   Recently, Minister Murnane O’Connor announced an additional €11 million in recurring funding for drugs and inclusion health services in Budget 2026. Highlights include €0.75m to improve access to Buprenorphine in OAT services, €0.2m to enhance strategic workforce planning for drug services, €0.33m to increase treatment capacity for under-served populations and €0.1m for other drug initiatives.  Further information on the budget announcement is available at: www.gov.ie/en/department-of-health/press-releases/press-release-minister-for-public-health-wellbeing-and-the-national-drugs-strategy-announces-funding-for-drugs-and-inclusion-health-for-2026/.   Budget 2025   Budget 2025 provided an additional provides €4.2m for new drugs initiatives, including €2m for community based drug services to be expanded to meet increased treatment demand, with a focus on improving access to services in underserved communities, promoting evidence-based innovations in service design and delivery, and meeting the needs of people who use stimulant drugs, and those who have a dual diagnosis. An additional €1m was provided for integrated community alcohol services, €0.4m for harm reduction initiatives and €0.5m for Drug prevention and public awareness campaigns.  Further information on the budget announcement is available at: www.gov.ie/en/department-of-health/press-releases/minister-of-state-colm-burke-announces-additional-40-million-in-funding-for-drug-and-alcohol-services-and-inclusion-health/. And information on the €1.89m Community Service Enhancement Fund announcement is available at: www.gov.ie/en/department-of-health/press-releases/minister-murnane-oconnor-announces-189-million-funding-for-community-based-drugs-services/.   Budget 2024   Budget 2024 provided an additional €4m to implement the national drugs strategy, including €2m to support and expand community-based drug services in conjunction with drug and alcohol task forces, €0.8m for recovery, €0.5m to tackle gambling and gaming addiction, and €0.64m for young people with dual diagnosis.  Further information on the budget announcement is available at: www.gov.ie/en/department-of-health/news/budget-2024-measures-for-national-drugs-strategy-and-inclusion-health/, and information on the €2.3 million to sustain community-based drugs services and to support people in recovery is available at: www.gov.ie/en/department-of-health/press-releases/minister-burke-announces-funding-of-23-million-to-sustain-community-based-drugs-services-and-to-support-people-in-recovery/. ",
        "questionType": "written",
        "showAs": " 820. Deputy Ann Graves asked the Minister for Health the amount each local and regional drugs and alcohol task force will be receiving from Budget 2026; and the way in which this compares with Budget 2024 and Budget 2025. [57124/25] ",
        "questionNumber": 820,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_820"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Budget 2026",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_710.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_710",
          "debateSectionId": "dbsect_710"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  The requested Abridged Estimates Volume for Budget 2026 for Vote 38 is attached.   Abridged Estimates Volume for Budget 2026 for Vote 38  ",
        "questionType": "written",
        "showAs": " 822. Deputy Ann Graves asked the Minister for Health to provide the Abridged Estimates Volume for Budget 2026 for Vote 38 including the provisional sub-head and programme level allocations. [57133/25] ",
        "questionNumber": 822,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_822"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Teaching Council of Ireland",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_144",
          "debateSectionId": "dbsect_144"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule.  The qualifications of teachers who qualified outside of the Republic of Ireland are assessed on an individual and holistic basis for the purposes of registering as a teacher. Qualifications are assessed for comparability with graduates of initial teacher education programmes accredited by the Teaching Council. All applications from teachers who qualified abroad are processed in line with the EU Directive 2005/36/EC and are assessed in the same manner, regardless of whether they qualified within or outside the EU. The EU Directive provides for the assessment of qualifications for the purposes of recognition, and this recognition may be subject to conditions.  To assist further with teacher supply challenges, I announced last April that I would work with the Teaching Council to introduce a proposal to enable eligible teachers who have qualified outside of Ireland to apply for registration and complete their induction requirement here.  I see this as an important step in encouraging more teachers to work and start their careers here in Ireland and I am pleased to note that significant progress has been made towards realising this measure.  Under the Teaching Council Act, the Council makes regulations for the purposes of registration through statutory instrument, including to amend or replace existing regulations. A further Statutory Instrument (SI) was required to establish the proposed creation of this timebound provision. A new set of registration regulations were drafted which included the provision for induction in the state for teachers qualified outside of the state, and on that basis engagement with the Data Protection Commissioner (DPC) was required. A proportionality impact assessment was carried out. There was also consultation with various stakeholders. Legal advice was sought to ensure that the new regulations are appropriate and proportionate, with no legal impediments, which requires more time than applies to an amending an SI.  It is expected that primary and post-primary teachers, who qualified outside of the Republic of Ireland and apply to complete their induction here under the new provision, will be subject to meeting eligibility and qualifications requirements to enable registration.  I am pleased to inform you that the final draft of the new Registration Regulations has been received from the Teaching Council and is progressing through the required procedures so that it can be laid before the Houses of the Oireachtas to be implemented in the coming days.  Please refer to the Teaching Council website, www.teachingcouncil.ie, for updates regarding the making of the new Registration Regulations, and for information on accessing the timebound provision for overseas qualified applicants to register and complete their induction in the State. Queries regarding the procedure involved in relation to the timebound provision should be directed to the Teaching Council once the new Registration Regulations are in place. ",
        "questionType": "written",
        "showAs": " 140. Deputy Ann Graves asked the Minister for Education and Youth if she will clarify a recent statement by the Teaching Council about a timebound provision that will allow teachers who trained abroad to complete the Droichead process and transfer to Route 1 registration; when this timebound provision will be implemented; the process for eligible teachers to apply; and if she will give assurance that this route will remain open long enough to allow those already teaching in Ireland to complete Droichead. [55533/25] ",
        "questionNumber": 140,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ann Graves",
          "memberCode": "Ann-Graves.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Ann-Graves.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_140"
      }
    }
  ]
}