{
  "head": {
    "counts": {
      "questionCount": 448,
      "resultCount": 448
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day to day operations regarding national roads, including toll roads are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll bye-laws and to enter into agreements with private investors are vested in TII under Part V of the Roads Act 1993 (as amended). Moreover, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned.  Please note that motor tax rates are under the remit of the Department of Finance.  Noting the above position, I have referred the question regarding tolls to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 271. Deputy Robert O'Donoghue asked the Minister for Transport his plans to extend the current M50 and Eastlink toll exemptions for motorcycles to all tolled roads; the plans to adjust the annual motorbike road tax for example from €88 to €100 in exchange for nationwide toll access; the plans to provide motorcyclists with the ability to pre-pay or post-pay online, linked to their registration plate, avoiding the need to stop at toll pay points; the plans to develop a weather-resistant toll tag specifically designed for motorcycles; and if he will make a statement on the matter. [71692/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_186",
          "debateSectionId": "dbsect_186",
          "showAs": "Road Tolls",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_186.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_271",
        "questionNumber": 271
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Programme for Government contains a commitment to publish a National Migration and Integration Strategy detailing how the Government intends to meet the demands and opportunities facing Ireland’s society and economy over the next decade. My Department is currently working with other Government Departments to develop this strategy with the aim to publish it in 2026.  As part of this strategic approach, I am reviewing the area of student permissions, including with regard to English Language students. This work is aimed at ensuring that the system remains robust and rules-based, supports high-quality education providers, and continues to offer a positive experience for genuine students coming to Ireland.  I can advise the Deputy that the number of people granted a student immigration permission on Stamp 2 conditions for 2025, will be available in early 2026. The numbers of such permissions granted in 2024 was 60,901. Numbers reflect those required to register/renew in a calendar year. Most renewals are annual. However, there may be students that were required to register/renew multiple times in the same calendar year.  International students from outside the EU/EEA are granted a permission on Stamp 2 conditions where they have enrolled on, and commenced a course listed on the Interim List of Eligible Programmes (ILEP), or eligible programmes offered by providers with authorisation to use the new TrustEd Education mark awarded by the Quality and Qualifications Ireland (QQI).  ILEP is being superseded by TrustEd Ireland, the international education mark launched in September 2024 by QQI and the Department of Further and Higher Education, Research, Innovation and Science (DFHERIS). TrustEd Ireland is a new statutory quality mark and part of a suite of legislative measures designed to further protect international learners.  Once the ILEP is discontinued, only education providers granted authorisation to use the TrustEd Ireland mark will be eligible to recruit students from outside the EEA to English language programmes, foundation programmes and higher education programmes leading to awards within the National Framework of Qualifications (NFQ).  The new mark will be awarded to higher education and English language education providers who have demonstrated that they meet national standards to ensure a quality experience for international learners from pre-enrolment through to the completion of their programme of education and training. Applications are currently being reviewed for the first application cycle, which closed in March 2025. Decisions are scheduled to issue in January 2026.  In 2025, my Department was notified of the closure of three education providers listed on the ILEP, and these providers were subsequently removed from the list. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 684. Deputy Robert O'Donoghue asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to when the full figures for student immigration on Stamp 2 Visas will be available for 2025; if his attention has been drawn to any recent closures of any institutions which provide the courses listed on the Interim List of Eligible Programmes , or eligible programmes offered by providers with authorisation to use the new TrustEd Education mark awarded by the Quality and Qualifications Ireland ; if there are any plans to reduce the overall number of Stamp 2 Visas issued to English-language students; and if he will make a statement on the matter. [71469/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_542",
          "debateSectionId": "dbsect_542",
          "showAs": "Visa Agreements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_542.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_684",
        "questionNumber": 684
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport (Deputy Jerry Buttimer)  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 120. Deputy Robert O'Donoghue asked the Minister for Transport if he will review the public transport provision serving Garristown and the surrounding rural areas of north County Dublin; if he will consider extending or adapting the 192 bus service, or introducing a new local loop route from Ashbourne through Ballymadun, Nutstown, Adamstown and Newhaggard, returning to Ashbourne; to examine the feasibility of providing a door-to-door Local Link service to assist residents, particularly older and isolated individuals (details supplied); and if he will make a statement on the matter. [70647/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_120",
        "questionNumber": 120
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  The Marine Survey Office (MSO) of my Department is aware of recent of fishing vessel incidents and losses involving small vessels fishing vessels under 15 metres operating in the north-east and has carried out recent compliance inspections in the area. The vessels that were recently assisted by Skerries and Clogherhead Lifeboats are required to comply with the Code of Practice for Small Fishing Vessels of less than 15 metres length overall in order to obtain a licence to fish from the Sea Fisheries Licensing Authority. My Department oversees the Code of Practice and appoints private surveyors to a panel to carry out periodical surveys for compliance with the Code, which was last updated in 2022 and is under constant review.  Additional resources have been allocated to oversight inspections of vessels subject to the Code of Practice for Small Fishing Vessels of less than 15 metres length. Actions have included detentions of vessels and withdrawal of their Declaration of Compliance under the Code of Practice with over eighty inspections and verifications carried out this year. In addition to this the MSO carries out compliance inspections on all sizes of fishing vessels throughout each year and has prosecuted owners and skippers in relation to casualties and non-compliance with legislation. A fatality occurred in 2023 which is the subject of an interim MCIB Report number 333.  Stakeholder engagement is continuing with fishing representatives, the North East Regional Inshore Fisheries Forum, local authorities, the Department of Agriculture and others with a view to addressing any safety issues identified in this fleet. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 175. Deputy Robert O'Donoghue asked the Minister for Transport if he is aware of the recent spate of fishing vessel incidents and losses involving small vessels under 15 metres operating along the Dublin, Meath, and Louth coasts, including a fatality off the Louth coast in 2023, several recent rescues by the Skerries and Clogherhead Lifeboats, and other groundings and tow-assists; the oversight, inspection, and enforcement measures currently in place for this category of vessel; if he is satisfied that existing safety, equipment, and training requirements are adequate; and if he will direct his Department and BIM to review compliance levels and take action to address any systemic safety issues identified in this fleet to help prevent further fatalities; and if he will make a statement on the matter. [70052/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_166",
          "debateSectionId": "dbsect_166",
          "showAs": "Water Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_166.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_175",
        "questionNumber": 175
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. As Minister for Transport I continue to engage with the NTA on an ongoing basis in relation to maintaining high operational standards on all forms of public transport.  The query raised by the Deputy is an operational matter for Dublin Bus. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 264. Deputy Robert O'Donoghue asked the Minister for Transport when improvements will be made to the E1 bus service serving the Northwood area of Dublin 9, given persistent reliability issues, including repeated no-show or ghost buses and extended gaps in service despite the route being scheduled to operate every ten minutes; if he will engage with the National Transport Authority regarding these failures; and if he will ensure that measures are put in place without delay in order that commuters in Northwood receive a consistent and dependable service as originally planned; and if he will make a statement on the matter. [70035/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_243",
          "debateSectionId": "dbsect_243",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_243.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_264",
        "questionNumber": 264
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 586. Deputy Robert O'Donoghue asked the Minister for Justice, Home Affairs and Migration the reason there is no State-run accreditation system or accrediting body for foreign-language translators and interpreters in Ireland, despite their critical role in the criminal justice system, immigration processes, healthcare, education, and other public services; and if the Department has plans to introduce statutory regulation or minimum qualification standards for this sector; and if he will make a statement on the matter. [69076/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_586",
        "questionNumber": 586
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 587. Deputy Robert O'Donoghue asked the Minister for Justice, Home Affairs and Migration who currently determines if an individual is or is not considered a qualified interpreter or a court-approved interpreter in Ireland, in the absence of a State-mandated certification system; whether any criteria, vetting standards, or qualification requirements are applied by the Courts Service, An Garda Síochána, or other public bodies when procuring interpreting services; and if he will make a statement on the matter. [69077/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_587",
        "questionNumber": 587
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 588. Deputy Robert O'Donoghue asked the Minister for Justice, Home Affairs and Migration the regulatory body, responsible for overseeing the profession of foreign-language translators and interpreters in Ireland, including the setting of professional standards, enforcement of ethical codes, or oversight of training and competence; and if he will make a statement on the matter. [69078/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_588",
        "questionNumber": 588
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 589. Deputy Robert O'Donoghue asked the Minister for Justice, Home Affairs and Migration which institution maintains a mandatory national register or list of qualified foreign-language interpreters or court-approved interpreters; and if no such register exists, the reason for this and if his Department intends to create one in line with international best practice; and if he will make a statement on the matter. [69079/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_589",
        "questionNumber": 589
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I propose to take Questions Nos. 840, 841 and 845 together.  The Government is committed to improving cancer care, ensuring better prevention and maintaining improvements in cancer survival rates and timely access to treatments. Women who have been referred to a breast disease clinic can understandably experience stress and anxiety and I am conscious of the burden that waiting times for assessment appointments places on patients and their families.  The National Cancer Control Programme (NCCP), in line with measures set down in the National Cancer Strategy, has several KPIs for Rapid Access Clinics, including breast cancer services. The KPI for urgent referrals to SBD clinics is that 95% of patients are seen within 10 working days. This year to date, over 25,500 patients triaged as urgent attended the SBD clinics nationally. 16,000 (63%) of these patients were seen within the 10 working days. Of those women waiting longer than 10 working days, 46% were seen within 20 days (target plus 10 days).  The KPI for non-urgent referrals is that 95% of patients are seen within 12 weeks. This year to date, 16,000 patients triaged as non-urgent attended an SBD clinic and 11,000 (68%) of these referrals were seen within the target timeframe. Of those women seen outside the 12 week target, 27% of them were seen within 14 weeks (target plus two weeks). Approximately 8% of women triaged as urgent and 1.5% of women triaged as non-urgent will receive a cancer diagnosis.  The SBD clinics consistently operate at full capacity and delays are most often caused by staff shortages or problems in accessing diagnostics or radiology services. Unfortunately, disruption to services can lead to a backlog which can take time to clear. Where a performance issue arises the HSE implements site-specific measures which can include funding additional clinics or providing locum cover where necessary.  The NCCP monitors KPI performance and works closely with Regional Executive Officers (REOs) to ensure the delivery of safe, effective cancer services in line with the implementation of the National Cancer Strategy. Looking ahead to 2026, under the devolved health budgets to the new Regions, REOs are being given greater autonomy to meet local needs while maintaining responsibility for meeting our KPI targets and national standards.840 ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 840. Deputy Robert O'Donoghue asked the Minister for Health her views on the fact that approximately 9,000 women are currently waiting up to 10 weeks or longer for a follow-up appointment after being referred by their GP for suspected breast cancer; the reason such delays are occurring; the clinical risk posed by these waiting times; the actions she is taking to ensure that urgent breast care referrals are assessed within recommended timeframes; and if she will make a statement on the matter. [69041/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_690",
          "debateSectionId": "dbsect_690",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_690.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_840",
        "questionNumber": 840
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I propose to take Questions Nos. 840, 841 and 845 together.  The Government is committed to improving cancer care, ensuring better prevention and maintaining improvements in cancer survival rates and timely access to treatments. Women who have been referred to a breast disease clinic can understandably experience stress and anxiety and I am conscious of the burden that waiting times for assessment appointments places on patients and their families.  The National Cancer Control Programme (NCCP), in line with measures set down in the National Cancer Strategy, has several KPIs for Rapid Access Clinics, including breast cancer services. The KPI for urgent referrals to SBD clinics is that 95% of patients are seen within 10 working days. This year to date, over 25,500 patients triaged as urgent attended the SBD clinics nationally. 16,000 (63%) of these patients were seen within the 10 working days. Of those women waiting longer than 10 working days, 46% were seen within 20 days (target plus 10 days).  The KPI for non-urgent referrals is that 95% of patients are seen within 12 weeks. This year to date, 16,000 patients triaged as non-urgent attended an SBD clinic and 11,000 (68%) of these referrals were seen within the target timeframe. Of those women seen outside the 12 week target, 27% of them were seen within 14 weeks (target plus two weeks). Approximately 8% of women triaged as urgent and 1.5% of women triaged as non-urgent will receive a cancer diagnosis.  The SBD clinics consistently operate at full capacity and delays are most often caused by staff shortages or problems in accessing diagnostics or radiology services. Unfortunately, disruption to services can lead to a backlog which can take time to clear. Where a performance issue arises the HSE implements site-specific measures which can include funding additional clinics or providing locum cover where necessary.  The NCCP monitors KPI performance and works closely with Regional Executive Officers (REOs) to ensure the delivery of safe, effective cancer services in line with the implementation of the National Cancer Strategy. Looking ahead to 2026, under the devolved health budgets to the new Regions, REOs are being given greater autonomy to meet local needs while maintaining responsibility for meeting our KPI targets and national standards.840 ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 841. Deputy Robert O'Donoghue asked the Minister for Health the clinical consequences identified by her Department and the HSE regarding prolonged delays in breast cancer follow-up appointments; the number of cases that have breached the recommended urgent referral timeframe; the measures which are being implemented to safeguard early detection and timely diagnosis; and if she will make a statement on the matter. [69042/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_690",
          "debateSectionId": "dbsect_690",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_690.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_841",
        "questionNumber": 841
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 842. Deputy Robert O'Donoghue asked the Minister for Health the status of out-of-date, old or non-compliant diagnostic equipment in breast cancer assessment units; the number of machines requiring replacement or upgrade; the timeline for bringing all breast units in line with modern clinical standards; and if she will make a statement on the matter. [69043/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_691",
          "debateSectionId": "dbsect_691",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_691.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_842",
        "questionNumber": 842
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the management of healthcare equipment, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 843. Deputy Robert O'Donoghue asked the Minister for Health when funding will be formally allocated to replace outdated breast diagnostic equipment; the reason for the delay in confirming this funding; and whether the 2026 capital plan includes specific ring-fenced investment for breast cancer services; and if she will make a statement on the matter. [69044/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_692",
          "debateSectionId": "dbsect_692",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_692.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_843",
        "questionNumber": 843
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 844. Deputy Robert O'Donoghue asked the Minister for Health the recruitment, staffing, and capacity challenges contributing to delays in breast cancer follow-up appointments; the number of vacant consultant, radiographer, and breast care nurse posts nationally; the plan to address these gaps; and if she will make a statement on the matter. [69045/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_693",
          "debateSectionId": "dbsect_693",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_693.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_844",
        "questionNumber": 844
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  I propose to take Questions Nos. 840, 841 and 845 together.  The Government is committed to improving cancer care, ensuring better prevention and maintaining improvements in cancer survival rates and timely access to treatments. Women who have been referred to a breast disease clinic can understandably experience stress and anxiety and I am conscious of the burden that waiting times for assessment appointments places on patients and their families.  The National Cancer Control Programme (NCCP), in line with measures set down in the National Cancer Strategy, has several KPIs for Rapid Access Clinics, including breast cancer services. The KPI for urgent referrals to SBD clinics is that 95% of patients are seen within 10 working days. This year to date, over 25,500 patients triaged as urgent attended the SBD clinics nationally. 16,000 (63%) of these patients were seen within the 10 working days. Of those women waiting longer than 10 working days, 46% were seen within 20 days (target plus 10 days).  The KPI for non-urgent referrals is that 95% of patients are seen within 12 weeks. This year to date, 16,000 patients triaged as non-urgent attended an SBD clinic and 11,000 (68%) of these referrals were seen within the target timeframe. Of those women seen outside the 12 week target, 27% of them were seen within 14 weeks (target plus two weeks). Approximately 8% of women triaged as urgent and 1.5% of women triaged as non-urgent will receive a cancer diagnosis.  The SBD clinics consistently operate at full capacity and delays are most often caused by staff shortages or problems in accessing diagnostics or radiology services. Unfortunately, disruption to services can lead to a backlog which can take time to clear. Where a performance issue arises the HSE implements site-specific measures which can include funding additional clinics or providing locum cover where necessary.  The NCCP monitors KPI performance and works closely with Regional Executive Officers (REOs) to ensure the delivery of safe, effective cancer services in line with the implementation of the National Cancer Strategy. Looking ahead to 2026, under the devolved health budgets to the new Regions, REOs are being given greater autonomy to meet local needs while maintaining responsibility for meeting our KPI targets and national standards.840 ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 845. Deputy Robert O'Donoghue asked the Minister for Health the way in which current waiting times for breast cancer follow-up appointments align with the targets set out in the National Cancer Strategy; the accountability measures which exist for persistent breaches of these targets; and if she will make a statement on the matter. [69046/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_690",
          "debateSectionId": "dbsect_690",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_690.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_845",
        "questionNumber": 845
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 846. Deputy Robert O'Donoghue asked the Minister for Health the immediate actions, such as extended clinic hours, outsourcing of scans, or temporary capacity expansion, which are being considered to reduce the backlog of 9,000 women awaiting follow-up appointments; the projected timeline for clearing this backlog; and if she will make a statement on the matter. [69047/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_694",
          "debateSectionId": "dbsect_694",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_694.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_846",
        "questionNumber": 846
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 1087, 1088, 1089, 1090 and 1091 together.  A national Hairdressing apprenticeship programme has been operating since 2019. It is a three-year consortia-led programme where graduates achieve a Level 6 qualification on the National Framework of Qualifications.  While wages are a key factor for those considering apprenticeships, it is important to note that neither SOLAS nor my department are responsible for or involved in the setting of apprentice wages. Apprentices are employees and remain employees of their employer for the duration of their apprenticeship. In the case of the 53 consortia-led apprenticeship programmes, of which Hairdressing is one, wages are agreed between the apprentice and the employer in the contract of employment. Under current legislation, minimum wage laws—which fall under the remit of the Department of Enterprise, Trade and Employment—do not apply to apprentices as defined under the Industrial Training Act, 1967, or the Labour Services Act, 1987.  Apprentices also do not meet the criteria of the Student Support Act, 2011 in that they are not attending an approved full-time course in approved institutions.  The Government is committed to reducing the cost of education for students and families in a financially sustainable way. I secured €2.5 million in Budget 2026 to permanently reduce the student contribution fee that apprentices pay in higher education by 17%. In addition, targeted financial supports are available for apprentices from underrepresented groups such as the Travelling Community or those from socioeconomically disadvantaged backgrounds.  In January 2022, as part of the implementation of the Action Plan for Apprenticeship 2021-2025, government also introduced a targeted grant of €2,666 available to employers who employ apprentices from the minority gender on programmes which have over 80% representation of a single gender. This initiative was designed to encourage greater gender diversity in traditionally male or female dominated fields. Since the gender-based bursary’s introduction, we have seen an increase of approximately 95% in female participation in apprenticeships, from 1,535 at the end of 2021 to 2,996 by the end of October this year. Women now represent approximately 10% of the overall apprentice population, up from approximately 6% in January 2022. As of end-October 2025, the consortia-led apprenticeship population is 44% female. Of the 78 apprenticeship programmes currently available, 47 qualified for the gender bursary in 2024 and 2025. Notably, 46 of these relate to female participation, with the exception of Hairdressing, where male apprentices qualify.  Apprenticeships, by blending practical workplace experience with formal education, are a powerful tool for developing both technical and transversal skills—such as problem-solving, communication, and adaptability—essential for a workforce navigating digitisation. I have prioritised investment in apprenticeships. In Budget 2026, I secured investment of €79 million in apprenticeship delivery, bringing the total funding for apprenticeship in 2026 to over €410 million. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1087. Deputy Robert O'Donoghue asked the Minister for Further and Higher Education, Research, Innovation and Science his views on the fact that apprentice hairdressers are currently paid as little as €7 per hour, with no incremental increases over the four-year duration of the apprenticeship; if he considers this consistent with the Government's stated ambition to expand and professionalise the apprenticeship sector; the actions he will take to ensure fair and progressive pay for apprentice hairdressers; and if he will make a statement on the matter. [69020/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_911",
          "debateSectionId": "dbsect_911",
          "showAs": "Low Pay",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_911.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1087",
        "questionNumber": 1087
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 1087, 1088, 1089, 1090 and 1091 together.  A national Hairdressing apprenticeship programme has been operating since 2019. It is a three-year consortia-led programme where graduates achieve a Level 6 qualification on the National Framework of Qualifications.  While wages are a key factor for those considering apprenticeships, it is important to note that neither SOLAS nor my department are responsible for or involved in the setting of apprentice wages. Apprentices are employees and remain employees of their employer for the duration of their apprenticeship. In the case of the 53 consortia-led apprenticeship programmes, of which Hairdressing is one, wages are agreed between the apprentice and the employer in the contract of employment. Under current legislation, minimum wage laws—which fall under the remit of the Department of Enterprise, Trade and Employment—do not apply to apprentices as defined under the Industrial Training Act, 1967, or the Labour Services Act, 1987.  Apprentices also do not meet the criteria of the Student Support Act, 2011 in that they are not attending an approved full-time course in approved institutions.  The Government is committed to reducing the cost of education for students and families in a financially sustainable way. I secured €2.5 million in Budget 2026 to permanently reduce the student contribution fee that apprentices pay in higher education by 17%. In addition, targeted financial supports are available for apprentices from underrepresented groups such as the Travelling Community or those from socioeconomically disadvantaged backgrounds.  In January 2022, as part of the implementation of the Action Plan for Apprenticeship 2021-2025, government also introduced a targeted grant of €2,666 available to employers who employ apprentices from the minority gender on programmes which have over 80% representation of a single gender. This initiative was designed to encourage greater gender diversity in traditionally male or female dominated fields. Since the gender-based bursary’s introduction, we have seen an increase of approximately 95% in female participation in apprenticeships, from 1,535 at the end of 2021 to 2,996 by the end of October this year. Women now represent approximately 10% of the overall apprentice population, up from approximately 6% in January 2022. As of end-October 2025, the consortia-led apprenticeship population is 44% female. Of the 78 apprenticeship programmes currently available, 47 qualified for the gender bursary in 2024 and 2025. Notably, 46 of these relate to female participation, with the exception of Hairdressing, where male apprentices qualify.  Apprenticeships, by blending practical workplace experience with formal education, are a powerful tool for developing both technical and transversal skills—such as problem-solving, communication, and adaptability—essential for a workforce navigating digitisation. I have prioritised investment in apprenticeships. In Budget 2026, I secured investment of €79 million in apprenticeship delivery, bringing the total funding for apprenticeship in 2026 to over €410 million. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1088. Deputy Robert O'Donoghue asked the Minister for Further and Higher Education, Research, Innovation and Science the reason apprentice hairdressers are currently unable to access funding supports for tools and equipment essential to their training; if he will consider the creation of a dedicated equipment grant for apprentices in the hairdressing sector; and if he will make a statement on the matter. [69021/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_911",
          "debateSectionId": "dbsect_911",
          "showAs": "Low Pay",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_911.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1088",
        "questionNumber": 1088
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 1087, 1088, 1089, 1090 and 1091 together.  A national Hairdressing apprenticeship programme has been operating since 2019. It is a three-year consortia-led programme where graduates achieve a Level 6 qualification on the National Framework of Qualifications.  While wages are a key factor for those considering apprenticeships, it is important to note that neither SOLAS nor my department are responsible for or involved in the setting of apprentice wages. Apprentices are employees and remain employees of their employer for the duration of their apprenticeship. In the case of the 53 consortia-led apprenticeship programmes, of which Hairdressing is one, wages are agreed between the apprentice and the employer in the contract of employment. Under current legislation, minimum wage laws—which fall under the remit of the Department of Enterprise, Trade and Employment—do not apply to apprentices as defined under the Industrial Training Act, 1967, or the Labour Services Act, 1987.  Apprentices also do not meet the criteria of the Student Support Act, 2011 in that they are not attending an approved full-time course in approved institutions.  The Government is committed to reducing the cost of education for students and families in a financially sustainable way. I secured €2.5 million in Budget 2026 to permanently reduce the student contribution fee that apprentices pay in higher education by 17%. In addition, targeted financial supports are available for apprentices from underrepresented groups such as the Travelling Community or those from socioeconomically disadvantaged backgrounds.  In January 2022, as part of the implementation of the Action Plan for Apprenticeship 2021-2025, government also introduced a targeted grant of €2,666 available to employers who employ apprentices from the minority gender on programmes which have over 80% representation of a single gender. This initiative was designed to encourage greater gender diversity in traditionally male or female dominated fields. Since the gender-based bursary’s introduction, we have seen an increase of approximately 95% in female participation in apprenticeships, from 1,535 at the end of 2021 to 2,996 by the end of October this year. Women now represent approximately 10% of the overall apprentice population, up from approximately 6% in January 2022. As of end-October 2025, the consortia-led apprenticeship population is 44% female. Of the 78 apprenticeship programmes currently available, 47 qualified for the gender bursary in 2024 and 2025. Notably, 46 of these relate to female participation, with the exception of Hairdressing, where male apprentices qualify.  Apprenticeships, by blending practical workplace experience with formal education, are a powerful tool for developing both technical and transversal skills—such as problem-solving, communication, and adaptability—essential for a workforce navigating digitisation. I have prioritised investment in apprenticeships. In Budget 2026, I secured investment of €79 million in apprenticeship delivery, bringing the total funding for apprenticeship in 2026 to over €410 million. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1089. Deputy Robert O'Donoghue asked the Minister for Further and Higher Education, Research, Innovation and Science the reason apprentices, including apprentice hairdressers, are deemed ineligible for SUSI grants on the basis that they are \"working\", despite earning training-level pay far below a living wage; if he will review eligibility criteria to ensure apprentices are not financially penalised; and if he will report on any planned changes; and if he will make a statement on the matter. [69022/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_911",
          "debateSectionId": "dbsect_911",
          "showAs": "Low Pay",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_911.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1089",
        "questionNumber": 1089
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 1087, 1088, 1089, 1090 and 1091 together.  A national Hairdressing apprenticeship programme has been operating since 2019. It is a three-year consortia-led programme where graduates achieve a Level 6 qualification on the National Framework of Qualifications.  While wages are a key factor for those considering apprenticeships, it is important to note that neither SOLAS nor my department are responsible for or involved in the setting of apprentice wages. Apprentices are employees and remain employees of their employer for the duration of their apprenticeship. In the case of the 53 consortia-led apprenticeship programmes, of which Hairdressing is one, wages are agreed between the apprentice and the employer in the contract of employment. Under current legislation, minimum wage laws—which fall under the remit of the Department of Enterprise, Trade and Employment—do not apply to apprentices as defined under the Industrial Training Act, 1967, or the Labour Services Act, 1987.  Apprentices also do not meet the criteria of the Student Support Act, 2011 in that they are not attending an approved full-time course in approved institutions.  The Government is committed to reducing the cost of education for students and families in a financially sustainable way. I secured €2.5 million in Budget 2026 to permanently reduce the student contribution fee that apprentices pay in higher education by 17%. In addition, targeted financial supports are available for apprentices from underrepresented groups such as the Travelling Community or those from socioeconomically disadvantaged backgrounds.  In January 2022, as part of the implementation of the Action Plan for Apprenticeship 2021-2025, government also introduced a targeted grant of €2,666 available to employers who employ apprentices from the minority gender on programmes which have over 80% representation of a single gender. This initiative was designed to encourage greater gender diversity in traditionally male or female dominated fields. Since the gender-based bursary’s introduction, we have seen an increase of approximately 95% in female participation in apprenticeships, from 1,535 at the end of 2021 to 2,996 by the end of October this year. Women now represent approximately 10% of the overall apprentice population, up from approximately 6% in January 2022. As of end-October 2025, the consortia-led apprenticeship population is 44% female. Of the 78 apprenticeship programmes currently available, 47 qualified for the gender bursary in 2024 and 2025. Notably, 46 of these relate to female participation, with the exception of Hairdressing, where male apprentices qualify.  Apprenticeships, by blending practical workplace experience with formal education, are a powerful tool for developing both technical and transversal skills—such as problem-solving, communication, and adaptability—essential for a workforce navigating digitisation. I have prioritised investment in apprenticeships. In Budget 2026, I secured investment of €79 million in apprenticeship delivery, bringing the total funding for apprenticeship in 2026 to over €410 million. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1090. Deputy Robert O'Donoghue asked the Minister for Further and Higher Education, Research, Innovation and Science if he recognises that hairdressing is a high-skill, future-proof profession unlikely to be replaced by automation or artificial intelligence; the way in which his Department plans to invest in and support such apprenticeships, which provide long-term, human-centred employment; and if he will make a statement on the matter. [69023/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_911",
          "debateSectionId": "dbsect_911",
          "showAs": "Low Pay",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_911.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1090",
        "questionNumber": 1090
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 1087, 1088, 1089, 1090 and 1091 together.  A national Hairdressing apprenticeship programme has been operating since 2019. It is a three-year consortia-led programme where graduates achieve a Level 6 qualification on the National Framework of Qualifications.  While wages are a key factor for those considering apprenticeships, it is important to note that neither SOLAS nor my department are responsible for or involved in the setting of apprentice wages. Apprentices are employees and remain employees of their employer for the duration of their apprenticeship. In the case of the 53 consortia-led apprenticeship programmes, of which Hairdressing is one, wages are agreed between the apprentice and the employer in the contract of employment. Under current legislation, minimum wage laws—which fall under the remit of the Department of Enterprise, Trade and Employment—do not apply to apprentices as defined under the Industrial Training Act, 1967, or the Labour Services Act, 1987.  Apprentices also do not meet the criteria of the Student Support Act, 2011 in that they are not attending an approved full-time course in approved institutions.  The Government is committed to reducing the cost of education for students and families in a financially sustainable way. I secured €2.5 million in Budget 2026 to permanently reduce the student contribution fee that apprentices pay in higher education by 17%. In addition, targeted financial supports are available for apprentices from underrepresented groups such as the Travelling Community or those from socioeconomically disadvantaged backgrounds.  In January 2022, as part of the implementation of the Action Plan for Apprenticeship 2021-2025, government also introduced a targeted grant of €2,666 available to employers who employ apprentices from the minority gender on programmes which have over 80% representation of a single gender. This initiative was designed to encourage greater gender diversity in traditionally male or female dominated fields. Since the gender-based bursary’s introduction, we have seen an increase of approximately 95% in female participation in apprenticeships, from 1,535 at the end of 2021 to 2,996 by the end of October this year. Women now represent approximately 10% of the overall apprentice population, up from approximately 6% in January 2022. As of end-October 2025, the consortia-led apprenticeship population is 44% female. Of the 78 apprenticeship programmes currently available, 47 qualified for the gender bursary in 2024 and 2025. Notably, 46 of these relate to female participation, with the exception of Hairdressing, where male apprentices qualify.  Apprenticeships, by blending practical workplace experience with formal education, are a powerful tool for developing both technical and transversal skills—such as problem-solving, communication, and adaptability—essential for a workforce navigating digitisation. I have prioritised investment in apprenticeships. In Budget 2026, I secured investment of €79 million in apprenticeship delivery, bringing the total funding for apprenticeship in 2026 to over €410 million. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1091. Deputy Robert O'Donoghue asked the Minister for Further and Higher Education, Research, Innovation and Science if his Department has assessed whether low apprentice pay, lack of equipment supports, and ineligibility for education grants disproportionately impact female apprentices in sectors such as hairdressing; if he will commit to addressing these inequities; and if he will make a statement on the matter. [69024/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_911",
          "debateSectionId": "dbsect_911",
          "showAs": "Low Pay",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_911.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1091",
        "questionNumber": 1091
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)   Reply not received from Department.  ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 153. Deputy Robert O'Donoghue asked the Minister for Housing, Local Government and Heritage in view of the ongoing uncertainty faced by homeowners affected by the defective block scheme; if Fingal County Council is to be included in the scheme; to provide details on the expected timeline, administrative arrangements, and any forthcoming guidance for local authorities and applicants; and if he will make a statement on the matter. [68231/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_153",
        "questionNumber": 153
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Section 118(5G) of the Taxes Consolidation Act 1997 provides for the Cycle to Work Scheme. This scheme offers an exemption from benefit-in-kind where an employer purchases a bicycle and/or associated safety equipment for one of their employees (or directors) to use, in whole or in part, to travel to work.  The Deputy may be aware that the Programme for Government 2025, \"Securing Ireland's Future\", contains a commitment to, within the lifetime of this Government, conduct a review of the Bike-to-Work scheme to boost take-up among all workers. The Terms of Reference of the review of the scheme will be considered in due course. In the course of this review, options to extend or restrict the current scheme or to complement or replace it with a direct expenditure measure may follow from the recommendations. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 167. Deputy Robert O'Donoghue asked the Tánaiste and Minister for Finance if there are plans for incentives or grants to expand the cycle to work/bike to work scheme to make it more accessible to employers; and if he will make a statement on the matter. [67536/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_167",
        "questionNumber": 167
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy will be delivered under my Department's ADAPT programme. ADAPT is an acronym for the \" A ccelerated D elivery of A rchitectural P lanning and T endering\".  The ADAPT programme uses a professional external Project Manager to co-ordinate and drive the Design Team to achieve the best possible timeframe for the project through the stages of Architectural Planning to Tender and Construction. The project brief is to provide a new 8 classroom Primary School with 2 Special Educational Needs class (expandable to 16 classroom if needed in the future) at Broadmeadow CNS Mooretown, off Rathbeale Road, Swords, Dublin.  Following the Stage 1 stakeholders meeting in January 2025, where the Principal, representatives from DDLETB, all Design Team members, the Project Manager and Department officials were in attendance, the project was approved to progress to Stage 2(a) of Architectural Planning.  Stage 2(a) – Developed Design - is a crucial element of the architectural planning process as it is at this stage that the design is developed to a stage where it can be fully cost planned and prepared to lodge for statutory approvals.  During stage 2(b) of the process, my Department liaises with the Design Team and local council to discuss traffic calming and safety measures which are then included as part of the planning application and detailed design of the major project.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 205. Deputy Robert O'Donoghue asked the Minister for Education and Youth when a school (details supplied) will be fully developed and end its current prefabrication status; if there are any plans to incorporate the school meals scheme at the school in the absence of existing facilities; if there are any plans for traffic safety/calming measures in the vicinity of the school in the absence of same; and if she will make a statement on the matter. [67270/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_189",
          "debateSectionId": "dbsect_189",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_205",
        "questionNumber": 205
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school project to which the Deputy refers is a campus project and is devolved for delivery to CEIST.  The project is currently at Stage 2b (post planning process) of the architectural process which allows for detailed design and planning, obtaining the necessary statutory permissions and the preparation of tender documents.  CEIST, as the delivery body will continue to engage directly with the school community to keep it fully informed of progress.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 264. Deputy Robert O'Donoghue asked the Minister for Education and Youth whether funding has been sanctioned in the capital budget, or any other budget, for the building of the new educational campus (details supplied); and if she will make a statement on the matter. [67713/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_242",
          "debateSectionId": "dbsect_242",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_264",
        "questionNumber": 264
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Property Services Regulatory Authority (the Authority) operates under the Property Services (Regulation) Act 2011 (the Act) and related regulations.  Under Section 61 of the Act, a Property Services Provider (PSP) must retain a record, for a period of not less than 6 years, of all offers received by the PSP, including conditional acceptances, in respect of properties for sale by private treaty. The Authority has developed a template for recording bids, available on its website www.psr.ie. The information to be collected by PSPs is as follows:  • Name and contact details of prospective purchasers  • Method of offer and person who received the offer  • Date and time of offer  • Offer  • Conditions (if any)  • Date and time offer was notified to client and by whom  • Name of client notified where more than one client  • Reaction to offer  Under Regulation 15 of the Property Services (Regulation) Act 2011 (Minimum Standards) Regulations 2020, in relation to properties for sale by private treaty, a PSP:  Shall disclose to their client, by the means and within the timeframe agreed with their client, all offers including any conditions attaching to the offers, and all recorded price offers in writing;  Shall provide written confirmation to each offeror on receipt of his or her offer;  Shall not express or imply to any person including their client that an offer has been received unless that offer has been received by the PSP;  When disclosing an offer to their client, shall notify the client in writing that the offeror is a PSP, a principal officer of a PSP, an employee of a PSP, the employer of the PSP, an employee of the PSP’s employer, or a connected relative of any of the above, where the PSP knows or has reasonable grounds to believe that this is the case.  More recently, a number of PSPs also facilitate prospective purchasers in placing their bid online, and this facility allows all prospective purchasers to have sight of the offers on the property, providing transparency on offers made on the property. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 307. Deputy Robert O'Donoghue asked the Minister for Housing, Local Government and Heritage if he can provide information on the current oversight guidelines for estate agents in allocating bids on housing; if there are any regulations in existence for transparency on how properties are sold via estate agents; if there are any forthcoming regulations on improving transparency on how properties are sold via estate agents; and if he will make a statement on the matter. [67272/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_285",
          "debateSectionId": "dbsect_285",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_285.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_307",
        "questionNumber": 307
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Delivering Homes, Building Communities 2025-2030 - An Action Plan on Housing Supply and Targeting Homelessness, contains Action 8.5: ‘Publish a National Planning Statement relating to rural housing to provide clarity and consistency within the planning system’, with a timeline of the second half of 2026. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 331. Deputy Robert O'Donoghue asked the Minister for Housing, Local Government and Heritage when the National Planning Statement for planning for rural housing will be published (details supplied); and if he will make a statement on the matter. [67543/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_299",
          "debateSectionId": "dbsect_299",
          "showAs": "National Planning Framework",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_299.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_331",
        "questionNumber": 331
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As Minister for Health, I am committed to supporting our population screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  The Programme for Government commits to advancing men’s health in tandem with the investment and progress seen in women’s healthcare. It also commits to research, implement and evaluate cancer prevention and early detection initiatives, including prostate cancer.  I would note that any proposed changes to Ireland’s screening programmes, including the potential introduction of a prostate cancer screening programme, will be facilitated through established evidence-driven protocols.  The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes to Ireland’s screening programmes. NSAC assesses the evidence in a robust and transparent manner and against internationally accepted criteria, before making recommendations to myself as Minister.  NSAC continues to progress work to consider the further expansion of our cancer screening programmes and has submitted several requests to the Health Information and Quality Authority (HIQA).  HIQA is currently focused on concluding a Health Technology Assessment (HTA) to examine a proposed extension of the BowelScreen programme to those aged 50-54 years. Work on this is at an advanced stage, with a report expected to be submitted to NSAC for consideration in December 2025.  Additionally, and at the request of NSAC, HIQA have also commenced a separate HTA to consider the proposals for the expansion of the BreastCheck programme. This review will comprise two elements; the proposed extension of the age range eligibility to those aged 45-49 and 70-74, and also the potential introduction of a standardised breast density notification.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multidisciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time intensive and rigorous processes.  I have been informed that proposals for a prostate cancer screening programme have not yet been referred by NSAC to HIQA to undergo a HTA, pending the results of a number of ongoing European research initiatives. NSAC’s current priorities in terms of cancer screening are to conclude the BowelScreen and BreastCheck HTAs.  In this regard, it is worth noting that in late-2024, NSAC established a Cancer Screening Subgroup to provide additional expertise to support the Committee’s decision-making processes. The subgroup has developed a prioritisation framework, to provide an evidence-based approach to identifying which of the cancer screening proposals on the NSAC work programme should be next referred to HIQA for evidence review. The subgroup will use its framework to make recommendations to NSAC in early 2026.  In terms of the international evidence with regards to prostate cancer screening, under Europe’s Beating Cancer Plan, an updated European Council (EC) Recommendation on Cancer Screening, was published in December 2022. The Recommendation calls, amongst other things, for member states to explore the feasibility and effectiveness of a screening programme using PSA testing for men, in combination with MRI scanning as a follow-up test.  My Department is coordinating Irish inputs into a four-year EU4Health-funded Joint Action project, titled EUCanScreen (2024-2028), which is aimed at coordinating research activities associated with the EC Recommendation across Europe.  Additionally, I welcome the involvement of Irish-based researchers in another EU4Health funded project, titled PRAISE-U, which is exploring the feasibility of risk-stratified screening for prostate cancer to help reduce morbidity and mortality caused by the disease, while avoiding overdiagnosis and unnecessary treatment. For further information on the PRAISE-U project, can be found on its dedicated https://uroweb.org/praise-u  The findings from the aforementioned EU studies will contribute to the overall evidence base for future consideration by NSAC, alongside the evidence available from comparable non-EU countries. In this regard, i note the recent recommendation by the UK National Screening Committee, which advised against the introduction of a population-based prostate cancer screening programme in the UK but is currently hosting a public consultation on a potential targeted screening programme.  Finally, I would emphasise that screening programmes are for people without symptoms. If anyone becomes aware of symptoms, or if they have concerns or worries, they should contact a medical professional immediately. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 519. Deputy Robert O'Donoghue asked the Minister for Health the position regarding the results/rollout of ongoing the PRAISE-U (PRostate Cancer Awareness and Initiative for Screening in the European Union) study; if there will be any efforts to bring in a free prostate cancer screening service similar to the existing BreastCheck and CervicalCheck programmes for breast and cervical cancers following the results of this study; and if she will make a statement on the matter. [67316/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_463",
          "debateSectionId": "dbsect_463",
          "showAs": "Cancer Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_463.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_519",
        "questionNumber": 519
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The development and enhancement of multi-use community facilities is a priority for me and this Government. Full details of the supports available within my Department, including those for community centres, which may include family resource centres, can be accessed at: www.gov.ie/en/department-of-rural-and-community-development/services/available-funding-and-supports/.  This information also outlines the eligibility criteria for each scheme. With respect to my department’s rural remit, this includes the geographic coverage of each scheme as well as type of organisations who can apply for funds.  The Community Centre Investment Fund (CCIF), which is open to applications from within city areas, has provided €110 million since 2022 for the enhancement and refurbishment of existing community centres as well the construction of new centres. Under the 2024 iteration of the fund, over €33 million has now been approved to support refurbishment works on over 770 projects nationwide. Under CCIF, a community facility which provides a range of uses and services which are open to all of the community, and which may includes a family resource centre, may be eligible under the scheme.  The Town and Village Renewal Scheme provides of funding for projects designed to combat vacancy and dereliction and rejuvenate town and village centres. TVRS does not fund the construction of new community facilities but can include projects which renovate and refurbish multipurpose community spaces. Since its launch, almost €184 million has been allocated to over 1,800 projects across Ireland.  The Rural Regeneration and Development Fund is a major capital investment programme which seeks to support large-scale, ambitious projects which can achieve sustainable economic and social development in rural areas. Funding is made available under the scheme for community facilities. Funding is allocated to local authorities and other State-funded bodies who work in close co-operation with local communities and organisations to being projects forward. Since 2018, over €613 million has been allocated to 273 projects.  Finally, the development of community facilities can also be funded under the LEADER programme. The current LEADER Programme is operational across the country, with total funding of €180 million allocated across Local Action Groups at the start of the programming period to cover the years from 2023 to 2027. Depending on the nature of the project, Family Resource Centres can be eligible to apply for LEADER funding. Information on the programme is available on www.gov.ie/LEADER, and prospective applicants are advised to contact their Local Action Group for details on how to apply in their area.  I am committed to delivering further iterations of my department’s schemes in the coming years in line with the commitments made in the Programme for Government. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 727. Deputy Robert O'Donoghue asked the Minister for Rural and Community Development and the Gaeltacht the capital funding programmes under his Department, including the Community Centres Investment Fund, the Rural Regeneration and Development Fund and the LEADER Programme, that are open to applications from family resource centres seeking to acquire, construct, or refurbish permanent buildings; the typical levels of funding available; the application requirements for each scheme; and if he will make a statement on the matter. [67550/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_654",
          "debateSectionId": "dbsect_654",
          "showAs": "Family Resource Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_654.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_727",
        "questionNumber": 727
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine (Deputy Michael Healy-Rae)  I recognise the impact that Storms Darragh and Éowyn have had on the forestry sector throughout the country. This presents significant challenges for the forestry stakeholders. I also welcome the positive progress that has been made by the forestry sector on the mobilisation of windblown materials in forests.  The volume of timber normally felled over a 2.5 year period was blown down overnight during storm Éowyn. The latest damage assessment maps show that over 27,000 ha of forests were windblown, with 11,400 ha impacted in private forestry. Following the storms, I quickly established the forest windblow task force and delivered an action plan, created in conjunction with relevant stakeholders, which focused on the mobilisation and processing of windblown timber. To further speed up the process, my Department has allowed the use of both thinning and felling licences in removing storm damaged trees, and our data now shows that over 77% of windblown trees already have a felling licence issued by the Department. All this means is that more than 90% of the harvesting capacity in the country is now working in windblow areas. My Department is currently finalising negotiations of the administration of a reconstitution scheme, which is expected to provide supports to those affected by windblown sites, and I will make an announcement on this matter in the coming weeks. I would like to confirm again that all forest owners who have been affected will not be disadvantaged by undertaking works to clear windblown material, and if they do not currently have a felling licence, they should consult with a registered forester as soon as possible.  The answer to this is that it was a bad story but it has been dealt with adequately. If it was not, I would tell the Deputy. There is a reconstitution scheme. It is going to be in place. It will be implemented and delivered in the coming weeks. People will know exactly what they can get. However, in terms of going ahead now and working on their forest, the Deputy knows from his time in local authorities that a person should never engage in any work without getting approval. The senior Minister and I have stated clearly and publicly that people can come along and carry out the necessary works but they should do so in a safe fashion, and they will get their reconstitution scheme after. \n Deputy Duncan Smith  I thank the Minister of State for his detailed and very clear response in relation to this. As he articulated, the storms caused unprecedented damage, felling tens of thousands of hectares, wiping out years of growth and inflicting huge economic losses. There is encouragement in the Minister of State's response. An estimated 26,000 ha of forest has been felled or destroyed, impacting the long-term investment income retirement security of many foresters. They have been severely eroded. The Minister of State can understand that many of them are looking for urgent clarity. I know he said it will be in the coming weeks. I am not trying to pin him down too much because his response was detailed, and I think it will give an awful lot of encouragement. However, does he think there will be greater visibility on how that scheme will look maybe this side of Christmas or are we looking at the first few weeks of January? That is my follow-up question. \n Deputy Michael Healy-Rae  I love straight questions, and I like giving straight answers. Yes, absolutely, before Christmas, people will know exactly how much they will be able to receive per hectare to reconstitute so, again, there is no reason in the world anybody should not go ahead and carry out their works. The one thing I would advise people on the record of the Dáil is to please deal with registered people. As the Deputy knows, if someone is selling an animal tomorrow morning, he or she wants to do it in a proper way to make sure he or she will be paid. We have a template for people who are selling and engaging in clearing timber from their forests to make sure they are dealing with reputable people and that they will get paid and, again, carry out their work in a safe fashion. Unfortunately, farm deaths have increased. This is also a type of activity on the land. I just want to make sure because sometimes the forest can be dangerous, so it is to make sure they are dealing with proper registered people and get paid. They will have their reconstitution scheme, and they can have every confidence.  I thank my staff in the Department, the head of forestry, Mr. Barry Delany, and all the others who worked so diligently in this reconstitution scheme and, of course, the co-operation of the Minister and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation in ensuring we are able to deliver this. \n Deputy Duncan Smith  I have no more to add. I brought this up on behalf of my colleague, Deputy Robert O'Donoghue. I thank the Minister of State for his detailed response. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_18.xml"
            }
          },
          "debateSectionId": "dbsect_18",
          "showAs": "Forestry Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_18"
        },
        "questionNumber": 99,
        "date": "2025-11-27",
        "showAs": " 99. Deputy Robert O'Donoghue asked the Minister for Agriculture, Food and the Marine his plans to introduce a dedicated support scheme to address the significant and ongoing losses experienced by the forestry sector as a result of recent storms; the expected timeline for the development and implementation of such a scheme; and if he will make a statement on the matter. [66951/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_99"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  There are no specific Guidelines in relation to extensions of duration of planning permissions under section 42 of the Planning and Development Act 2000 (Act of 2000). My Department issues Circular Letters when legislation is amended. Section 42 of the Act of 2000 was amended in July this year.  Circular Letter No. PLR 02/2025 issued on 5 August 2025 and outlined the recent changes to section 42 of the Act of 2000 introduced by way of section 28 of the Planning and Development (Amendment) Act 2025 (Act of 2025) and the Planning and Development (Extension of Duration – Planning and Development Act 2000) Regulations 2025 (S.I. No. 378/2025).  Section 28 of the Act of 2025 inserts new provisions into section 42 of the Act of 2000 allowing for extensions of duration of uncommenced permissions for development of one or more houses.  Under new subsection (1A) of section 42, where such a permission has not commenced within its appropriate period, a planning authority shall extend the appropriate period by such additional period (not exceeding 3 years) as the planning authority considers necessary to enable the development concerned to be completed. This is subject to the application being made—  • before, but not earlier than 2 years before, the expiry of the permission, and  • not later than 6 months after the commencement of section 28 of the Planning and Development (Amendment) Act 2025 (i.e. from 1 August 2025).  and that the planning authority is satisfied the development will be completed within a reasonable time.  An extension of the appropriate period under subsection (1A) ceases to have effect if the development is not commenced within 18 months of section 28 of the Planning and Development (Amendment) Act 2025 coming into operation (i.e. from 1 August 2025).  A person who avails of an extension under this new subsection (1A) for un-commenced housing development cannot subsequently seek a further extension under subsection (1) (which applies to commenced development with substantial works carried out). Subsection (4A) allows for housing development permissions already extended under subsection (1A) to be further extended by an additional period as the planning authority considers requisite to enable the development concerned to be completed, provided that—  • an application is made before, but not earlier than 2 years before, the expiry of the permission, and  • the planning authority is satisfied that –  • development was commenced before the expiry of that permission’s appropriate period,  • substantial works were carried during that period, and  • the development will be completed within a reasonable time.  This further extension under subsection (4A) can only be availed of once and the combined duration of the extensions of the appropriate period under subsections (1A) and (4A) shall not exceed 5 years.  Circular PLR 02/2025 is available at the following link: [ https://www.gov.ie/en/department-of-housing-local-government-and-heritage/circulars/planning-circular-plr-022025-extension-of-duration-of-permissions-for-un-commenced-housing-development-and-suspension-of-running-of-duration-of-permission-during-judicial-review-proceedings/ ] [ ]  The Act of 2025 and S.I. No. 378/2025 are available on the Irish Statute Book at the following links:  • Act of 2025: ([ www.irishstatutebook.ie/eli/2025/act/9/enacted/en/html ]).  • SI No. 378/2025: [ (www.irishstatutebook.ie/eli/2025/si/378/made/en/print ]). ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_301.xml"
            }
          },
          "debateSectionId": "dbsect_301",
          "showAs": "Planning Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_301"
        },
        "questionNumber": 351,
        "date": "2025-11-27",
        "showAs": " 351. Deputy Robert O'Donoghue asked the Minister for Housing, Local Government and Heritage the latest guidelines in relation to planning permission extension of duration under section 42 of the Planning and Development Act 2000, as amended; and if he will make a statement on the matter. [66774/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_351"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 387 and 389 together.  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed to improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  However, my Department's Budget 2026 package contained significant targeted measures to support disabled people. These measures include:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January;  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025;  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026;  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People, my Department will lead a Strategic Focus Network on the Cost of Disability. The First Programme Plan of Actions 2025 - 2026 will be published shortly.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I will be meeting a number of organisations at the next meeting of my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  My Department provides the Supplementary Welfare Allowance scheme, for those whose means are insufficient to meet their needs and those of their dependents. Under the scheme, the Department may make an ‘additional needs payment’ to meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. Any person who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare service.  I trust this clarifies the issue for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_330.xml"
            }
          },
          "debateSectionId": "dbsect_330",
          "showAs": "Emergency Planning",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_330"
        },
        "questionNumber": 387,
        "date": "2025-11-27",
        "showAs": " 387. Deputy Robert O'Donoghue asked the Minister for Social Protection his plans to introduce an emergency winter payment to offset the extra cost of disability; and if he will make a statement on the matter. [66779/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_387"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 388, 409, 410 and 412 together.  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  Not all of the matters covered in the details supplied relate to my Department. For example, the one-off electricity credits provided over the past few years are a matter for my colleague the Minister for Climate, Energy and the Environment.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures. This contained significant targeted measures to support disabled people, including:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January.  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025.  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12.  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026.  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People 2025-2030 my Department will lead a Strategic Focus Network on the Cost of Disability. The First Programme Plan of Actions 2025 - 2026 will be published shortly.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I will be meeting a number of organisations at the next meeting of my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  My Department provides the Supplementary Welfare Allowance scheme, for those whose means are insufficient to meet their needs and those of their dependents. Under the scheme, the Department may make an ‘additional needs payment’ to meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. Any person who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare service.  My Department will publish a social impact assessment of Budget 2026, with distributional analysis of the measures in this Budget.  I trust this clarifies the issue for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_331.xml"
            }
          },
          "debateSectionId": "dbsect_331",
          "showAs": "Budget 2026",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_331"
        },
        "questionNumber": 388,
        "date": "2025-11-27",
        "showAs": " 388. Deputy Robert O'Donoghue asked the Minister for Social Protection his plans to review how Budget 2026 will impact disabled households over the winter months with rising fuel and living costs; and if he will make a statement on the matter. [66786/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_388"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 387 and 389 together.  The Government recognises the significant additional costs that disabled people can face in their daily lives and is committed to improving outcomes for disabled people by introducing permanent measures.  That is why the Programme for Government includes a range of commitments to support disabled people. Our Programme for Government commitments will be advanced over the lifetime of the Government, having regard to the overall policy and budgetary context.  In Budget 2026, I provided for a €1.15 billion package of new social protection measures.  Government has been very clear that there would be no once-off measures in this year’s Budget. We are at the start of a five-year programme for Government and not everything can be done in year one.  However, my Department's Budget 2026 package contained significant targeted measures to support disabled people. These measures include:  • A €10 increase in the weekly rates of payment, bringing the personal rates of payment to €254 per week from January;  • A Christmas bonus double payment to all persons getting a long-term disability payment, to be paid in December 2025;  • The highest ever increases in the Child Support Payment – an increase of €16 to €78 for children aged 12 or over, and of €8 to €58 for children under 12  • A €5 increase in the Fuel Allowance, bring it to €38 per week from January 2026;  • People moving from Disability Allowance or Blind Pension to take up work will be able to retain their Fuel Allowance payment for five years.  • People getting Disability Allowance or Blind Pension who have children will be eligible for Back to Work Family Dividend when taking up employment and moving off those payments.  • Expansion of the Wage Subsidy Scheme to people who acquire a disability while in employment and to those who transfer from Invalidity Pension to Partial Capacity Benefit, and increasing the rates paid from April.  The Department of Social Protection package also contained measures aimed at supporting carers, and recipients of Domiciliary Care Allowance.  • Increase the Earnings Disregard for Carer’s Allowance by €375 to €1,000 for a single person and by €750 to €2,000 for a couple from July 2026.  • The income limit for Carer’s Benefit will increase by €375 to €1,000 per week from July 2026.  • €20 increase in the monthly Domiciliary Care Allowance payment bringing the payment to €380 per month from January.  The Government also allocated €3.8 billion to the Department of Children, Disability and Equality for disability services in 2026, including funding for Community Based Specialist Disability Services to ensure people with disabilities receive the right support, at the right time, in the right place. This represents a 20% increase year on year and represents an overall increase since 2020 of €1.8 billion.  The Programme for Government commits to introducing a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment. In addition, under the recently published National Human Rights Strategy for Disabled People, my Department will lead a Strategic Focus Network on the Cost of Disability. The First Programme Plan of Actions 2025 - 2026 will be published shortly.  My officials have already held meetings with a number of organisations to discuss the possible structure and content of the Strategic Focus Network on the Cost of Disability. I will be meeting a number of organisations at the next meeting of my Department’s Disability Consultative Forum on 2 December at which the Cost of Disability Strategic Focus Network is the main agenda item.  My Department provides the Supplementary Welfare Allowance scheme, for those whose means are insufficient to meet their needs and those of their dependents. Under the scheme, the Department may make an ‘additional needs payment’ to meet essential expenditure which a person could not reasonably be expected to meet out of their weekly income. Any person who considers they may have an entitlement to an additional needs payment is encouraged to contact their local community welfare service.  I trust this clarifies the issue for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_330.xml"
            }
          },
          "debateSectionId": "dbsect_330",
          "showAs": "Emergency Planning",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_330"
        },
        "questionNumber": 389,
        "date": "2025-11-27",
        "showAs": " 389. Deputy Robert O'Donoghue asked the Minister for Social Protection if he will bring forward a cost-of-disability payment to replace the once-off measures provided for in Budget 2025; and if he will make a statement on the matter. [66788/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_389"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_413.xml"
            }
          },
          "debateSectionId": "dbsect_413",
          "showAs": "Cancer Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_413"
        },
        "questionNumber": 484,
        "date": "2025-11-27",
        "showAs": " 484. Deputy Robert O'Donoghue asked the Minister for Health if she is aware of any plans for the establishment of rapid access diagnostic clinics for pancreatic cancer, similar to those for lung, breast, and prostate cancer; if she is aware of how transformative these clinics have been for the aforementioned cancer diagnoses; and if she will make a statement on the matter. [66763/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_484"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Government is committed to improving cancer care, ensuring better prevention, maintaining improvements in cancer survival rates, and timely access to treatments.  The Government has allocated significant funding of €105 million, including €23 million in 2025, to the National Cancer Strategy since 2017 to support cancer services and improve outcomes for patients. This includes allocating funding to screening programmes, cancer treatment and survivorship services.  This funding has enabled the recruitment of over 670 staff to our national cancer services, including 200 nursing staff, 100 consultants, and 180 health and social care professionals in designated cancer centres. Funding in 2025 will support recruitment of 179 additional staff to national cancer screening and treatment services.  Capital funding of over €140 million has been used since 2017 to provide state of the art radiation oncology facilities to establish a National Cervical Screening Laboratory, and to update cancer infrastructure in chemotherapy wards and lab facilities. This year’s capital plan includes €12.13m for radiation oncology projects along with further funding for the design and construction of Oncology Day Units and chemotherapy infrastructure.  Pancreatic cancer is the 9th most diagnosed invasive cancer, accounting for 2.5% of invasive cancer diagnoses. Early pancreatic cancer rarely presents with specific or classic red-flag symptoms, such symptoms typically appear only in advanced stages of the disease. Around 600 new cases of pancreatic cancer are diagnosed in Ireland each year.  In line with Recommendation 21 from the National Cancer Strategy 2017-2026, surgery for pancreatic cancer has been centralised to two cancer centres: A national centre in St Vincent’s University Hospital and an associated centre in Cork University Hospital and significant work has been done to improve the awareness and treatment of pancreatic cancer in Ireland.  The NCCP have completed scoping the requirements to develop a pancreatic pathway from primary care through tertiary care.  The first version of the NCCP genomic test directory for cancer was published in July 2024 with the publication of the test directory for colorectal and ovarian cancer. It has now been expanded to include the Pancreatic cancer also.  The test directory comprises a list of clinical indications for genomic testing for cancer patients and is focused on clinically actionable findings.  A number of new testing pathways have been introduced in line with HSE reimbursement approval of new Systemic Anti-Cancer Therapy (SACT) indications. These include direct ordering of BRCA testing by medical oncologists to support prescribing of PARP (Poly (ADP-ribose) Polymerase) inhibitors in prostate cancer, breast cancer and pancreatic cancer which allows timely access to testing for patients to help inform treatment decisions.  Survival rates for patients have improved greatly and OECD data shows that cancer mortality rates in Ireland are falling faster than the EU27 average and faster than our economic peers. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_415.xml"
            }
          },
          "debateSectionId": "dbsect_415",
          "showAs": "Healthcare Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_415"
        },
        "questionNumber": 486,
        "date": "2025-11-27",
        "showAs": " 486. Deputy Robert O'Donoghue asked the Minister for Health if she plans to roll out a national awareness campaign for pancreatic cancer; if such a campaign would provide material for both medically trained and non-medically trained (patients, family, friends, carers) individuals; and if she will make a statement on the matter. [66766/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_486"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_418.xml"
            }
          },
          "debateSectionId": "dbsect_418",
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_418"
        },
        "questionNumber": 489,
        "date": "2025-11-27",
        "showAs": " 489. Deputy Robert O'Donoghue asked the Minister for Health if she is aware of the extended waiting list time for an appointment for a person (details supplied); if there are any updates available for this case; and if she will make a statement on the matter. [66773/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_489"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 324. Deputy Robert O'Donoghue asked the Minister for Health if her Department holds up-to-date figures on the number of people living with dementia in each county; if so, to provide the most recent breakdown; and if not, to state whether a national dementia register exists or is planned, and the timeline for its establishment; and if she will make a statement on the matter. [66559/25] ",
        "answerText": " Minister of State at the Department of Health  The most recent published estimated dementia prevalence figures for 2020, including a breakdown by county and projected figures for 2045, were generated by Health Atlas, HSE based on Central Statistical Office Census data from 2016. Work is currently under way to update the estimates and future projections of the number of people with dementia in Ireland, including a breakdown by county.  The 2025 Programme for Government contains a commitment to \"Work with the National Dementia Office and key stakeholders to develop a National Dementia Registry...\". On 23 May, I was pleased to announce the commencement of this Irish Dementia Registry (IDR).  The IDR will be developed, implemented, and maintained, by the National Office for Clinical Audit. It will provide a comprehensive framework for the collection of reliable, accurate, valid and timely dementia data. This data will guide service planning and delivery, support research, inform policy development and align with the recommendations of the Model of Care for Dementia in Ireland (2023).  Significant progress in setting up the IDR has already been made including the recruitment of key posts (Clinical Lead, Project Manager, and Data Analyst) and, the establishment of an oversight group to support the advancement of key deliverables.  The development of the IDR is expected to take approximately three years, with full implementation scheduled for Q3 2028. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_324",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_284",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_284.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_284"
        },
        "date": "2025-11-26",
        "questionNumber": 324,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Robert O'Donoghue",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 156. Deputy Robert O'Donoghue asked the Minister for Foreign Affairs and Trade the number of embassies, missions and consulates operated by her Department; the total WTE staff and cost of each by host country/mission, for each year since 2015. [65804/25] ",
        "debateSection": {
          "showAs": "Diplomatic Representation",
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_170",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_170.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 156,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Foreign",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_156",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 484. Deputy Robert O'Donoghue asked the Minister for Culture, Communications and Sport the current and planned funding streams to ensure that all sports grounds, clubs, and gyms have access to automated external defibrillators (AEDs); and if he will consider establishing a dedicated national fund to support the purchase, maintenance, and replacement of AEDs in sports facilities; and if he will make a statement on the matter. [65982/25] ",
        "debateSection": {
          "showAs": "Defibrillators Provision",
          "debateSectionId": "dbsect_451",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_451",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_451.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 484,
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The Community Sport Facilities Fund (CSFF) is the primary means of providing Government funding to sport and community organisations at local, regional and national level throughout the country. The Fund aims to foster an integrated and planned approach to the development of sports and physical recreation facilities, and it also assists the purchase of non-personal sports equipment.  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the CSFF benefitting over forty sports, as well as multi-sport facilities, throughout the country. This represents the largest-ever investment in sports facilities in communities across Ireland.  CSFF provides funding for non-personal sports equipment up to a value of €40,000 and this includes defibrillators. Equipment grants of over €70,000 are awarded in exceptional circumstances (such as to National Governing Bodies of Sport).  In line with previous rounds of the Fund, a review of the current funding round is being undertaken. I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next CSFF round will particularly target areas and sports that have been under-invested in over the years. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_484",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 499. Deputy Robert O'Donoghue asked the Minister for Housing, Local Government and Heritage to confirm that community-based, not-for-profit early years services are exempt from commercial rates; the guidance provided to local authorities to ensure that such community services are treated consistently with regard to rates liability; and if he will make a statement on the matter. [65980/25] ",
        "debateSection": {
          "showAs": "Early Childhood Care and Education",
          "debateSectionId": "dbsect_463",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_463",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_463.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 499,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 499 and 500 together.  Tailte Éireann is an independent Government agency and provides a property registration system, property valuation service, and national mapping and surveying infrastructure for the State. Tailte Éireann is independent in the exercise of its valuation functions under the Valuation Act 2001, as amended (the Act), and I, as the Minister for Housing, Local Government and Heritage, have no function in decisions in this regard.  Tailte Éireann has overall responsibility under the Act, for the maintenance of all Valuation Lists used by local authorities in the calculation of rates liability. Under the Act, all property is rateable unless it falls into one of the exempt categories listed in Schedule 4 of the Act. There is a very specific range of exemptions that can be applied, and Tailte Éireann has no discretionary latitude to grant exemptions not covered by Schedule 4.  Paragraph 22 of Schedule 4 of the Act, which was inserted by the Valuation (Amendment) Act 2015, refers specifically to early childhood care and education facilities and provides an exemption for:  “Any land, building or part of a building used exclusively for the provision of early childhood care and education, and occupied by a body which is not established and the affairs of which are not conducted for the purpose of making a private profit.”  Therefore, while the Act provides that early childhood care and education facilities that are operated on a not-for-profit basis are exempt from rates, it does not provide a general exemption from rates for all childcare or childminding facilities operating on a for profit basis. To avoid ambiguity, if an early childhood care and education facility is operated on a for-profit basis, then they do not fulfil the criteria for exemption under Paragraph 22.  As a matter of course, Tailte Éireann examines all properties on their individual merits by reference to the relevant statutory provisions governing the operation of the Act and case law arising from the independent Valuation Tribunal and the Higher Courts.  There are a number of avenues of redress for an occupier of rateable property who is dissatisfied with a determination of valuation by Tailte Éireann made under the provisions of the Valuation Act 2001, as amended. Firstly, before a determination is made, there is a right to make representations to Tailte Éireann in relation to a proposed valuation. Later in the process, if the occupier is still dissatisfied with the determination, there is a right of appeal to the Valuation Tribunal which is an independent body set up for the purpose of hearing appeals against determinations of Tailte Éireann. There is a right of appeal to the Higher Courts on a point of law.  Under Irish law there is a distinct separation of functions between the valuation of rateable property and the setting and collection of commercial rates. The commercial rates payable on a particular property is a product of the valuation of that property determined by Tailte Éireann multiplied by the “Annual Rate on Valuation” (ARV) which is set annually by the elected members of the local authority as part of its budgetary process. The billing and collection of rates is solely a matter for the relevant local authority. Tailte Éireann has no function in that regard. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_499",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 500. Deputy Robert O'Donoghue asked the Minister for Housing, Local Government and Heritage if he is aware that Tailte Éireann has recently contacted community-based, not-for-profit early years services in Waterford indicating that they may be liable for commercial rates; if he will clarify Government policy regarding the rates status of such community services; if he will engage with Tailte Éireann and local authorities to ensure that community early years providers are not incorrectly deemed rateable and are protected from unwarranted threats of rates liability; and if he will make a statement on the matter. [65981/25] ",
        "debateSection": {
          "showAs": "Early Childhood Care and Education",
          "debateSectionId": "dbsect_463",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_463",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_463.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 500,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 499 and 500 together.  Tailte Éireann is an independent Government agency and provides a property registration system, property valuation service, and national mapping and surveying infrastructure for the State. Tailte Éireann is independent in the exercise of its valuation functions under the Valuation Act 2001, as amended (the Act), and I, as the Minister for Housing, Local Government and Heritage, have no function in decisions in this regard.  Tailte Éireann has overall responsibility under the Act, for the maintenance of all Valuation Lists used by local authorities in the calculation of rates liability. Under the Act, all property is rateable unless it falls into one of the exempt categories listed in Schedule 4 of the Act. There is a very specific range of exemptions that can be applied, and Tailte Éireann has no discretionary latitude to grant exemptions not covered by Schedule 4.  Paragraph 22 of Schedule 4 of the Act, which was inserted by the Valuation (Amendment) Act 2015, refers specifically to early childhood care and education facilities and provides an exemption for:  “Any land, building or part of a building used exclusively for the provision of early childhood care and education, and occupied by a body which is not established and the affairs of which are not conducted for the purpose of making a private profit.”  Therefore, while the Act provides that early childhood care and education facilities that are operated on a not-for-profit basis are exempt from rates, it does not provide a general exemption from rates for all childcare or childminding facilities operating on a for profit basis. To avoid ambiguity, if an early childhood care and education facility is operated on a for-profit basis, then they do not fulfil the criteria for exemption under Paragraph 22.  As a matter of course, Tailte Éireann examines all properties on their individual merits by reference to the relevant statutory provisions governing the operation of the Act and case law arising from the independent Valuation Tribunal and the Higher Courts.  There are a number of avenues of redress for an occupier of rateable property who is dissatisfied with a determination of valuation by Tailte Éireann made under the provisions of the Valuation Act 2001, as amended. Firstly, before a determination is made, there is a right to make representations to Tailte Éireann in relation to a proposed valuation. Later in the process, if the occupier is still dissatisfied with the determination, there is a right of appeal to the Valuation Tribunal which is an independent body set up for the purpose of hearing appeals against determinations of Tailte Éireann. There is a right of appeal to the Higher Courts on a point of law.  Under Irish law there is a distinct separation of functions between the valuation of rateable property and the setting and collection of commercial rates. The commercial rates payable on a particular property is a product of the valuation of that property determined by Tailte Éireann multiplied by the “Annual Rate on Valuation” (ARV) which is set annually by the elected members of the local authority as part of its budgetary process. The billing and collection of rates is solely a matter for the relevant local authority. Tailte Éireann has no function in that regard. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_500",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 549. Deputy Robert O'Donoghue asked the Minister for Housing, Local Government and Heritage if he will support the development of a national requirement that all developers constructing new housing estates provide an automated external defibrillator (AED) within the estate; and if he will consider incorporating such a requirement into planning or building regulations in the interest of public health and community safety; and if he will make a statement on the matter. [65983/25] ",
        "debateSection": {
          "showAs": "Defibrillators Provision",
          "debateSectionId": "dbsect_499",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_499",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_499.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 549,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_549",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 660. Deputy Robert O'Donoghue asked the Minister for Justice, Home Affairs and Migration his position on signing up to the European Prosecutor's Office; to outline the work and steps being taken to sign up to this office; and if he will make a statement on the matter.  [65803/25] ",
        "debateSection": {
          "showAs": "Departmental Bodies",
          "debateSectionId": "dbsect_590",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_590",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_590.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 660,
        "answerText": " Minister for Justice, Home Affairs and Migration  The European Public Prosecutor’s Office (EPPO) was established in 2017 under the EU's enhanced cooperation measure to investigate and prosecute crimes against the financial interest of the European Union. These crimes are as set out in Directive (EU) 2017/1371 of the European Parliament and of the Council, on the fight against fraud to the Union’s financial interests by means of criminal law, otherwise known as the PIF Directive.  Ireland decided not to opt in to the EPPO Regulation at that time, given that it represented a departure from our common law model of investigation and prosecution. However, Ireland has transposed the PIF Directive and the full suite of measures to investigate and prosecute PIF offences are available to Irish authorities under our domestic structures.  The Government approved the drafting of the General Scheme of a Bill to allow Ireland to join the EPPO in October 2023. I hope to be in a position to publish the General Scheme in early 2026. In the meantime, co-operation with the EPPO as a non-participating Member State is operational and working well, and legislative changes required to facilitate Ireland’s cooperation with the EPPO are fully operational as of 1 November 2023.  This was effected by way of amendments to the Criminal Justice (Mutual Assistance) Act 2008, which enables Irish-EPPO cooperation, by creating a legal framework for EPPO to make requests for assistance directly to the State. Since then, there has been ongoing positive engagement with the EPPO in relation to the processing of mutual legal assistance requests.  The Central Authority for Mutual Assistance in my Department is the contact point for the European Public Prosecutor’s Office. All EPPO requests received are handled in accordance with the legislation and are prioritised. I can assure the Deputy that Irish officials enjoy a positive and collaborative working relationship with the EPPO, and it is intended that this will continue as the work on the legislative and operational aspects of Ireland’s future participation in the EPPO progresses. The Irish Government remains fully committed to protecting the Union’s financial interests and to providing every support possible to the EPPO, as it carries out its very important work. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_660",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 666. Deputy Robert O'Donoghue asked the Minister for Justice, Home Affairs and Migration to clarify the situation of international protection applicants from Afghanistan that have their applications refused and are advised to voluntarily return, given the ongoing humanitarian crisis in Afghanistan; to elaborate on the circumstances whereby Ireland is both operating a humanitarian admission programme and not enforcing returns to the country; to explain the circumstances where many Afghan nationals with negative decisions will face becoming \"non-returnable migrants\", with all the attendant negative consequences; and if he will make a statement on the matter. [65869/25] ",
        "debateSection": {
          "showAs": "International Protection",
          "debateSectionId": "dbsect_595",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_595",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_595.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 666,
        "answerText": " Minister for Justice, Home Affairs and Migration  It is a central priority for me that Ireland’s immigration system is robust and rules based. The enforcement aspects of our laws, including deportation orders, are an essential requirement for the system to work effectively and to ensure that there is confidence in the application of our legislation in this area.  Where a person applies for international protection in the State, there are a number of assessments of the person’s application; where an applications is assessed as being unfounded, the Minister is under an obligation to issue a Deportation Order.  It is important to note that in many cases where a Deportation Order has been signed in respect of an Afghan national, these are cases where the person has not co-operated with the International Protection process; including not cooperating in the determination of their identity and nationality. In many such cases non-cooperation may involve the person not attending for their interview or failing to make representations why they and their family should be granted permission to remain in Ireland, therefore leaving no option but for a Deportation Order to issue.  Deportations are costly and complex to enforce. It is the preferred option to return people voluntarily and my Department has, for many years, operated a voluntary return programme to assist people to return prior to the issuance of a deportation order. It is important to note that a person can only avail of voluntary return before a deportation order is issued. Part of the voluntary return process is the offer of reintegration assistance – this is a grant that helps people get back on their feet when they return home.  In 2024, 934 people left Ireland by way of voluntary return. This year 1,426  people have left up to 21 November 2025 , which is an increase of 90% compared to the same period in 2024.  Voluntary return is offered to everyone in the International Protection process and people are not excluded on grounds of nationality. However, I can assure the Deputy there are safeguards in place for vulnerable people and requests for return can be refused if it would be unsafe for the person to return. My Department assesses each application individually based on their eligibility for the programme. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_666",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 746. Deputy Robert O'Donoghue asked the Minister for Children, Disability and Equality the number of people under the age of 65 currently residing in nursing homes, in tabular form; the primary medical or support needs associated with these individuals; the average cost of providing their care in these settings; and if she will make a statement on the matter. [65295/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_662",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_662",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_662.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 746,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_746",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 958. Deputy Robert O'Donoghue asked the Minister for Further and Higher Education, Research, Innovation and Science if his Department is working with community organisations, libraries, or Age Friendly Ireland to provide targeted digital literacy training and support, in order that older people can confidently use online services if they wish to, rather than being forced to because there’s no alternative; and if he will make a statement on the matter. [63872/25] ",
        "debateSection": {
          "showAs": "Education and Training Provision",
          "debateSectionId": "dbsect_863",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_863",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_863.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Robert O'Donoghue",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "memberCode": "Robert-O'Donoghue.D.2024-11-29"
        },
        "questionNumber": 958,
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  My Department, working with SOLAS and the Education and Training Boards (ETBs), is actively supporting digital literacy so that all those wishing to use online services can do so confidently and at their own pace - including older people.  Under the Government’s ten-year Adult Literacy for Life (ALL) Strategy, digital capability is recognised as essential for full participation in society. The Strategy does not specifically assess the impact of digitalisation of services on older adults, a strong suite of training-focused initiatives is underway to support this group through the ALL Collaboration and Innovation Fund (CIF), the REACH Fund and wider community-education provision. A detailed list of projects funded through the ALL CIF for 2025 is provided separately.  These programmes are designed to build confidence, functional skills and the ability to use digital tools for everyday tasks such as communicating, accessing information and navigating online services. Delivery models include one-to-one Digital Help Hubs in libraries; ETB initiatives such as Byte and Brew; Siúlóid Nádúr Digiteach; peer-mentor training for active-retirement groups; digital-skills programmes linked to creative projects including Life in Motion and Our Lived History; and structured smartphone and online-services courses delivered through Family Resource Centres, Men’s Sheds, libraries and community organisations.  In 2025, SOLAS allocated over €176,000 to Age Action to deliver two programmes, the University of the Third Age and Digital Literacy Programme and the Getting Started Digital Skills Programme, aimed at enhancing digital skills among older people.  In addition, SOLAS is supporting Generation Ireland - an initiative aimed at helping people overcome barriers to employment to upskill - to deliver digital-skills bootcamps for older workers, including tailored provision for those aged 40 and over.  Whilst my Department does not have a remit in relation to the digitisation of services, I want to assure the Deputy that I am committed to ensuring everyone including older people can access high-quality, relevant supports for digital skills in order to use online services. To this end, SOLAS and the ETBs are working with community organisations, libraries, Age Friendly Ireland, and other partners to deliver targeted digital literacy training and support that are accessible, inclusive, and responsive to the needs of older people.   Digital Literacy for Older People  ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_958",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_52",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_52",
          "showAs": "Online Safety",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_52.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 8. Deputy Robert O'Donoghue asked the Minister for Culture, Communications and Sport if he will ensure that his Department works closely with Coimisiún na Meán, An Garda Síochána, and education partners to strengthen prevention and protect victims, in order that our online spaces reflect the values of safety, respect, and democracy we expect offline (details supplied); and if he will make a statement on the matter. [64060/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_8",
        "answerText": " Minister for Culture, Communications and Sport  Threats and harassment of any individual are not acceptable. The bringing to justice of the perpetrators of such abuse, whether online or offline, is a matter for An Garda Síochána and if anyone is subjected to threats or abuse, they should report it immediately to the Gardaí. Furthermore, I would encourage anyone who sees any abusive or threatening content online to report it, in the first instance, to the relevant platform. If a person is dissatisfied with the platform’s response, they can report it to Coimisiún na Meán.  Under the online safety framework, platforms are obliged to minimise the availability of harmful online content like cyberbullying, incitement to hatred or violence. They must provide a way for people to report content they think is illegal, respond to these reports in a timely and diligent manner and consistently enforce their own terms and conditions. In particular, under the Digital Services Act, which is part of Ireland’s online safety framework, the largest online platforms must take mitigation measures in relation to the availability and exposure of users to illegal online content. This includes, for example, certain abusive, threatening or offensive communications as detailed in Coco’s Law (the Harassment, Harmful Communications and Related Offences Act, 2020).  The European Commission is the lead regulator in enforcing these requirements for the largest platforms and search engines. Coimisiún na Meán, as Ireland’s Digital Services Coordinator under the DSA, supports the European Commission in enforcing these obligations. An Coimisiún announced last week that it is investigating the platform X for possible non-compliance with the DSA in respect of how they deal with complaints.  In September, Coimisiún na Meán published a report into the experiences of candidates in the 2024 elections. Many said that they were subject to abuse or threats online. An Coimisiún is committed to working with all stakeholders to address the issues raised in the report. An Coimisiún already works closely with An Garda Síochána on such matters and both bodies are working on a memorandum of understanding to structure this cooperation.  Awareness is important and last year, An Coimisiún produced a range of online safety materials for schools and later this year, An Coimisiún will be running public awareness campaigns across social media and other channels to carry the message that content like that is unacceptable and that people should report it to the relevant platforms in the first instance.  As a politician and a parent, I am committed to working with all stakeholders to ensure that our online spaces are safe for everyone. ",
        "questionNumber": 8,
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_83",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_83",
          "showAs": "Online Safety",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_83.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 50. Deputy Robert O'Donoghue asked the Minister for Culture, Communications and Sport in light of other countries introducing restrictions on social media for under 16s or requiring parental consent, if his Department is considering similar measures in Ireland; and if he will make a statement on the matter. [64061/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_50",
        "answerText": " Minister for Culture, Communications and Sport  European Union Member States are examining this question of prohibiting access by children and young people to social media platforms – the so-called “digital age of majority”. Australia is implementing such a measure and other jurisdictions are considering similar measures.  Ireland is also considering its approach on this matter. I believe that any decision would be better taken by the EU and EU Member States together and in that regard, it is important to note that the President of the European Commission Ursula van der Leyen announced that she would establish an expert panel to examine the issue and to report by the end of the year. However, across the European Union there are differing views whether there should be an age of digital majority at all, and if there were such an age, what age it should be, and whether it should be an outright ban or a ban subject to parental consent.  In considering this matter, it is important that we include the voice of our young people and have regard to their rights, while protecting them from harm. It is also important that any such measures comply with the Digital Services Act because it is an EU Regulation that requires maximum harmonisation for all EU Member States, including Ireland  Notwithstanding whether a “digital age of majority” is implemented, I believe that age verification is a vital part of the picture in terms of providing real assurance that children are the age they claim to be and to ensure they are not exposed to harmful or illegal content. Without robust age verification, any other measures, including implementing a digital age of majority won’t work. I am working across Government to support robust age verification. In doing so, we must seek to ensure interoperabability and respect users’ rights, including data protection rights. To that end, my officials are working with the Government’s Chief Information Officer and his Office to look at practical technical solutions to age verification as part of the Government's Digital Wallet being developed using MyGovID. I am also seeking the inclusion of a commitment to this effect in the Government’s updated National Digital Strategy which will be published later this year.  I am determined to make progress on this key issue and will work with other EU member states, including in the context of Ireland's Presidency of the EU next year, on effective and practical solutions. ",
        "questionNumber": 50,
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_457",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_457",
          "showAs": "Hospital Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_457.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 587. Deputy Robert O'Donoghue asked the Minister for Health given the increasing number of older people presenting with dementia and Alzheimer’s disease, if it is mandatory for all hospital staff , including those working in emergency departments, to receive dementia-specific training;  the HSE or hospital protocols for patients with dementia or Alzheimer’s who present with delirium and are left sitting on a chair in an emergency department for extended periods, including up to 24-hours; the measures which are in place to ensure that persons with dementia receive appropriate, safe, and dignified care when attending emergency departments; and if she will make a statement on the matter. [64690/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_587",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  Reply not received from Department. ",
        "questionNumber": 587,
        "by": {
          "memberCode": "Robert-O'Donoghue.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Robert-O'Donoghue.D.2024-11-29",
          "showAs": "Robert O'Donoghue"
        }
      },
      "contextDate": "2025-11-20"
    }
  ]
}