{
  "head": {
    "counts": {
      "questionCount": 306,
      "resultCount": 306
    }
  },
  "results": [
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_263.xml"
            }
          },
          "debateSectionId": "dbsect_263",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_263",
          "showAs": "Job Retention"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_300",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 300,
        "showAs": " 300. Deputy Pat Casey asked the Minister for Business, Enterprise and Innovation the actions she has taken to protect jobs at a company (details supplied); if she has spoken with management of the company regarding protecting the jobs; and if she will make a statement on the matter. [52686/19] ",
        "answerText": " Minister for Business, Enterprise and Innovation (Deputy Heather Humphreys)  First and foremost, my thoughts are with the workers affected and their families at what is a very difficult time. Enterprise Ireland has been engaging with Rondo Foods since 2011 and since the announcement by the company on the 8th November of possible redundancies, Enterprise Ireland has been engaging intensively with the company to see it is was possible to find a solution and avert the job losses. Unfortunately, however, this has not proved possible to avert these job losses and the company announced on 9th December that the factory in Arklow will close at the end of January 2020 and the facility will be relocated to Krefeld in Germany.  The Government will make every State support available to the employees of Rondo Foods. The Minister for Employment Affairs and Social Protection is aware of the situation and we will be collectively, across Government, doing our utmost to help these workers transition and find new employment opportunities.  The staff of the Workplace Relations Commission (WRC) will be available to meet the employees concerned, either individually or collectively, to discuss their employment rights. I would urge any employees who have any concerns about their employment rights to contact the WRC.  The company has confirmed on 9th December that all staff have been offered redundancy packages which exceed the scale of the mandatory statutory redundancy packages.  Enterprise Ireland was in attendance along with the Wicklow Local Enterprise Office at an information meeting for all Rondo employees on Monday 16th December which was organised by Department of Employment Affairs and Social Protection.  At the information meeting for all staff Enterprise Ireland provided information on:  - The Enterprise Ireland High Potential Start Up supports available for start-up food businesses and;  - The FoodWorks programme for high potential food businesses.  In addition to marketing Wicklow for new investment, both Enterprise Ireland and IDA Ireland continue to work with their existing client companies in the area with a view to encouraging them to grow and embed their businesses.  Notwithstanding this extremely disappointing news, it’s important to remember that the overall trend in terms of job creation in Co. Wicklow is positive. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_623.xml"
            }
          },
          "debateSectionId": "dbsect_623",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_623",
          "showAs": "Employment Support Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_672",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 672,
        "showAs": " 672. Deputy Pat Casey asked the Minister for Employment Affairs and Social Protection the supports that will be put in place by her Department and agencies under her aegis for employees that lost their jobs in a company (details supplied); and if she will make a statement on the matter. [52686/19] ",
        "answerText": " Minister for Employment Affairs and Social Protection (Deputy Regina Doherty)  I propose to take Questions Nos. 672 and 679 together.  Officials in my Department have been in close contact with the Company over the past number of weeks (during the consultation period between the company and its employees), to ensure that were the plant to close that my Department would be ready to act swiftly in terms of providing support and advice for the employees.  The consultation period has now concluded and unfortunately the outcome has resulted in a closure of the plant. My Department put a support plan for the Company named into operation with immediate effect, and held two information sessions in the town on Monday 16/12/19 to which all the affected employees were invited.  Information about the income and other supports available to the employees was made available at both sessions. Officials from my Department provided advice and information on the income support payments to which the employees may be entitled from my Department and they explained the supports that are in place to assist them in finding alternative employment.  Kildare Wicklow Education & Training Board was also available to provide information on training and education options for employees interested in reskilling. Wicklow Local Enterprise Office and Enterprise Ireland provided advice to people who may want to consider self-employment as an option. In addition, the local Jobs Club assisted employees who needed help with CV preparation and interview skills and the Money Advice and Budgeting Service was also in attendance to offer advice on money management and debt, if required.  In addition to the support and information sessions, the local Intreo Centre put a process in place to ensure claims applications will be received and processed in a timely manner. Staff from my Department and the other agencies mentioned above will be available to give ongoing support and advice to the workers affected during this difficult time.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_623.xml"
            }
          },
          "debateSectionId": "dbsect_623",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_623",
          "showAs": "Employment Support Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_679",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 679,
        "showAs": " 679. Deputy Pat Casey asked the Minister for Employment Affairs and Social Protection the supports and advice her Department will make available to workers laid off at a company (details supplied); and if she will make a statement on the matter. [52685/19] ",
        "answerText": " Minister for Employment Affairs and Social Protection (Deputy Regina Doherty)  I propose to take Questions Nos. 672 and 679 together.  Officials in my Department have been in close contact with the Company over the past number of weeks (during the consultation period between the company and its employees), to ensure that were the plant to close that my Department would be ready to act swiftly in terms of providing support and advice for the employees.  The consultation period has now concluded and unfortunately the outcome has resulted in a closure of the plant. My Department put a support plan for the Company named into operation with immediate effect, and held two information sessions in the town on Monday 16/12/19 to which all the affected employees were invited.  Information about the income and other supports available to the employees was made available at both sessions. Officials from my Department provided advice and information on the income support payments to which the employees may be entitled from my Department and they explained the supports that are in place to assist them in finding alternative employment.  Kildare Wicklow Education & Training Board was also available to provide information on training and education options for employees interested in reskilling. Wicklow Local Enterprise Office and Enterprise Ireland provided advice to people who may want to consider self-employment as an option. In addition, the local Jobs Club assisted employees who needed help with CV preparation and interview skills and the Money Advice and Budgeting Service was also in attendance to offer advice on money management and debt, if required.  In addition to the support and information sessions, the local Intreo Centre put a process in place to ensure claims applications will be received and processed in a timely manner. Staff from my Department and the other agencies mentioned above will be available to give ongoing support and advice to the workers affected during this difficult time.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "questionNumber": 104,
        "questionType": "written",
        "showAs": " 104. Deputy Pat Casey asked the Minister for Education and Skills the number of primary and secondary schools in County Wicklow that have autism units; the number of primary and secondary school students diagnosed with autism in County Wicklow; and if he will make a statement on the matter. [49162/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_94",
          "showAs": "Special Educational Needs Data",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_94.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_94"
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister for Education and Skills  The provision of education for children with special needs, including those with Autism, is an ongoing priority for Government.  Currently, almost 20% of the total Education Vote or €1.9bn is invested in supporting children with special needs.  Since 2011 investment in Special Education supports has increased by 50%, which is significantly above the 7% increase in total student numbers over the same period.  As a result the numbers of special education teachers, special needs assistants and special class and school places are at unprecedented levels.  My Department does not hold information in relation to the number of children with a diagnosis of Autism Spectrum Disorder in school.  The National Council for Special education (NCSE), an independent agency of my Department, is responsible for planning, coordinating and advising on education provision for children with special educational needs in consultation with the relevant education partners and the Health Service Executive (HSE).  The NCSE’s policy advice on Supporting Students with Autism Spectrum Disorder (2016) noted a national ASD prevalence rate of 1.55% or 1 in every 65 students.  The majority of children with Autism attend mainstream class, where they may access additional supports if required.  But some students may find it difficult to manage full-time placement in mainstream and so placement in a Special Class or Special School setting may be deemed appropriate where placement in mainstream class is not in the best interests of the child.  The enrolment of a child to a school is a matter in the first instance for the parents/guardians of the child and the Board of Management of a school.  My Department has no role either in making or deciding on enrolment applications to schools or keeping waiting lists. In these matters, schools are required to adhere to the requirements of relevant legislation and the policies of my department.  The NCSE has responsibility for coordinating and advising on the education provision for children nationwide and has well established structures in place for engaging with schools and parents.  Nationally, 167 new special classes opened this school year, which means there are 1,618 special classes in place, compared to 548 in 2011.  Of these 1,353 special classes cater for students diagnosed with ASD.  Provision in our 124 special schools has also increased from 6,848 placements in 2011 to 7,872 this year.  In Wicklow alone there are 62 special classes and 3 Special Schools providing specialist support to children with more complex special educational needs.  The NCSE has planned a further expansion of special class and school places in Wicklow for next year.  It is open to any school to make an application to the NCSE for the establishment of a specialised provision and where sanctioned, there is a range of supports including capital funding available to the school.  Normally, special class and school places are established with the full cooperation of the schools in areas where they are required.  However there are some parts of the country where the Council has faced challenges in getting schools and their Patrons to voluntarily agree to provide special class or school places.  I know that this can cause much anguish for parents and families involved.  As Minister I have a power under Section 37A of the Education Act 1998 to direct a school to provide additional provision where all reasonable efforts have failed.  I would prefer to see schools volunteer to provide more places rather than places being secured on the back of an order or a direction from me. It is the right thing for the children in a community.  All schools have the contact details of their local SENO, while Parents may also contact their local SENO directly to discuss their child's special educational needs and to identify appropriate educational placements, using the contact details available on the NCSE website www.ncse.ie. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_104"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 118,
        "questionType": "written",
        "showAs": " 118. Deputy Pat Casey asked the Minister for Justice and Equality the number of Garda vehicles attached to each district in County Wicklow as of 20 November 2019; the year, make and model of the vehicles; the equivalent figures as of 1 January 2019; and if he will make a statement on the matter. [49173/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_109",
          "showAs": "Garda Transport Data",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_109.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_109"
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister for Justice and Equality  The resources provided by Government to An Garda Síochána have reached record levels, with an allocation for 2019 of €1.76 billion and this is due to increase further to an unprecedented €1.88 billion for 2020.  The capital budget for An Garda Síochána has also been significantly increased - a total of €92 million was provided this year, representing a 50% increase on capital investment in 2018. And capital investment will increase further to €116.5 million in 2020.  I can confirm that an overall investment of €46 million has been agreed by Government between 2016 and 2021.  €10 million was made available for the Garda fleet this year.  A further €9million will be provided next  year as part of an overall investment of €46 million in the Garda fleet between 2016 and 2021.  It is important to be clear that under Garda Síochána Act 2005 as amended, the Garda Commissioner has responsibility for management of An Garda Síochána. He is responsible for the allocation and efficient use of Garda resources, in light of operational demands.  This includes responsibility for allocation of Garda vehicles.  As Minister I have no direct role in these matters. I understand however that Garda management keeps the distribution of resources under continual review, to ensure their optimum use.  The Deputy will appreciate that the size of the Garda fleet can fluctuate somewhat, as vehicles are added to and removed from the fleet.  I am further informed that the fleet in the Wicklow Division on 1 January 2019 included 61 vehicles.  On 22 November it was 60.  A breakdown of these vehicles for the Wicklow Division, as conveyed to me by the Garda authorities, is set out in the following tables.   Wicklow Division as of 1 January 2019      District    Cars    Vans    Motorcycles    4X4    Other      Baltinglass    10    3    0    1    0      Bray    19    4    1    1    1      Wicklow    13    4    0    3    1      Total    42    11    1    5     2       Wicklow Division as of 22 November 2019      District    Cars    Vans    Motorcycles    4X4    Other      Baltinglass    10    3    0    1    0      Bray    19    4    1    1    0      Wicklow    12    4    0    4    1      Total    41    11    1    6     1      I am informed that the current tender for the purchase of Garda vehicles through the Office of Government Procurement is for Hyundai, BMW and Ford vehicles.  I understand that this year's funding is being used for the purchase and fit-out of over 300 vehicles, of which 289 vehicles have been allocated to date. I understand that orders have been placed for a further 59 vehicles which will be allocated before the end of this year or in Quarter 1 2020.  As a result, the Garda authorities consider that it is likely that the Garda fleet will be slightly larger at the end of the year compared to the total number of vehicles at the beginning of the year.  Further, my intention is that a further €1 million funding for the fleet will be included in additional funding to be provided to the Garda Vote before the end of the year.  I am assured that the allocation of Garda vehicles is made on the basis of identified operational demands and that the allocation of Garda vehicles is monitored and reviewed on a continual basis.  Finally, the Deputy may be interested to know that the Garda authorities are developing a Fleet Strategy, which I expect to set out detail on matters including, for example, the optimum size and composition of the fleet.  I expect that the new Governance function in my Department will engage with An Garda Síochána, in that regard, as the process continues. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_118"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 127,
        "questionType": "written",
        "showAs": " 127. Deputy Pat Casey asked the Minister for Health the number of persons in County Wicklow awaiting home help hours to be approved, allocated or increased; and if he will make a statement on the matter. [49177/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_118",
          "showAs": "Home Help Service Data",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_118.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_118"
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister of State at the Department of Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_127"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 129,
        "questionType": "written",
        "showAs": " 129. Deputy Pat Casey asked the Minister for Health if there was a funding underspend from 2019 in the mental health services for CHO areas 6 and 7; if so, the amount; the location in which this funding was provided; and if he will make a statement on the matter. [49179/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_120",
          "showAs": "Mental Health Services Expenditure",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_120.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_120"
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister of State at the Department of Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_129"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 217,
        "questionType": "written",
        "showAs": " 217. Deputy Pat Casey asked the Minister for Communications, Climate Action and Environment the timeframe for the publication of guidelines pertaining to the supply of energy to the national grid through solar energy and solar farms in County Wicklow; the terms and conditions which prospective suppliers must adhere to; and if he will make a statement on the matter. [49196/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_200",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_200.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_200"
        },
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister for Communications, Climate Action and Environment  In order to deliver on the ambition set out in the Climate Action Plan, my Department is developing the Renewable Electricity Support Scheme (RESS). The RESS has been designed within a competitive auction-based, cost effective framework and the scheme will provide for a renewable electricity (RES-E) ambition of 70% by 2030. The Scheme is subject to state aid approval from the EU Commission.  The Climate Action Plan targets the delivery of indicative volumes of up to 1.5 GW of grid scale solar by 2030. Utility scale solar energy farms will be critical to diversifying the renewable technology mix and to deliver gains through connecting hybrid renewable technologies. The volume of connected solar in 2030 may well exceed this target if prices continue to fall and solar projects are successful in the RESS auctions.  The terms and conditions of the first RESS auction (RESS-1) will set out the process by which all competing technologies including solar farms receive support for supplying energy to the national grid.  My Department held a public stakeholder briefing on 22 November 2019 at which officials presented on the RESS detailed design framework, and the presentation from the briefing session is available on my Department's website. It is expected that the draft RESS 1 terms and conditions will be published in December 2019, subject to Government approval. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_217"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 242,
        "questionType": "written",
        "showAs": " 242. Deputy Pat Casey asked the Minister for Transport, Tourism and Sport the details on each application sent from County Wicklow for the sports capital grant 2019, by successful, unsuccessful and incomplete applications. [49217/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_222",
          "showAs": "Sports Capital Programme Data",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_222.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_222"
        },
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister of State at the Department of Transport, Tourism and Sport  Details of all applications submitted under the latest round (2018) of the Sports Capital Programme are listed on a county basis on my Department's website at https://assets.gov.ie/20000/ececa538f64a48e3ab4540515da4cf95.pdf.  Similarly, details of all allocations under the programme are also published on the Department's website at https://www.gov.ie/en/collection/471ed5-sports-capital-allocations/  In relation to the latest allocations under the Programme as announced earlier this month, my Department will shortly be in contact with all applicants with full details of the outcome of the assessment process.  All unsuccessful applicants will be invited to appeal the Department's decision if they believe that their application was not correctly assessed according to the published assessment manual. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_242"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 262,
        "questionType": "written",
        "showAs": " 262. Deputy Pat Casey asked the Minister for Rural and Community Development the clubs, groups and organisations that have received funding under the LEADER RDP programme in County Wicklow in each of the years 2016 to 2018 and to date in 2019; the level of funding provided to each group; and if he will make a statement on the matter. [49250/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_241",
          "showAs": "LEADER Programmes Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_241.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_241"
        },
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister for Rural and Community Development  The LEADER programme is administered in County Wicklow by the Wicklow Local Action Group (LAG).  The Funding Agreement for the LEADER 2014-2020 programme was signed with the Wicklow LAG in July 2016. The programme effectively became operational in County Wicklow from this date. The total amount of funding allocated to County Wicklow for the duration of the LEADER programme to 2020 is in excess of €6.3 million.  No projects were approved for funding is this LAG area in 2016 or 2017 as the initial focus of the LAG was to work with potential project promoters to develop ideas and bring forward proposals for funding.  However, there has been a significant increase in project approvals nationally since the start of 2018, and this is also evident in County Wicklow.  The Wicklow LAG has now approved 61 projects applications to a value of over €2.2 million.  A further 11 applications, requesting funding in excess of €1.5 million, are at earlier stages in the approvals process.  Payments under the programme will increase significantly as these projects are completed and payment claims are submitted.  Details of all projects funded by the LEADER Local Action Group in County Wicklow are available on-line at: https://www.gov.ie/en/publication/b849be-local-action-groups-approved-projects-2014-2020/ . ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_262"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 269,
        "questionType": "written",
        "showAs": " 269. Deputy Pat Casey asked the Minister for Employment Affairs and Social Protection the progress made to date by the interdepartmental group on the pension issue of community employment supervisors; and if she will make a statement on the matter. [49251/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_248",
          "showAs": "Community Employment Schemes Supervisors",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_248.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_248"
        },
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister for Employment Affairs and Social Protection  The Government decided in January 2019 to set up an Inter-departmental Group (IDG) to explore the most appropriate organisation arrangements for social inclusion work schemes currently operated by my Department.  The Group was not set up to consider the pensions of CE supervisors.  The final report of the IDG is expected to be available shortly.  In relation to the Deputy's specific question on the 'pension issue of Community Employment Supervisors', my Department is currently engaging with representatives of CE supervisors to discuss issues that arise following a 2008 Labour Court Recommendation in relation to pensions.  All parties have agreed that the detail of all discussions undertaken by the group should remain confidential until the process has completed.  I expect the related discussions to conclude shortly. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_269"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 270,
        "questionType": "written",
        "showAs": " 270. Deputy Pat Casey asked the Minister for Employment Affairs and Social Protection the status of a pension application by a person (details supplied). [49253/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_249",
          "showAs": "State Pension (Contributory) Applications",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_249.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_249"
        },
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister for Employment Affairs and Social Protection  The person concerned initially applied for State pension (contributory) on 28 October 2009 in advance of reaching pension age in December 2009.  They were assessed as having 22 paid full-rate social insurance contributions.  As their contributions fell short of the required 260 paid full-rate contributions to qualify for State pension (contributory), the claim was disallowed.  They were notified in writing of this decision.  The person re-applied for State pension (contributory) on 24 October 2019.  Their entitlement to both the standard State pension (contributory) and the mixed insurance pro rata State pension (contributory) was examined.  The person was again assessed with 22 full-rate contributions, which is less than the statutory minimum requirement of 260 full-rate paid contributions.  Their application was disallowed and they were notified accordingly in writing on 11 November 2019.  A copy of their social insurance record was included with the person's pension decision. If they have other periods of insurable employment or self-employment which they consider should be recorded, it is open to them to forward details to my Department and the matter will be examined.  The interim Total Contributions Approach (TCA) to pension calculation, announced in January 2018, includes provision for homecaring periods, but does not apply to people who reached pension age prior to 1 September 2012.  I hope this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_270"
      },
      "contextDate": "2019-11-27"
    },
    {
      "question": {
        "questionNumber": 284,
        "questionType": "written",
        "showAs": " 284. Deputy Pat Casey asked the Minister for Housing, Planning and Local Government the funding which will be provided to Wicklow County Council in 2020 in lieu of the loss of commercial rates from Irish Water properties; the funding provided to date in 2019; the loss of income incurred; and if he will make a statement on the matter. [49255/19] ",
        "date": "2019-11-27",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        },
        "debateSection": {
          "debateSectionId": "dbsect_264",
          "showAs": "Local Authority Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/mul@/dbsect_264.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-27/writtens/dbsect_264"
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32"
        },
        "answerText": " Minister of State at the Department of Housing, Planning and Local Government  Since 2015, all local authorities have been compensated for commercial rates foregone as a result of the decision to make Irish Water non-rateable in 2014. In consultation with the local authority sector, commercial rates are being re-introduced for Irish Water and from next year, Irish Water will pay commercial rates like other utilities and there will no longer be any general need for compensation in lieu of rates.  Based on the valuation, by the independent Commissioner for Valuation, it is expected that overall, the local government sector should collect a broadly similar amount in commercial rates to that previously provided as exchequer funded water rates compensation. However, due to the distribution of the income from Irish Water commercial rates, on the same basis as other utilities, some local authorities will receive less in commercial rates than they received in compensation, with others receiving more. Of the small number of local authorities negatively impacted, it is accepted that Wicklow County Council would be disproportionately impacted by the level of income reduction in the context of its Budget for 2020.  My Department has monitored the impact of the transition across local authorities and having carefully considered the challenges faced by Wicklow County Council, my colleague, the Minister for Housing, Planning and Local Government and I have agreed the allocation of financial support to Wicklow County Council in the amount of €300,000.  This level of support will significantly mitigate the impact in 2020. Looking further ahead, it is important that the Council continues to work to achieve savings, efficiencies and improvements in income generation and collection as this funding represents a once off special allocation that will not be repeated in subsequent years. My Department will continue to work with the Council to this end. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-27/pq_284"
      },
      "contextDate": "2019-11-27"
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_48.xml"
            }
          },
          "debateSectionId": "dbsect_48",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_48",
          "showAs": "Primary Care Centres Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_54",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 54,
        "showAs": " 54. Deputy Pat Casey asked the Minister for Health the status of the proposed new primary care centres in Arklow and Rathdrum, County Wicklow; and if he will make a statement on the matter. [48885/19] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 54, 344 and 348 together.  I am pleased to be able to inform the Deputy that the development of the Primary Care Centres in Arklow and Rathdrum is being progressed.  I know that there has been some concern around the development of Arklow Primary Care Centre given the decision by the original preferred bidder not to proceed with the project. However, I am pleased to say that an alternative developer has been identified, and a Letter of Intent to develop a centre via operational lease was issued in July 2019. I understand that a review of the existing building design and planning conditions has been undertaken and that a new planning application to amend the existing grant of planning has been submitted.  The Rathdrum Primary Care Centre is further advanced and I understand that the HSE is in contract discussions with the developer.  Unfortunately, it is not possible at this stage to provide a definitive operational date for the two centres. Nonetheless, delivering these projects is representative of this Government's support for the development of the primary care sector. There are now 128 Primary Care Centres in operation with a further 20 centres expected to open by the end of 2020.  These modern, well-equipped and accessible premises support the development of primary care services in line with the vision of Sláintecare. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_133.xml"
            }
          },
          "debateSectionId": "dbsect_133",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_133",
          "showAs": "Defence Forces Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_142",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 142,
        "showAs": " 142. Deputy Pat Casey asked the Taoiseach and Minister for Defence the engagement between his Department, local residents and Wicklow County Council regarding ongoing land management access and maintenance of the Glen of Imaal firing range; and if he will make a statement on the matter. [49108/19] ",
        "answerText": " Minister of State at the Department of Defence  The Glen of Imaal is an operational training facility for the Defence Forces.  The civilian Lands Staff employed by my Department at that location deal mainly with the herding and removal of sheep from the ranges prior to exercises and when necessary assist with mountain rescues.  Throughout the year advertisements are placed in the main national and local Wicklow newspapers which give a general warning around military firing ranges and advising that red flags indicate live firing.  I have been advised by my officials that the Department has not been approached in the recent past by Wicklow County Council or by local residents in regard to the lands there. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_215.xml"
            }
          },
          "debateSectionId": "dbsect_215",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_215",
          "showAs": "Schools Building Projects Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_230",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 230,
        "showAs": " 230. Deputy Pat Casey asked the Minister for Education and Skills the timeframe for construction of a new school building for a school (details supplied); and if he will make a statement on the matter. [49139/19] ",
        "answerText": " Minister for Education and Skills  The project to which the Deputy refers has been devolved for delivery to the local Education and Training Board (ETB).  Under this arrangement, I can confirm that the ETB has appointed a design team for the project to design the buildings, obtain the necessary statutory planning permissions, and move the project onward to construction in due course.  As the project has not yet commenced architectural planning, it is too early in the process to provide a timeline for completion of the works. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_48.xml"
            }
          },
          "debateSectionId": "dbsect_48",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_48",
          "showAs": "Primary Care Centres Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_344",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 344,
        "showAs": " 344. Deputy Pat Casey asked the Minister for Health the status of the primary care centre for Rathdrum, County Wicklow; and if he will make a statement on the matter. [49115/19] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 54, 344 and 348 together.  I am pleased to be able to inform the Deputy that the development of the Primary Care Centres in Arklow and Rathdrum is being progressed.  I know that there has been some concern around the development of Arklow Primary Care Centre given the decision by the original preferred bidder not to proceed with the project. However, I am pleased to say that an alternative developer has been identified, and a Letter of Intent to develop a centre via operational lease was issued in July 2019. I understand that a review of the existing building design and planning conditions has been undertaken and that a new planning application to amend the existing grant of planning has been submitted.  The Rathdrum Primary Care Centre is further advanced and I understand that the HSE is in contract discussions with the developer.  Unfortunately, it is not possible at this stage to provide a definitive operational date for the two centres. Nonetheless, delivering these projects is representative of this Government's support for the development of the primary care sector. There are now 128 Primary Care Centres in operation with a further 20 centres expected to open by the end of 2020.  These modern, well-equipped and accessible premises support the development of primary care services in line with the vision of Sláintecare. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_48.xml"
            }
          },
          "debateSectionId": "dbsect_48",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_48",
          "showAs": "Primary Care Centres Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_348",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 348,
        "showAs": " 348. Deputy Pat Casey asked the Minister for Health the status of the development of the Arklow primary care centre; and if he will make a statement on the matter. [49145/19] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 54, 344 and 348 together.  I am pleased to be able to inform the Deputy that the development of the Primary Care Centres in Arklow and Rathdrum is being progressed.  I know that there has been some concern around the development of Arklow Primary Care Centre given the decision by the original preferred bidder not to proceed with the project. However, I am pleased to say that an alternative developer has been identified, and a Letter of Intent to develop a centre via operational lease was issued in July 2019. I understand that a review of the existing building design and planning conditions has been undertaken and that a new planning application to amend the existing grant of planning has been submitted.  The Rathdrum Primary Care Centre is further advanced and I understand that the HSE is in contract discussions with the developer.  Unfortunately, it is not possible at this stage to provide a definitive operational date for the two centres. Nonetheless, delivering these projects is representative of this Government's support for the development of the primary care sector. There are now 128 Primary Care Centres in operation with a further 20 centres expected to open by the end of 2020.  These modern, well-equipped and accessible premises support the development of primary care services in line with the vision of Sláintecare. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_355.xml"
            }
          },
          "debateSectionId": "dbsect_355",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_355",
          "showAs": "National Broadband Plan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_402",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 402,
        "showAs": " 402. Deputy Pat Casey asked the Minister for Communications, Climate Action and Environment the costs associated with the launch of the national broadband plan in Laragh, County Wicklow, on 21 November 2019. [49143/19] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I propose to take Questions Nos. 378, 393 to 395, inclusive, and 402 together.  The National Broadband Plan (NBP) is the Government’s plan to rollout high speed broadband to the 1.1 million people living and working in the nearly 540,000 premises including almost 100,000 businesses and farms, and 695 schools, where commercial operators will not commit to deliver the service.  On the 19 November, the Government signed the contract for delivering the NBP State intervention network with National Broadband Ireland.  The contract signing and related Government press conference took place at St. Kevin’s National School in Laragh Co. Wicklow.  The event also comprised of a visit to the nearby Brockagh Resource Centre in Laragh by myself and cabinet colleagues to meet with local stakeholders who will be beneficiaries of the State intervention roll out.  Both of these locations were chosen as they are Broadband Connection Points, community based locations which will benefit from the rollout of high speed broadband in the first year of deployment.  Those invited reflected the nature of the event and included, members of the local community, Government Ministers, representatives of Wicklow County Council, ComReg Commissioners and Officials from a number of Government Departments.  Costs to be met by my Department relate to the provision of transport for staff to the venue, light refreshments for the attendees, together with logistics for the staging of the event which was facilitated by the OPW, including PA system and audio visual facilities. The relevant invoices have yet to be received, verified and paid. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_412.xml"
            }
          },
          "debateSectionId": "dbsect_412",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_412",
          "showAs": "Youth Services Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_445",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 445,
        "showAs": " 445. Deputy Pat Casey asked the Minister for Children and Youth Affairs her plans to improve funding for youth services in County Wicklow. [49111/19] ",
        "answerText": " Minister for Children and Youth Affairs  Government investment in youth services has increased since 2016 by €8.5m.  In 2019 we have invested €63.6M in current and capital funding in clubs, services and young people.  In Budget 2020, I secured an additional €1.396 million in funding.  My officials and I are considering the final distribution of this funding and final approval will issue in due course following the publication of the revised estimates volume (REV).  My Department and I are committed to ensuring that every young person in Ireland has access to the transformational power that participating in youth services can bring.  This is achieved through the provision of out-of-school supports to young people in their local communities to enable them to overcome adverse circumstances and achieve their full potential by strengthening their personal and social competencies.  The following tables detail the Department of Children and Youth Affairs funding for youth services in County Wicklow in 2019.   Targeted Youth Funding Scheme (TYFS) (Wicklow)      Service    Amount      Connect Bray Neighbourhood Youth Project    €94,330      Connect Bray Neighbourhood Project 1    €118,997      Connect Bray Neighbourhood Project 2    €101,503      Ballywaltrim Youth Project    €48,277      Little Bray Special Project    €48,277      Longstanding (Bray Youth Service)    €48,277      At Risk Youth Project    €14,215      Bray Adventure Sports Project    €24,351      Adventure Sports    €25,070      Bray Youth Service    €107,091      FAI Football in the Community Officer    €24,477      Bray Travellers Project Ltd    €2,230      Wicklow Traveller Development Group Ltd    €824      TOTAL    €657,918      Targeted Youth Funding Scheme (Wicklow and Kildare*)      Service    Amount      Football in the Community (4 new towns)    €8,262      Sports Access Program 2011    €1,813      Sports Promotion Unit    €120,080      TOTAL    €130,155      Revised Youth Funding Scheme (Wicklow)      Service    Amount      East Wicklow Y.S. Arklow (Crosscare)    €206,844.00      West Wicklow Y. P. Inst 4    €144,538.00      TOTAL    €351,382.00      One-off (2019) Capital Funding (Wicklow and Kildare*)      Service    Amount      Staff-led Capital Funding    €40,000.00      Local Youth Club Equipment Scheme    €56,386.97      TOTAL    €96,386.97     * These are figures for funds allocated to KWETB as a whole.  As the Deputy may be aware my Department is currently managing the most significant reform of youth services ever undertaken.  Part of this reform involves the restructuring of four funding schemes into one funding scheme – the Targeted Youth Funding Scheme.  The Targeted Youth Funding Scheme has been allocated €35.18 million for 2019 to provide out of school Young people aged 10 to 24 years of age who are described in the National Youth Strategy as marginalised, disadvantaged or vulnerable will be the primary target group for services available through the new scheme.  Key to the reform is the new approach to identify need and to focus funding on young people most in need of intervention.  Future development and investment in youth services will be informed by the mapping exercise completed in 2017, which mapped youth service provision across the State, as well as an Area Profiling, Needs Assessment and Service Requirement tool which was designed in collaboration with the Education and Training Board (ETB) sector and was officially launched in January 2019. This mapping and tool will assist the Department and the relevant ETBs in developing a detailed social demographic profile in terms of both population numbers and deprivation levels.  My Department is committed to working with ETBs to identify requirements in their area and facilitate decisions on service requirement by reference to evidenced need. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_413.xml"
            }
          },
          "debateSectionId": "dbsect_413",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_413",
          "showAs": "Childcare Services Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_446",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 446,
        "showAs": " 446. Deputy Pat Casey asked the Minister for Children and Youth Affairs her plans to assist in planning for provision of further childcare places in County Wicklow. [49112/19] ",
        "answerText": " Minister for Children and Youth Affairs  I am committed to improving the provision of childcare throughout the State.  I have successfully secured a 138% increase in the level of public investment in Early Learning and Care and School Aged Childcare services over the past 5 budgets. This extra investment has supported a doubling of capacity in the sector, including both Early Childhood Care and Education (ECCE) and the provision of childcare to the  0-3 age group.  One of the key priorities for my Department's capital programme is to support childcare providers to extend their existing services, or to establish new services, where need or demand exists.  My Department allocates capital funding on an annual basis.  Providers are invited to submit applications setting out their grant request.  All applications are appraised in a fair and impartial manner and on the basis of the quality of their application.  Four providers in Co. Wicklow were allocated capital grants in 2019 to enable them to extend their services.  Finally, if the Deputy is aware of any specific cases of parents having difficulty accessing childcare places, the Wicklow County Childcare Committee will be pleased to assist them. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/mul@/dbsect_414.xml"
            }
          },
          "debateSectionId": "dbsect_414",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-26/writtens/dbsect_414",
          "showAs": "Childcare Services Regulation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-26/pq_447",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 447,
        "showAs": " 447. Deputy Pat Casey asked the Minister for Children and Youth Affairs her plans to ensure quality and safety in childcare providers in County Wicklow; and if she will make a statement on the matter. [49113/19] ",
        "answerText": " Minister for Children and Youth Affairs  My Department has made significant strides over the last number of years in progressing the quality agenda both nationally and locally, to enhance quality and safety in early learning and care and school-age childcare. Measures already undertaken and which will continue over the years ahead include:  - Introducing a minimum qualification requirement in law which ensures that all staff must have at least a Level 5 qualification in early childhood care and education  - Incentivising the recruitment of graduates. 25% of those working in the sector now have degrees in early childhood education and care  - Establishing the Better Start Quality Development Service that provides mentoring and training to services all across the country.  - Providing Learner Fund Bursaries and payments for participation in Continuing Professional Development, to support the upskilling of those working in the sector.  - Funding the provision of training in areas such as the curriculum and inclusion.  - Expanding and strengthening the Tusla Early Years Inspectorate, which is the statutory regulator of the sector. The number of inspections carried out by Tusla each year is nearly double what it was 5 years ago.  - Creating a register of providers, and giving Tusla the power to deregister providers and to attach conditions to their registration.  - Introducing “education-focused inspections” for the ECCE programme that are carried out by the Department of Education and Skills Inspectorate on behalf of my Department.  - Supporting the 30 City and County Childcare Committees - including Wicklow County Childcare Committee - to assist my Department in ensuring that schemes and other initiatives we operate nationally meet local needs.  - Introducing (in 2019) the regulation of school age childcare for the first time.  - Consulting on a Draft Childminding Action Plan (published in August 2019 for the purpose of public consultation), which sets out how we propose to introduce the regulation of childminding over the years ahead and to open up a full range of supports for childminders, including supports for quality and safety.  In addition, First 5, our Whole-of-Government Strategy for Babies, Young Children and their Families, which I published last year, sets out a wide range of further measures that I - working in collaboration with my colleagues in Government - intend to take. These include, for example, the Workforce Development Plan, work on which began earlier this year and which will set out a detailed plan of actions to achieve a graduate-led workforce in early learning and care settings by 2028. In relation to school-age childcare, following the initial Regulations introduced earlier this year, a public consultation took place in summer 2019 which will inform the development over the period ahead of comprehensive Regulations and a quality improvement framework for school-age childcare settings.  Following the recent broadcast of the RTÉ investigation, Behind Closed Doors, I wrote to the Chair of Tusla to ask what additional powers the Tusla Early Years Inspectorate might need. Following Tusla’s reply, my Department is now examining legislative options, which may include mechanisms to inform parents of inspection findings at an earlier stage, to require services to display prominently their inspection status, and to alert parents in relation to the operation of unregistered services.  Additional powers for Tusla must form part of a multi-faceted approach that also includes: additional training for those working in the sector, with a renewed focus on the child protection training that is already under way; strengthened advisory supports before and after inspections; supporting the Garda Vetting process for the sector; and additional information for parents. In short, we need to keep strengthening the quality agenda we have been successfully pursuing over recent years. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-26",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-06",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-06/writtens/mul@/dbsect_135.xml"
            }
          },
          "debateSectionId": "dbsect_135",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-06/writtens/dbsect_135",
          "showAs": "Hospital Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-06/pq_134",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 134,
        "showAs": " 134. Deputy Pat Casey asked the Minister for Health the status of his plans to upgrade and refurbish St. Colman's Hospital, Rathdrum in view of the need to do so as stated by recent HIQA reports; and if he will make a statement on the matter. [45646/19] ",
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-06",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-05/writtens/mul@/dbsect_310.xml"
            }
          },
          "debateSectionId": "dbsect_310",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-05/writtens/dbsect_310",
          "showAs": "Direct Provision System"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-05/pq_332",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 332,
        "showAs": " 332. Deputy Pat Casey asked the Minister for Justice and Equality if a social support worker has been assigned to the temporary direct provision centre (details supplied); and if he will make a statement on the matter. [44907/19] ",
        "answerText": " Minister of State at the Department of Justice and Equality  As the Deputy will appreciate, my Department, has a legal duty to protect the identities of persons in the international protection process and must be mindful of the right to privacy of applicants when responding to any specific queries.  As of 27 October 2019, there were 139 people residing in emergency accommodation in Co. Wicklow. This includes family units and single people seeking international protection.  As our existing 38 accommodation centres are currently operating at full capacity, my Department sought expressions of interest seeking bed and board in hotels and guesthouses on a 12-26 week basis for emergency temporary accommodation for international protection applications. Premises in County Wicklow were sourced on that basis. Our aim is to ensure that residents in emergency accommodation are re-accommodated in a dedicated accommodation centre as quickly as possible.  The International Protection Accommodation Services (IPAS - formerly known as RIA) of my Department liaises with the relevant partner agencies such as the HSE, Tusla, the Department of Education and Skills and the Department of Employment Affairs and Social Protection regarding the local roll-out of required services to residents in all emergency accommodation locations. The HSE and Tusla, where applicable, continue to engage with any issues raised relating to health care provision such as access to GPs and access to social workers. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-05",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-11-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-05/writtens/mul@/dbsect_800.xml"
            }
          },
          "debateSectionId": "dbsect_800",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-05/writtens/dbsect_800",
          "showAs": "Greenways Development"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-05/pq_913",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 913,
        "showAs": " 913. Deputy Pat Casey asked the Minister for Transport, Tourism and Sport when the 2020 greenway application process will be announced; the details of changes to the process; and if he will make a statement on the matter. [44528/19] ",
        "answerText": " Minister for Transport, Tourism and Sport  Earlier this year I allocated €40m in 2019 to ten greenways projects across the country. These allocations, combined with existing projects such as the Dublin to Galway project, account for the bulk of the funding over the years 2019 to 2021 and I have no plans at this stage for a funding round for the construction of new greenways in 2020. At the appropriate stage I will consider advertising a new round of the funding for the years beyond that period.  Separately, in Budget 2020 my Department was allocated an additional €4.5m for greenways from the Carbon Tax fund. While this is not sufficient to warrant a round of funding for the construction of new greenways I have asked my officials to consider options in regard to the best use of this funding. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-05",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-22/writtens/mul@/dbsect_569.xml"
            }
          },
          "debateSectionId": "dbsect_569",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-22/writtens/dbsect_569",
          "showAs": "Land Development Agency"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-22/pq_651",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 651,
        "showAs": " 651. Deputy Pat Casey asked the Minister for Housing, Planning and Local Government the contact his Department has had with EUROSTAT on the classification of the Land Development Agency as being on balance sheet; and if he will make a statement on the matter. [43549/19] ",
        "answerText": " Minister for Housing, Planning and Local Government  My Department was invited by the Central Statistics Office (CSO) to meet with, and brief,  EUROSTAT in relation to the Land Development Agency (LDA) as part of a routine EUROSTAT European Deficit Procedure (EDP) Dialogue visit to EU member states on 26 February 2019.  In relation to the classification of the LDA, it is understood that the CSO will not take a definitive view on this matter, until it can undertake a full analysis of the business plan and financial model of the LDA in the context of the primary legislation establishing the LDA as a commercial body.  Pending this review, the LDA has been classified by the CSO as a body within Government and I further understand that EUROSTAT concurred with this interim approach. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-22",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-17/writtens/mul@/dbsect_177.xml"
            }
          },
          "debateSectionId": "dbsect_177",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-17/writtens/dbsect_177",
          "showAs": "Schools Building Projects Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-17/pq_129",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 129,
        "showAs": " 129. Deputy Pat Casey asked the Minister for Education and Skills the status of each secondary school in County Wicklow involved in the school building programme; the length of time they have been in their current development stage; the average times for all development stages to complete; the estimated time for projects to progress to completion in tabular form; and if he will make a statement on the matter. [42816/19] ",
        "answerText": " Minister for Education and Skills  The current status of projects being delivered is listed on a county by county basis on my Department’s website at www.education.ie and updated on a monthly basis to reflect their progress through the various stages of capital appraisal, site acquisition, design, tender and construction.  It is not possible to give an average timeline for all development stages as this varies from project to project depending on the size and complexity. It also depends on interactions with planning authorities and other factors. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-17",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-16/writtens/mul@/dbsect_150.xml"
            }
          },
          "debateSectionId": "dbsect_150",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-16/writtens/dbsect_150",
          "showAs": "Hospital Consultant Recruitment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-16/pq_159",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 159,
        "showAs": " 159. Deputy Pat Casey asked the Minister for Health the timeline of events in the process carried out to date in the appointment of a full-time consultant medical oncologist with a special interest in sarcoma based at St. Vincent’s University Hospital, created by him in July 2016; if interviews were held in March 2017 (details supplied); and if he will make a statement on the matter. [42396/19] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 155 and 159 together.  The Consultant Medical Oncologist with a special interest in sarcoma was due to commence on 1st September 2019. On 17th September she advised Human Resources in St Vincent’s University Hospital that she would not be taking up the post due to personal reasons.  St Vincent’s University Hospital informed the Department of this on 25 September. As a voluntary hospital, St Vincent's operates its own recruitment policy. The post was subsequently re-advertised on Sunday 6th October 2019, with a closing date of Sunday 3rd November 2019. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-16",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-10/writtens/mul@/dbsect_158.xml"
            }
          },
          "debateSectionId": "dbsect_158",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-10/writtens/dbsect_158",
          "showAs": "Garda Operations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-10/pq_143",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 143,
        "showAs": " 143. Deputy Pat Casey asked the Minister for Justice and Equality the status of the Garda national protective service and its roll out and operations in Wicklow Garda Division; and if he will make a statement on the matter. [41472/19] ",
        "answerText": " Minister for Justice and Equality (Deputy Charles Flanagan)  As the Deputy will appreciate, the management and efficient use of Garda resources is the responsibility of the Garda Commissioner. This includes responsibility for deployment of personnel. As Minister, I have no direct role in these matters. I understand, however, that Garda management keeps the distribution of resources under continual review in the context of crime trends and policing priorities, to ensure their optimum use.  I have been informed by the Commissioner that to date, Divisional Protective Services Units have been established in DMR South Central, Waterford, Kerry, Kilkenny, Carlow, Limerick and Galway Garda Divisions. These are in addition to the units previously established in DMR West, Cork City and Louth Divisions in the initial phase of this initiative.  As the Deputy will be aware, I recently welcomed the Garda Commissioner's adoption of a new Garda Operating Model which will see the number of Garda Divisions reduce from 28 to 19. This functional model has long been recommended by independent policing specialists, including the Garda Síochána Inspectorate and in the Report of the Commission on the Future of Policing in Ireland (CoFPI). Rollout of this model meets a key commitment in A Policing Service for the Future , the four year implementation plan giving effect to the recommendations of the Commission on the Future of Policing in Ireland.  The Commissioner's plan allows for Divisions of sufficient scale to be self-sufficient in the delivery of services, which will included greater availability of expertise in addressing domestic and sexual violence in each area.  I am informed by Garda management that it is expected that Divisional Protective Services Units should be rolled-out to the remaining Garda Divisions on a phased basis by the end of 2019.  This expected timetable is in accordance with the target set out in 'A Policing Service for the Future'. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-10",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-09/writtens/mul@/dbsect_106.xml"
            }
          },
          "debateSectionId": "dbsect_106",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-09/writtens/dbsect_106",
          "showAs": "Home Care Packages Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-09/pq_99",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 99,
        "showAs": " 99. Deputy Pat Casey asked the Minister for Health the number of persons up to 30 September 2019 waiting for homecare support by county in tabular form; the number of applications for homecare support up to 30 September by CHO areas 6 and 7; and if he will make a statement on the matter. [41295/19] ",
        "answerText": " Minister of State at the Department of Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-09",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_65.xml"
            }
          },
          "debateSectionId": "dbsect_65",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_65",
          "showAs": "VAT Rate Reductions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_47",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 47,
        "showAs": " 47. Deputy Pat Casey asked the Minister for Finance his views on the restoration of the VAT rate to 9% to improve competitiveness in view of the fact this is the highest rate of VAT on tourist accommodation in the EU; the Brexit effects on British visitors; and if he will make a statement on the matter. [40910/19] ",
        "answerText": " Minister for Finance  As the Deputy will be aware, it is a longstanding practice of the Minister for Finance not to comment, in advance of the Budget, on any tax matters that might be the subject of Budget decisions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_66.xml"
            }
          },
          "debateSectionId": "dbsect_66",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_66",
          "showAs": "Insurance Costs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_48",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 48,
        "showAs": " 48. Deputy Pat Casey asked the Minister for Finance the rank of Ireland in the EU in terms of the level of motor insurance and business insurance costs; and if he will make a statement on the matter. [40914/19] ",
        "answerText": " Minister for Finance  At the outset, it is important to note that as Minister for Finance, I am responsible for the development of the legal framework governing financial regulation and my Department does not collect the type of information being sought by the Deputy. Indeed, there is no official centralised source of such data within the European Union that provides for rankings in relation to insurance costs between countries. Therefore, I am unable to provide the Deputy with Ireland’s ranking on the two issues raised.  The Deputy should note that it would be very difficult to collect and compare such information as the level of motor and business insurance costs will be determined by a range of different factors. For example, in drawing any comparison between average insurance premiums across EU member states, it should be borne in mind that variation in premiums will reflect factors such as the economic and regulatory environment in each country, the legal system, health and safety standards etc. An example of one of these differences is that settlement awards for minor and moderate injuries are significantly higher in Ireland than in the UK, as was determined by the Personal Injuries Commission.  This is why the work of the Cost of Insurance Working Group (CIWG) is so important. The CIWG, which was established in July 2016, and which produced two reports, is continuing to work to implement the recommendations of the Cost of Motor Insurance Report and the Cost of Employer and Public Liability Insurance Report. Its most recent Progress Update, the Ninth, was published in July 2019 and shows that the vast majority of recommendations and actions due by Q2 2019 have been completed. Going forward, there are some further measures that will be carried out by Government over the next few months. These include the following:  - Commencement of the remaining parts of the Judicial Council Act 2019 , which provides for the establishment of a Personal Injuries Guidelines Committee. It is now matter for the Judiciary to put in place the Judicial Council and to operationalise the Personal Injuries Guidelines Committee, which will introduce new guidelines to replace the Book of Quantum; this is an essential step if award levels are to be reduced.  - The completion of the Central Bank’s feasibility study into adding Employer and Public Liability insurance to the National Claims Information Database (NCID). In addition, the first report of the NCID, on motor insurance, is due by the end of the year;  - The completion of the CSO’s feasibility study into tracking the cost of business insurance, as it does with other forms of insurance including motor. The CSO is due to report back to my Department by the end of the year;  - The Law Reform Commission’s work to undertake a detailed analysis of the possibility of developing constitutionally sound legislation to delimit or cap the amounts of damages which a court may award in respect of some or all categories of personal injuries. It is expected that there will be a public consultation on this by the end of the year; and,  - The furtherance of measures necessary to implement Pre-Action Protocols (PAPs) for personal injury cases, beginning with medical negligence cases.  In addition, my colleague, Minister of State D’Arcy, has been engaging with insurers in order to seek a commitment that they will reduce premiums and widen their risk appetite should there be a recalibration of award levels downwards once the new personal injury guidelines are introduced.  I believe that these reforms are having a significant impact with regard to private motor insurance (CSO figures from August 2019 show that the price of motor insurance is now 24% lower than the July 2016 peak). The Government is determined to keep working to ensure that these positive pricing trends continue and can be extended to other forms of insurance. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_170.xml"
            }
          },
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_170",
          "showAs": "Direct Provision System"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_156",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 156,
        "showAs": " 156. Deputy Pat Casey asked the Minister for Justice and Equality his plans to address the number of persons living in direct provision centres nationally; his further plans to cease using hotels as emergency centres; the procedures for residents of these centres to make complaints against operators; and if he will make a statement on the matter. [40908/19] ",
        "answerText": " Minister of State at the Department of Justice and Equality  My Department is responsible for offering accommodation and related services to international protection applicants while their claim for protection is being examined. These services are demand led and generally it is difficult to predict demand far in advance.  I am advised that as of 29th September 2019, 7,462 persons were being provided with accommodation by the International Protection Accommodation Services (IPAS, formerly the Reception and Integration Agency) of my Department.  Currently, there are 6,063 persons residing in the 38 accommodation centres located nationwide across 18 counties. As these centres are at full capacity, there are also a further 1,399 applicants residing in 34 emergency accommodation locations in hotels and guest houses.  Every effort is being made to re-accommodate applicants in emergency locations to a dedicated accommodation centre as quickly as possible. My Department is actively working on securing additional capacity, both in its existing centres and through sourcing new accommodation centres.  IPAS has sought expressions of interest from parties who would be interested in providing accommodation and related services to people in the international protection process and has also launched a nationwide, regional tendering process to source new accommodation centres.  In relation to the query about complaints, IPAS has a complaints procedure which is set out in the House Rules & Procedures Booklet for International Protection Applicants. Complaints are made initially to the Centre Manager with a view to informal resolution. If the person concerned is not satisfied with the outcome of their complaint, he or she may make a complaint to the International Protection Accommodation Service who will investigate the matter and take action as appropriate.  In the event that a resident is not satisfied with how his or her complaint is dealt with, he or she has full access to the services of the Ombudsman and Ombudsman for Children. The office of the Ombudsman received 148 complaints about Direct Provision in 2018, 15 of which were upheld.  Separately, certain decisions by IPAS made in line with the European Communities (Reception Conditions) Regulations 2018, relating to material reception conditions and listed in full in Regulation 20, allow for review by a Review Officer, a designated role in IPAS. This review may be further appealed to the International Protection Appeals Tribunal (IPAT). ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_174.xml"
            }
          },
          "debateSectionId": "dbsect_174",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_174",
          "showAs": "Community Alert Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_160",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 160,
        "showAs": " 160. Deputy Pat Casey asked the Minister for Justice and Equality his plans to improve and expand the existing community text alert scheme; and if he will make a statement on the matter. [40985/19] ",
        "answerText": " Minister for Justice and Equality  As the Deputy will be aware, the Programme for Government includes a commitment to support and prioritise community crime prevention, including Text Alert.  Community partnership has been particularly evident in the success of the Garda Text Alert scheme. Since it was launched in September 2013 it has grown quickly with a total of 164,000 subscribers and in the order of 3 million text messages sent annually. Every Garda Division, rural and urban, now offers the text alert service and An Garda Síochána has published guidelines to assist in the establishment and operation of local groups.  For many years, my Department has supported community crime prevention by providing funding for the Community Alert programme, which is operated by Muintir na Tíre in partnership with the Garda authorities. My Department provides funding in relation to the employment and associated costs of the national service, including three of the five regional Development Officers. The long-standing view has been that this is the best use of the resources available to my Department to support effective community crime prevention actions.   At the Ploughing Championships in September 2018, I announced that the Text Alert Rebate Scheme would be available to over 1,000 local groups registered under the Garda Text Alert Scheme. Under that Scheme, my Department made in the region of €150,000 available to local communities who wanted to apply for a rebate towards the costs associated with running their local Text Alert Scheme. Ultimately, payments made as part of the 2018 Scheme amounted to €112,500 which was allocated to 394 groups.  I can advise the Deputy that it is my intention to make a further announcement about the Text Alert Rebate Scheme for 2019 in the near future. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_194.xml"
            }
          },
          "debateSectionId": "dbsect_194",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_194",
          "showAs": "Brexit Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_180",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 180,
        "showAs": " 180. Deputy Pat Casey asked the Minister for Business, Enterprise and Innovation the number of businesses by county that have applied for working capital under the Brexit loan scheme; the number of such businesses that have been sanctioned financing to date; and the total value. [40986/19] ",
        "answerText": " Minister for Business, Enterprise and Innovation  While the nature of the UK's departure from the EU still remains to be determined, Brexit continues to represent a significant challenge for businesses in Ireland, one which cannot be underestimated. That is why my Department and its agencies have put in place extensive supports, schemes and advisory resources to ensure that to ensure that businesses around the country are prepared for Brexit. These measures aim to assist businesses in identifying and managing key risk areas and develop practical preparatory actions regardless of the circumstances of the UK’s withdrawal from the EU.  The Brexit Loan Scheme was launched in March of 2018. The Scheme, using a combination of Irish Exchequer and EU guarantees from the European Investment Bank, leveraged up to €300 million of lending at a maximum interest rate 4% at a cost to the Exchequer of €23 million - €14 million provided by my Department and €9 million provided by Department of Agriculture, Food and the Marine.  The Brexit Loan Scheme provides relatively short-term working capital, 1 to 3 years, to eligible businesses with up to 499 employees to help them to innovate, change or adapt to mitigate their Brexit challenges. Businesses can confirm their eligibility with the Strategic Banking Corporation of Ireland (SBCI) and, if deemed eligible, can apply to one of the participating finance providers for a loan under the scheme.  The scheme features a two-stage application process. First, businesses must apply to the Strategic Banking Corporation of Ireland (SBCI) to confirm their eligibility for the scheme. Businesses can use guidelines provided on the SBCI website to determine if they are eligible, and if so, to complete the eligibility form. As part of the process, businesses must submit a business plan, demonstrating the means by which they intend to innovate, change or adapt to meet their Brexit challenges. The SBCI assesses the applications and successful applicants receive an eligibility reference number.  Successful applicants can then apply for a loan under the scheme with one of the participating finance providers using their eligibility reference number. Participating finance providers are the Bank of Ireland, Ulster Bank and Allied Irish Bank. Approval of loans is subject to the finance providers' own credit policies and procedures.  As at 04 October, there have been 828 applications for eligibility under the scheme, of which 751 have been approved to date by SBCI. 198 of those applications have progressed to sanction at bank value, to a total value of €44 million. It should be noted that 153 of total applications received relate to repeat/duplicate applications.  The following table details the number of businesses by county that have applied for working capital under the Brexit loan scheme to 27 September 2019.     Counties    Breakdown of Businesses by county that have applied Brexit loan scheme to 27 September 2019      Carlow    17      Cavan    19      Clare    13      Cork    76      Donegal    44      Dublin    286      Galway    37      Kerry    21      Kildare    31      Kilkenny    6      Laois    10      Leitrim    3      Limerick    20      Longford    0      Louth    36      Mayo    12      Meath    37      Monaghan    28      Offaly    8      Roscommon    14      Sligo    12      Tipperary    20      Waterford    10      WestMeath    14      Wexford    17      Wicklow    37      Total    828    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_195.xml"
            }
          },
          "debateSectionId": "dbsect_195",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_195",
          "showAs": "Brexit Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_181",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 181,
        "showAs": " 181. Deputy Pat Casey asked the Minister for Business, Enterprise and Innovation the number of food businesses by county that have applied for working capital under the Brexit loan scheme which opened in March 2018 up until the end of the third quarter of 2019; the number of such businesses that have been sanctioned financing to date; and the value of same. [41038/19] ",
        "answerText": " Minister for Business, Enterprise and Innovation  While the nature of the UK's departure from the EU still remains to be determined, Brexit continues to represent a significant challenge for businesses in Ireland, one which cannot be underestimated. That is why my Department and its agencies have put in place extensive supports, schemes and advisory resources to ensure that to ensure that businesses around the country are prepared for Brexit. These measures aim to assist businesses in identifying and managing key risk areas and develop practical preparatory actions regardless of the circumstances of the UK’s withdrawal from the EU.  The Brexit Loan Scheme was launched in March of 2018. The Scheme, using a combination of Irish Exchequer and EU guarantees, leveraged up to €300 million of lending at a maximum interest rate of 4% at a cost to the Exchequer of €23 million - €14 million provided by my Department and €9 million provided by Department of Agriculture, Food and the Marine.  The Brexit Loan Scheme provides relatively short-term working capital, 1 to 3 years, to eligible businesses with up to 499 employees to help them to innovate, change or adapt to mitigate their Brexit challenges. Businesses can confirm their eligibility with the Strategic Banking Corporation of Ireland (SBCI) and, if deemed eligible, can apply to one of the participating finance providers for a loan under the scheme.  The scheme features a two-stage application process. First, businesses must apply to the Strategic Banking Corporation of Ireland (SBCI) to confirm their eligibility for the scheme. Businesses can use guidelines provided on the SBCI website to determine if they are eligible, and if so, to complete the eligibility form. As part of the process, businesses must submit a business plan, demonstrating the means by which they intend to innovate, change or adapt to meet their Brexit challenges. The SBCI assesses the applications and successful applicants receive an eligibility reference number.  Successful applicants can then apply for a loan under the scheme with one of the participating finance providers using their eligibility reference number. Participating finance providers are the Bank of Ireland, Ulster Bank and Allied Irish Bank. Approval of loans is subject to the finance providers' own credit policies and procedures.  As at 04 October, there have been 154 applications by food businesses under the scheme, of which 130 have been approved by SBCI. 36 food business applications have progressed to sanction at bank value, to a total value of €9.3 million.  The following table details the number of food businesses by county that have applied for working capital under the Brexit loan scheme to 27 September 2019.  Brexit Loan Scheme: Breakdown of Food businesses by county that have applied Brexit loan scheme to 27 September 2019     Carlow    3      Cavan    5      Clare    4      Cork    23      Donegal    7      Dublin    28      Galway    6      Kerry    1      Kildare    3      Kilkenny    4      Laois    1      Leitrim    0      Limerick    1      Longford    0      Louth    5      Mayo    2      Meath    13      Monaghan    14      Offaly    6      Roscommon    2      Sligo    3      Tipperary    7      Waterford    1      WestMeath    3      Wexford    5      Wicklow    7      Total    154    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_283.xml"
            }
          },
          "debateSectionId": "dbsect_283",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_283",
          "showAs": "Newborn Screening Cards"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_273",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 273,
        "showAs": " 273. Deputy Pat Casey asked the Minister for Health the progress being made in introducing a thorough newborn screening programme to provide lifesaving essential early diagnoses of conditions such as MLD; and if he will make a statement on the matter. [40856/19] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 273 and 289 together.  Currently all newborn babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’) through their parents/guardians for eight very rare conditions that are treatable if detected early in life.  A National Screening Committee is being established and will hold its first meeting before the end of 2019, as per recommendation 5, contained within the Scally Review (2018). The Committee’s role will be to undertake an independent assessment of the evidence for screening for a particular condition against internationally accepted criteria and make recommendations accordingly.  I appointed Professor Niall O’Higgins as Chair of the Committee in July and asked that, as part of its initial body of work, the Committee prioritise a review of the national newborn blood-spot screening programme and look specifically at how Ireland should best proceed with an expansion in line with international best practice.  My officials have commenced some preparatory work, ahead of the Committee becoming operational later this year and will visit counterparts in Italy, at the end of October, to learn more about the work that they have undertaken that led to the recent expansion of the Italian neonatal screening programme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_297.xml"
            }
          },
          "debateSectionId": "dbsect_297",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_297",
          "showAs": "Home Help Service Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_290",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 290,
        "showAs": " 290. Deputy Pat Casey asked the Minister for Health the number of persons in County Wicklow on waiting lists for home support hours. [40988/19] ",
        "answerText": " Minister of State at the Department of Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_362.xml"
            }
          },
          "debateSectionId": "dbsect_362",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_362",
          "showAs": "Common Agricultural Policy Negotiations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_359",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 359,
        "showAs": " 359. Deputy Pat Casey asked the Minister for Agriculture, Food and the Marine the most recent proposals put forward at the EU Agriculture Council on the need to ensure there is no reduction in funding for CAP post 2020; and if he will make a statement on the matter. [40915/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The European Commission has proposed, as part of the Multiannual Financial Framework (MFF) 2021-2027, that funding for the Common Agricultural Policy should be set at €365 billion. This equates to a cut of approximately 5% to the CAP budget in the next MFF period 2021 - 2027. I have previously stated that the proposed cut is unacceptable for Ireland.  Negotiations on the MFF proposals have commenced and are running in parallel to the CAP post-2020 negotiations. The MFF is a critical matter for all Member States and its agreement requires unanimity at the EU Council. It is clear that there are divergent views among Member States on the appropriate level for the budget. While some Member States (including Ireland) have indicated their willingness to increase their contributions once they contribute towards areas of added European value, there are others who feel equally strongly that the current proposals, such as they are, are too costly.  Brexit further compounds the budgetary issue, with some €12 billion per annum in UK net contributions being removed from the budget post-2020.  I continue to work at building consensus among my agriculture colleagues in Europe with regard to maintaining the CAP budget. In May last year, I co-signed a Joint Memorandum in Madrid, which calls for the CAP budget to be retained at current levels for the EU 27 post-2020. The memorandum has been supported by up to 20 other EU Agriculture Ministers. We will continue to work together on this issue as the negotiations for the CAP post-2020 and its budgetary allocations progress.  At the Council of Agriculture Ministers, I have consistently called for an adequate CAP budget to meet the increasing demands being placed on farmers in the context of the post-2020 CAP proposals, for example, in achieving greater climate ambition. Indeed, I made this point most recently at the last Informal Council meeting in Helsinki on 24 September 2019.  Ireland will continue to work closely with its EU colleagues to build a consensus around the need to fight for a strong CAP budget as the negotiations progress. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_383.xml"
            }
          },
          "debateSectionId": "dbsect_383",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_383",
          "showAs": "Mobile Telephony Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_387",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 387,
        "showAs": " 387. Deputy Pat Casey asked the Minister for Communications, Climate Action and Environment his plans to quell health concerns regarding 5G roll out; the actions he will take to ensure that information is provided on the health impact of 5G roll out here; and if he will make a statement on the matter. [40933/19] ",
        "answerText": " Minister for Communications, Climate Action and Environment  5G is the next generation of mobile communications and has the potential to deliver hugely enhanced connectivity. Ireland welcomes the benefits that the enhanced connectivity and technology will bring. It is expected that 5G will be commercialised over the next few years. Rollout in Ireland is primarily a matter for private mobile network operators, operating on a commercial basis.  As Minister for Communications, Climate Action and Environment, I have policy responsibility for matters pertaining to public exposure to non-ionising radiation. This is an area that is kept under review and earlier this year I assigned a new statutory function to the Environmental Protection Agency to provide general information to the public on matters pertaining to public exposure to non-ionising radiation, to monitor international scientific developments and provide independent advice to my Department in this area. Information is published on the EPA’s website at www.epa.ie/radiation/emf.  Ireland's policy in this area is informed by a substantial volume of internationally recognised scientific research and evidence. This includes the guidelines set down by the International Commission on Non-Ionizing Radiation Protection, the ICNIRP.  These guidelines provide scientifically-based exposure limits that are applicable to both public and occupational exposure from electromagnetic fields (EMF), including 5G. ICNIRP guidelines apply up to a frequency of 300 gigahertz (GHz), well above the maximum frequencies being considered for 5G. ComReg, the independent telecoms regulatory authority, ensures that licensed mobile operators comply with their licence conditions and do not exceed ICNIRP guidelines.  In 2015, the Irish Government commissioned a report by the National Institute for Public Health and the Environment of the Netherlands (RIVM). This was published in 2016 and is entitled “Electromagnetic Fields in the Irish Context”. It examined and synthesised existing peer-reviewed research into clear findings, with particular focus on the potential health effects of electric and magnetic fields arising from high voltage power lines, and electromagnetic fields from base stations for mobile communication. This report reaffirms the overall conclusion of an earlier 2007 report, “Health Effects of Electromagnetic Fields”, that there is insufficient evidence to establish a causal relationship between exposure to low-frequency electromagnetic fields and adverse health effects. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_382.xml"
            }
          },
          "debateSectionId": "dbsect_382",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_382",
          "showAs": "Energy Resources"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_391",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 391,
        "showAs": " 391. Deputy Pat Casey asked the Minister for Communications, Climate Action and Environment if he is planning to confirm plans with the European Commission this week to build gas import terminals here as a project of common interest that would allow the importing of fracked gas from the United States of America. [41035/19] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I propose to take Questions Nos. 386 and 391 together.  The Shannon LNG project is a private commercial project and any decisions on the future development of this project are matters for the project promoter. The project has been designated a “Project of Common Interest” on the previous three lists of Projects of Common Interest (i.e. it has been a \"Project of Common Interest\" since 2013).  EU Regulation 347/2013, which provides for the designation of a project of common interest, does not override the requirement to comply with environmental law or to obtain the necessary permits or consents. Final investment decisions for the Shannon LNG project and compliance with any legal and regulatory requirements in relation to consents or permits, including environmental assessment, are the responsibility of the project promoter. Decisions on consents for the construction of an LNG plant would be a matter for the relevant consenting authorities.  At the decision making body meeting in Brussels on 4 October 2019 Ireland maintained its position on the inclusion of the Shannon LNG Project on the 4th PCI list as it enhances our energy security by increasing import route diversity. While supporting the project, Ireland also asked the Commission whether the implications of importing LNG to the European Union, from conventional and unconventional fracked sources, have been examined in terms of a sustainable, secure and competitive European energy policy. We further stated that if this work has not been carried out, we believe that it should be undertaken at EU level.  I will only consider supporting any future applications for EU Connecting Europe Facility (CEF) funding for LNG projects after a security of supply review has been completed and considered by the Government and by the Dáil, and only if these projects are consistent with national and EU climate policy objectives.  The production, sourcing, buying and selling of natural gas produced outside this jurisdiction would also be an operational matter for the undertakings involved. Any undertaking would be required to comply with EU law in this area.  In relation to fracked gas in Ireland, the Petroleum and Other Minerals Development (Prohibition of Onshore Hydraulic Fracturing) Act 2017 provides for the prohibition of exploration for and extraction of onshore petroleum by means of hydraulic fracturing. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_404.xml"
            }
          },
          "debateSectionId": "dbsect_404",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_404",
          "showAs": "Public Transport Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_408",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 408,
        "showAs": " 408. Deputy Pat Casey asked the Minister for Transport, Tourism and Sport if his attention has been drawn to the concerns of residents of Blessington, County Wicklow, that BusConnects by itself will not provide adequate public transport capacity for the area; his plans to improve public transport in the area; and if he will make a statement on the matter. [40936/19] ",
        "answerText": " Minister for Transport, Tourism and Sport  As Minister for Transport, Tourism and Sport I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area, including Co. Wicklow.  In light of the NTA's responsibilities on this matter, I have referred the Deputy's question to the company for a more detailed reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_464.xml"
            }
          },
          "debateSectionId": "dbsect_464",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_464",
          "showAs": "Community Employment Schemes Supervisors"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_478",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 478,
        "showAs": " 478. Deputy Pat Casey asked the Minister for Employment Affairs and Social Protection the position regarding the provision of a pension scheme for community employment scheme supervisors; when the issue will be resolved; and if she will make a statement on the matter. [40940/19] ",
        "answerText": " Minister for Employment Affairs and Social Protection  I am currently engaging with representatives of Community Employment supervisors and assistant supervisors to discuss issues arising following the 2008 Labour Court Recommendation. All parties to the engagement process have agreed that the detail of the discussions should remain confidential while the engagement is ongoing and I would ask Deputies to respect these wishes and allow the talks to continue free from speculation which might prove unhelpful. I expect that it will take a number of weeks to reach a conclusion.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_466.xml"
            }
          },
          "debateSectionId": "dbsect_466",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_466",
          "showAs": "Community Employment Schemes Review"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_480",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 480,
        "showAs": " 480. Deputy Pat Casey asked the Minister for Employment Affairs and Social Protection the status of the interdepartmental review of community employment schemes; when the review is expected to be published; and if she will make a statement on the matter. [40945/19] ",
        "answerText": " Minister for Employment Affairs and Social Protection  As the Deputy will be aware, the Government agreed to establish an Interdepartmental Group (IDG) to explore how social inclusion schemes might be organised going forward.  A number of meetings of the IDG have taken place and a number of bilateral meetings with relevant Departments have also been undertaken. There was a consultative process with stakeholders and the associated submissions were considered as part of the wider deliberations. I expect to have the final report shortly.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_496.xml"
            }
          },
          "debateSectionId": "dbsect_496",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_496",
          "showAs": "Fire Stations Upgrade"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_513",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 513,
        "showAs": " 513. Deputy Pat Casey asked the Minister for Housing, Planning and Local Government the details of the fire station capital plan and the need to upgrade many fire stations such as Baltinglass; and if he will make a statement on the matter. [40907/19] ",
        "answerText": " Minister of State at the Department of Housing, Planning and Local Government  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Service Act, 1981. My Department supports fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding support for equipment and priority infrastructural projects.  In February 2016, my Department announced a five-year Fire Services Capital Programme with an allocation of €40 million, based on an annual €8 million allocation, to be used for the purchase of fire appliances and specialist equipment, building or upgrading of prioritised Fire Stations, an upgrade of the Communications and Mobilisation system and improvements to Training Centres. The five-year programme proposed the construction/refurbishment of twenty six fire stations. This included sixteen new builds and ten upgrade/refurbishment projects. Details of the programme are available on my Department's website at the following link:   https://www.housing.gov.ie/local-government/fire-and-emergency-management/funding/minister-kelly-announces-new-40-million-euro.   In relation to Wicklow County Council's Fire Service, Balltinglass and Dunlavin Fire Stations were included in a further list of stations which would be considered in annual reviews during the five-year Programme. My Department is awaiting updated cost plans from the Council for the upgrading work to be undertaken at both of these Fire Stations. My Department will consider the proposals upon receipt and will continue working with the Council to progress these projects. In order to maximise the available Capital Programme funding, my Department re-assesses the status of projects in the capital programme on an annual basis, and some flexibility is normally available to advance projects that are ready and that offer best value-for-money taking account of the state of readiness of projects more generally. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_498.xml"
            }
          },
          "debateSectionId": "dbsect_498",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_498",
          "showAs": "Water Supply"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_515",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 515,
        "showAs": " 515. Deputy Pat Casey asked the Minister for Housing, Planning and Local Government if there are grants for water well drilling for domestic houses. [40946/19] ",
        "answerText": " Minister for Housing, Planning and Local Government  There is a grant currently available, which is funded by my Department through the local authorities, for the provision or necessary improvement of an individual water supply in a house. This is more commonly called the individual or private wells grant. The grant, subject to certain conditions, assists households dependent on these supplies with the costs incurred in providing such a supply of water for domestic purposes or rectifying serious deficiencies with an existing supply.  Information on this grant is available from local authorities and from my Department's website at the following link:  www.housing.gov.ie/water/water-services/rural-water-programme/private-wells.  Earlier this year I announced details of the new Multi-annual Rural Water Programme 2019-2021. This included an improved funding scheme for individual wells.  The composition of the new multi-annual programme is based on recommendations from the Working Group that I established in April 2018 to conduct a review of investment needs and rural water services. The changes that I have approved to the individual wells grant scheme are, as follows:  - A maximum grant for rehabilitation works of €3,000, which represents an increase of 47% on the current maximum grant amount;  - Where the local authority agrees that the most appropriate solution is to provide a new well, the maximum grant payable would be €5,000;  - Recognising the role of the grant in improving quality, the water quality treatment element (typically filtration and UV filtration) will qualify for 100% funding up to a maximum of €1,000;  - Up to 85% of other costs would be met, subject to the total combined maximum costs of €3,000 for well rehabilitation or €5,000 for a new well;  - For clarity, applicants would not be able to avail of both grant amounts, so they would not be able to avail of €3,000 for well rehabilitation as well as the €5,000 for a new well.  Work is at an advanced stage of development for the new scheme. I expect that the process will be completed shortly when the necessary regulations dealing with the financial assistance arrangements and related administrative matters are put in place. This will enable a circular letter, terms and conditions, guidance and the application form to issue to local authorities shortly thereafter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_499.xml"
            }
          },
          "debateSectionId": "dbsect_499",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_499",
          "showAs": "Social and Affordable Housing"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_516",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 516,
        "showAs": " 516. Deputy Pat Casey asked the Minister for Housing, Planning and Local Government the status of the roll out of the affordable housing scheme and serviced sites fund; the number of housing schemes approved; and if he will make a statement on the matter. [40947/19] ",
        "answerText": " Minister for Housing, Planning and Local Government  Part 5 of the Housing (Miscellaneous Provisions) Act 2009 was commenced in June 2018 to provide a statutory basis for the delivery of affordable housing for purchase. Regulations in respect of the making of Schemes of Priority were signed on 12 March 2019, and these were issued to local authorities on 22 March 2019. The purpose of a Scheme of Priority is to set out the affordable purchase arrangements at local authority level. This includes the methodology that will be applied by local authorities to determine the order of priority to be accorded to eligible households where the demand for such affordable dwellings exceeds the number available.  In line with the legal requirements of the Affordable Dwelling Purchase Arrangements, further regulations will be put in place over the coming months regarding eligibility and other matters. When the operational procedures for the scheme are finalised, and before dwellings are made available for purchase under the scheme, a programme of communication will be undertaken by my Department and local authorities.  In order to support the delivery of discounted homes to buy or rent, this Government has committed €310 million under the Serviced Sites Fund, from 2019 to 2021, to provide infrastructure to support the delivery of some 6,200 homes. To date, funding of €127 million, in support of 35 projects in 14 local authority areas, has been allocated for infrastructure works on sites that will support the delivery of almost 3,200 homes.  Details of all SSF funded infrastructure projects can be found on the Rebuilding Ireland website at the following links:   https://rebuildingireland.ie/news/minister-murphy-approves-10-local-authority-sites-affordable-housing-serviced-sites-fund/    https://rebuildingireland.ie/news/minister-murphy-approves-funding-of-e84m-to-support-delivery-of-1770-affordable-homes-under-the-ssf/   The overall cost and the timing of delivery for these projects is contingent upon the completion of design, planning and procurement in the first instance, and local authorities are working to achieve delivery as quickly as possible.  In addition to making discounted homes available for purchase, the Government is also committed to the development of ‘Cost Rental’ in Ireland. Under the Cost Rental model, rents cover the cost of delivering, managing, and maintaining the homes only, less both the profit margin seen in the private rental sector and any financial supports provided by the State/local authorities. With the resulting rents significantly below market levels, this would mean that many households on moderate incomes will have access to a more affordable and stable form of rental tenure than would otherwise have been the case.  In order to drive delivery, two early mover pilot projects are being advanced, one at Enniskerry Road, in Dún Laoghaire-Rathdown, and the other at Emmet Road in Inchicore. In tandem with these pilot projects, my Department is developing a national policy approach to Cost Rental for Ireland to ensure future projects can be delivered at a scale and in a manner that will have the desired positive impact on the Irish housing sector.  These new schemes are complemented by other key Government affordability initiatives, including the Rebuilding Ireland home loan and the Help to Buy Scheme. In addition, the Land Development Agency's initial portfolio of sites will have the potential to deliver 3,000 affordable homes and the Local Infrastructure Housing Activation Fund ( LIHAF) will support more than 2,300 affordable homes on mainly publicly owned lands, while 5,600 further homes will benefit from a LIHAF related cost reduction, some of which have already come on stream.  In overall terms, programmes are in place under which some 18,000 affordable homes or homes with a LIHAF related reduction will be delivered, with 15,000 households already supported under the Rebuilding Ireland Home Loan or the Help to Buy Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-01/writtens/mul@/dbsect_114.xml"
            }
          },
          "debateSectionId": "dbsect_114",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-01/writtens/dbsect_114",
          "showAs": "Central Bank of Ireland"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-01/pq_145",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 145,
        "showAs": " 145. Deputy Pat Casey asked the Minister for Finance the engagement he has had with the Central Bank on the increased levy being imposed on certain credit unions in view of the vital role of the credit union movement in providing financial services to communities and the voluntary nature of its commitment to providing that service; and if he will make a statement on the matter. [39679/19] ",
        "answerText": " Minister for Finance  My officials meet with officials from the Central Bank on a regular basis to discuss the funding of financial services regulation by industry, while also ensuring that the commitment to transparency on the cost of regulation is met.  Agreed recommendations from these meetings are submitted to me as Minister for my review and agreement.  In 2015, a joint Department of Finance Central Bank public consultation ‘Funding the cost of Financial Regulation’ put industry representatives on notice that it was the Central Bank’s and my predecessor's intention to move towards full industry funding on a phased basis.  Against a backdrop of a significant increase in the cost of Financial Regulation and increases in recovery rates, certain industry bodies set out a number of concerns in relation to the increased costs they would have to bear, in particular the continually increasing cost, the performance of and the accountability of the Central Bank.  Overall, industry were not supportive of the proposal but set out that a phased movement would be preferable.  To answer the concerns of industry, the Central Bank and the Department of Finance issued a joint Feedback Statement.  This feedback statement set out that the Central Bank would bring greater clarity and transparency to the levy model through the Bank’s Annual Performance Statement and that there would be greater targeting of resources at the areas of highest priority.  These commitments have been addressed by the Central Bank publishing its Annual Performance Statement which provides an evaluation of the Bank’s performance under a number of key areas such as Regulatory Performance, Financial Institutions Supervision, Markets Supervision, Consumer Protection and Enforcement. The statement also includes detailed information on the levy process and its cost control and budgetary processes, including Commission approval of annual budgets, and oversight of quarterly outturns against those budgets.  Each phased increase required my or my predecessor's approval of the annual industry funding regulations.  In 2017, the then Minister for Finance approved a phased increase to 100% industry funding commencing with an increase from 50% to 65% in 2017  (S.I. No. 442/2017 - The Central Bank Act 1942 (Section 32D) Regulations 2017).  In 2018, I agreed to an increase in recovery rates from 65% to 80% (in certain categories) with corresponding increases in other categories (S.I. No. 445 of 2018 - The Central Bank Act 1942 (Section 32D) Regulations 2018).  At the time of this increase, the Central Bank issued a Funding Strategy and Guide to the 2018 Industry Funding Levy. This guide provides significant detail on the levy strategy and the plans to 2021.  The move towards full funding is part of a wider levy strategy, which includes moving to levying in arrears in the next levy cycle.  This will eliminate significant prior year shortfalls and surpluses which resulted in volatility in the past.  No levies will issue in 2019 as actual costs will be levied on an arrears basis in mid-2020.  Earlier this year, I agreed to the phased increase of all financial sectors to 100% funding by 2024.  However, I specifically provided for an exception for Credit Unions so they will only reach 50% funding by 2021.  This has been well flagged to the sector and I have also agreed to not increase credit union regulatory funding beyond 50%  until the impact of the move to 50% is reviewed and a further public consultation is undertaken. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-01",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-10-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-01/writtens/mul@/dbsect_586.xml"
            }
          },
          "debateSectionId": "dbsect_586",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-01/writtens/dbsect_586",
          "showAs": "Water Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-01/pq_644",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 644,
        "showAs": " 644. Deputy Pat Casey asked the Minister for Housing, Planning and Local Government the status of the roll-out and take-up of the multi-annual rural water programme announced in February 2019 and for which the deadline for applications was 14 March 2019; the number of applicants successful and unsuccessful by local authority area for each measure under the programme; and if he will make a statement on the matter. [39863/19] ",
        "answerText": " Minister for Housing, Planning and Local Government  On 8 February this year, I announced details of the measures being funded through my Department under the Multi-annual Rural Water Programme 2019-2021. Local authorities were invited to submit their bids for the funding of schemes or projects in their functional areas.  An Expert Panel has been put in place to support the evaluation process and its membership includes Departmental, stakeholder and independent representation.  The Expert Panel has made recommendations to my Department on the suitability of schemes and projects for funding based on objective criteria which are set out in the framework document issued to local authorities when requesting proposals. I expect to conclude consideration of the Panel's recommendations and to make an announcement of the allocations shortly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-01",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2019-09-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-24/writtens/mul@/dbsect_94.xml"
            }
          },
          "debateSectionId": "dbsect_94",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-24/writtens/dbsect_94",
          "showAs": "Corporate Governance"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-09-24/pq_87",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 87,
        "showAs": " 87. Deputy Pat Casey asked the Minister for Finance if the anomaly will be rectified by which the Companies Registration Office is asking community-based organisations such as community employment schemes and community halls to specify a beneficial owner in cases in which no such owner exists in view of the fact that they are community and social enterprise companies; and if he will make a statement on the matter.  [38518/19] ",
        "answerText": " Minister for Finance  Statutory Instrument 110 of 2019, the European Union (Anti-Money Laundering: Beneficial Ownership of Corporate Entities) Regulations 2019, was signed into law on 22 March 2019. These Regulations transpose Article 30 of the Fifth Anti-Money Laundering Directive and maintain the obligation, first established in 2016, for corporate entities to obtain and hold information on their beneficial ownership – that is, the people who ultimately own or control the company.  The Regulations also provide for the establishment of a central register of beneficial ownership information. This central register is operated under the aegis of the Companies Registration Office and began accepting filings on 29 July 2019.  The purpose of the Regulations is to prevent the use of corporate entities as vehicles for money laundering or terrorist financing and to provide competent authorities with access to information on the true ownership and control of corporate entities. Therefore, the obligation to file information with the central register applies to all companies formed under the Companies Act and societies registered under the Industrial and Provident Societies Acts, with the exception of companies listed on regulated markets that are subject to disclosure requirements consistent with European Union law or subject to equivalent international standards which ensure adequate transparency of ownership information. The Regulations apply to community and social enterprises if they are created under the above Acts. In cases where no beneficial owner can be identified, companies are permitted to register the senior managing officials of the company instead. The scope of the Regulations is necessary in order to meet the State's obligations on foot of the Directive.  While the relevant legislation was signed by myself as Minister for Finance, the register is maintained by a “Registrar of Beneficial Ownership of Companies and Industrial and Provident Societies”, as provided for under Regulation 18 of SI 110/2019, who has been appointed by the Minister for Business, Enterprise and Innovation. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-09-24",
        "by": {
          "showAs": "Pat Casey",
          "memberCode": "Pat-Casey.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pat-Casey.D.2016-10-03"
        }
      }
    }
  ]
}