{
  "head": {
    "counts": {
      "questionCount": 3032,
      "resultCount": 3032
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Cian O'Callaghan  There is a significant problem with Irish banks charging very high interest rates to mortgage holders, especially in comparison with UK banks and the spreads in the UK, while at the same garnering record profits. What is the Tánaiste doing about this? Cad atá ar siúl? \n Deputy Simon Harris  The European Central Bank, as we know, is responsible for monetary policy in the euro area. Having declined in stages over the past 18 months, its main lending rate is now 2.15%. While changes in the level of official interest rates will feed through to the wider economy it does not have a uniform impact on the level of retail interest rates. In a market economy, the determination of retail and business lending rates is a commercial matter for individual creditors. The most recent Central Bank data shows the weighted average interest rate on new mortgages was 3.56% in October. While this is above the euro area average of 3.33%, the percentage is almost 0.5% lower than the same time last year. It is factually correct that we are above the euro but we are not the highest in the EU.  In the most recent budget, the Government maintained the mortgage interest tax credit at the current level for a further year and at a reduced level of relief for the following year. This will assist borrowers who have seen large interest rate increases to offset the impact of the rising cost of living. It introduced mortgage interest relief for homeowners with an outstanding mortgage balance on their primary dwelling house of between €80,000 and €500,000 as of 31 December 2022. This relief was extended in budget 2025 and again in the most recent budget for 2026.  The Central Bank, through its regulatory framework, offers protection for consumers and requires that all regulated entities, including banks, retail credit firms and credit servicing firms, are transparent and fair in all their dealings with borrowers. The revised and strengthened consumer protection code will come into effect next March and will set out requirements for enhanced disclosure on mortgage switching options and the impact of incentives on the overall cost of credit of a mortgage. The banking industry has adopted an aligned industry-wide set of initial eligibility criteria to facilitate the switching of mortgages from non-banks to banks and has introduced a website, bpfi.ie/in-your-interest , to assist the mortgage switching process. Domestic banks currently maintain healthy balance sheets, which are also important to ensure they are well positioned in case of adverse shocks. While the profitability of the domestic banking sector is high, it is noted that it has moderated from recent highs. \n Deputy Cian O'Callaghan  Irish banks are making huge profits from charging high interest rates on mortgages. Research by RBC Capital Markets shows that Irish banks are making more than three times as much on mortgages as UK banks by charging higher interest rates. It is the last thing people who are struggling to buy a home need. At the same time, profit levels in Irish banks are at a record high. AIB and Bank of Ireland last year made a combined profit of almost €5 billion and these same banks paid virtually no taxes on these profits. Does the Tánaiste think it is acceptable that Irish banks are making huge profits off the backs of mortgage holders? Does he see that there is a serious problem? Will he do anything to end this rip-off? \n Deputy Pearse Doherty  I have raised this issue with the Tánaiste over and over again. It is clear that people are being ripped off. I wonder whether that is the assessment of the Tánaiste, as Minister for Finance, or does he think it is okay that banks make €5 billion in profits and charge higher interest rates than the average in the EU. That is where they are making their money. It is not due to huge innovations. It is because of the European Central Bank, ECB, interest rate in the main that these banks are making the profits they are making. This means a lot to families. Percentages relating to large mortgages - and I spoke earlier about the runaway house prices and people being forced into huge mortgages - mean thousands of euro each year. We cannot have a Minister who is simply impotent in this regard. On the one hand, the Government is getting rid of the pay caps for the CEO and selling off the stakes while, on the other hand, customers are basically abandoned. Is there anything the Minister plans to do to ensure banks pass on reduced interest rates to their customers instead of gouging them? \n Deputy Simon Harris  The more competition in the banking sector and the ability to have competition across the EU is how we can help in a sustained and policy proactive way. A number of discussions that are taking place at a European level about completing the single market in relation to that is good. Making sure this is an attractive location in which to operate banks and financial services is also important and important to consumers, including the people the Deputies mentioned. It is important, though, when we have this conversation to recognise that we are having it at a time when the weighted average interest rate on new mortgages is falling. It is 0.5 % lower than it was at the same time last year. The Deputies are right that these are real figures and have real impacts on people. The latest data from the Central Bank, which publishes quarterly data on interest rates on outstanding mortgages, is from September of this year and indicates that the average interest rate on outstanding mortgages held by banks was 3.44%, down from 3.6% a year earlier. For the overall non-bank sector the weighted average was 3.78%, down from 4.39% a year earlier and for those entities in the non-bank sector, which do not engage in new lending, the weighted average was 3.91%, down almost 1.5% from 5.32% a year earlier. The Central Bank has indicated that Irish banks operate at a healthy profit level, but that gap with the EU average has narrowed more recently.  Domestic banks currently maintain healthy balance sheets. We need them to do so in order that they are well positioned to absorb potential credit losses in case of adverse shocks. We know what it was like when the banking sector collapsed in the past and the pain that caused. As announced in the recent budget, the revised form of a bank levy was further extended. Extending the bank levy in increments of one year at a time ensures the form, scope and revenue target of the levy can be assessed and calibrated on an annual basis in a manner that accounts for various factors, including the level of profitability of the sector from year to year and the performance of the liable institutions relative to one another and that is also a tool at our disposal. \n Deputy Cian O'Callaghan  Of course interest rates have fallen in the past year. The European interest rates have fallen. Why on earth would they not? The issue is that we have record bank profits and Irish mortgage holders are being over-charged in interest rates compared with other countries. I gave the example of the UK. The spreads in Ireland are more than three times higher than those in the UK. Does the Tánaiste find that acceptable? Is he going to do anything about it? He is simply talking about more banking competition. That has been said by Ministers for Finance in this Chamber over many years, but we are in the situation that people are being ripped off now. Is the Tánaiste going to do something about it or does he find it acceptable? \n Deputy Pearse Doherty  Deputy O'Callaghan made the point. To tell us that interests have dropped 0.2% in a year on weighted average, when the ECB has reduced interest rates seven or eight times in the past 16 months, is a nonsense argument. \n Deputy Simon Harris  It is not. They reduced. \n Deputy Pearse Doherty  It is a nonsense argument. The banks should be reducing their interest rates beyond the rate they are offering at this time. The ECB has given them the flexibility to do that by reducing the rate. I am not expecting them to be passed on percentage by percentage, but there is no doubt that Irish banks are creaming it off the backs of mortgage holders and the Tánaiste is doing nothing about it. His predecessor did nothing about it, and the Tánaiste's response here is that he will not do anything about it. All he is saying to the public is that he is looking for competition, that we have to get another bank. What will he actually do about AIB and Bank of Ireland making a €5 billion profit when everyone in this Chamber knows it is being made as a result of high interest rates that should not be charged to Irish consumers. Consumers and families are being forced to take out mortgages at huge rates because of Government policies. \n Deputy Simon Harris  If the Deputies want to have a direct link between every loan facility and the ECB interest rate, they have to be willing to say they want it for deposits as well. That will not be good either for many Irish businesses or families. There has to be a context to this conversation because people are watching at home and it is presented to them as though interest rates are way out of kilter with the European average. The point I am making with the evidence I put on the record of the House, which is available for all to read from the ECB and the Central Bank of Ireland, is that the gap is now narrowing.  I have heard it said for years that Irish mortgage holders pay the highest mortgage interest rates in the European Union. That is not true. We pay a little above the European average. That has real impacts on people in their bills, that is absolutely right. However, it was 3.56% in October and the European average was 3.3%. It is, therefore, absolutely prudent and sensible to say we should continue to look at what we can do at a European level.  I was at meetings as recently as last week about what we can do at a European level to complete the single market and make sure there are more opportunities for Ireland, which is a small country from the point of view of population, to be able to avail of banking services across the European Union and to attract banks in. It is not just talk. We saw yesterday the benefit of a new banking organisation entering the Irish economy. We have kept the banking levy, which is a tool at our disposal and it is reviewed each year in advance of the budget. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 171. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the action he is taking to address the banking sector using high mortgage interest rates in order to maintain high profits; and if he will make a statement on the matter. [73718/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_37",
          "debateSectionId": "dbsect_37",
          "showAs": "Mortgage Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_37.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_171",
        "questionNumber": 171
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " An Cathaoirleach Gníomhach (Deputy Jen Cummins)  Now we have two grouped questions again – my favourite. Deputy Cian O'Callaghan has two different questions. \n Deputy Cian O'Callaghan  I thank the Chair. I have never been grouped with myself before.  Má chaitheann muid ár súil siar, we will recall that huge economic damage was done by property tax reliefs that were not well designed or indeed well researched.  In relation to recently introduced property tax relief measures, what research and analysis was done in advance? Will the Minister publish that research and analysis and share it with us? \n Deputy Simon Harris  I propose to take Questions Nos. 177 and 364 together.  The Deputy was determined to ask this question because it came in as a priority, regular oral and a written question. I am glad it got tabled because it is an important issue in relation to the expenditure of public money and the impact of that on the delivery of housing. A well-functioning housing market, we can all agree, is crucial to supporting labour mobility, improving competitiveness and ensuring that Ireland remains an attractive location for both domestic and foreign investment into the future. It is key for our people first and foremost.  The newly released national housing plan targets the delivery of 300,000 new homes from 2025 to 2030. High-density housing, such as apartments, will form a significant portion of these, in line with changing demographics and in order to achieve national policies on compact growth aimed at creating more sustainable communities.  The direct answer to the Deputy's question is that a number of reports have been published by my Department, most recently one in June 2024 that looked at the availability, composition and flow of finance for residential development. This report found that there is reasonable access to finance for viable residential developments. However, there are certain segments where viability is challenged and there is constrained access to finance, including funding apartment development for the private market. That was the 2024 anchor. I think that report was published.  The Deputy is also familiar with the recently published Society of Chartered Surveyors Ireland report \"The Real Costs of New Apartment Delivery 2025\", which came out post the budget. It found that State interventions are playing a critical role in closing the financial viability gap while also noting that affordability remains the key challenge. There is also a Department of housing total development cost survey. The direct straight answer to the Deputy's question is that the two principal reports from an official Department point of view are the Department of Finance report in June 2024 on availability, composition and flow of finance for residential development and the Department of housing total development cost survey.  The Society of Chartered Surveyors Ireland report reveals through detailed case studies that State interventions are helping to bridge the financial viability gap. The analysis shows that, without Government initiatives, just two out of six apartment types are viable, whereas with State interventions five out of six become viable.  Even with record levels of State spending allocated for housing, private capital will also be required to meet our housing needs. As such, it is important to create an environment where we can continue to attract private investment, both domestic and international.  For this reason, budget 2026 contained a number of measures to support the housing sector, and in particular the construction of apartment developments. These include the reduction in VAT on apartments, the enhanced corporation tax deduction for certain apartment construction costs and enhancements to the living city initiative, which encourages people to regenerate and live in historic buildings in the centre of Irish cities and now in five large towns under the national planning framework.  Apartment development at scale will play an important role in meeting our housing targets. However, in recent years we have seen a retrenchment of private capital from the funding and development of apartments because these developments are costly, capital intensive and higher risk. Investment in the private rental sector in Dublin is estimated to have fallen from €2 billion in 2019 to €166 million in 2024.  The measures introduced in budget 2026, in tandem with more structural measures related to areas such as planning, apartment design and infrastructure, are all elements of a whole-of-government approach aiming to improve viability, increase supply and help to create a long-term sustainable housing system that reflects our country's needs. \n Deputy Cian O'Callaghan  I am aware that there have been reports on housing, viability, financing and so forth and that there has been research in the area; that was not my question. My question was on the tax measures that were introduced by Government and by the Minister's predecessor as Minister for Finance in the budget on property. What research or analysis was done before those tax measures were decided on? The Parliamentary Budget Office, which is independent, has been highly critical of the Government for introducing measures like that and not producing any evidence, analysis or research to back them up, especially given the damage that has been done in the past with similar measures.  In other countries when there are such massive public subsidies put into different types of housing, it is linked specifically to affordability - it makes housing more affordable. The Government decided not to do that. One of the main reports the Minister cited was something that was published post budget. Did the Government carry out research about these tax measures and if so, will the Minister publish it and share it with us? \n Deputy Simon Harris  I am not aware of any research or information that is not already in the public domain but let me double check. I bring the Deputy back to the political decision we made - and it was a political decision - in relation to recognising that viability is a major issue when it comes to apartment construction. Only a month or two after the budget, and I do not want to reach too much into the data, the initial data is somewhat encouraging. The Society Chartered Surveyors in Ireland which has expertise and certainly independence in this pointed out that there are six categories of apartments and only two of them were viable before Government made a number of interventions and it now believes that five out of six are viable which is a good thing.  It is not just a measure that is going to benefit developers in the private sense - by the way there is nothing wrong with private development and we need a lot more of it - but it will also benefit AHBs. It will reduce the cost of apartments for approved housing bodies which is also a good thing. It will also benefit, for example, people building student accommodation which is also a good thing. I am out of time but I agree with the Deputy on the broader point about the importance of measures being targeted and carefully monitored and I hope I will have a chance to come back in. \n Deputy Cian O'Callaghan  As the Tánaiste has said, a political decision was made. We know that there was intense lobbying from the sector for that decision to be made. It appears that there was not any actual research or analysis done in advance on these tax measures by the Department. The Tánaiste is not aware of any and none has been published. The SCSI report that he referenced shows only the top 20% of earners can actually afford to rent an apartment. Not doing that analysis, not doing that research and not tying these measures in with affordability is an absolute flaw. We are surrounded by countries where when they make these kinds of investments and measures, they make housing more affordable. The Government is pursuing policies that increase supply but do not increase affordability. That is a major flaw in what it is doing. Not having researched or analysed it in advance is a major flaw and the Parliamentary Budget Office has called it out on that. Why did the Government not do that? When making these kinds of decisions in future, will the Government commit to do the proper analysis in advance and tie the measures in with affordability which is best practice in other European countries? \n Deputy Micheál Carrigy  All the large building companies and AHBs appeared before the housing committee. They all welcomed the changes and improvements made on the viability of apartment building. Is there any timeline on the legal challenge being brought on the changes to apartment sizes which will affect the delivery of tens of thousands of apartments? \n Deputy Simon Harris  I have heard Deputy O'Callaghan make this point before and he holds a legitimate policy viewpoint on linking this to affordability. My predecessor was clear and I am clear too: this is a viability measure. While I do not have it in front of me, we have seen a very small example of where this measure has led to people building apartments to say that it has reduced the costs. However, it has not been introduced primarily as an affordability measures; it has been introduced primarily as a viability measure. There are other things we try to do on the viability side, such as cost rental, renter's tax credits, etc. That is a broader debate. I do not want to say, nor did I say, that no evidence-based research has been done. We have listened to the market, listened to industry and listened to the people who build apartments. That is an important thing to do in recognising there is a viability issue. There was also the June 2024 Department of Finance report which recognised challenges in this area and the Department of housing total development cost report.  I thank Deputy Carrigy for his question on apartments. I also followed that meeting and it was encouraging to hear many people, including the AHBs, saying this measure would help them. The Deputy is right in saying this is just one of a number of measures; there are also the apartment standards. I do not have a timeline on that but I will see if I can get it and revert to him. The apartment standard changes, the viability measures around the VAT and the clarity around rent protections are three key issues in trying to really stimulate apartment construction. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 177. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the research carried out by his Department into the potential fiscal and housing market impacts of the new tax reliefs for property developers announced as part of budget 2026; and if he will make a statement on the matter.  [73179/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_43",
          "debateSectionId": "dbsect_43",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_43.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_177",
        "questionNumber": 177
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  While neither I as Tánaiste and Minister for Finance, nor the Central Bank, can intervene directly in pricing under EU Solvency II rules, ensuring that consumers have access to affordable insurance cover is a key priority for this Government.  Considerable progress in this area has already been made achieved through the 2020 Action Plan for Insurance Reform, including the introduction of the Personal Injuries Guidelines, legal reforms to rebalance the duty of care, and the establishment of the Office to Promote Competition in the Insurance Market (OPCIM).  A key focus of the reform agenda was addressing personal injury costs, which historically accounted for around 70% of overall motor insurance claims costs. Thanks to the introduction of the Personal Injuries Guidelines and related reforms, that figure has now moved to 46%. However, the last few years has seen the emergence of inflationary pressures. This rise is driven by a combination of external factors, including increased vehicle technology, supply chain disruptions, and a tightening labour market; all of which have raised the cost of repairs.  The 2025 Action Plan for Insurance Reform sets out comprehensive range of targeted measures to further improve affordability, availability, and transparency across the insurance sector. As part of the Action Plan, a transparency code for the insurance industry is under development. The Code will require insurers to provide simple, understandable explanations of how premiums are formed and what broader factors influence pricing. It is my expectation that the Code will be finalised by the end of this year.  The Government also remains committed to addressing the cost of insurance through the work of the Office for the Promotion of Competition in the Insurance Market. In terms of business and commercial insurance, existing providers have also indicated that they are expanding their risk appetite to underserved areas and various sectors are reporting reductions in the rate being charged for liability cover.  I am firmly of the view that securing a more sustainable and competitive market through deepening and widening the supply of insurance will support broader availability and affordability across the market, benefiting consumers and businesses alike. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 210. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the work being carried out to reduce insurance premiums, including public liability insurance premiums; and if he will make a statement on the matter. [73182/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_224",
          "debateSectionId": "dbsect_224",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_224.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_210",
        "questionNumber": 210
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 220 and 228 together.  The Government is aware of the impact that increased mortgage interest rates has had on some borrowers over recent years.  It is important to note that the determination of retail lending rates is a commercial matter for individual lenders. Now that official interest rates have reduced, the Government expects all mortgage creditors to keep their lending rates under review.  Recent Central Bank of Ireland data indicates that mortgage interest rates have declined over the past year. At the end of September, the weighted average interest rate on all outstanding mortgages held by banks was 3.44%, down 16 basis points from 3.60% a year earlier.  For the non-bank sector, the weighted average interest rate on outstanding mortgages was 3.78% down 61 basis points from 4.39% a year earlier.  For those entities in the non-bank sector which do not engage in new lending, the average interest rate on outstanding mortgages at end-September 2025 was 3.91%, down 141 basis points from 5.32% a year earlier.  In relation to new mortgages, as at end October the weighted average interest rate on all new mortgage agreements was 3.56%, down 47 basis points annually.  The Government, the Central Bank and the industry have taken steps to assist all borrowers in response to higher mortgage interest rates.  Budget 2026 maintained the mortgage interest tax credit at the current level for a further year and at a reduced level of relief for the subsequent year.  The Central Bank regulatory framework offers strong protection for consumers and requires that all regulated entities, including banks, retail credit firms and credit servicing firms, are transparent and fair in all their dealings with borrowers. In this regard, the revised and strengthened Consumer Protection Code will come into effect next March.  It should be noted that the Central Bank consumer protection framework provides the same protections for borrowers regardless of the regulated entity with whom they are dealing, be that a bank, retail credit firm or credit servicing firm.  The industry has also adopted an aligned industry-wide set of initial eligibility criteria to facilitate switching mortgages from a non-bank to a bank and it has introduced a bespoke website, entitled ' it's in your interest ', to further encourage and assist the mortgage switching process. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 220. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the action he is taking to reduce extremely high interest rates being charged to some mortgage holders whose mortgages were sold to non-bank lenders after the crash; and if he will make a statement on the matter. [73181/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_234",
          "debateSectionId": "dbsect_234",
          "showAs": "Mortgage Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_234.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_220",
        "questionNumber": 220
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 220 and 228 together.  The Government is aware of the impact that increased mortgage interest rates has had on some borrowers over recent years.  It is important to note that the determination of retail lending rates is a commercial matter for individual lenders. Now that official interest rates have reduced, the Government expects all mortgage creditors to keep their lending rates under review.  Recent Central Bank of Ireland data indicates that mortgage interest rates have declined over the past year. At the end of September, the weighted average interest rate on all outstanding mortgages held by banks was 3.44%, down 16 basis points from 3.60% a year earlier.  For the non-bank sector, the weighted average interest rate on outstanding mortgages was 3.78% down 61 basis points from 4.39% a year earlier.  For those entities in the non-bank sector which do not engage in new lending, the average interest rate on outstanding mortgages at end-September 2025 was 3.91%, down 141 basis points from 5.32% a year earlier.  In relation to new mortgages, as at end October the weighted average interest rate on all new mortgage agreements was 3.56%, down 47 basis points annually.  The Government, the Central Bank and the industry have taken steps to assist all borrowers in response to higher mortgage interest rates.  Budget 2026 maintained the mortgage interest tax credit at the current level for a further year and at a reduced level of relief for the subsequent year.  The Central Bank regulatory framework offers strong protection for consumers and requires that all regulated entities, including banks, retail credit firms and credit servicing firms, are transparent and fair in all their dealings with borrowers. In this regard, the revised and strengthened Consumer Protection Code will come into effect next March.  It should be noted that the Central Bank consumer protection framework provides the same protections for borrowers regardless of the regulated entity with whom they are dealing, be that a bank, retail credit firm or credit servicing firm.  The industry has also adopted an aligned industry-wide set of initial eligibility criteria to facilitate switching mortgages from a non-bank to a bank and it has introduced a bespoke website, entitled ' it's in your interest ', to further encourage and assist the mortgage switching process. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 228. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance his plans to reduce extremely high interest rates being charged to some mortgage holders whose mortgages were sold to non-bank lenders after the crash; and if he will make a statement on the matter. [69734/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_234",
          "debateSectionId": "dbsect_234",
          "showAs": "Mortgage Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_234.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_228",
        "questionNumber": 228
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  My Department remains committed to progressing legislation that will replace the Dublin Carriage Act 1853 to ensure that the Dublin City Council is provided with an appropriate legal basis to regulate this area, and the Bill remains on the Government’s legislative programme.  Some initial scoping work on the Bill has taken place, but is at an early stage due to other primary transport legislation being progressed currently. It is anticipated that consultation with Stakeholders in relation to the drafting of the Bill will take place in 2026.  It is important to note that other legislation is in place in relation to animal welfare matters which are dealt with by the Department for Agriculture, Food and the Marine. Under the Animal Health and Welfare Act 2013, people in possession of a protected animal, including horses, must ensure the animal is kept and treated in a manner that safeguards their health and welfare. Failure to do this is considered an offence under that Act.  In addition, section 33 of the Control of Horses Act 1996 provides that An Garda Siochána may compel individuals in control of horses to obtain necessary attention from a veterinarian if the horse is in pain, distress, neglect or is severely injured, diseased or in need of veterinary attention. Failure to comply is an offence.  Furthermore, the drivers of all vehicles used on public roads, including horse-drawn carriages, are required to comply with road traffic legislation and to behave in a safe manner paying due care to other road users. The enforcement of such road traffic legislation is a matter for An Garda Síochána. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 313. Deputy Cian O'Callaghan asked the Minister for Transport if he will provide an update on the Horse-Drawn Carriages Bill; and if he will make a statement on the matter. [73314/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_317",
          "debateSectionId": "dbsect_317",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_317.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_313",
        "questionNumber": 313
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  A well-functioning housing market is crucial to supporting labour mobility, improving competitiveness and ensuring that Ireland remains an attractive location for both domestic and foreign investment into the future.  The newly released National Housing Plan targets the delivery of 300,000 new homes from 2025-2030. High density housing, such as apartments, will form a significant portion of these, in line with changing demographics and in order to achieve national policies on compact growth aimed at creating more sustainable communities.  A number of reports have been published by my Department, most recently in June 2024: “The availability, composition and flow of finance for residential development”. This report found that there is reasonable access to finance for viable residential developments. However, there are certain segments in particular where viability is challenged and there is constrained access to finance, including funding apartment development for the private market.  The Deputy may also be aware of the recently published Society of Chartered Surveyors Ireland report “The Real Costs of New Apartment Delivery 2025”, which found that State interventions are playing a critical role in closing the financial viability gap, while also noting that affordability remains the key challenge.  The report reveals through detailed case studies that State interventions are helping to bridge the financial viability gap. The analysis shows that, without Government initiatives, just 2 out of 6 apartment types are viable, whereas with State interventions 5 out of 6 are viable.  Even with record levels of State spending allocated for housing, private capital will also be required to meet our housing needs. As such, it is important to create an environment where we can continue to attract private investment, both domestic and international.  For this reason, Budget 2026 contained a number of measures to support the housing sector, and particularly the construction of apartment developments. These include the reduction in VAT on apartments, the enhanced corporation tax deduction for certain apartment construction costs, a corporation tax exemption for rental income from Cost Rental dwellings and enhancements to the Living City Initiative, which encourages people to regenerate and live in historic buildings in the centre of Irish cities, including its extension to the five regional centres of Athlone, Drogheda, Dundalk, Letterkenny and Sligo.  Apartment development at scale will play an important role in meeting our housing targets. However, in recent years we have seen a retrenchment of private capital from the funding and development of apartments, because these developments are costly, capital intensive and higher risk. Investment in the Private Rental sector in Dublin is estimated to have fallen from €2.0bn in 2019 to €166m in 2024.  The measures introduced in Budget 2026, in tandem with more structural measures related to areas such as planning, apartment design and infrastructure, are all elements of a whole of Government approach aiming to improve viability, increase supply and help create a long-term sustainable housing system that reflects our nation’s needs. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 342. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the research that was carried out by his Department into the potential fiscal and housing market impacts of the new tax reliefs for property developers announced as part of Budget 2026; and if he will make a statement on the matter. [70374/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_344",
          "debateSectionId": "dbsect_344",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_344.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_342",
        "questionNumber": 342
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " An Cathaoirleach Gníomhach (Deputy Jen Cummins)  Now we have two grouped questions again – my favourite. Deputy Cian O'Callaghan has two different questions. \n Deputy Cian O'Callaghan  I thank the Chair. I have never been grouped with myself before.  Má chaitheann muid ár súil siar, we will recall that huge economic damage was done by property tax reliefs that were not well designed or indeed well researched.  In relation to recently introduced property tax relief measures, what research and analysis was done in advance? Will the Minister publish that research and analysis and share it with us? \n Deputy Simon Harris  I propose to take Questions Nos. 177 and 364 together.  The Deputy was determined to ask this question because it came in as a priority, regular oral and a written question. I am glad it got tabled because it is an important issue in relation to the expenditure of public money and the impact of that on the delivery of housing. A well-functioning housing market, we can all agree, is crucial to supporting labour mobility, improving competitiveness and ensuring that Ireland remains an attractive location for both domestic and foreign investment into the future. It is key for our people first and foremost.  The newly released national housing plan targets the delivery of 300,000 new homes from 2025 to 2030. High-density housing, such as apartments, will form a significant portion of these, in line with changing demographics and in order to achieve national policies on compact growth aimed at creating more sustainable communities.  The direct answer to the Deputy's question is that a number of reports have been published by my Department, most recently one in June 2024 that looked at the availability, composition and flow of finance for residential development. This report found that there is reasonable access to finance for viable residential developments. However, there are certain segments where viability is challenged and there is constrained access to finance, including funding apartment development for the private market. That was the 2024 anchor. I think that report was published.  The Deputy is also familiar with the recently published Society of Chartered Surveyors Ireland report \"The Real Costs of New Apartment Delivery 2025\", which came out post the budget. It found that State interventions are playing a critical role in closing the financial viability gap while also noting that affordability remains the key challenge. There is also a Department of housing total development cost survey. The direct straight answer to the Deputy's question is that the two principal reports from an official Department point of view are the Department of Finance report in June 2024 on availability, composition and flow of finance for residential development and the Department of housing total development cost survey.  The Society of Chartered Surveyors Ireland report reveals through detailed case studies that State interventions are helping to bridge the financial viability gap. The analysis shows that, without Government initiatives, just two out of six apartment types are viable, whereas with State interventions five out of six become viable.  Even with record levels of State spending allocated for housing, private capital will also be required to meet our housing needs. As such, it is important to create an environment where we can continue to attract private investment, both domestic and international.  For this reason, budget 2026 contained a number of measures to support the housing sector, and in particular the construction of apartment developments. These include the reduction in VAT on apartments, the enhanced corporation tax deduction for certain apartment construction costs and enhancements to the living city initiative, which encourages people to regenerate and live in historic buildings in the centre of Irish cities and now in five large towns under the national planning framework.  Apartment development at scale will play an important role in meeting our housing targets. However, in recent years we have seen a retrenchment of private capital from the funding and development of apartments because these developments are costly, capital intensive and higher risk. Investment in the private rental sector in Dublin is estimated to have fallen from €2 billion in 2019 to €166 million in 2024.  The measures introduced in budget 2026, in tandem with more structural measures related to areas such as planning, apartment design and infrastructure, are all elements of a whole-of-government approach aiming to improve viability, increase supply and help to create a long-term sustainable housing system that reflects our country's needs. \n Deputy Cian O'Callaghan  I am aware that there have been reports on housing, viability, financing and so forth and that there has been research in the area; that was not my question. My question was on the tax measures that were introduced by Government and by the Minister's predecessor as Minister for Finance in the budget on property. What research or analysis was done before those tax measures were decided on? The Parliamentary Budget Office, which is independent, has been highly critical of the Government for introducing measures like that and not producing any evidence, analysis or research to back them up, especially given the damage that has been done in the past with similar measures.  In other countries when there are such massive public subsidies put into different types of housing, it is linked specifically to affordability - it makes housing more affordable. The Government decided not to do that. One of the main reports the Minister cited was something that was published post budget. Did the Government carry out research about these tax measures and if so, will the Minister publish it and share it with us? \n Deputy Simon Harris  I am not aware of any research or information that is not already in the public domain but let me double check. I bring the Deputy back to the political decision we made - and it was a political decision - in relation to recognising that viability is a major issue when it comes to apartment construction. Only a month or two after the budget, and I do not want to reach too much into the data, the initial data is somewhat encouraging. The Society Chartered Surveyors in Ireland which has expertise and certainly independence in this pointed out that there are six categories of apartments and only two of them were viable before Government made a number of interventions and it now believes that five out of six are viable which is a good thing.  It is not just a measure that is going to benefit developers in the private sense - by the way there is nothing wrong with private development and we need a lot more of it - but it will also benefit AHBs. It will reduce the cost of apartments for approved housing bodies which is also a good thing. It will also benefit, for example, people building student accommodation which is also a good thing. I am out of time but I agree with the Deputy on the broader point about the importance of measures being targeted and carefully monitored and I hope I will have a chance to come back in. \n Deputy Cian O'Callaghan  As the Tánaiste has said, a political decision was made. We know that there was intense lobbying from the sector for that decision to be made. It appears that there was not any actual research or analysis done in advance on these tax measures by the Department. The Tánaiste is not aware of any and none has been published. The SCSI report that he referenced shows only the top 20% of earners can actually afford to rent an apartment. Not doing that analysis, not doing that research and not tying these measures in with affordability is an absolute flaw. We are surrounded by countries where when they make these kinds of investments and measures, they make housing more affordable. The Government is pursuing policies that increase supply but do not increase affordability. That is a major flaw in what it is doing. Not having researched or analysed it in advance is a major flaw and the Parliamentary Budget Office has called it out on that. Why did the Government not do that? When making these kinds of decisions in future, will the Government commit to do the proper analysis in advance and tie the measures in with affordability which is best practice in other European countries? \n Deputy Micheál Carrigy  All the large building companies and AHBs appeared before the housing committee. They all welcomed the changes and improvements made on the viability of apartment building. Is there any timeline on the legal challenge being brought on the changes to apartment sizes which will affect the delivery of tens of thousands of apartments? \n Deputy Simon Harris  I have heard Deputy O'Callaghan make this point before and he holds a legitimate policy viewpoint on linking this to affordability. My predecessor was clear and I am clear too: this is a viability measure. While I do not have it in front of me, we have seen a very small example of where this measure has led to people building apartments to say that it has reduced the costs. However, it has not been introduced primarily as an affordability measures; it has been introduced primarily as a viability measure. There are other things we try to do on the viability side, such as cost rental, renter's tax credits, etc. That is a broader debate. I do not want to say, nor did I say, that no evidence-based research has been done. We have listened to the market, listened to industry and listened to the people who build apartments. That is an important thing to do in recognising there is a viability issue. There was also the June 2024 Department of Finance report which recognised challenges in this area and the Department of housing total development cost report.  I thank Deputy Carrigy for his question on apartments. I also followed that meeting and it was encouraging to hear many people, including the AHBs, saying this measure would help them. The Deputy is right in saying this is just one of a number of measures; there are also the apartment standards. I do not have a timeline on that but I will see if I can get it and revert to him. The apartment standard changes, the viability measures around the VAT and the clarity around rent protections are three key issues in trying to really stimulate apartment construction. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 364. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the research carried out by his Department into the potential fiscal and housing market impacts of the new tax reliefs for property developers announced as part of budget 2026; and if he will make a statement on the matter.  [69732/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_43",
          "debateSectionId": "dbsect_43",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_43.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_364",
        "questionNumber": 364
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that the Department is currently progressing the draft European Union (Motor Vehicle Type-Approval - Criteria for IO Approval and IO Employee Authorisation) Regulations 2025. The draft regulations are at the final stages of preparation and are expected to be signed shortly.  The Irish National Accreditation Board (INAB) will appoint the National Standards Authority of Ireland as the conformity assessment body responsible for implementation of the SERMI scheme in Ireland. As the INAB operates under the Health and Safety Authority, which is a state agency within the remit of the Department of Enterprise, Tourism and Employment, the Department of Transport is not in a position to comment on the timeframes for this appointment. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 146. Deputy Cian O'Callaghan asked the Minister for Transport the position regarding the implementation of EU Regulation 2018/858, in particular, the introduction of a national conformity assessment body; and if he will make a statement on the matter. [72763/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_143",
          "debateSectionId": "dbsect_143",
          "showAs": "EU Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_146",
        "questionNumber": 146
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  My department's Home Tuition Grant Schemes provide funding towards the provision of a compensatory educational service for children who, for a number of specific reasons, are unable to attend school. By its nature, it is intended to be a short term intervention.  The Home Tuition Grant Schemes are governed by annual circulars which sets out the purpose, eligibility criteria and details of the scheme. Circular 0047/2025 provides information in relation to the 2025/2026 Home Tuition Grant Scheme and can be accessed by clicking on the following link: www.gov.ie/en/department-of-education/circulars/home-tuition-grant-scheme-2025-2026-special-education-component/.  The purpose of the Home Tuition Grant Scheme is to provide funding towards the provision of a compensatory educational service for:  (a) Pre-School Children with autism who meet the scheme’s eligibility criteria  (b) Children seeking a Special School or Special Class placement  (c) Students, enrolled in schools, with a significant medical condition, which has caused, and is likely to continue to cause, major disruption to their attendance at school  (d) Students, enrolled in schools, with school phobia and/or associated depression/anxiety, which has caused, and is likely to continue to cause, major disruption to their attendance at school  In relation to applications in respect of students with school phobia and/or associated depression/anxiety, the principle that home tuition cannot be provided as an alternative to school applies.  Eligibility is assessed having regard to, although not limited to, the following criteria  • The student’s attendance levels during the previous school year.  • A relevant medical /relevant professional report - a separate report may be requested in some cases if required.  In exceptional cases, in recognition of significant and immediate circumstances, the Department will consider home tuition hours to compensate for a period of absence occurring in the current school year on a case by case basis. Home tuition hours in these circumstances are provided on a once off basis to compensate for a period of absence from school. Therefore this period of absence will not attract home tuition hours if an application for home tuition is made in the next school year.  Generally, grant aid based on a range of between 2 and 10 hours tuition may be approved with the allocation reflecting the level of attendance in the previous school year, and whether the attendance was at primary or post primary level. As a general guide, up to 5 hours may be granted to children at primary level while students at post primary level may be granted between 2 and 7 hours, and students sitting their Leaving Certificate Examinations may be granted between 2 and 10 hours.  Regarding the student referenced by the Deputy, the parent has the option to appeal the decision not to grant Home Tuition in this instance. The appeals process was outlined in the decision letter. Officials from my Department have contacted the family to provide information on the Home Tuition Grant Scheme, including details of the application and appeals process, and to offer any additional assistance or information they may require. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 444. Deputy Cian O'Callaghan asked the Minister for Education and Youth the steps her Department will take to ensure that a child (details supplied) can access a suitable educational setting for the remainder of the 2025/2026 school year. [71570/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_334",
          "debateSectionId": "dbsect_334",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_334.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_444",
        "questionNumber": 444
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Any attempt by accommodation providers to exploit their position and prey on vulnerable individuals through such 'sex for rent' arrangements is completely unacceptable. Such actions are an abuse of power, which will not be tolerated under any circumstances.  The General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025, which I published on 6 May, includes measures to criminalise the exploitative practice of seeking sex in lieu of rent. It is proposed to introduce two specific criminal offences related to ‘sex for rent’: (i) offering accommodation in exchange for sexual activity and (ii) the advertising of accommodation for the same motivation.  The General Scheme of the Bill was referred to the Office of Parliamentary Counsel for drafting and to the Joint Committee on Justice, Home Affairs and Migration for pre-legislative scrutiny. The pre-legislative scrutiny hearing took place on 30 September 2025 and the Committee’s Report was published on 13 November 2025.  I received Government approval on Tuesday, 16th December 2025 to publish the Bill and I intend on introducing the legislation to the Houses of the Oireachtas early in 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 693. Deputy Cian O'Callaghan asked the Minister for Justice, Home Affairs and Migration to provide an update on the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025; if his Department intends on proceeding with the Bill’s current provisions to prohibit sex for rent exploitation; and if he will make a statement on the matter. [71491/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_550",
          "debateSectionId": "dbsect_550",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_550.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_693",
        "questionNumber": 693
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform:  The first pillar is Legal Reform. Reforms here aim to achieve a better balance towards the common good by addressing the incentives that drive a disproportionate reliance on the courts in planning and regulatory matters. While access to justice remains protected, the reforms will reduce incentives for excessive litigation, clarify rules on standing and remedies, and introduce fast-track pathways for nationally significant projects that are in the common good, through the development of new legislation.  The second pillar is Regulatory Reform and Simplification. This means identifying where regulation leads to excessive process rather than improved outcomes. It also means examining the structure of our regulatory environment, the practices applied by regulatory bodies, and how they communicate with one another and applicants. In practical terms, I think that there is scope for improved outcomes by applying parallel processes, mandating statutory timelines, and measuring the performance of our regulatory bodies  The third pillar is Coordination and Delivery Reform. This implements the reforms outlined in the Programme for Government. It means my Department assuming a more central coordination role on critical infrastructure, providing certainty to other Government Departments and utilities through multiyear funding commitments to underpin 5-year sectoral plans and reforms to the Infrastructure Guidelines. Across Government, it means driving and embedding a delivery-first culture, including, where appropriate, a balance between risk and delivery that incorporates the potential cost of delay.  The final pillar is Public Acceptance. Fundamentally, without improved public acceptance, critical infrastructure will be subject to delays, leaving broader society worse off. Government and utilities need to do a better job in promoting the social value of infrastructure to communities openly and transparently using tools like a benefits realisation framework that can demonstrate these societal benefits.  The majority of these actions are targeted for completion in Q1 and Q2 2026. By addressing systemic bottlenecks and creating a streamlined framework for planning, funding, and delivery, these actions accelerate the provision of critical infrastructure. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 31. Deputy Cian O'Callaghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to address persistent delays to the construction of major infrastructure projects; and if he will make a statement on the matter. [70771/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_74",
          "debateSectionId": "dbsect_74",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_74.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_31",
        "questionNumber": 31
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Department of Justice, Home Affairs and Migration (Department) published their 'Sectoral Investment Plan: Justice Sector' (plan) on the 4th of December 2025. The plan includes capital projects for An Garda Síochána over the period of 2026 to 2030.  The second half of the plan published by the Department aims to bring several capital projects to construction for An Garda Síochána in 2029; including a new Garda Station for the Dublin Metropolitan Region North  On the basis of the priorities now published within the Department's plan, the Office of Public Works will be engaging with An Garda Síochána and the Department to identify and acquire a suitable site to support the Department's objectives. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 65. Deputy Cian O'Callaghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the position regarding the proposed new Garda station for Northern Cross in Dublin; and if he will make a statement on the matter. [70770/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_105",
          "debateSectionId": "dbsect_105",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_65",
        "questionNumber": 65
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 69 and 71 together.  I wish to assure the Deputy that reform of the statutory framework for ethics in public life is a priority for this Government, and we have committed in our Programme for Government 2025, 'Securing Ireland’s Future', to update the legislation that underpins it. However, this policy area remains a complex one, and careful consideration is required before I can bring forward detailed proposals for legislative reform.  As the Deputy mentions in his question, my Department has already prepared the ground with a comprehensive review of the ethics legislative framework. This was undertaken during the life of the last Government and the Report and findings were published in February 2023. The Report's recommendations include that the legislative framework for ethics should be underpinned by a set of integrity principles; that disclosure requirements should be strengthened to improve transparency; and that consideration should be given to whether the regime should encompass more office holders. The Report also recommends a strengthening of the Standards in Public Office Commission (SIPO). Certain, more recent, recommendations in relation to ethics will also need to be considered in the context of the reform agenda.  A variety of operational and policy considerations flow from this. I am conscious that this represents an opportunity to make real and meaningful, long-term change to our current regime and I wish to ensure that this happens in a way that is both coherent from a policy perspective and user-friendly from an operational perspective.  Given their significance, I will examine the outstanding policy issues with care and engage with my officials to determine the most appropriate way to deliver on our Programme for Government commitment in this area. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 71. Deputy Cian O'Callaghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the position regarding the reform of the ethics in public office legislation, given that the review of the statutory framework was completed in December 2022; the reason for the delay in publishing the heads of a Bill; if he expects this Bill to be introduced this year; and if he will make a statement on the matter. [70769/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Ethics in Public Office",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_71",
        "questionNumber": 71
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The large scale capital project for the school referred to by the Deputy is the provision of a new 600 pupil school building including all associated ancillary accommodation.  I am pleased to inform the Deputy that the project was authorised to proceed to tender on 12 November. Tender submissions are expected in January 2026, to allow for the Christmas holiday period, but may be subject to an extension if requested. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 140. Deputy Cian O'Callaghan asked the Minister for Education and Youth if she will provide an update on a new school building project (details supplied); and if she will make a statement on the matter. [70630/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_162",
          "debateSectionId": "dbsect_162",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_140",
        "questionNumber": 140
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  My department and the National Council for Special Education (NCSE) have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and beyond.  As you are aware parents were asked to notify the NCSE of their requirement for a special educational placement for the 2026/27 school year by 1 October 2025.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is envisioned that many of these special classes will be sanctioned by 31 December 2025.  In order to ensure new special classes can open as quickly as possible the NCSE prioritise working with medium and larger primary schools who do not already have a special class and have available accommodation to accommodate new special class. This approach maximises the use of existing space which can be reconfigured efficiently while also ensuring that new provision continues to be established. It also increases number of schools with special classes providing parents with greater choice and reducing the distances that some children are travelling to access a special class place.  However, as in other years where schools have no available accommodation, particularly at post-primary level and there is known demand in a local area, my department will continue to provide additional classroom accommodation to provide necessary places.  The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will be become available through the normal movement of children leaving primary or post-primary school.  The school referred to by the Deputy already has 3 special classes and any school willing to open further new special classes is to be commended.  I can confirm that a request to meet with this school has been received by my office and remains under consideration.  The NCSE will assess what additional provision is required in local areas and what schools have capacity to accommodate required provision. My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 153. Deputy Cian O'Callaghan asked the Minister for Education and Youth if she will fulfil the commitment made by the previous Minister and meet with the principal of a school (details supplied) to discuss the urgent need for additional autism class provision within the school, and wider community; and if she will make a statement on the matter. [70629/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_176",
          "debateSectionId": "dbsect_176",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_153",
        "questionNumber": 153
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 458. Deputy Cian O'Callaghan asked the Minister for Social Protection the reason the disability allowance is means-tested for couples who are cohabiting; and if he will make a statement on the matter. [70988/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_449",
          "debateSectionId": "dbsect_449",
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_449.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_458",
        "questionNumber": 458
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 18. Deputy Cian O'Callaghan asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [65859/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_18",
        "questionNumber": 18
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  A well-functioning housing market is crucial to supporting labour mobility, improving competitiveness and ensuring that Ireland remains an attractive location for both domestic and foreign investment into the future.  The newly released National Housing Plan targets the delivery of 300,000 new homes from 2025-2030. High density housing, such as apartments, will form a significant portion of these, in line with changing demographics and in order to achieve national policies on compact growth aimed at creating more sustainable communities.  A number of reports have been published by my Department, most recently in June 2024: “The availability, composition and flow of finance for residential development”. This report found that there is reasonable access to finance for viable residential developments. However, there are certain segments in particular where viability is challenged and there is constrained access to finance, including funding apartment development for the private market.  Even given record levels of State spending allocated for housing, private capital will be required to meet the majority of our housing need. As such, it is important to create an environment where we can continue to attract private investment, both domestic and international.  For this reason, Budget 2026 contained a number of measures to support the housing sector, and in particular the construction of apartment developments. These include the reduction in VAT on apartments, the enhanced corporation tax deduction for certain apartment construction costs, and enhancements to the Living City Initiative, which encourages people to regenerate and live in historic buildings in the centre of Irish cities.  Apartment development at scale will play an important role in meeting our housing targets. However, in recent years we have seen a retrenchment of private capital from the funding and development of apartments, because these developments are costly, capital intensive and higher risk. Investment in the Private Rental sector in Dublin is estimated to have fallen from €2.0bn in 2019 to €166m in 2024.  The measures introduced in Budget 2026, in tandem with more structural measures related to areas such as planning, apartment design and infrastructure, are all elements of a whole of Government approach aiming to improve viability, increase supply and help create a long-term sustainable housing system that reflects our nation’s needs. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 39. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the research carried out by his Department into the potential fiscal and housing market impacts of the new tax reliefs for property developers announced as part of Budget 2026; and if he will make a statement on the matter. [64338/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_59",
          "debateSectionId": "dbsect_59",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_39",
        "questionNumber": 39
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Ireland Strategic Investment Fund (ISIF) portfolio is constructed within the legislative framework set for it by the Oireachtas. ISIF has, to date, completed several divestment programmes and excluded investments from the Fund. Exclusion is used on a limited basis, reflecting exclusions mandated by legislation including the Fossil Fuel Divestment Act 2018 and the Cluster Munitions and Anti-Personnel Mines Act 2008 and, inter alia, exclusions on sustainable investment grounds including Tobacco and Nuclear Weapons.  I assume the Deputy is referring to the UN Human Rights Council database (the UN Database) identifying businesses involved in specific activities in the Occupied Palestinian Territories which was first issued in 2020, updated in June 2023 and most recently updated in September 2025 as mandated by the UN Human Rights Council.  ISIF has taken an investment decision to divest from six companies, all of which remain on the updated UN Database, with a total value at the time of the divestment decision of approximately €2.95m. The six companies are Bank Hapoalim BM; Bank Leumi-le Israel BM; Israel Discount Bank Ltd; Mizrahi Tefahot Bank Ltd; First International Bank Ltd and Rami Levi Chain Stores Ltd.  ISIF holdings at the end of 2024 as per the updated UN Database are listed below.      Security Description      YE 2024 Direct      YE 2024 Indirect      YE 2024 Total       Airbnb INC    440,000    -     440,000       Altice    -    390,000     390,000       Booking Holdings    1,140,000    460,000     1,600,000       Expedia Group    -    990,000     990,000       Heidelberg Materials    100,000    -     100,000       Motorola Solutions    2,490,000    290,000     2,780,000        TOTAL      4,170,000      2,130,000      6,300,000      I have been informed that ISIF will continue to monitor its holdings to ensure that investments remain aligned with its risk profile and investment parameters but it does not comment on individual investments. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 50. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance if he will ensure the Irish Strategic Investment Fund is fully divested from all companies, directly and indirectly, involved in illegally occupied Palestinian territories; and if he will make a statement on the matter. [64339/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_69",
          "debateSectionId": "dbsect_69",
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_50",
        "questionNumber": 50
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 34 and 61 together.  The Government is aware of the impact that increased mortgage interest rates has had on some borrowers over recent years.  It is important to note that the determination of retail lending rates is a commercial matter for individual lenders. Now that official interest rates have reduced, the Government expects all mortgage creditors to keep their lending rates under review.  Recent Central Bank of Ireland data indicates that mortgage interest rates have declined over the past year. At the end of September, the weighted average interest rate on all outstanding mortgages held by banks was 3.44%, down 16 basis points from 3.60% a year earlier.  For the non-bank sector, the weighted average interest rate on outstanding mortgages was 3.78% down 61 basis points from 4.39% a year earlier. For those entities in the non-bank sector which do not engage in new lending, the average interest rate on outstanding mortgages at end-September 2025 was 3.91%, down 141 basis points from 5.32% a year earlier.  In relation to new mortgages, as at end September the weighted average interest rate on all new mortgage agreements 3.59%, down 49 basis points annually.  The Government, the Central Bank and the industry have taken steps to assist all borrowers in response to higher mortgage interest rates. Budget 2026 maintained the mortgage interest tax credit at the current level for a further year and at a reduced level of relief for the subsequent year.  The Central Bank regulatory framework offers strong protection for consumers and requires that all regulated entities, including banks, retail credit firms and credit servicing firms, are transparent and fair in all their dealings with borrowers. In this regard, the revised and strengthened Consumer Protection Code will come into effect next March.  The industry has also adopted an aligned industry-wide set of initial eligibility criteria to facilitate switching mortgages from a non-bank to a bank and it has introduced a bespoke website, entitled 'it's in your interest', to further encourage and assist the mortgage switching process. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 61. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Finance the action he is taking to reduce extremely high interest rates being charged to some mortgage holders whose mortgages were sold to non-bank lenders after the crash; and if he will make a statement on the matter. [64340/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_54",
          "debateSectionId": "dbsect_54",
          "showAs": "Mortgage Interest Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_54.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_61",
        "questionNumber": 61
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The large scale capital project for the school referred to by the Deputy is the provision of a new 600 pupil school building including all associated ancillary accommodation.  I am pleased to inform the Deputy that the project was authorised to proceed to tender on 12 November. Tender submissions are expected in January 2026, to allow for the Christmas holiday period, but may be subject to an extension if requested. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 428. Deputy Cian O'Callaghan asked the Minister for Education and Youth if a new school building project (details supplied) has gone to tender; if the tender has been published on eTenders; the deadline for tender submissions; and if she will make a statement on the matter. [69921/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_381",
          "debateSectionId": "dbsect_381",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_381.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_428",
        "questionNumber": 428
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  There are a number of significant proposals for capital investment at Beaumont Hospital, and all are progressing through the requisite design and planning stages. All of these proposals are being managed through the HSE capital development process in line with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation’s Infrastructure Guidelines.  As a live hospital campus there is an added complexity in terms of planning, sequencing and enabling each of these projects. Our Model 4 acute hospitals require extensive enabling works to support upcoming larger projects. These key enabling pieces are ongoing at Beaumont.  In May 2025, the proposed new Emergency Department received a final grant of planning. The project has now progressed to detailed design stage.  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1025. Deputy Cian O'Callaghan asked the Minister for Health to provide an update on the new emergency department for Beaumont Hospital; and if she will make a statement on the matter. [69922/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_851",
          "debateSectionId": "dbsect_851",
          "showAs": "Emergency Departments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_851.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1025",
        "questionNumber": 1025
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As the Deputy may be aware my department has overarching responsibly for public service pension policy including pension appeals. Circular 16/2020 titled ‘Internal Dispute Resolution (IDR) procedure for pension appeals in relation to beneficiaries/disputed beneficiaries of pre-existing civil service pension schemes and of certain public service pre-existing pension schemes’ replaces all previous circulars/letters/guidance issued on pension appeals/IDR procedures relating to pre-existing schemes in the:  • the civil service, and  • the public service where it is specified in either the governing legislation establishing the body, or in the pension scheme rules, that I as Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation (or formerly Minister for Finance) am responsible for making the determination.  The circular does not grant a right of appeal to the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation (M/PER) where none exists, and it is noted that certain other public service schemes do not have a right of appeal to M/PER in respect of pension disputes. The circular simply lays out the procedure to be followed in cases where there is a route of appeal to M/PER set out in the relevant pension scheme rules and/or a body’s establishing legislation.  Given the quasi-judicial nature of the pension appeal process, and for impartiality reasons It is not possible to engage with appellants in relation to the outcome of their appeal while consideration of their appeal is ongoing. Section 7 of the circular states that:  “From the time a person commences the formal appeal process (see Stage 2 in appendix) until a determination has issued, the appellant should receive no communication either in writing or verbally to indicate the possible success or failure of their appeal. This approach is necessary given the quasi-judicial process involved…”  The circular provides an indicative timeline of three months for a Notice of Determination to issue from receipt of the full information required to assess an appeal.  In some cases, a longer timeline may be necessary. This can arise when there is a substantial volume of documentation submitted, where the matters being considered are particularly complex and/or where third-party advice is required. In addition, there are a large number of pension appeal cases on hand with my department at present which require detailed and careful consideration.  While it is not possible to provide appellants with revisions to the indicative timeline set out under the circular on an ad-hoc basis, I wish to advise that my department is committed to progressing pension appeals received to a conclusion in as short a timeframe as possible.  As outlined in Circular 16/2020 should an appellant have a query connected to this circular they can contact their relevant HR Unit. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 260. Deputy Cian O'Callaghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the reason he is the sole decision maker in pension appeals in circular 16/2020; the reason his Department does not engage directly with claimants during the appeals process; the reason published processing timelines differ from actual timelines; if he will ensure that where delays arise, including where expert input is required, his Department provides claimants with updates and revised timelines; and if he will make a statement on the matter. [68980/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_249",
          "debateSectionId": "dbsect_249",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_249.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_260",
        "questionNumber": 260
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 13 to 23, inclusive, together.  Regulation, and the extent of any regulatory or administrative burden, has recently become a greater focus at European Union level and nationally as a means to further enhance competitiveness. At a European level, both simplification and implementation are important Commission priorities. The Commission is striving to simplify and lighten the administrative burden of European Union regulations to ensure they are proportionate, stable, coherent and technologically neutral.  Likewise, our national regulatory framework is a central focus for the Government as we strive to support competitiveness at a time of international economic uncertainty. In line with the programme for Government, we published an action plan on competitiveness and productivity on 10 September this year. The action plan includes actions across government to ensure the development of a more effective regulatory system which will support economic growth.  These actions reflect priority areas where targeted public policy intervention can have the greatest impact. These include a red-tape challenge to reduce regulation for SMEs; the application of the SME test by Government Departments to all measures, in particular policy initiatives where it is proposed to increase costs on small businesses; expediting the Environmental (Miscellaneous Provisions) Bill; commencing reforms, as we have done, under the Planning and Development Act 2024 to enhance delivery of infrastructure; and implementing the outstanding recommendations from the review of the administration of civil justice review group report.  Increased regulatory burden has also been identified as a barrier to infrastructure development and delivery. The Minister, Deputy Chambers, supported by the work of the accelerating infrastructure task force, this morning, with Government colleagues including me, the Tánaiste and the Minister of State, Deputy Harkin, published a plan which will include extensive regulatory reforms aimed at accelerating the delivery of critical infrastructure.  Today's plan provides the blueprint to reduce complexity and blockages in the system and deliver infrastructure with urgency. The changes we are initiating today are vital if we are to maintain our competitive position in an ever uncertain world. They are also necessary to support our citizens with top class public services, job security, access to housing and all other facilities necessary to enjoy the stability and good quality of life we are all entitled to expect.  The actions are ambitious but achievable, and delivering them will require commitment and co-operation across a broad and diverse range of stakeholders, from political, legal and public sectors, industry and society as a whole. We have established a cost-of-business advisory forum where business owners and representative bodies can speak directly to decision-makers about the real-world impact of regulations, fees and operational challenges. The work of that forum is under way. The Minister, Deputy McEntee, is working on the simplification omnibus packages put forward by the European Commission in a range of policy areas, most recently the Commission's digital simplification omnibus package, which was published last month.  My Department will play a co-ordinating role across these different regulatory reform initiatives, as outlined in the action plan on competitiveness and productivity, including the establishment of a central economic regulators' forum, and we will work with the Minister for Enterprise, Tourism and Employment and other Government colleagues on that agenda. \n Deputy Tony McCormack  I thank the Taoiseach for his response. I acknowledge the significant work he, the Minister, Deputy Chambers, and their two Departments are doing on infrastructure reform, particularly the steps being taken to modernise planning, reduce delays and ensure major projects move forward. Infrastructure reform is vital, but businesses and especially SMEs are also calling for a more streamlined regulatory environment. These firms consistently cite overlapping rules, slow approvals and heavy administrative demands as major obstacles to growth. Building on the work already happening on infrastructure, will the Taoiseach update the House on what specific measures his Department is pursuing to simplify compliance for SMEs, reduce unnecessary paperwork and make it easier for businesses to operate and expand? How will these reforms help to lower costs for employers and the taxpayer by making the system more efficient overall? \n Deputy Albert Dolan  It is vital that when we speak about regulatory reform, we talk about the administrative operations of existing systems in the function of the State. I will specifically reflect on the Sustainable Energy Authority of Ireland, SEAI, and the roll-out of grants. We are about to have a debate in this Chamber on energy costs. One thing that is vital is that the best way the Government can help to reduce energy costs in homes is to retrofit them for the future so that they simply do not need as much energy. That is the number one way to reduce the cost and it facilitates homes to be more efficient and takes pressure off the grid. The Government needs to do something to accelerate the rate at which homes can be retrofitted by the SEAI. For many constituents in my constituency, it is taking too long to get through the process of approval of the grant to construction. \n Deputy Ruairí Ó Murchú  We all accept there are huge issues with bureaucracy and red tape in planning. We should have seen simplification and streamlining. Conversations about this are occurring across Europe, but we know about the home-grown issues. It is an issue I have brought up previously, even within the planning systems involving State authorities. For example, Louth County Council is involved in the Ardee Education Together National School build and a particular issue has arisen. We do not have enough agility in the system. Multiple requests have gone in stating that there are not enough parking spaces. There are 21 spaces, including three disability spaces. There are only two set-down spaces for minibuses and there is a need for five as there are five autism spectrum disorder, ASD, classes and there is not even room for a full-size 52-seater bus to turn. There are 21 spaces for staff and there is a need for something closer to 40. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruairí Ó Murchú  It is possible to get this work done at this time, but if the works continue as planned, the problem will still need to be fixed but it could take more than €100,000, so we need something to be done. \n Deputy Darren O'Rourke  I raise the regulation of social media companies in the online space, particularly as it relates to children. The criticism that has been levelled at Coimisiún na Meán's online safety code is that an earlier draft had a recommendation that social media companies turn off recommender systems and it has been removed. Recommender systems profile people who are using apps and then drive them down often hateful and dangerous rabbit holes. It is not healthy for them or society. Will this be looked at? \n Deputy Ruth Coppinger  I raise regulatory reform of immigration and particularly family reunification. It is now being made much harder for many essential workers to be unified with their families, in particular migrant healthcare assistants who were brought over here on a visa programme and are working in private nursing homes. Last week on RTÉ radio, the Minister for justice was asked by the presenter whether these people are not entitled to a normal family life. They are caring for our older people and we have to show we care for them. The Minister's reply was that no one is forcing them to come here. That is absolutely heartless, shows zero empathy and is also completely counterproductive because many of them are nurses. They could go to other countries, but they have come to Ireland and are working below their grades or qualifications, giving huge added value to the nursing homes. I urge the Taoiseach to have a heart. We had a briefing here a few years ago, which Deputy Michael Healy-Rae attended because he knew the value of those healthcare assistants in nursing homes. These are essential workers and they will go elsewhere. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruth Coppinger  Please entitle them to have a normal family life. These mothers should not be separated from their kids. \n Deputy Paul Murphy  The programme for Government says the Government will move responsibility for the Multi-Unit Developments, MUD, Acts to the Department of housing from the Department of justice and establish a unit in the Housing Agency to regulate owners' management companies, OMCs, to ensure effective governance. That is important work that needs to happen. The problem is that it is not happening currently, but it has been agreed. Effectively what is holding it up is that, as a result of the Mulcreevy judgment, the primary legislation needs to be changed. At the moment, the MUD Act refers to the Minister for justice and not the Minister for housing. A simple amendment is needed to change the reference to the Minister for housing. Until that happens, all this work of regulatory oversight of OMCs and so on is simply not taking place. There was a meeting of the housing committee to discuss these issues. It invited various officials from the Department of housing and was told they could not come yet because their line Minister is not yet responsible for this. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Paul Murphy  The Housing Agency has not been allocated funding for doing any regulatory work as a result. This needs urgent action. \n Deputy Liam Quaide  There was a health committee session last week on the regulation of counselling and psychotherapy. In standards it has published, CORU has adopted a position that is entirely at odds with the main representative groups of those disciplines, which will reduce supervision requirements and remove mandatory personal therapy for trainees. These changes, if implemented, will degrade professional standards and undermine patient safety. CORU is showing a remarkable level of intransigence on these fundamentals of safe practice. Practitioners and representative bodies have warned that the proposals could also jeopardise recognition and mobility across the EU for counsellors and psychotherapists. We must protect high-quality training, preserve public confidence and ensure regulation strengthens, not weakens, these services.  I am not expressing some fringe opinion. The health committee was unanimous in supporting the counselling and psychotherapy representative groups and the session included some strong and insightful contributions from the Taoiseach's party colleagues, including Senator Costello. Will the Government immediately pause the CORU process, bring representative bodies and practitioners into full consultation and commit to reforms that prioritise client safety and high professional standards? \n Deputy Rose Conway-Walsh  I will talk about the regulation of quarries. The Taoiseach knows the price we have paid in this country and the price that families affected by the defective concrete blocks scandal have paid due to a lack of regulation.  Many of the homeowners I have spoken to in Mayo are not satisfied with the current regulations of quarries and in particular, that geologists are not examining the aggregate within the quarries that are being used to build homes now. I ask the Taoiseach to have a look at this area to see what can be done in that regard. It can be easily fixed by engaging and employing geologists to do the job and to make sure that people have confidence in the materials that are coming out of quarries. \n Deputy Richard Boyd Barrett  The Taxi Regulation Act 2013 clearly gives the Minister the power to impose regulations around the activities of dispatch companies. Today, for the third time in two weeks, taxi drivers in Dublin are protesting. There is a widespread protest against this across the country by taxi drivers over the behaviour of Uber, a multimillion euro company, that is trying to undermine the livelihood of nearly 20,000 taxi drivers by introducing a fixed fare system. This will undermine the regulated fare structure and therefore the livelihoods of taxi drivers and ultimately the industry itself. In the long run, as is clear from Uber's behaviour elsewhere in the world, it will not benefit the customer. Once the company gets hold of a market, fares and charges go up and the livelihoods of taxi drivers get smashed. Will the Taoiseach ask the Minister for Transport to impose such regulations to prevent Uber destroying the industry and livelihoods of taxi drivers around this fixed fare system and enforce the taxi regulation and meter stuff? \n The Taoiseach  Deputy McCormack raised infrastructure reform, particularly for small to medium-sized businesses. Some of the measures we have taken in respect of deferring the alignment of the minimum wage with the national living wage will help to avoid the escalation of costs because the SME sector has borne the brunt of a lot of additional costs over the past five years. There is no doubt the reduction in VAT on hospitality will help a lot of SMEs in the hospitality sector and hairdressing as well. The number of sick days leave is going to be quickly expanded. We have expanded it to three days. The cumulative cost of everything has been fairly excessive. The Small Business Forum is there to try to balance imposition on small business as well as the cost.  The other issue is the sequential approach to planning and regulations as opposed to a concurrent approach whereby instead of waiting for the planning to be done, agencies do the procurement. Instead of waiting for environmental assessments, doing them all in parallel would speed up a lot of activity. In many instances, we are constantly looking at the avoidance of increased cost for SMEs and trying to slow down the increased costs that have come their way. It is interesting the rate of youth employment has crept up in the past six to nine months. I believe that is related to costs on SMEs.  Deputy Dolan is correct that retrofitting is the most effective way to reduce costs. Between 2019 and September 2025, the Government provided over €1.5 billion in support to homeowners for over 228,000 upgrades, including 30,000 fully funded retrofits under the warmer homes scheme. It is estimated that if a deep retrofit is done, it can save a household up to €1,100 per year in energy costs. I get the Deputy's point that the administration of it needs to be faster. There is also resource demand in respect of it as well with some people not being able to afford to do retrofits because of the cost.  On Deputy Ó Murchú's issue, I do not have the specifics on Ardee Educate Together National School. I do not know what the interaction with the county council is, but in any event----- \n Deputy Ruairí Ó Murchú  The refusal to change----- \n The Taoiseach  They should sort it out. A school is an important facility. The county council should be facilitative in the building of a school. \n Deputy Ruairí Ó Murchú  It is not just the council. \n The Taoiseach  Deputy O'Rourke raised regulation online. We have now established the regulatory framework governing online. There is ongoing review in respect of it. Children must be protected. That has to be the optimal.  Deputy Coppinger raised healthcare assistants and family reunification. We have significant reunification in Ireland under our migration system, in particular when people leave direct provision who have residency. The Minister will bring forward legislation in respect of this and these are issues we can discuss in greater detail at that stage.  On Deputy Murphy's point, I will talk to the Ministers responsible. There has to be proper regulation of management companies. There are fundamental rights involved in terms of those complexes. I will pursue that with the Minister and see where we are in terms of amendment to primary legislation.  Deputy Quaide raised the issue of counselling and psychotherapy. On qualification frameworks and regulators generally, we want more therapists, but they have to be highly qualified. Public health is number one and the protection of the consumer. In some instances, they can be quite protectionist as well. The judgment called for regulators and I would like CORU to get the judgment right in terms of not having the bar so high that there are only highly qualified, and others are not. That is not just in terms of therapy and counselling; that is in terms of teaching and a range of other issues.  Deputy Conway-Walsh raised the regulation of quarries. I will talk to the Minister involved in that. We can overregulate too but I take the Deputy's point about the quality of aggregate and quality of the product. There are existing systems to deal with that. The SEAI is there. There are various regulatory bodies to deal with the quality of materials, but I will talk to the Minister in respect of that. New bodies were set up after the defective blocks scheme.  Deputy Boyd Barrett raised taxi regulation. I will talk to the Minister about the issues that the Deputy raised. There is a balance between consumers, those availing of taxis and the regulation of same. We had regulation a long time ago; it did not work. There was always an imbalance between supply and demand. I will look at this and will talk to the Minister for Transport in respect of it. He is fully aware of it. \n An Ceann Comhairle  We have a delegation of students visiting from Ukraine as our part of our EPAS programme hosted by Maynooth Post Primary School. They are most welcome. We had their president here yesterday, which we enjoyed immensely. ",
        "questionType": "oral",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 18. Deputy Cian O'Callaghan asked the Taoiseach for an update on his Department’s plans to co-ordinate a range of actions aimed at regulatory reform. [63906/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Regulatory Reform",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_18",
        "questionNumber": 18
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling students with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The NCSE is the statutory agency with responsibility for the provision of special education places.  All schools must notify the NCSE when a child or young person is enrolled in a special class or special school place. In addition to this information source, the NCSE also completed an exercise at the start of this school year to examine the number of vacant places in existing special classes. 782 vacant special class places were identified.  These are the confirmed number of available special class places as at the start of this school year as reported by schools to the NCSE.  Please note that children and young people may take up some of these places on an ongoing basis through this school year 2025/2026.  It is accepted that these available places may not always be in an area that some children and young people wish to apply to for the upcoming school year. Parents can contact the NCSE who will provide advice and support to where vacancies are.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 142. Deputy Cian O'Callaghan asked the Minister for Education and Youth if figures provided by her Department, to a newspaper are accurate (details supplied); the methodology her Department used to classify a special class place as vacant; if places counted as vacant are fully operational, and appropriately staffed; and if she will make a statement on the matter. [68311/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_134",
          "debateSectionId": "dbsect_134",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_134.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_142",
        "questionNumber": 142
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year. 407 new special classes were sanctioned for the 2025/26 school year. Five new special schools were also sanctioned for 2025/26.  The NCSE has advised my department just under 3,300 valid notifications were received by mid-February via their new parent notify service. While parents were asked to notify the NCSE by mid-February the NCSE received further notifications after this date. The NCSE advise that a number of special class vacancies remain in every county in the country.  It is expected that a similar number of special class and special school places may need to be provided over each of the next few years, that was provided in recent years. As more and more special classes open in primary schools and as the overall level of enrolments at primary level reduce, it is expected that over time the normal annual progression of students from primary special classes to post-primary will provide a significant number of places each year for younger students seeking a special class placement. At post-primary level, my department has already written to all schools asking them to prepare to provide on average four special classes each.  The NCSE is currently collating the data and information received by 1 October through the parents notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is envisioned that the majority of these special classes will be sanctioned by 31 December 2025.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the timeline and process.  The NCSE report a very significant level of engagement and contact from families before 1 October.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 143. Deputy Cian O'Callaghan asked the Minister for Education and Youth the number of parents who have submitted a notification to the NCSE, by the 1 October deadline, requesting a special school place for the 2026-2027 school year in Dublin, broken down by postcode, in tabular form. [68312/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_135",
          "debateSectionId": "dbsect_135",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_135.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_143",
        "questionNumber": 143
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Delivering Equality of Opportunity in Schools, known as the DEIS programme, is a Department of Education and Youth policy which aims to reduce educational disadvantage. Our lady Mercy School, Beaumont, Dublin 9 is a DEIS Secondary school and all DEIS secondary schools have access to the School Meals Programme.  The Hot School Meals Programme is for Primary Schools. My immediate priority is to complete the roll-out of Hot School Meals to all Primary Schools in 2025/26 academic year. However, we will commence the rollout of Hot School Meals to all secondary schools over the lifetime of this government.  Our lady Mercy School, Beaumont has made an application for the School Meals Programme on the 3rd October 2025. We have requested further information from the school and my officials have followed up with a phone call. The school has confirmed that it will send in the information required and as soon as this is received, a decision will be made. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 167. Deputy Cian O'Callaghan asked the Minister for Social Protection if secondary schools that entered the DEIS programme from 2022 onwards are excluded from the school meals scheme; the reason a school (details supplied) has not yet been able to access funding for hot school lunch provision; when this school will be able to access funding; and if he will make a statement on the matter. [68310/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_158",
          "debateSectionId": "dbsect_158",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_158.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_167",
        "questionNumber": 167
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Central Statistics Office (CSO), as the national statistical agency, is responsible for the compilation and publication of all crime statistics.  The CSO produces these statistics using data recorded on An Garda Síochána’s PULSE system and makes regular releases in relation to various crime statistics. The most recent statistics were released on 24 September 2025, providing statistics for Recorded Crime for Quarter 2, 2025.  Recorded crime statistics are published by the CSO for Burglary and Related Offences at Garda Station level, including Coolock, Raheny, Howth and Clontarf, annually for the 2003 to 2024 period: www.data.cso.ie/table/CJA07  Alternatively, recorded crime statistics are published by the CSO for Burglary and Related Offences at Garda Division level (including DMR North) quarterly for the Q1 2003 to Q2 2025 period:  www.data.cso.ie/table/CJQ06. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 426. Deputy Cian O'Callaghan asked the Minister for Justice, Home Affairs and Migration the number of reported burglaries and related offences to date in 2025 in Coolock, Raheny, Howth and Clontarf Garda stations, in tabular form. [67758/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_377",
          "debateSectionId": "dbsect_377",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_377.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_426",
        "questionNumber": 426
      },
      "contextDate": "2025-12-02"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 16. Deputy Cian O'Callaghan asked the Taoiseach if he will report on the programme plan for his Department's new disability unit for 2025-2027. [61464/25] ",
        "answerText": " An Ceann Comhairle  We have 15 to 16 minutes left. There are 20 Deputies to speak on the next question. I propose to divide the time remaining after the Taoiseach's opening statement between a number of Deputies. \n The Taoiseach  It is a brilliant statement. \n An Ceann Comhairle  The Taoiseach will have to try to be brief. \n The Taoiseach  I jest. \n Deputy Peadar Tóibín  It is all in the delivery. \n The Taoiseach  I will try to cut it short to allow others to come in. I propose to take Questions Nos. 14 to 35, inclusive, together.  I established the disability unit in the Department to bring about a renewed focus and urgency and out of a desire to drive progress on disability issues. The unit's first programme plan, published in September, outlines how the unit will drive the delivery of the Government's new national disability strategy, working across government to make the ambitions a reality. In particular, the unit will look to drive innovation, to get things done, to bring momentum to policy implementation, to troubleshoot, where appropriate, to improve the delivery of services, and to get strategic thinking on future challenges. The unit will also support the Cabinet committee on disability.  The first programme plan for the unit outlines ten priority areas for the period from 2025 to 2027 across five workstreams. The first workstream relates to transforming children's disability services, early years education and health. The second is about increasing system capacity and the third is about opening doors and addressing barriers to employment pathways and supports. The fourth relates to implementing the national disability strategy and the fifth is on planning and designing for the future. The programme plan allows for further workstreams to be assigned to the unit as may be needed.  We do not want to duplicate the work of Ministers or Departments but to support them in improving services and getting things done. It is already up and running. The Cabinet committee on disability has met five times to date. With the support of the unit, we have looked at the new national disability strategy. As the House will know, that has gone through and has now been published. The provision of therapists in special schools is up and running. Some €16 million has been allocated for that this year. There have also been improvements to the delivery of services and the assessment of need process is being reformed, which includes legislative reform.  The budget was impacted by the unit and the Cabinet subcommittee and there was a significant focus on disability, particularly the income disregards for carer's allowance, among other initiatives and payments. The budget also provided a record €3.8 billion allocation towards specialist disability services. This represents a 20% increase year on year. That is to provide permanent dedicated funding for essential disability services. The investment in children's disability services will provide therapy services and strengthen the children's disability network teams through the provision of additional staff and so forth. Some €20 million was targeted at the assessment of need waitlist initiative, providing up to 6,500 clinical assessments. We are developing our budget spotlight on disability. That will be published in due course. It relates to the last budget but will also provide further thinking with regard to future budgets. We are also looking at developments in the area of transport and mobility. We are awaiting proposals from the Departments of Transport and Finance in that regard. \n An Ceann Comhairle  I propose to take the first six Deputies and to allow the Taoiseach six minutes to respond. \n Deputy Pádraig O'Sullivan  This is a topic the Taoiseach is very familiar with. He has visited the Rainbow Club on dozens of occasions at this stage and knows the great work that Jon, Karen and the board do. When Senator Rabbitte was the Minister of State, she was the first to allocate funding to the Rainbow Club under a service level agreement to provide respite care for children. As the Taoiseach will know, every week, over 1,200 children avail of this service, which is provided on a shoestring budget. The Taoiseach will be very familiar with the difficulties the club had in acquiring a nearby site, the former HSE ambulance building. It now has that building and has been lucky enough to engage an architect who is a professional in this field pro bono to design a bespoke building that is fit for the club's purposes. We need to move this project on. We need the HSE and the Government to support it financially to deliver it. It is going to be a massive undertaking for the charity. What is the Taoiseach's office going to do to advance the project? \n Deputy Ruairí Ó Murchú  The National Human Rights Strategy for Disabled People 2025-2030 was launched with great fanfare but we await the action plan. There is much talk of accountability. Will the Taoiseach give me a timeline for the introduction of that action plan? Who will be taking the lead, particularly with regard to oversight and accountability? Will it be the unit, the Cabinet committee or the Department of Children, Disability and Equality? How exactly will it work? How will we see improvements, whether in relation to assessments and therapies or the low level of disabled people who are involved in employment and the need for schemes that actually work? A lot of work is needed to make schemes such as the wage subsidy scheme and the work and access programme fit for purpose. \n Deputy Cian O'Callaghan  The level of unemployment among disabled people in Ireland is among the worst in Europe. I recently met with a number of disabled people in my constituency who have excellent qualifications and skills and who are willing and eager to work but who are stuck in unemployment. There are a number of barriers to employment that need to be removed. We are far behind other European countries in this regard. In 2021, the OECD released a report that made a number of recommendations as to how to tackle this. Those recommendations have still not been implemented. When will they be implemented in full?  What is the Government doing to tackle the scandalously high unemployment levels for disabled people in Ireland? \n Deputy Barry Heneghan  Bhí mé ag caint faoi seo dhá sheachtain ó shin agus an tseachtain seo caite. An rud atá i gceist ná Stapolin Educate Together National School in Baldoyle, which has a petition. Children from the school were in the Dáil last week. It needs two autism classrooms to be sanctioned by the Minister. There are eight children in mainstream classes with eligibility letters and a further 30 in the catchment area who are on waiting lists. This is a huge priority for me and I would love it to be addressed. \n Deputy Richard Boyd Barrett  David and Nicole have a five-year-old son with autism, and an older son. They live in a maisonette, which is 29 sq. m. It is absolutely tiny and rank with damp. Because of his autism, their son has serious sensory processing issues. He is a flight risk. I know these flats well. They have very dangerous concrete steps, which are a serious risk to him. Occupational therapists, medical professionals and people in school have said that he has to be got out of there as he cannot develop or do his occupational therapy if he is living in these conditions. Dún Laoghaire-Rathdown County Council says autism is too prevalent in the community to give it medical priority. That is outrageous. The prevalence of a condition is not a reason to say it is not a priority if the child is in danger. If a child is in danger, it is a priority to get the child out of danger. \n An Ceann Comhairle  I appreciate that. The Taoiseach has the message. \n Deputy Richard Boyd Barrett  I would like there to be an intervention on that. \n Deputy Paul Murphy  The budget was a savage attack on disabled people. It took over €1,000 out of the pockets of disabled people and betrayed the promise in the programme for Government to introduce a permanent annual cost-of-disability support payment. The last time I asked about this, the Taoiseach claimed the cost of disability would be looked at in the next budget. The cost-of-living crisis is now. The cost-of-disability crisis is now. Some 70,000 people who are disabled or have a long-term illness are living in poverty. That is one in three. I have been inundated with emails from disabled people asking for winter cost-of-living and cost-of-disability payment. Many will be forced to choose between heating and eating this Christmas. They also want a permanent cost-of-disability payment without further delay. The Taoiseach has billions of euro in surplus. Do not be a Scrooge this Christmas. Please act on it. \n Deputy Peadar Tóibín  The children's disability network team, CDNT, in Meath is not fully staffed. According to statistics I received today, there are 20 vacant posts across disability teams in Kells, Dunshaughlin, Navan, Slane and Trim. Separate data received by Aontú today show that the Government is actually reducing the number of college places for speech and language therapists, from 370 in the year before Covid to 355 last year. The Government is reducing the number of students filling the necessary college places on an annual basis. What is the Taoiseach saying to parents whose children have been waiting for 14 months to see the CDNT in County Meath and to the children who are being bounced around endlessly from CAMHS, the CDNTs and other services? \n An Ceann Comhairle  Before the Taoiseach replies, could he maybe answer the other Deputies in writing?  Sixteen Deputies did not get to ask questions. They might get some form of response from the Taoiseach. \n The Taoiseach  You can bring some more of them in if you want, a Cheann Comhairle. \n An Ceann Comhairle  Only if the Taoiseach needs less time. We cannot go over the 45 minutes provided. \n The Taoiseach  I am not going to write replies to oral questions. I have given an overall response to everybody. \n An Ceann Comhairle  I am bound by the timelines set down. \n The Taoiseach  Do I have six minutes remaining? \n An Ceann Comhairle  Yes. \n The Taoiseach  I will get around to everybody who has asked a question. \n An Ceann Comhairle  I am talking about the Deputies who have not have not got in. \n Deputy Richard Boyd Barrett  The Taoiseach cannot really answer questions that have not been asked. \n An Ceann Comhairle  I know, but that is it. \n The Taoiseach  It is a new departure if I am going to do a written reply to every oral question. That is not on either. \n An Ceann Comhairle  The Taoiseach should go ahead. I suppose it is just a casualty of how interruptions affect the course of questions. To be fair, the Taoiseach cannot answer a question that has not been asked. We are delaying the answering process. \n Deputy Jennifer Whitmore  Could we even have 30 seconds to ask a question and then maybe the Taoiseach could respond? \n An Ceann Comhairle  No. We cannot go over time. I do not set the time. I do not have that discretion. \n Deputy Jennifer Whitmore  No, but we could stay within the time. \n An Ceann Comhairle  There are 15 Deputies left. \n The Taoiseach  Deputy Pádraig O'Sullivan raised the Rainbow Club, which is doing exceptional work. Jon and Karen O'Mahony have been exceptional leaders in that regard. The former Minister of State, now Senator Rabbitte, did good work on a service level agreement. I was involved in advocating for that building, which was a HSE building, to be allocated to the Rainbow Club. I will certainly continue to work with them and to support them with capital. What is important is that we get a timeline and some idea of how we can progress that as quickly as we possibly can. It is a very good, practical example of how a parent-led, community-based approach can develop services for autism in a nimble and flexible way that has helped so many families.  Deputy Ó Murchú asked about the action plan. That will come.  I do not have an exact date but it is on target. It is fairly imminent. \n Deputy Ruairí Ó Murchú  Who will lead on it? \n An Ceann Comhairle  Please, Deputy Ó Murchú. \n The Taoiseach  The Minister, Deputy Foley, will lead, with the support of the unit in my office, but she will also report to the Cabinet subcommittee, which will then make recommendations to the Cabinet. That is how this will work. The Cabinet subcommittee is very important because all the key Ministers have to be there.  I agree with Deputy Cian O'Callaghan that the unemployment levels among the disability community is too high, and the barriers are too much. Part of the strategy in terms of what I am trying to do with the Minister, Deputy Calleary, is to remove some of those barriers and to create additional supports to make sure that employers are even more incentivised to recruit people. The intention is also to give supports to those who employ people with disabilities on a more sustainable basis. I do not disagree with the Deputy. The historic underemployment of people with disabilities in society is something that is exercising me.  I will pursue the issue raised by Deputy Heneghan about the two autism classes in the Educate Together school in Baldoyle.  I agree with Deputy Boyd Barrett. That is a very strange response from the council referring to the prevalence of autism. Autism is a spectrum, a continuum. There is high-functioning autism, people in the middle and those with autism which is very severe and profound. The council should be able to use the general guidelines in respect of health needs more generally. I am at a loss as to why the council cannot say in this case that the child needs prioritisation and a proper house to facilitate the treatment and life of the child. That is something on which I will go back to the Minister for housing in respect of guidelines to be sent to councils in that respect. I would not have thought it necessary. I thought councils would have enough flexibility to do this.  I disagree with Deputy Paul Murphy's description of the budget as a savage attack, but €3 billion has been invested in special education as an outcome of the budget, as well as €130 million for grants to adapt the houses of older people and disabled people. There was a €10 increase per week in the disability allowance, an expansion of the wage subsidy scheme, an increase of €375 in the income limit for carer's benefit, and a €20 increase in the monthly domiciliary care allowance. That is not a savage attack on disability. We have to pursue the cost of disability and the Minister will bring plans in the next budget in respect of that.  In response to Deputy Tóibín, the vacancy rate nationally has come down for CDNTs. We have increased the allocation of therapy places in third level colleges. \n An Ceann Comhairle  I thank the Taoiseach. Even though there is time left, the point is that this format is not working. The place to discuss that is at the Business Committee on Thursday. I ask Members to bring it up and we can sort out something else. Certainly, where there is a grouping of 19 Members, it is not possible to give the Taoiseach time to answer in the remaining time. I am sorry for those who did not get in but there is just nothing we can do, other than discuss it at the Business Committee and change the format. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_16",
        "debateSection": {
          "showAs": "Departmental Programmes",
          "debateSectionId": "dbsect_17",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/mul@/dbsect_17.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/dbsect_17"
        },
        "date": "2025-11-26",
        "questionNumber": 16,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "oral",
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 34. Deputy Cian O'Callaghan asked the Taoiseach if he will report on the programme plan for his Department’s new disability unit for 2025-2027. [65858/25] ",
        "answerText": " An Ceann Comhairle  We have 15 to 16 minutes left. There are 20 Deputies to speak on the next question. I propose to divide the time remaining after the Taoiseach's opening statement between a number of Deputies. \n The Taoiseach  It is a brilliant statement. \n An Ceann Comhairle  The Taoiseach will have to try to be brief. \n The Taoiseach  I jest. \n Deputy Peadar Tóibín  It is all in the delivery. \n The Taoiseach  I will try to cut it short to allow others to come in. I propose to take Questions Nos. 14 to 35, inclusive, together.  I established the disability unit in the Department to bring about a renewed focus and urgency and out of a desire to drive progress on disability issues. The unit's first programme plan, published in September, outlines how the unit will drive the delivery of the Government's new national disability strategy, working across government to make the ambitions a reality. In particular, the unit will look to drive innovation, to get things done, to bring momentum to policy implementation, to troubleshoot, where appropriate, to improve the delivery of services, and to get strategic thinking on future challenges. The unit will also support the Cabinet committee on disability.  The first programme plan for the unit outlines ten priority areas for the period from 2025 to 2027 across five workstreams. The first workstream relates to transforming children's disability services, early years education and health. The second is about increasing system capacity and the third is about opening doors and addressing barriers to employment pathways and supports. The fourth relates to implementing the national disability strategy and the fifth is on planning and designing for the future. The programme plan allows for further workstreams to be assigned to the unit as may be needed.  We do not want to duplicate the work of Ministers or Departments but to support them in improving services and getting things done. It is already up and running. The Cabinet committee on disability has met five times to date. With the support of the unit, we have looked at the new national disability strategy. As the House will know, that has gone through and has now been published. The provision of therapists in special schools is up and running. Some €16 million has been allocated for that this year. There have also been improvements to the delivery of services and the assessment of need process is being reformed, which includes legislative reform.  The budget was impacted by the unit and the Cabinet subcommittee and there was a significant focus on disability, particularly the income disregards for carer's allowance, among other initiatives and payments. The budget also provided a record €3.8 billion allocation towards specialist disability services. This represents a 20% increase year on year. That is to provide permanent dedicated funding for essential disability services. The investment in children's disability services will provide therapy services and strengthen the children's disability network teams through the provision of additional staff and so forth. Some €20 million was targeted at the assessment of need waitlist initiative, providing up to 6,500 clinical assessments. We are developing our budget spotlight on disability. That will be published in due course. It relates to the last budget but will also provide further thinking with regard to future budgets. We are also looking at developments in the area of transport and mobility. We are awaiting proposals from the Departments of Transport and Finance in that regard. \n An Ceann Comhairle  I propose to take the first six Deputies and to allow the Taoiseach six minutes to respond. \n Deputy Pádraig O'Sullivan  This is a topic the Taoiseach is very familiar with. He has visited the Rainbow Club on dozens of occasions at this stage and knows the great work that Jon, Karen and the board do. When Senator Rabbitte was the Minister of State, she was the first to allocate funding to the Rainbow Club under a service level agreement to provide respite care for children. As the Taoiseach will know, every week, over 1,200 children avail of this service, which is provided on a shoestring budget. The Taoiseach will be very familiar with the difficulties the club had in acquiring a nearby site, the former HSE ambulance building. It now has that building and has been lucky enough to engage an architect who is a professional in this field pro bono to design a bespoke building that is fit for the club's purposes. We need to move this project on. We need the HSE and the Government to support it financially to deliver it. It is going to be a massive undertaking for the charity. What is the Taoiseach's office going to do to advance the project? \n Deputy Ruairí Ó Murchú  The National Human Rights Strategy for Disabled People 2025-2030 was launched with great fanfare but we await the action plan. There is much talk of accountability. Will the Taoiseach give me a timeline for the introduction of that action plan? Who will be taking the lead, particularly with regard to oversight and accountability? Will it be the unit, the Cabinet committee or the Department of Children, Disability and Equality? How exactly will it work? How will we see improvements, whether in relation to assessments and therapies or the low level of disabled people who are involved in employment and the need for schemes that actually work? A lot of work is needed to make schemes such as the wage subsidy scheme and the work and access programme fit for purpose. \n Deputy Cian O'Callaghan  The level of unemployment among disabled people in Ireland is among the worst in Europe. I recently met with a number of disabled people in my constituency who have excellent qualifications and skills and who are willing and eager to work but who are stuck in unemployment. There are a number of barriers to employment that need to be removed. We are far behind other European countries in this regard. In 2021, the OECD released a report that made a number of recommendations as to how to tackle this. Those recommendations have still not been implemented. When will they be implemented in full?  What is the Government doing to tackle the scandalously high unemployment levels for disabled people in Ireland? \n Deputy Barry Heneghan  Bhí mé ag caint faoi seo dhá sheachtain ó shin agus an tseachtain seo caite. An rud atá i gceist ná Stapolin Educate Together National School in Baldoyle, which has a petition. Children from the school were in the Dáil last week. It needs two autism classrooms to be sanctioned by the Minister. There are eight children in mainstream classes with eligibility letters and a further 30 in the catchment area who are on waiting lists. This is a huge priority for me and I would love it to be addressed. \n Deputy Richard Boyd Barrett  David and Nicole have a five-year-old son with autism, and an older son. They live in a maisonette, which is 29 sq. m. It is absolutely tiny and rank with damp. Because of his autism, their son has serious sensory processing issues. He is a flight risk. I know these flats well. They have very dangerous concrete steps, which are a serious risk to him. Occupational therapists, medical professionals and people in school have said that he has to be got out of there as he cannot develop or do his occupational therapy if he is living in these conditions. Dún Laoghaire-Rathdown County Council says autism is too prevalent in the community to give it medical priority. That is outrageous. The prevalence of a condition is not a reason to say it is not a priority if the child is in danger. If a child is in danger, it is a priority to get the child out of danger. \n An Ceann Comhairle  I appreciate that. The Taoiseach has the message. \n Deputy Richard Boyd Barrett  I would like there to be an intervention on that. \n Deputy Paul Murphy  The budget was a savage attack on disabled people. It took over €1,000 out of the pockets of disabled people and betrayed the promise in the programme for Government to introduce a permanent annual cost-of-disability support payment. The last time I asked about this, the Taoiseach claimed the cost of disability would be looked at in the next budget. The cost-of-living crisis is now. The cost-of-disability crisis is now. Some 70,000 people who are disabled or have a long-term illness are living in poverty. That is one in three. I have been inundated with emails from disabled people asking for winter cost-of-living and cost-of-disability payment. Many will be forced to choose between heating and eating this Christmas. They also want a permanent cost-of-disability payment without further delay. The Taoiseach has billions of euro in surplus. Do not be a Scrooge this Christmas. Please act on it. \n Deputy Peadar Tóibín  The children's disability network team, CDNT, in Meath is not fully staffed. According to statistics I received today, there are 20 vacant posts across disability teams in Kells, Dunshaughlin, Navan, Slane and Trim. Separate data received by Aontú today show that the Government is actually reducing the number of college places for speech and language therapists, from 370 in the year before Covid to 355 last year. The Government is reducing the number of students filling the necessary college places on an annual basis. What is the Taoiseach saying to parents whose children have been waiting for 14 months to see the CDNT in County Meath and to the children who are being bounced around endlessly from CAMHS, the CDNTs and other services? \n An Ceann Comhairle  Before the Taoiseach replies, could he maybe answer the other Deputies in writing?  Sixteen Deputies did not get to ask questions. They might get some form of response from the Taoiseach. \n The Taoiseach  You can bring some more of them in if you want, a Cheann Comhairle. \n An Ceann Comhairle  Only if the Taoiseach needs less time. We cannot go over the 45 minutes provided. \n The Taoiseach  I am not going to write replies to oral questions. I have given an overall response to everybody. \n An Ceann Comhairle  I am bound by the timelines set down. \n The Taoiseach  Do I have six minutes remaining? \n An Ceann Comhairle  Yes. \n The Taoiseach  I will get around to everybody who has asked a question. \n An Ceann Comhairle  I am talking about the Deputies who have not have not got in. \n Deputy Richard Boyd Barrett  The Taoiseach cannot really answer questions that have not been asked. \n An Ceann Comhairle  I know, but that is it. \n The Taoiseach  It is a new departure if I am going to do a written reply to every oral question. That is not on either. \n An Ceann Comhairle  The Taoiseach should go ahead. I suppose it is just a casualty of how interruptions affect the course of questions. To be fair, the Taoiseach cannot answer a question that has not been asked. We are delaying the answering process. \n Deputy Jennifer Whitmore  Could we even have 30 seconds to ask a question and then maybe the Taoiseach could respond? \n An Ceann Comhairle  No. We cannot go over time. I do not set the time. I do not have that discretion. \n Deputy Jennifer Whitmore  No, but we could stay within the time. \n An Ceann Comhairle  There are 15 Deputies left. \n The Taoiseach  Deputy Pádraig O'Sullivan raised the Rainbow Club, which is doing exceptional work. Jon and Karen O'Mahony have been exceptional leaders in that regard. The former Minister of State, now Senator Rabbitte, did good work on a service level agreement. I was involved in advocating for that building, which was a HSE building, to be allocated to the Rainbow Club. I will certainly continue to work with them and to support them with capital. What is important is that we get a timeline and some idea of how we can progress that as quickly as we possibly can. It is a very good, practical example of how a parent-led, community-based approach can develop services for autism in a nimble and flexible way that has helped so many families.  Deputy Ó Murchú asked about the action plan. That will come.  I do not have an exact date but it is on target. It is fairly imminent. \n Deputy Ruairí Ó Murchú  Who will lead on it? \n An Ceann Comhairle  Please, Deputy Ó Murchú. \n The Taoiseach  The Minister, Deputy Foley, will lead, with the support of the unit in my office, but she will also report to the Cabinet subcommittee, which will then make recommendations to the Cabinet. That is how this will work. The Cabinet subcommittee is very important because all the key Ministers have to be there.  I agree with Deputy Cian O'Callaghan that the unemployment levels among the disability community is too high, and the barriers are too much. Part of the strategy in terms of what I am trying to do with the Minister, Deputy Calleary, is to remove some of those barriers and to create additional supports to make sure that employers are even more incentivised to recruit people. The intention is also to give supports to those who employ people with disabilities on a more sustainable basis. I do not disagree with the Deputy. The historic underemployment of people with disabilities in society is something that is exercising me.  I will pursue the issue raised by Deputy Heneghan about the two autism classes in the Educate Together school in Baldoyle.  I agree with Deputy Boyd Barrett. That is a very strange response from the council referring to the prevalence of autism. Autism is a spectrum, a continuum. There is high-functioning autism, people in the middle and those with autism which is very severe and profound. The council should be able to use the general guidelines in respect of health needs more generally. I am at a loss as to why the council cannot say in this case that the child needs prioritisation and a proper house to facilitate the treatment and life of the child. That is something on which I will go back to the Minister for housing in respect of guidelines to be sent to councils in that respect. I would not have thought it necessary. I thought councils would have enough flexibility to do this.  I disagree with Deputy Paul Murphy's description of the budget as a savage attack, but €3 billion has been invested in special education as an outcome of the budget, as well as €130 million for grants to adapt the houses of older people and disabled people. There was a €10 increase per week in the disability allowance, an expansion of the wage subsidy scheme, an increase of €375 in the income limit for carer's benefit, and a €20 increase in the monthly domiciliary care allowance. That is not a savage attack on disability. We have to pursue the cost of disability and the Minister will bring plans in the next budget in respect of that.  In response to Deputy Tóibín, the vacancy rate nationally has come down for CDNTs. We have increased the allocation of therapy places in third level colleges. \n An Ceann Comhairle  I thank the Taoiseach. Even though there is time left, the point is that this format is not working. The place to discuss that is at the Business Committee on Thursday. I ask Members to bring it up and we can sort out something else. Certainly, where there is a grouping of 19 Members, it is not possible to give the Taoiseach time to answer in the remaining time. I am sorry for those who did not get in but there is just nothing we can do, other than discuss it at the Business Committee and change the format. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_34",
        "debateSection": {
          "showAs": "Departmental Programmes",
          "debateSectionId": "dbsect_17",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/mul@/dbsect_17.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/dbsect_17"
        },
        "date": "2025-11-26",
        "questionNumber": 34,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "oral",
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 207. Deputy Cian O'Callaghan asked the Minister for Housing, Local Government and Heritage the reason the required funding has not been released or allocated in order that the jobs, outlined under Section 4 of the Framework for the Future Delivery of Water Services, can be created and allow staff to retain the roles appropriate to their grade and competency; the reason local authorities are informing staff that only lower-grade positions exist, when the framework explicitly prohibits downgrading; if he will ensure that staff receive clarity on reassignment, role matching and pay grade protections; the oversight and enforcement he is putting in place to ensure that local authorities comply with the commitments made in the Framework; and if he will make a statement on the matter. [66538/25] ",
        "answerText": " Minister for Housing, Local Government and Heritage  The Framework for the Future Delivery of Water Services was prepared following extensive consultation between my Department, Uisce Éireann, the County and City Management Association, the Local Government Management Agency and Trades Union representatives. This dialogue was facilitated by the Workplace Relations Commission. Inter alia, the Framework addressed concerns raised by water services staff.  Section 4 of the Framework outlines that local authority water services staff who decide not to transfer to Uisce Éireann by the deadline of end December 2026 can choose to remain in employment with their local authority. As this deadline approaches local authorities will continue to work closely with water services staff who choose to be redeployed within the local authority. Individual local authorities have put in place various support structures to assist staff move into new roles. These supports are typically tailored to the numbers of staff involved and the level of support required, which varies from local authority to local authority.  Local authorities are fully funded to deliver their services and deliver on their responsibilities under the Framework and my Department is engaging closely with the local authorities to ensure the overall objectives of the water transformation programme are met. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_207",
        "debateSection": {
          "showAs": "Water Services",
          "debateSectionId": "dbsect_194",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_194.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_194"
        },
        "date": "2025-11-26",
        "questionNumber": 207,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 260. Deputy Cian O'Callaghan asked the Minister for Agriculture, Food and the Marine to provide an update on the Howth Harbour dredging project; the timeline for the commencement of dredging works; and if he will make a statement on the matter. [66539/25] ",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The need to dredge Howth FHC to ensure its long-term viability as a commercial fishing port, leisure harbour and tourism destination is widely accepted by the industry and the community and has been long recognised as an urgent issue by my Department.  Unfortunately, the project experienced significant delays in obtaining the relevant planning and consents. Planning permission was granted by Fingal County Council in August 2022. A third party subsequently made an appeal to An Coimisiún Pleanála (ACP formerly An Board Pleanála ABP). Progress on this project was delayed by 20 months until a decision which was made in favour of the Department in August 2024.  My Department submitted an application for a waste licence to the Environmental Protection Agency (EPA) in December 2023 in anticipation of the ACP decision. Ideally the EPA assessment would have commenced immediately. However, the application was not scheduled on either the 2024 or 2025 application lists.  I am now pleased to inform the Deputy that I was recently informed by the EPA that they are now treating the application as a matter of urgency and importance, and the project will be a priority application on their 2026 scheduled application list. Following their decision, the potential timeline for the construction phase of the project is for construction over three budgetary years, subject to funding availability, and national priorities, with actual construction time being 24-34 months ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_260",
        "debateSection": {
          "showAs": "Harbours and Piers",
          "debateSectionId": "dbsect_236",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_236.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_236"
        },
        "date": "2025-11-26",
        "questionNumber": 260,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 408. Deputy Cian O'Callaghan asked the Minister for Education and Youth if she will fulfil the commitment made by the former Minister of Education and Youth and meet with the principal of a school (details supplied) to discuss the urgent need for additional autism class provision within their school, and wider community; and if she will make a statement on the matter. [65810/25] ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_394",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_394",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_394.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "questionNumber": 408,
        "answerText": " Minister of State at the Department of Education  My department and the National Council for Special Education (NCSE) have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and beyond.  As you are aware parents were asked to notify the NCSE of their requirement for a special class for the 2026/27 school year by 1 October 2025. The NCSE is now collating and assessing the information gathered through this notification process. Once complete the NCSE will be in a position to engage with schools across the country to open new special classes.  In order to ensure new special classes can open as quickly as possible the NCSE prioritise working with medium and larger primary schools who do not already have a special class and have available accommodation to accommodate new special class. This approach maximises the use of existing space which can be reconfigured efficiently while also ensuring that new provision continues to be established. It also increases number of schools with special classes providing parents with greater choice and reducing the distances that some children are travelling to access a special class place.  However, as in other years where schools have no available accommodation, particularly at post-primary level and there is known demand in a local area, my department will continue to provide additional classroom accommodation to provide necessary places.  The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will be become available through the normal movement of children leaving primary or post-primary school.  The school referred to by the Deputy already has 3 special classes and any school willing to open further new special classes is to be commended.  I can confirm that a request to meet with this school has been received by my office and is currently under consideration.  The NCSE will assess what additional provision is required in local areas and what schools have capacity to accommodate required provision. My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_408",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 844. Deputy Cian O'Callaghan asked the Minister for Health her Department’s plan to deregulate the use of a medication (details supplied) in an effort to help reduce drug deaths; and if she will make a statement on the matter. [65431/25] ",
        "debateSection": {
          "showAs": "Departmental Policies",
          "debateSectionId": "dbsect_757",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_757",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_757.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "questionNumber": 844,
        "answerText": " Minister for Health  Naloxone services, including training, are part of an integrated approach to reducing drug harm under the National Drugs Strategy. In 2024, the HSE supplied 6,944 units of naloxone to services nationwide and trained 2,330 people in overdose awareness and naloxone administration in collaboration with community partners.  Promotion by service providers to encourage uptake of existing training and roll out of existing mechanisms and initiatives on naloxone access is resulting in greater awareness and availability of naloxone in the community.  Under existing legislation, naloxone can be prescribed to an individual by their doctor, however it can also be supplied under certain conditions without a prescription for the purposes of administration by appropriately trained individuals in emergency situations.  The regulations provide for the supply and administration of naloxone, without a prescription, by an individual appointed by a listed organisation, for the purpose of saving life or reducing severe distress in emergency situations, where that individual has successfully completed an approved training course on the administration of such medicines and on the management of any adverse reaction.  The regulations also provide for the creation of a list of organisations that may procure naloxone without a prescription for supply and administration in an emergency by trained persons in the organisation. For context, ‘listed organisation’ means an organisation or emergency rescue organisation listed in the list of organisations maintained by the Health Products Regulatory Authority (HPRA).  The HPRA website provides detailed information on emergency medicines, including what they are, who can use them, and how they are regulated. This can be found at the following link: www.hpra.ie/regulation/human-medicine/patients-and-healthcare-professionals/emergency-medicines. The HPRA may be contacted directly for further guidance on emergency medicines.  There are therefore no legislative restrictions on organisations applying to the HPRA to become a ‘listed organisation’, including An Garda Síochána, The Irish Prison Service, private, public, NGO’s, voluntary and charitable organisations. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_844",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_300",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_300",
          "showAs": "Schools Building Projects",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_300.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 409. Deputy Cian O'Callaghan asked the Minister for Education and Youth if a new school building project (details supplied) has gone to tender, as mentioned in her statement in Dáil Éireann on 12 November 2025; when the tender will be published on eTenders; if she can confirm the deadline for tender submissions; and if she will make a statement on the matter.  [64660/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_409",
        "answerText": " Minister for Education and Youth  The large scale capital project for the school referred to by the Deputy is the provision of a new 600 pupil school building, including a 2 classroom SEN and all associated ancillary accommodation.  The Department recently authorised the project to Proceed to Stage 3 - Tender Action and Award. The Design Team are finalising the required documents, and it is expected the tender will be published on e-tenders as soon as possible.  The Department is committed to the delivery of the project for Gaelcholáiste Reachrann. ",
        "questionNumber": 409,
        "by": {
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 359,
        "showAs": " 359. Deputy Cian O'Callaghan asked the Minister for Finance his plans to assign additional resources, including personnel and funding, to the Office to Promote Competition in the Insurance Market to enable it to deliver on the Government’s commitments in the Action Plan for Insurance Reform to increase competition in the insurance market, with particular reference to the liability insurance sector where there have been no new entrants for over a decade; and if he will make a statement on the matter. [63310/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Finance"
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_359",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_300",
          "showAs": "Insurance Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_300",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_300.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Finance (Deputy Paschal Donohoe)  The Government remains committed to addressing the issue of public liability insurance costs through the efforts of the Office for the Promotion of Competition in the Insurance Market. The new Programme For Government - Securing Ireland’s Future calls for the expansion/support of the Office and work is underway to add additional resources. It continues to play an important role in connecting various stakeholders – insurers, brokers, representative groups, among others – and facilitating engagement on issues relating to the availability of insurance across the market. The resourcing of the Office is kept under review.  On 24 July, Government launched its new Action Plan for Insurance Reform. The new Plan includes a comprehensive series of targeted actions aimed at improving affordability, availability and transparency across the insurance sector, including public liability.  There are several priority actions, including actions that place a key focus on the Office and enhancing market competitiveness by proactively engaging with the insurance market to encourage new entrants into the Irish insurance market, which will further boost supply and enhance the availability of insurance.  In his capacity as Chair of the Office to Promote Competition in the Insurance Market, the Minister of State, Deputy Troy, engages on an ongoing basis with insurance companies and brokers to ensure that reforms result in increased competition and availability of cover for businesses.. These engagements provide an opportunity to highlight to the wider insurance industry the positive impact of the Government’s offer in particular sectors of the Irish insurance market. In terms of business and commercial insurance, existing providers have also indicated that they are expanding their risk appetite to underserved areas and various sectors are reporting reductions in the rate being charged for liability cover.  It may interest the Deputy to know that the number of ‘pinch-points’ in the insurance market have also decreased significantly, with insurance now available in previously difficult areas such as: equestrian activities; classic car hire; inflatable hire; leisure activities; sports clubs, play centres and high-footfall SMEs such as pubs. From a high of over 40 identified ‘pinch-points’ in 2021, only three now remain. However, in each of these areas, there is some capacity available.  Recently, OUTsurance, Revolut, Fastnet, Coverys and an influx of managing general agents commenced operations here. In terms of business and commercial insurance, existing providers have indicated that they are expanding their risk appetite to underserved areas and various sectors are reporting reductions in the rate being charged for liability cover.  In conclusion, a key focus of the Office will be building upon the last Government reform programme, emphasising the impact of the successful reform agenda and continuing to encourage increased capacity within the Irish market. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 371,
        "showAs": " 371. Deputy Cian O'Callaghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of the proposed 2024-2026 Spending Review cycle that was noted in the Public Service Performance Report 2022; and if he will make a statement on the matter. [62769/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_371",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_313",
          "showAs": "Public Expenditure Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_313",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Securing value for money is an ongoing priority for this Government and is at the heart of all decision making, at every stage of a policy or programme lifecycle. It is about securing the efficient and effective use of public resources in the pursuit of better public services, living standards and infrastructure for the people of Ireland. Policy analysis is a core component of the public expenditure management and value for money frameworks.  A wide range of policy and expenditure analysis is undertaken and published by Government Departments annually. These can take the form of Staff Papers, Focused Policy Assessments, Spending Reviews, and analytical notes among others. My department plays a central role in this process by regularly analysing expenditure trends and policies. Alongside this, individual Departments have responsibility for evaluating the efficiency and impact of their own programmes and policies, to ensure the optimal use of public resources.  Since 2024 approximately 59 papers have been published by IGEES staff across Government. During 2025, policy analysis and expenditure evaluations on a broad range of topics, including disability services, social housing, migration and labour market trends, statutory sick leave, wellbeing, education, transport, and youth participation. This analytical research has continued to play a key role in supporting evidence-based policymaking across the government.  In addition my department continually seeks to ensure evidence and analysis is at the centre of policy making including through the budgetary process. This is communicated through our range of publications including the annual Expenditure Report, the Public Service Performance Report, as well our expenditure and policy evaluation papers across various topics.  In preparation for Budget 2026, my department undertook several pieces of analysis to support resource allocation:  The Public Service Performance Report, published in June, detailed how Departments performed against targets set in the Revised Estimates process. This supports assessment of progress ahead of the budgetary process.  The National Development Plan Review, published in July, set out investment plans to address the infrastructure deficit in the best way to safeguard our economy, drive growth and opportunity, protect jobs, increase competitiveness and ensure prosperity for our people and communities. This review was underpinned by analysis of drivers of infrastructure needs.  The Medium-Term Expenditure Framework was published in September. This is a multi-year public expenditure planning exercise and supports assessment of the resource implications of future policy decisions over the period 2025-2030. The framework utilises three pillars: fiscal sustainability, spending adequacy and spending efficiency. It is based on analysis of past trends, consideration of risks and opportunities alongside development of forward-looking scenarios. The scenarios set out in the framework are indicative only and based on a number of variable assumptions. Their purpose is to illustrate a range of options for public expenditure based on previously observed trends and known cost drivers.  This work complements engagement with Departments in the Estimates process and the analysis underpinning these discussions, such as, for example, the Live Register Analysis Paper, published by my department on budget day, which examines labour market trends and forecasts Live Register related expenditure for 2026. My department’s published policy analysis and strategies are all available on the department’s website.  In relation to 2026, business plans are currently being finalised including areas for analysis. This process is overseen by line-management structures and takes into consideration unit capacity, strategic priorities and business needs. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 372,
        "showAs": " 372. Deputy Cian O'Callaghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if a review was undertaken by his Department into the 2017 to 2022 and the 2023 spending review cycles; if so, if he will publish this review; and if he will make a statement on the matter. [62770/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_372",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_314",
          "showAs": "Public Expenditure Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_314",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_314.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  A report was published in October 2020 titled “Rationale Operation and Issues – Irish Spending Review Process 2017-2019”. It can be accessed at the following link: www.gov.ie/en/irish-government-economic-and-evaluation-service-igees/igees-publication/rationale-operation-and-issues-irish-spending-review-process-2017-2019/.  The report was undertaken by Professor John O’Hagan of Trinity College Dublin. It provided the Spending Review Steering Group with an external view of how the Spending Review process was operating and set out a number of recommendations. The terms of reference for this review included examining the clarity of the Spending Review’s aims and objectives, the effectiveness of governance structures, communication with stakeholders, and the quality and integration of outputs into policy and budgetary processes.  The series of recommendations set out in the report informed several reforms implemented for the 2020–2022 cycle, including expanded governance structures, increased departmental authorship of papers, and improved transparency measures. Adjustments made following the review of the 2017–2019 cycle were also embedded into the 2023 Spending Review process.  A broad range of policy analysis is undertaken and published by Government Departments each year. These can take the form of Staff Papers, Focused Policy Assessments, Spending Reviews, and analytical notes among others. My department regularly analyses expenditure trends and policies. Alongside this, individual Departments have responsibility for evaluating the efficiency and impact of their own programmes and policies, to ensure the optimal use of public resources. Since 2017 over 188 papers have been published, covering a wide range of policy areas, and these are available on the department’s website.  In addition, my department continually seeks to ensure evidence and analysis is at the centre of policy making including through the budgetary process. This is communicated through our range of publications including the annual Expenditure Report, the recently published Medium Term Expenditure Framework, the Public Service Performance Report, as well our expenditure and policy evaluation papers across a range of topics. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  I remind Members that we are due to conclude at 4.18 p.m. \n The Taoiseach  I propose to take questions Nos. 18 to 36, inclusive, together.  The Cabinet committee on disability has been established to oversee the implementation of the programme for Government commitments in the area of disability, with specific focus on children's disability services as well as disability more generally under the Government's new National Human Rights Strategy for Disabled People 2025-2030.  Under the programme for Government, we are committed to delivering a step change in disability services and to advancing the rights and improving the lives of people with disabilities. To deliver on this, I established the stand-alone Cabinet committee on disability. This committee has met five times to date, most recently on 16 October, and it is due to meet again on 27 November. To date, the committee has considered issues including the new national disability strategy, the provision of therapists in special schools, improving the delivery of services and reform of the assessment of need process.  Despite the committed efforts of so many working to provide services and significant increases in funding and resources in recent years, I acknowledge that we can and must do more and do better. I am determined that this will be a Government that moves forward with purpose in improving the level, scale and quality of support for disabled people and their families.  The Government's new National Human Rights Strategy for Disabled People 2025-2030, published in September, is the framework for our whole-of-government approach to addressing disability and advancing the implementation of the United Nations Convention on the Rights of Persons with Disabilities. It represents our commitment and ambition that all disabled people in Ireland can live the life of their choosing and participate in their communities and our society to the fullest extent possible.  In budget 2026, we took initial steps to deliver on this commitment through record allocations for disabilities services and special education. Reflecting the importance of disability issues, I have established a dedicated disability unit in my Department.  An initial programme planned for the unit has been published, outlining how the unit will work to achieve this. The unit is already up and running, supporting the work of the Cabinet committee on disability and ensuring a truly all-of-government approach to disability. \n Deputy Aisling Dempsey  I want to raise the urgent issue of the transition from child disability services to adult disability services. A constituent has told me that her child was not seen by child disability services until he was almost 18 and that was eight years post her first contact. The family had no clarity on what supports they were entitled to when he was a child, let alone what they were facing into from adult disability services. Another constituent - another mother - has told me some therapies her child receives now are not going to be available in adult disability services. Somehow, her adult child will not have the same needs any more. In this case, respite will also be withdrawn when her child ages out of child disability services. This is leaving families feeling anxious, unsupported and fearful for their family's future. Will the Taoiseach and the committee urgently examine the transition process between child and adult disability services to ensure continuity of care and no loss of essential supports for young people and their families? \n Deputy Catherine Ardagh  One of the greatest fears facing parents of children with disabilities and parents of adult children with disabilities is what will happen when we are no longer here. Who will care for my son? Who will care for all of these children, including adult children? It is a question that causes sleepless nights for so many people. Ultimately, we need a clear, compassionate pathway for lifelong housing and care in the community for adults with disabilities, so families can have certainty and peace of mind.  Will the Government commit to developing a national plan to ensure that every person with a disability has a safe, permanent home and the supports they need, not just for today but for the future? All of us have been in many houses in our constituencies and we have met elderly parents caring for middle-aged children with disabilities. It is heartbreaking that they are in their senior years and they do not know what is going to happen to their son or daughter when they pass. We have all dealt with these types of queries. It is something that lies ahead for me and my family also. We need to start discussing housing and care in the community for people with disabilities. \n Deputy Martin Daly  I am following on from what my colleague Deputies have already said about the care of the offspring of people who are getting older and have no certainty around what is going to happen when they are not here any more. It is a major challenge within the community. It seems like a cliff edge. When you die, you get a residency. That is not good enough. There has got to be planning around that, and it should be seamless.  A lot of work has been done on the provision of special education classes, and special school place provision. We have done stuff around increasing the income disregard for the carer's allowance and we are getting to an abolishment of the means test but also I think we need to address flexible arrangements around getting more people who live with disability into work and out of poverty without losing their benefits. The cost of disability payment should be considered also. There is a lot of work to be done. The direction is right but we do need a huge focus on it. \n Deputy Peadar Tóibín  It is 420 days since I asked the Tánaiste, Deputy Simon Harris, about why Harvey Morrison Sherratt was taken off the waiting list. The Tánaiste has not been able to answer that question in those 420 days. That is an incredible indictment in relation to it. He said in the Dáil that he would immediately ask the HSE and that he would ask the Minister for Health, yet no question has been answered.  We saw in The Sunday Times this weekend that a protected disclosure was submitted to the Department of Health. The information in this protected disclosure is catastrophic. The implication is that someone, or a group, took a decision that was not medically based and may have led to the death of Harvey. That is a catastrophic question. The import of that on a government is absolutely enormous. What the Government is asking us to believe is that on one level, the Tánaiste has spent 420 days asking questions in relation to why Harvey was taken off the waiting list and he still did not get an answer and, at the same time, a protected disclosure was given to the Department of Health with the answer. That is an incredible thing.  Does the Government understand the import of what has just happened? Why has it taken 420 days for the Tánaiste to answer a question? Have the staff or the management involved actually been asked what has happened? \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Peadar Tóibín  Are they refusing to answer what has happened? Why is it that the family only found out through The Sunday Times what happened in relation to their child? \n An Leas-Cheann Comhairle  I am sorry that I overlooked Deputy Coppinger. \n Deputy Ruth Coppinger  That is no problem.  Governments have fallen over less than what has happened in relation to Harvey Morrison Sherratt. We found out over the weekend through a protected disclosure that a worker heard or became aware that Harvey had been taken off the waiting list because he was mistakenly, or for whatever reason, considered \"palliative\" - in itself a horrible phrase. First, his parents were not told and, second, no care plan or treatment plan was drawn up if he was \"palliative\". This just defies belief. Aside from the fact that he may have ended up dying because of this error, perhaps if he had received the surgery, he would not be dead. The fact is that we have surgeons who would not tell parents about this and who would not organise a care plan for a \"palliative\" child. Every week, we come in here and ask the Taoiseach to have a statutory public inquiry. The Government's stance has been to have a scoping inquiry here and a scoping inquiry there. We need a full statutory inquiry into all of the issues surrounding Harvey, CHI and spinal surgery. The Taoiseach should have asked questions since this broke on Sunday, given how important this issue is in Ireland for so many people. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Ruth Coppinger  He should have asked CHI directly about this particular issue, so I hope he has answers for us today. \n Deputy Mark Ward  I was at a public meeting last Monday in Neilstown hosted by parents of children with disabilities. They raised a multitude of areas and how their children are being failed. There are long waiting lists for assessment of need, speech and language therapy and occupational therapy. There is no access to appropriate school places. There are limited SNA allocations. They also talked about not even getting appropriate places for school transport and arbitrary timeframes for filling out forms. If they do not fill out the forms within the timeframe, there are consequences for their children.  I got a response this morning saying the average wait time for an assessment of need in my area of Dublin Mid-West is three and a half years, even though the statutory timeframe is six months. Children are being denied the right to reach their full potential. How is the Government going to address the failures children are experiencing? \n Deputy Paul Murphy  The budget reneged on a key commitment in the programme for Government to introduce a permanent annual cost of disability support payment and then to incrementally increase it. We know that it costs a lot of money to be disabled in this country. A few years ago, the Department of Finance estimated it at around €10,000. It has obviously gone up substantially since then. Last year's €400 lump sum disability payment was a drop in the ocean but far from increasing it, as promised, the Government abolished it completely. It slashed other payments that disabled people rely on, like the living alone allowance lump sum and the electricity credit. Even taking into account small increases to the disability allowance, the Government still took well over €1,000 out of the pockets of disabled people. It is shocking in one of the richest countries in the world, with a budget surplus and with the cost-of-living crisis ongoing, that the Government made disabled people poor. That is not just in real inflationary terms but even in nominal terms. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Paul Murphy  The Government made them poorer, and took over €1,000 from them. Will it recognise this as a major mistake? Will it bring back an emergency lump sum cost-of-living payment for disabled people before Christmas? \n Deputy Ruairí Ó Murchú  I want to bring up the attempt by Darver National School in County Louth to have two autism classes sanctioned. The initial engagement between the principal, the SENO and the NCSE took place in June 2025. This was followed up throughout September and October, with no word back. It is absolutely supported by the patrons and the board of management and all have tried to make contact. We need to ensure that this happens but we also need to ensure that the school is contacted.  I do not think this is okay. I am just giving the timeframe on this.  I also need someone to light a fire under the Department of education in relation to Ardee Educate Together National School. Louth County Council is the agent but the Department ----- \n An Leas-Cheann Comhairle  Thank you Deputy. \n Deputy Ruairí Ó Murchú  This relates to parking spaces and planning. It should be a very small piece of work to get this changed to account for the 45 staff and also enough bays for the minibuses. At this point, there is not space. It would be very cheap to get it changed at this point. A contractor is on for this. If not at this point, then we could be talking about something that could cost €100,000-plus. \n Deputy Barry Heneghan  Is there an update or timeline from the Cabinet committee on disability on assessments of need?  In my own constituency, Stapolin Educate Together primary school is looking for two additional autism classes. It has a very powerful image of 12 chairs outside that school representing children locked out. I would urge the Taoiseach push----- \n The Taoiseach  Which school? \n Deputy Barry Heneghan  Stapolin in Dublin Bay North. I can send details to the Taoiseach’s office. These children are locked out. I urge that the NCSE look at this school. It has brilliant staff who are really hard working.  Gabhaim míle buíochas leis an Aire, Deputy McEntee, i dtaobh Ghaelcholáiste Reachrann. Tá sé iontach go bhfuil rudaí ag bogadh ar aghaidh air sin. \n Deputy Conor D. McGuinness  The Government is failing children in Waterford with additional needs over the stagnation in early intervention classes. Five years ago, there were two early intervention classes across Waterford city and county. This year, there are still two. That is despite an increasing need and a demand that is there but unmet. These early interventions are critical for children’s educational and social outcomes. It is something that the Taoiseach’s Government needs to grapple with. Over the last nine or ten months, we have seen issues around special education spaces and classes in schools. While the Government did belatedly do some work to fill some of those gaps in service provision, there is a lot more to do. That situation is still there and I think there will be problems next year. We need to get to grips with the early intervention classes and increase them dramatically so that there is availability for parents to get their children that much-needed timely intervention. \n Deputy Liam Quaide  The plight of ageing parents of adult children with intellectual disabilities is an area of abject neglect on the part of the Government. Many of these parents are being deprived of peace of mind in their later years because they remain the primary carers of their children. They are less physically able to carry out this role as time goes on. They are living with a constant background worry of not knowing where their children will live after they die and how their need for belonging and community will be met.  The Government’s privatisation of services means that both young people and adults who require 24-hour staffed residential support are increasingly living far from home, in some cases hundreds of kilometres away, not connected to wrap-around services, detached from their communities and families. What is the Taoiseach’s plan to address this particular crisis in residential services for people with intellectual disabilities? Why are these services being privatised and fragmented to such an extent when the outcomes in many cases are so poor for our disabled citizens and when the cost to the State is so enormous? \n Deputy Rose Conway-Walsh  It is an absolute disgrace that even today we still do not know which children were wrongly removed from the scoliosis waiting list or why it happened. Families have been left in the dark while children suffer in pain. There is a clear culture of secrecy, concealment and unaccountability at the heart of children’s healthcare and an utter lack of transparency. I want to talk to the Taoiseach again, after many other times I have done so, about Mikey Henry Benson from Mayo, who is still waiting for the procedures he needs. I want to ask the Taoiseach to ask the Minister for Health when she is in Mayo on Monday to meet the family of Mikey Henry Benson to go through the episodes and the pain they have gone through and to find a way forward so that we can ensure that Mikey Henry Benson stays alive? \n Deputy Cian O'Callaghan  The Government has said time and again that there should be an appropriate school place for every child. I am contacted constantly by parents who are desperately trying to get a place for their child in an autism class. The same as any other parent, they just want their child to be able to thrive. Stapolin Educate Together National School in Baldoyle has asked to open two additional new autism classes. The school has the space for the modular units required. It also has experienced staff who can support the opening of these two additional classes. All that is required is for approval to be granted. Is the Minister for education going to meet the school principal about this and when is approval going be granted for these two much-needed classes? \n Deputy Richard Boyd Barrett  While I was getting my treatment in St. Luke's, I met a very nice woman called Shirley who brought up her daughter Lauren's case with me. Lauren subsequently wrote to me. Lauren lives with her and has a life-long disability condition that means she is unfit for work. She had previously been on domiciliary care allowance, then on disability allowance, but she then got married. She lives at home with her mum still, being cared for by her mum, but because she got married and went over the threshold, her disability payment has been cut. It really highlights the massive problem and injustice of having means testing of disability payments. What does the Taoiseach have to say to Lauren and many others like her who lose all support for their disability on the basis that their partner’s income has gone over a very arbitrary threshold? \n An Leas-Cheann Comhairle  We are gone way over time, so I would ask the Taoiseach to consider that. \n The Taoiseach  We are about seven minutes over time, is it? \n An Leas-Cheann Comhairle  Yes. \n The Taoiseach  I will try to do what I can as quickly as I can. \n An Leas-Cheann Comhairle  No, you are okay. Just ----- \n The Taoiseach  No, I am conscious of others.  Deputy Dempsey raised the issue of transition from child services to adult services and that there was an absence of early planning for that. She also made the comment that parents were told that therapies would not be available in transition. That is not acceptable and respite should not be withdrawn. In the disability unit that I have established, a key workstream will be planning and designing for the future. There should be proper data and proper early analysis of expected need for services from primary to post-primary, from post-primary to adult or, indeed, continuing education or other aspects. That is where I want to get to and that is where we want to get to as a Government because there is no doubt - Deputy Ardagh has raised this as well, as have others - that the insecurity is shocking. It is very sad that so many parents – I have met them – have no certainty. Deputy Daly said it was a cliff edge, and it is for many. If one talks to some of the providers in the sections 38 and 39 organisations, they are all dealing with emergency cases. That is not satisfactory, so we have got to get a more planned approach to this transition. I think there are also issues in terms of the interaction between the sections 38 and 39 organisations and the Government and Government services and how that works. Many of those are under pressure as well, I have to acknowledge, but equally we have to work out the models and so forth. There should be proper databases outlining how many people are in a given service at a given time and what will the requirements be at a later date. There is that issue of creating a secure transition and that older parents in particular, senior citizens now, have a certain sense of security and knowledge well in advance that their children will be looked after in case anything happens to themselves. That is a very understandable human concern, which is not being met at the moment but that needs to be met. I am very determined that we would put services in place to enable that to happen. There is a fear there, as Deputy Ardagh said. She called for a national plan for this and that is something I am going to work on so that people will have that security. Other Deputies have raised that issue. We should be looking at a seamless transition, ideally.  There is a link into housing as well in that respect, different solutions at different times in the journey of life that people can move to better accommodation, more suitable accommodation. We should have greater flexibility around that provision. There can be too many silos between different Government Departments in respect of that but we are working on it. That is what the Cabinet subcommittee is for, to do a cross-government, whole-of-government approach.  Deputy Daly and others raised the income disregard and the cost of disability. The cost of disability will be looked at in the next budget and there is a working group established in relation to that. On the relationship between work and disability payments, there are some supports there for transitioning from disability, from the social protection system, into work in terms of the medical card and others. I think that can be strengthened and that those moving into work can be given greater certainty, more long-term certainty, that they will retain their benefits or whatever entitlements they have as they go into work. There have been improvements on the employer grant and so on but there is further work to be done in terms of giving greater security around that transition and encouraging people to go into work without fear of losing their health entitlements or the various other entitlements they have.  Earlier during Leaders' Questions, we dealt with questions in respect of Harvey Morrison Sherratt. I would say to the Deputy the Minister is this afternoon meeting with the parents. The Minister did look for a chronology from the HSE. The Minister has that. The CEO of the HSE shared that with the family. It is a draft because the HSE wanted the family's input into that. I dealt with the protected disclosure earlier on Leaders' Questions. The Minister did not see that. All protected disclosures do not go to the Ministers per se . The Minister has an obligation to establish a system by which it goes to the protected disclosure commissioner. That commissioner has the specific protected disclosure and is now going to deal with that. Without question, there is a meeting on between the Minister, the Tánaiste and the parents of Harvey, with a view to an inquiry. The precise format is to be determined.  Deputy Coppinger had a similar question in relation to this. It is a fundamental question as to why Harvey was taken off a waiting list. There are clinical decisions clearly involved here that have to be examined and will be examined. Likewise, there are other, broader investigations and examinations of issues pertaining to CHI, as the Deputy knows. Some of them have come in and some have not. Overall, again, terms of reference have to be specific here. We can have statutory inquiries that can go on too long and do not give closure to families. I think there is a bit of work to be done yet and the Minister is meeting with the family in that regard.  Deputy Murphy raised the issue of the cost of disability programme. I dealt with that earlier insofar as the next budget will be dealing with that. Once-off payments were two years. What we were determined to do in this budget was to increase the permanent payments within the social protection system, which we did, for example, and to enhance them as well and also, in terms of the carer's allowance threshold and income disregard, to increase that and we will eliminate that over the lifetime of this Government. We increased the domiciliary care allowance significantly.  In terms of education, there are now about 46,500 teachers and SNAs working in our education system, committed to supporting and nurturing children with special educational needs. Huge numbers of special needs assistants have been appointed over the past number of years. There are about 400 new special classes in the budget of 2025, and about 2,700 new places for the 2025-2026 school year. Some of those school places are under construction and being put in place. A number of specifics have been asked. I will check those out with the Minister. I am not in a position to have knowledge of every single application from individual schools in respect of autism classes and so forth but I will follow those up with the Minister. I presume the Deputies are also engaging with the Departments in respect of that.  On the assessment of need, the Cabinet subcommittee on disability did approve outline proposals for a change in legislation which will have to happen to prioritise the provision of services. Therapy services to children has been the number one priority in terms of the legislative objective of that. The access and inclusion model, AIM, is a critical intervention for early years in terms of disability, in response to Deputy McGuinness's question. I would make that point and that has been enhanced and improved and will be improved as a result of the recent budget. Deputies Quaide, Dempsey and Ardagh raised the issue of insecurity and worry for ageing parents of children with disabilities. I am very conscious of that and we will work to see if we can improve on that.  I have dealt with the issue raised by Deputy Conway-Walsh. I response to Deputy Cian O'Callaghan, I will check in respect of the school in Baldoyle. I do not have awareness of that. In response to Deputy Boyd Barrett, again, I do not know the specific issue but I think it is an income threshold issue in terms of people marrying. \n Deputy Richard Boyd Barrett  It is, yes, the means test. \n The Taoiseach  I will have that examined. That is something that we can certainly look at. I will talk to the Minister for Social Protection in relation to that. \n Deputy Rose Conway-Walsh  Sorry, I think the Taoiseach was referring to the previous question. It was the one on Mikey Henry-Benson I had asked. \n The Taoiseach  Sorry. Again, I will talk to the Minister in respect of it. To be fair, this should be done at hospital level. It should be done properly through the clinicians properly engaging with the family and with the parents. There are liaison officers in CHI as well who should be----- \n Deputy Rose Conway-Walsh  I know it should but it was not and it is not. \n The Taoiseach  I will make the Minister aware of the case. \n Deputy Rose Conway-Walsh  Thank you. \n Deputy Ruairí Ó Murchú  On the two issues, if I could write to the Taoiseach and if his good offices would be able to put some pressure on----- \n The Taoiseach  There are about ten projects now that you have all mentioned. I am good but----- \n Deputy Ruairí Ó Murchú  In fairness these are critical time-wise. ",
        "to": {
          "showAs": "Taoiseach",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/mul@/dbsect_13.xml"
            }
          },
          "debateSectionId": "dbsect_13",
          "showAs": "Cabinet Committees",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/dbsect_13"
        },
        "questionNumber": 34,
        "date": "2025-11-12",
        "showAs": " 34. Deputy Cian O'Callaghan asked the Taoiseach when the Cabinet committee on disability will next meet.  [60924/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_34"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. As a commercial semi-state body, Córas Iompair Éireann (CIÉ) are responsible for the provision of pension schemes for their employees.  Regarding the recent engagement between CIÉ and the Trade Union Group (TUG) on the matter of the CIÉ Pension Schemes, the Department acknowledges the longstanding tradition within CIÉ of ensuring that terms and conditions of employees, which include pension provision, are negotiated collectively with recognised Trade Unions.  I welcome the constructive and collaborative approach of the Trade Union Group and CIÉ management in reaching agreement on a pathway forward, which is aimed at balancing the objectives of supporting the future sustainability of the schemes, protecting existing benefits for members of the scheme (including pensioners), and contributing to the overall financial stability of the CIÉ Group.  I acknowledge the positive outcome from the ballot held on the CIÉ Pension Proposal for both Schemes, which was agreed by CIÉ and the TUG in May of this year.  In line with the appropriate processes and compliance with all applicable requirements, my Department will continue to engage with CIÉ as well as financial advisors at NewERA, the Pensions Authority and the Department of Public Expenditure, Infrastructure, Public Services, Reform and Digitalisation on the next steps in progressing the agreement and bringing CIÉ pensions onto a more stable footing for the benefit of active, and retired scheme members. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_300.xml"
            }
          },
          "debateSectionId": "dbsect_300",
          "showAs": "Public Sector Pensions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_300"
        },
        "questionNumber": 354,
        "date": "2025-11-12",
        "showAs": " 354. Deputy Cian O'Callaghan asked the Minister for Transport when the Statutory Instruments required to implement the agreed pension increases for Córas Iompair Éireann (CIÉ) pensioners will be signed; and if he will make a statement on the matter. [62009/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_354"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The large scale capital project for the school referred to by the Deputy is the provision of a new 600 pupil school building including all associated ancillary accommodation.  The Department previously advised a new grant of planning was received in December 2023, with a number of conditions attached.  Decarbonisation measures were included in a revised project scope in line with Climate Action objectives.  The design team have finalised the pre-tender checks and documents in line with revised Technical guidance documentation from the Department of Education and Youth and a report was submitted in late September to the Department of Education and Youth for review.  This review is now being undertaken in the context of the Department’s NDP allocation and the finalisation of the NDP Implementation Plan.  The GC Reachrann project is one of the 80 projects intended to progress to construction over the 2026/27 period as part of our 2-year rolling capital programme.  All Government departments are expected to publish their sectoral NDP Implemenation Plans in November.  The inclusion of projects that are to progress to tender, such as GC Reachrann, in the NDP Implementation Plan reflects a programmatic approach in line with DPENDR's requirements. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_459.xml"
            }
          },
          "debateSectionId": "dbsect_459",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_459"
        },
        "questionNumber": 533,
        "date": "2025-11-12",
        "showAs": " 533. Deputy Cian O'Callaghan asked the Minister for Education and Youth the date in which her Department received the design team's report in respect of the new school building project for a school (details supplied); when the Departmental review of this report will conclude; the timeline for when this project will proceed to tender, and then to construction; if the project remains on schedule to commence construction in Q1/Q2 of 2026; and if she will make a statement on the matter. [61715/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_533"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth (Deputy Helen McEntee)  I propose to take Questions Nos. 542 and 537 together.  The DEIS programme is a key policy of Government to tackle concentrated educational disadvantage at school level. The Minister for Education and Youth is determined to close the performance gap between DEIS and non-DEIS and introduce more innovative solutions to tackle disadvantage.  Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and to introduce the DEIS plus scheme commencing in September 2026.  The DEIS plus scheme will provide additional support to schools with the highest levels of need, in line with the Government's commitment. The details of the DEIS plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy.  Any future expansion of the DEIS programme and the allocation of funding will be determined as part of the new DEIS Strategy which will be published before the end of the year. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_463.xml"
            }
          },
          "debateSectionId": "dbsect_463",
          "showAs": "Educational Disadvantage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_463"
        },
        "questionNumber": 537,
        "date": "2025-11-12",
        "showAs": " 537. Deputy Cian O'Callaghan asked the Minister for Education and Youth the way in which DEIS Plus resources will be allocated; if she will ensure that all eligible schools will have access to these resources before the end of the 2025-2026 school year; and if she will make a statement on the matter. [61776/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_537"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_148",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_149",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_149",
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_149.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Foreign",
          "roleCode": null
        },
        "showAs": " 148. Deputy Cian O'Callaghan asked the Tánaiste and Minister for Foreign Affairs and Trade if he will ensure Ireland plays a leading role in the restoration of the Palestinian banking system; if he will advocate for the immediate end to the block imposed by Israel of banknotes to Palestinian banks; and if he will make a statement on the matter. [60750/25] ",
        "questionNumber": 148,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Government remains committed to supporting the Palestinian Authority, both politically and financially. Financial stability is imperative to the effective functioning of the Palestinian Authority, and addressing the fiscal crisis will be central to its ability to deliver basic public services.  Ireland is actively working with the EU and other partners in the region and beyond to foster an enabling environment for a revitalised Palestinian Authority. I was pleased to attend the first ever EU-Palestine High Level Dialogue in Luxembourg in April. At the meeting, I welcomed the programme of reform being undertaken by the Palestinian Authority and commended progress made to date in what is an extremely challenging environment.  There is strong consensus at EU and international level that Israel must release approx. US$3 billion in withheld tax revenue from the Palestinian Authority and Ireland continues to raise this issue at the EU and international level. Israel has not transferred tax revenue to the Palestinian Authority since April 2025 .In October 2025, the European Council reiterated its call on Israel to release withheld clearance revenues.  As a result of limits on the transfer of cash shekels by Palestinian banks to their Israeli counterparts, there is a risk that Palestinian banks will not be able to make electronic payments and may be forced to resort to cash transactions only. Ireland and partners have called for an increase limit to the shekel transfer to NIS 30 billion or to facilitate an extraordinary transfer of shekels from Palestinian financial institutions.  In September 2025, Ireland was one of 142 countries to endorse the New York Declaration on the Peaceful Settlement of the Question of Palestine and the Implementation of the Two-State solution. The Declaration called for a number of measures to support the viability of the Palestinian economy; the removal of movement and access restrictions and the immediate release of withheld Palestinian tax revenues, the establishment of a new framework for clearance revenue transfers leading to Palestinian ownership over taxation, as well as the full integration of Palestine into the International Monetary and Financial System.  Ireland has joined the Emergency Coalition for the Financial Sustainability of the Palestinian Authority the purpose of which is to stabilise the Palestinian Authority’s finances and preserve its ability to govern, provide essential services, and maintain security, all of which are indispensable to regional stability and to preserving the two-State solution. Along with the Foreign Ministers of the Coalition, I called for Israel to immediately release all Palestinian clearance revenues and cease any measures that obstruct or weaken the Palestinian Authority or risk its collapse.  Ireland welcomes the EU’s payments to the Palestinian Authority of €172 million in 2025 and continues to call for additional emergency funding for the Palestinian Authority to at least the level of the €400 million in additional support provided in 2024.  Ireland has provided more than €95 million in support to the Palestinian people since January 2023. This includes €3 million per year to support the PA’s delivery of education. In 2025 we have also provided €300,000 through the EU’s Pegase mechanism to support the provision of public services. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_203",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_189",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_189",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Finance",
          "roleCode": null
        },
        "showAs": " 203. Deputy Cian O'Callaghan asked the Minister for Finance the amount paid to companies (details supplied) for advice on stocks and the cancelation of warrants; and if he will make a statement on the matter. [60748/25] ",
        "questionNumber": 203,
        "answerText": " Minister for Finance  I can inform the Deputy of the following amounts paid to N.M. Rothschild & Sons Limited and William Fry LLP contracts relating to the shareholding divestment of AIB, PTSB and Bank of Ireland across a range of transactions over a number of years. The amounts below exclude fees in relation to the recent AIB IPO Warrants transaction as the Department has not yet received invoices relating to this work.  N.M. Rothschild & Sons Limited: €3,958,644* (since 2016) relating to the AIB IPO, AIB and BOI trading plans, various AIB and PTSB Accelerated Bookbuild transactions and various AIB Directed Buyback transactions.  William Fry LLP: €573,625** (since 2021) relating to AIB and PTSB advice.  * N.M. Rothschild & Sons Limited – note that the Department did not incur any actual cost as the relevant invoices were paid by the NTMA and subsequently recouped from the relevant banks.  ** William Fry LLP - note that €470,006 of this amount is recoupable from the relevant banks. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_204",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_190",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_190",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Finance",
          "roleCode": null
        },
        "showAs": " 204. Deputy Cian O'Callaghan asked the Minister for Finance if he will provide a breakdown of the dwellings purchased where the 10 % stamp duty was paid, by year since the enhanced stamp duty was introduced, in tabular form; and if he will make a statement on the matter. [60749/25] ",
        "questionNumber": 204,
        "answerText": " Minister for Finance  I am advised by Revenue that the number of properties on which the higher stamp duty rate was paid is provided in the table below. The higher rate is currently set at 15% of the consideration. This rate came into effect on 2 October 2024. Prior to this, it was 10%.      Year      Number of properties       2021    189      2022    454      2023    667      2024    392      2025**    137      Total    1,839     ** End September 2025. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_255",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_232",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_232",
          "showAs": "Public Sector Pensions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "showAs": " 255. Deputy Cian O'Callaghan asked the Minister for Culture, Communications and Sport the reason it is necessary for An Post to submit a business case to his Department and NewERA before any agreed pension increases can be paid; the timeframe for when the business case will be assessed and approved; and if he will make a statement on the matter. [60743/25] ",
        "questionNumber": 255,
        "answerText": " Minister for Culture, Communications and Sport  I propose to take Questions Nos. 249, 255 and 257 together.  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for Culture, Communication and Sport with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform, approves any superannuation schemes submitted by An Post. The operation of the schemes is a matter between the management of An Post, staff representatives and the trustees of the schemes.  In accordance with the Act and the relevant Code of Practice for the Governance of State Bodies, An Post must seek Ministerial approval from both Ministers to increase pensions and deferred pensions for members of the An Post superannuation scheme. Section 2.13 of the Code of Practice for Governance of State Bodies Superannuation and Remuneration annex sets out that NewERA advice should be sought in respect of pension amendment proposals, as is appropriate in their role as commercial and financial advisors to the Ministers.  On 23 October 2025, An Post wrote to my Department requesting consent for an increase to pensions in payment and deferred pensions, arising from its agreements with employee representative groups. It is not possible, at this point, to set out the specific timeframe within which the decision-making process will be concluded by both shareholding Ministers in respect of increases submitted for consent. It should be recognised that the time taken for the pension approval process is necessary to ensure that robust governance procedures are in place. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_297",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_270",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_270",
          "showAs": "Stardust Fire",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_270.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "showAs": " 297. Deputy Cian O'Callaghan asked the Minister for Justice, Home Affairs and Migration if he can provide an update on the redress scheme for Stardust survivors and their families; when he expects to bring proposals on the scheme to Government for approval; the further length of time survivors and their families will have to wait before receiving compensation; and if he will make a statement on the matter. [60740/25] ",
        "questionNumber": 297,
        "answerText": " Minister for Justice, Home Affairs and Migration  Following engagement with legal representatives of the families of the victims of the Stardust fire, the Government, in August 2024, approved a two-phased approach to redress arrangements.  Phase one of the redress, for the families of the 48 victims of the fire, was recently completed. In line with the Government's 2024 decision, work to develop phase two proposals, concerning survivors of the fire, continues to be advanced by the Department of Justice, Home Affairs and Migration. This assessment will, in considering an appropriate mechanism, consider the compensation awards made by the Stardust Victims’ Compensation Tribunal established in 1985.  This assessment is at an advanced stage and I look forward to bringing proposals to Government for consideration, following which the Department will make the necessary arrangements for implementation. Those arrangements will include the provision of additional information, including timelines, for survivors on this important matter. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_445",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cian O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_407",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_407",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_407.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 445. Deputy Cian O'Callaghan asked the Minister for Health for an update on the roll-out of spinal muscular atrophy screening as part of the heel prick test for newborns; and if she will make a statement on the matter.  [60741/25] ",
        "questionNumber": 445,
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cian-O'Callaghan.D.2020-02-08",
          "showAs": "Cian O'Callaghan",
          "memberCode": "Cian-O'Callaghan.D.2020-02-08"
        },
        "questionNumber": 2,
        "questionType": "oral",
        "answerText": " Deputy Cian O'Callaghan  I ask the Minister about the spending reviews carried out this year that were not published, as had been the practice in previous years. Why were no spending reviews published in the run-up to the budget? How many spending reviews were carried out this year that were not published? Why has the practice of publishing these reviews been abandoned? Does the Minister agree the public has a right to know what is in these reviews? Will he publish all spending reviews that have been caried out? When will he publish them? \n Deputy Jack Chambers  I thank Deputy O'Callaghan. Securing value for money is an ongoing priority for the Government. It is at the heart of all decision-making at every stage of policy or programme lifecycles. It is about securing the efficient and effective use of public resources and improving living standards and infrastructure for the people of our country. Policy analysis is a core component of public expenditure management and value for money frameworks.  A wide range of policy and expenditure analysis is undertaken and published by Departments annually. These can take the form of staff papers, focused policy assessments, spending reviews and analytical notes, among others. My Department plays a central role in this process by regularly analysing expenditure trends and policies. Alongside this, individual Departments have responsibility for evaluating the efficiency and impact of their own programmes and policies. Since 2024, approximately 59 papers have been published by Irish Government Economic and Evaluation Service, IGEES, staff across government. During 2025, it produced policy analysis and expenditure evaluations on a broad range of topics, including disability services, social housing, migration and labour market trends, statutory sick leave, well-being, education, transport and youth participation. This analytical research has continued to play a key role in supporting evidence-based policymaking.  In addition, my Department continues to ensure evidence and analysis is at the centre of policymaking within the budgetary process. This is communicated through a range of publications including the annual expenditure report and the public service performance report, as well as our expenditure and policy evaluation papers across a range of topics.  In preparation for budget 2026, my Department undertook several pieces of analysis to support resource allocation. The public service performance report was published in June and it detailed how Departments performed against targets set in the Revised Estimates process. We published the national development plan review in July. We spoke about that previously. Importantly, we published the medium-term expenditure framework in September. This is a multiyear public expenditure planning exercise which supports assessment of the resource implications of future policy decisions over the period from 2025 to 2030. \n Deputy Cian O'Callaghan  Go raibh maith agat, a Aire, but let us focus on spending reviews and 2025, and not all the other things that have happened. The Government has a track record of wasting public money. We need look no further than the bike shed for an example of that. In previous years, spending reviews were published in the run-up to the budget. That did not happen this year. Why not? Why is the Minister suppressing these reports?  At the budgetary oversight committee, we were told by the Parliamentary Budget Office that about 50 spending reviews were carried out this year and that these were not published. Some 250 IGEES personnel worked on these spending reviews in every Department. It is a significant amount of work but we have not seen what is in these reviews. The public has a right to know what is in them. When will the Minister publish them? Is there something in these spending reviews the Minister does not want us to see? If not, will he commit now to publishing all spending reviews that have been carried out in 2025? \n Deputy Jack Chambers  I reject that analysis. Much work across government and in the public service is delivering a significant number of projects on time and on budget. Flippant remarks about particular projects undermine the core work of many people who work across our system. It is important to balance the Deputy's remarks in that context. Since 2024, approximately 59 publications have been authored. In 2025, we have had the Intergenerational Dependence on Social Housing working paper from the Department of Housing, Local Government and Heritage; the Review of Social Housing Delivery and Spend from my Department in January; the Supply and Demand of General Practice in Ireland report, which was published by the Department of Health; the Analytical Paper on the School Meals Programme, which was published in July; the Spending Review: Disability Residential Services report; and the Focused Policy Assessment: HSE Adult Disability Day Services report. I have a long list here which I can send to the Deputy of many papers published by IGEES, which is co-ordinated by my Department, as part of its work across government around spending reviews, value for money and providing policy analysis. There have been extensive publications. I could list many publications from this year, such as the well-being framework. They complement the medium-term expenditure framework, which was an extensive piece of work by the central expenditure division. \n Deputy Cian O'Callaghan  How many spending reviews were carried out in 2025 that have not been published? That is the nub of my question. That is what I want to know. We have been told at the budgetary oversight committee that in the region of 50 spending reviews across Departments - a very significant body of work - have not been published.  Can the Minister tell us how many spending reviews have been carried out this year, how many remain unpublished and when will he publish these spending reviews? They can provide an invaluable insight and analysis. There can be huge learnings from them. It is important information is shared with the public and that it is not suppressed. How many spending reviews have been carried out this year that the Minister has not published and when will he publish them? \n Deputy Jack Chambers  I started listing a number of them that have been published. As I said, there have been 59 papers published since 2024. I am happy to send to the Deputy a list of the ones we have published.  Indeed, what has informed most of the work in the Department was the medium term expenditure framework, which did an expenditure analysis of the overall expenditure trends across Government. I am not sure if the Deputy has read it. It looked at the----- \n Deputy Cian O'Callaghan  I am asking the Minister about the spending reviews he has not published. \n Deputy Jack Chambers  It has been the most extensive detailed piece of work across many of the economists in the Department, looking at the expenditure trends for the past five years and at how we make the policy choices and trade-offs over the next five years, acknowledging some of what was referenced in the Department of Finance report yesterday in terms of changing demographics, the impact of climate change and----- \n Deputy Cian O'Callaghan  Will the Minister publish the spending reviews that he has not published? \n Deputy Jack Chambers  There are ongoing publications. Indeed, I regularly publish their respective reports. I am not sure who is giving the Deputy that analysis on reports not being published because----- \n Deputy Cian O'Callaghan  The Parliamentary Budget Office. \n Deputy Jack Chambers  -----many of the IGEES reports are published.  I am not sure if the Deputy read the medium term expenditure framework. It is a comprehensive, cross-cutting cross-government report as a five-year backward-looking analysis on expenditure trends to inform expenditure for the next five years. It informs a lot of the work that we undertook as part of budget 2026 and will inform the medium-term structural and fiscal plan with the Minister, Deputy Donohoe. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_15",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/debate/dbsect_15",
          "showAs": "Public Expenditure Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/debate/mul@/dbsect_15.xml"
            }
          }
        },
        "showAs": " 2. Deputy Cian O'Callaghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will publish updated spending reviews for each Government Department; the reason for not publishing in advance of budget 2026; and if he will make a statement on the matter. [60444/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_2"
      }
    }
  ]
}