{
  "head": {
    "counts": {
      "questionCount": 923,
      "resultCount": 923
    }
  },
  "results": [
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 377,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_377",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_343",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_343",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  Since 2020, my department has invested over €5 billion in our schools throughout the country, involving the completion of over 950 school building projects and with construction currently underway at approximately 350 other projects, which includes 37 new school buildings. These 350 projects currently at construction involve a total State investment of over €1.5bn.  The department announced earlier this year that close to 90 projects, including 28 new school buildings, would be authorised to proceed from tender stage to construction over the course of 2024 and early 2025. In total, around €800 million will be invested in these projects under the department’s Large Scale Capital Programme and Additional Accommodation Scheme for essential classroom accommodation.  Between projects currently under construction and projects moving to construction in this latest phase, investments by the Department of Education are adding over 550,000 square metres of new and modernised capacity to our school estate.  This is a record level of investment in school buildings. It will expand the number of school places, significantly increase provision for special education and upgrade and modernise our school infrastructure. The impact of this will be felt in communities, right around the country.  The key drivers of capital investment in the schools’ sector include:  demographic growth, particularly at post-primary level;  increased demand for special educational needs provision;  alignment of school place provision with new housing development; and  climate action objectives including deep energy retrofit.  There was one new school delivered in Dun Laoghaire between 2020 and to date in 2024. Please see details below:  Cherrywood ETNS (RN20535E), Project Brief: new 24 classroom primary school + 2 class SEN, completed in 2023.  There were two new primary schools established since 2020 and to date in 2024 in Dún Laoghaire. Please see details below:  Cherrywood ETNS (RN20535E) established in 2020; and  Sallynoggin Killiney ETNS (RN20543D) established in 2022.  There was one new post-primary school established as a regional solution to serve the Booterstown_Blackrock and Dún Laoghaire school planning areas but is not located within the Dún Laoghaire constituency boundary. Please see details below:  Blackrock ETSS (RN68387K) established in 2021.  There are 10 schools in Dun Laoghaire with projects at various stages of planning and delivery. Please see details below:  St. Michael's House Special School Rathgar (RN18671A)  Ballyowen Meadows Special School (RN19355S)  Dún Laoghaire ETNS (RN20503O)  Gaelscoil Laighean (RN20518E)  Cherrywood Post Primary School (announced in 2018, timing of establishment is under review)  Bray Woodbrook Shanganagh Primary School (RN20536G)  Sallynoggin ETNS (20543D)  Sallynoggin Killiney DLR Cherrywood Primary School (RN20544F)  Holy Child Community School (RN91330K)  St. Brigid's Boys National School (RN16352U)  Further information on all current school building projects is available on the Department webpage at:  www.gov.ie/en/organisation/department-of-education/ ",
        "showAs": " 377. Deputy Jennifer Carroll MacNeill asked the Minister for Education the number of new school buildings delivered from 2020 to date in 2024 in Dún Laoghaire; the number of new schools established from 2020 to date in 2024; the number of schools awaiting a new school building each year from 2020 to 2024 to date; and if she will make a statement on the matter. [43084/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 417,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_417",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_381",
          "showAs": "Sports Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_381",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_381.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  On 25 September, Minister Martin and I announced €230 million in grants for sports clubs and facilities under phase 2 of the Community Sport Facilities Fund (formerly the Sports Capital and Equipment Programme).  Over a quarter of a billion euro has been allocated to community sports clubs and facilities in 2024, taking account of the earlier equipment-only allocation of €26 million, with a total investment of €256 million. This will facilitate the largest-ever investment in sports facilities in communities across Ireland.  Details of allocations under this round of the Community Sport Facilities Fund can be found by using this link: www.gov.ie/en/publication/3f9fa-community-sport-facilities-funding/. Details of allocations under previous rounds of the Community Sport Facilities Fund can be accessed by using this link: www.gov.ie/en/collection/471ed5-sports-capital-allocations/  The National Sports Policy, which was published in 2018, provided for the establishment of a Large Scale Sport Infrastructure Fund (LSSIF). The aim of the LSSIF is to provide Exchequer support for larger sports facility projects where the Exchequer investment would be greater than the maximum amount available under the Community Sport Facilities Fund (formerly the Sports Capital and Equipment Programme).  The first call for proposals under the LSSIF closed in 2019 with applications confined to local authorities and National Governing Bodies of Sport. All applications were assessed in accordance with the published Evaluation Procedures and Guidelines with the first allocations announced in January 2020. Details of allocations under the large-scale sport infrastructure fund can be found by using this link: gov.ie - Large Scale Sport Infrastructure Fund (LSSIF)  Earlier this year, Minister Martin and I announced funding of up to €120 million under the new 2024 round of the large-scale sport infrastructure fund, which closed for applications on 1 July 2024. Assessment of applications is well advanced and I hope to announce allocations under this latest round of LSSIF in the coming period. ",
        "showAs": " 417. Deputy Jennifer Carroll MacNeill asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the amount of money granted to sporting facilities under both the sports capital grant and the large-scale sport infrastructure fund from 2020 to date in 2024, in tabular form; and if she will make a statement on the matter. [43083/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 454,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_454",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_413",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_413",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_413.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Data on new dwelling completions are published on a quarterly basis by the CSO on its website at the following link: data.cso.ie/table/NDQ06. The data are disaggregated by local authority and dwelling type i.e. single houses, scheme houses and apartments. A breakdown of the number of these homes likely to be available for sale or rent is not provided.  Separately, my department publishes comprehensive programme-level statistics on a quarterly basis on affordable housing delivery activity in each local authority. Data for the period to the end of Q2 2024 can be accessed at the following link: www.gov.ie/en/collection/6060e-overall-social-housing-provision/#affordable-housing-delivery  My department also publishes the Social Housing Construction Status Report. The report provides details of social housing developments, and their location, that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The Quarter 2 2024 report is available at the following link: www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/ ",
        "showAs": " 454. Deputy Jennifer Carroll MacNeill asked the Minister for Housing, Local Government and Heritage the number of properties completed in Dún Laoghaire Rathdown in the years 2020 to date in 2024, in tabular form; the breakdown of these properties, if available, for example, house, apartment, for sale, social housing, affordable purchase, cost rental or rental; and if he will make a statement on the matter. [43081/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 455,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_455",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_414",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_414",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_414.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy Darragh O'Brien)  My department does not collect data on the overall number of homes under construction at any one time.  That said, combined quarterly data on new residential planning permissions and construction activity are captured by the four Dublin local authorities in the '4Dublin Housing Supply Pipeline Monitor'. While the monitor doesn't capture the full extent of planning and construction activity across the four authorities - as it is limited to developments of ten or more units and excludes local authority own developments, social housing units and student accommodation - it gives a good indication of activity in the four areas. This data is published on a quarterly basis by my department at the following link: www.gov.ie/en/collection/ca75e-planning-initiatives/.  Separately, my department publishes the Social Housing Construction Status Report. The report provides details of social housing developments, and their location, that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The Quarter 2 2024 report is available at the following link: www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/. ",
        "showAs": " 455. Deputy Jennifer Carroll MacNeill asked the Minister for Housing, Local Government and Heritage the number of homes under construction currently in Dún Laoghaire-Rathdown, in tabular form; the number of planning permissions currently granted for the Dún Laoghaire-Rathdown area; and if he will make a statement on the matter.  [43082/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 809,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_809",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_761",
          "showAs": "Primary Care Centres",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_761",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_761.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 809. Deputy Jennifer Carroll MacNeill asked the Minister for Health the number of primary healthcare centres in CHO 6; and if he will make a statement on the matter. [43085/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_858.xml"
            }
          },
          "debateSectionId": "dbsect_858",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_858",
          "showAs": "School Meals Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_936",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 936,
        "showAs": " 936. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection the up-to-date position regarding the rolling out of further hot school meals in schools in Dublin; the number of new schools that are included in the most recent addition of schools; if she will provide a list of all schools in County Dublin now benefitting from the scheme, including the date on which the schools were approved for the programme; the number of schools in County Dublin that remain outside the programme; the number of them that expressed an interest in the programme in the most recent call, in tabular form; and if she will make a statement on the matter. [34168/24] ",
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The Programme is an important component of policies to encourage school attendance and extra educational achievement. Following the expansion of the Programme in recent years, some 2,723 schools and organisations, covering 472,000 children are now eligible for funding.  As part of this significant expansion plan, all remaining primary schools were contacted last year and requested to submit an expression of interest form if their school is interested in commencing the provision of Hot School Meals. Expressions of interests were received from over 900 primary schools in respect of 150,000 children and late last year these schools were invited to participate in the Hot School Meals Programme from 8th April 2024.  I have since announced details of an additional 168 primary schools to be newly included in the Hot School Meals Programme from September 2024, and my Department contacted the remaining 1,000 primary schools, who have not yet joined the Hot School Meals scheme asking them to submit expressions of interest in commencing the provision of Hot School Meals. The responses will be reviewed with the aim of including more schools subject to available funding in Budget 2025.  Details of the number of schools in Dublin invited to the Programme in the most recent extension to 168 new schools, a list of schools currently availing of the Programme - including the dates invited to join the scheme - a list of schools who submitted an Expression of interest, and schools that remain outside the Programme who did not submit an Expression of interest, are included in the tabular statements below.  I trust this clarifies the matter for the Deputy.   Schools currently in the scheme including the new schools eligible from September 2024 - including the date they were invited to join the scheme      Roll Number    School Name    COUNTY    Date invited to scheme      07546J    Goldenbridge Convent    DUBLIN 8    September 2019      19601H    St Philip The Apostle Junior N S    DUBLIN 15    September 2019      19765O    St Thomas Senior N S    DUBLIN 24    September 2019      20308Q    Belmayne Educate Together National School    DUBLIN 13    September 2019      20056P    Gaelscoil Phadraig    CO. ÁTHA CLIATH    September 2019      19831B    Scoil Chaoimhin    BAILE ÁTHA CLIATH 1    January 2021      17603B    Scoil Iosagain Boys Senior    DUBLIN 12    January 2021      17464N    Fionnbarra Naofa B.N.S.    DUBLIN 7    January 2021      19619D    St Malachys Ns    DUBLIN 11    January 2021      19546C    St Oliver Plunkett N S    DUBLIN 11    January 2021      19896G    Scoil Caitriona Na Mbraithre    DUBLIN 2    January 2021      11578V    City Quay Ns    DUBLIN 2    January 2021      19197D    St Kevins B N S    DUBLIN 11    January 2021      19669S    Lady Of Good Counsel Boys Senior Ns    DUBLIN 12    January 2021      18137D    S N Naomh Feargal Boys Senior    DUBLIN 11    January 2021      19015R    St Josephs G N S    DUBLIN 11    January 2021      20507W    St Laurence O'Toole'S National School    DUBLIN 1    January 2021      18585H    S N Banrion Na Naingeal 1    DUBLIN 10    January 2021      17881G    Scoil Ui Chonaill Boys Seniors    DUBLIN 1    January 2021      20104A    St Audoens Ns    DUBLIN 8    January 2021      18361I    Sn Caitriona Girls    DUBLIN 5    January 2021      17104G    St Francis Junior National School    DUBLIN 17    January 2021      19454U    Darndale Ns Junior    DUBLIN 17    January 2021      19524P    Our Lady Immac Sen N S    DUBLIN 17    January 2021      20139T    Inchicore Ns    DUBLIN 10    January 2021      19668Q    St Francis Senior N S    DUBLIN 17    January 2021      18362K    S N Caitriona Naionain    DUBLIN 5    January 2021      15056L    S N San Vinseann Cailin    DUBLIN 1    January 2021      16786H    St Brigids Primary School    DUBLIN 8    January 2021      20429F    St. James'S Primary School    DUBLIN 8    January 2021      19661C    St Gabriels Ns    DUBLIN 10    January 2021      20064O    Our Lady Of Consolation Ns    DUBLIN 5    January 2021      19913D    St Josephs Ns    DUBLIN 17    January 2021      18726W    S N Seosamh Na Mbrathar    DUBLIN 3    January 2021      17355I    Muire Na Dea Coirle Girls Senior    DUBLIN 12    January 2021      18360G    Scoil Bhreandain    DUBLIN 5    January 2021      17083B    S N Muire Gan Smal B    DUBLIN 8    January 2021      19979K    St Kevins N S    CO. DUBLIN    January 2021      19497P    Scoil Mhuire    DUBLIN 18    January 2021      19693P    Mary Queen Of Ireland N S    CO DUBLIN    January 2021      19643A    St Philips Senior N S    DUBLIN 15    January 2021      20302E    Thornleigh Educate Together National School    CO. DUBLIN    January 2021      19850F    Ladyswell N S    DUBLIN 15    January 2021      20307O    Skerries Educate Together National School    CO. DUBLIN    January 2021      20186F    Castaheany Educate Together Ns    DUBLIN 15    January 2021      16983J    S N Naomh Cillin    DUBLIN 12    January 2021      19613O    Scoil Cnoc Mhuire Sin    DUBLIN 24    January 2021      19782O    St Brigids N S    DUBLIN 24    January 2021      19543T    S N An Croi Ro Naofa    DUBLIN 24    January 2021      19569O    Neillstown N S    DUBLIN 22    January 2021      19652B    An Chroi Ro Naofa Sois    DUBLIN 24    January 2021      19510E    Talbot Senior Ns    DUBLIN 22    January 2021      19872P    Scoil Chaitlin Maude    BAILE ÁTHA CLIATH 24    January 2021      19702N    St Thomas Junior N S    DUBLIN 24    January 2021      19707A    St Ronans N S    DUBLIN 22    January 2021      19646G    Scoil Santain    BAILE ÁTHA CLIATH 24    January 2021      20274C    Esker Educate Together Ns    CO. DUBLIN    January 2021      19878E    Holy Rosary Primary School    DUBLIN 24    January 2021      18843D    Bainrion Na Naingal 2    DUBLIN 10    January 2021      19775R    Scoil Cnoc Mhuire Junior    DUBLIN 24    January 2021      19382V    Scoil Eoin    DUBLIN 12    January 2021      19799I    Sacred Heart N S    DUBLIN 22    January 2021      19590F    Scoil Mochua    DUBLIN 22    January 2021      16989V    Christ The King Girls Senior School    DUBLIN 7    January 2021      19438W    Scoil Colmcille Senior    CO. DUBLIN    January 2022      19840C    Holy Family School    CO. DUBLIN    January 2022      19515O    S N Naomh Teresa    CO. DUBLIN    January 2022      19582G    Tallaght Community National School    DUBLIN 24    January 2022      19642V    St Peter Apostle Sen Ns    DUBLIN 22    January 2022      20220C    Gaelscoil Ui Earcain    BAILE ÁTHA CLIATH 11    January 2022      20468P    St Dominic'S National School    DUBLIN 24    January 2022      13611D    Presentation Primary School    DUBLIN 8    January 2022      20091R    St Peters Ns    DUBLIN 7    January 2022      20303G    Lucan East Etns    COUNTY DUBLIN    January 2022      19946S    Rutland National School    DUBLIN 1    January 2022      19662E    St Michaels Ns    DUBLIN 10    January 2022      19663G    St Raphaels Ns    DUBLIN 10    January 2022      19929S    St Brigids Senior Girls    DUBLIN 11    January 2022      17356K    Our Lady Of Good Counsel School    DUBLIN 12    January 2022      19764M    Our Lady Of Wayside N S    DUBLIN 12    January 2022      19605P    Scoil Nais Mhuire Sois    DUBLIN 15    January 2022      19694R    Scoil Mhuire Sin    DUBLIN 15    January 2022      19743E    St Bernadettes Junior N S    DUBLIN 22    January 2022      19785U    St Bernadettes Senior N S    DUBLIN 22    January 2022      19577N    Scoil Iosa    DUBLIN 24    January 2022      15253N    St Patricks Girls Ns    DUBLIN 4    January 2022      19935N    Scoil Eoin    DUBLIN 5    January 2022      18968A    St Malachys B N S    DUBLIN 5    January 2022      09932B    Stanhope Street Primary School    DUBLIN 7    January 2022      19933J    Scoil Treasa Naofa    DUBLIN 8    January 2022      03917V    Naomh Padraig Boys    DUBLIN 4    January 2022      20173T    St Annes Primary School    DUBLIN 24    January 2022      Schools currently in the scheme including the new schools eligible from September 2024 - including the date they were invited to join the scheme cont.      15816I    St Vincents Inf Boys    DUBLIN 1    September 2022      19834H    St Aidans Ns    DUBLIN 24    September 2022      17214N    St. Vincent'S Primary School    DUBLIN 11    September 2022      19390U    St Marks Sen Ns    DUBLIN 24    September 2022      19472W    St Marks Junior Mixed    DUBLIN 24    September 2022      19541P    Belgard Heights N S    DUBLIN 24    September 2022      19837N    Drimnagh Castle Cbs N S    DUBLIN 12    September 2022      19865S    Divine Mercy Junior National School    CO. DUBLIN    September 2022      19919P    St Davids N S    DUBLIN 5    September 2022      20187H    Divine Mercy Senior National School    CO. DUBLIN    September 2022      20450T    Assumption Junior School    DUBLIN 12    September 2022      20453C    Broombridge Educate Together National School    DUBLIN 7    September 2022      20502M    Scoil Sinead Ns    DUBLIN 11    September 2022      00752A    Central Senior Mxd N S    DUBLIN 1    September 2023      01795A    Central Infs School    DUBLIN 1    September 2023      05600C    Clochar San Dominic    CO. DUBLIN    September 2023      05933G    Presentation Primary School    DUBLIN 7    September 2023      12448N    Gardiner Street Convent    DUBLIN 1    September 2023      14556D    South City Cns    DUBLIN 8    September 2023      16695E    Scoil Na Mbrathar Boys Senior School    DUBLIN 7    September 2023      16964F    Scoil Mhuire Ogh 1    DUBLIN 12    September 2023      16988T    Christ The King B N S    DUBLIN 7    September 2023      17110B    Naomh Lorcan O Tuathail Senior Boys    DUBLIN 1    September 2023      17459U    Christ The King I G    DUBLIN 7    September 2023      17465P    Dominican Convent Girls Senior School    DUBLIN 7    September 2023      17466R    St Catherines Infant School    DUBLIN 7    September 2023      17683C    Muire Og 2 Loreto Con    DUBLIN 12    September 2023      17732M    Scoil Chiarain    DUBLIN 5    September 2023      17893N    Sancta Maria C B S    DUBLIN 8    September 2023      18205R    S N An Pharoiste    DUBLIN 11    September 2023      18386B    Marist National School    DUBLIN 12    September 2023      18477E    Scoil Na Mbrathar    DUBLIN 8    September 2023      18682F    St Canices B N S    DUBLIN 11    September 2023      18683H    St Canices G N S    DUBLIN 11    September 2023      18910P    Bantiarna Na Mbuanna Boys    DUBLIN 9    September 2023      18911R    Bantiarna Na Mbuanna Girls    DUBLIN 9    September 2023      18969C    St Eithnes Senior Girls Ns    DUBLIN 5    September 2023      19037E    St Monicas N S    DUBLIN 5    September 2023      19208F    Holy Spirit B N S    DUBLIN 11    September 2023      19209H    Sn An Spioraid Naiomh C    DUBLIN 11    September 2023      19242F    Our Lady Of Victories Infant N S    DUBLIN 9    September 2023      19297H    Cromcastle Green B N S    DUBLIN 5    September 2023      19298J    Scoil Nais Ide Cailini    DUBLIN 5    September 2023      19302U    S N Na Maighdine Muire B    DUBLIN 9    September 2023      19303W    Virgin Mary Girls National School    DUBLIN 9    September 2023      19430G    Scoil An Tseachtar Laoch    BAILE ÁTHA CLIATH 11    September 2023      19431I    St Josephs Jnr    DUBLIN 11    September 2023      19489Q    S N Naomh Finnin    DUBLIN 11    September 2023      19490B    Scoil Mhuire    DUBLIN 16    September 2023      19502F    Scoil Aenghusa Jun Ns    DUBLIN 24    September 2023      19509T    Scoil Nano Nagle    DUBLIN 22    September 2023      19545A    St. Patrick'S Junior Ns    DUBLIN 15    September 2023      19566I    Our Lady Queen Of Apostles    DUBLIN 22    September 2023      19575J    St Marys Junior N S    DUBLIN 22    September 2023      19576L    S N Aenghusa    DUBLIN 24    September 2023      19583I    St Josephs Senior N S    DUBLIN 11    September 2023      19636D    St Patricks Senior School    DUBLIN 15    September 2023      19641T    Scoil Cholmcille Junior Ns    CO. DUBLIN    September 2023      19647I    St Marys Sen N S    DUBLIN 22    September 2023      19723V    Queen Of Angels Primary School    DUBLIN 16    September 2023      19774P    St Josephs Mxd N S    DUBLIN 3    September 2023      19920A    St John Of God N S    DUBLIN 5    September 2023      19922E    Our Ladys N S    DUBLIN 14    September 2023      19924I    Harolds Cross N S    DUBLIN 6W    September 2023      19938T    St Josephs    CO. DUBLIN    September 2023      19939V    Scoil Naisiunta An Dea Aoire    DUBLIN 14    September 2023      19960M    St Johns N S    CO. DUBLIN    September 2023      19981U    St Marys N S    DUBLIN 3    September 2023      20015B    Gaelscoil Bhaile Munna    BAILE ÁTHA CLIATH 9    September 2023      20029M    St Brigids Infant N S    DUBLIN 11    September 2023      20035H    St Gabriels N S    DUBLIN 7    September 2023      20047O    Gaelscoil Bharra    BAILE ÁTHA CLIATH 7    September 2023      20059V    Mother Of Divine Grace    DUBLIN 11    September 2023      20092T    St Ultans Ns    DUBLIN 10    September 2023      20202A    Balbriggan Educate Together Ns    DUBLIN    September 2023      20218P    St Columbanus National School    DUBLIN    September 2023      20241K    Scoil Choilm Community Ns    DUBLIN 15    September 2023      20281W    St Benedicts And St Marys National School    DUBLIN 5    September 2023      20282B    Bracken Educate Together Ns    DUBLIN    September 2023      20397S    St Louise De Marillac Primary School    DUBLIN 10    September 2023      20422O    Scoil Aoife Cns    DUBLIN 24    September 2023      20436C    Paradise Place Etns    DUBLIN 7    September 2023      20463F    Holy Spirit Junior Primary School    DUBLIN 12    September 2023      20464H    Holy Spirit Senior Primary School    DUBLIN 12    September 2023      20488V    Scoil Úna Naofa    DUBLIN 12    September 2023      20545H    St Christopher'S Ns    DUBLIN 4    September 2023      17971H    St Michaels Spec School    DUBLIN 20    September 2023      18210K    St Michaels House Special School    DUBLIN 13    September 2023      18317F    Central Remedial Clinic    DUBLIN 3    September 2023      18370J    Enable Ireland Sandymount School    DUBLIN 4    September 2023      18417J    St Josephs For Blind Ns    DUBLIN 9    September 2023      18499O    St Augustines School    CO. DUBLIN    September 2023      18569J    St Declans Special Sch    DUBLIN 4    September 2023      18671A    St Michaels Hse Spec Sc    DUBLIN 18    September 2023      18763F    St Michaels Hse Spec Sc    DUBLIN 9    September 2023      18815V    Our Lady Of Lourdes School    CO. DUBLIN    September 2023      18863J    Benincasa Special School    CO DUBLIN    September 2023      18904U    St Peters Special Sch    DUBLIN 6    September 2023      19032R    Stewarts School    DUBLIN 20    September 2023      19039I    St Vincents Home Ns    DUBLIN 7    September 2023      19151C    St John Of God Sp Sch    DUBLIN 8    September 2023      19325J    St Ciarans Spec Sch    DUBLIN 11    September 2023      19355S    Ballyowen Meadows    DUBLIN    September 2023      19373U    St Michaels Hse Sp Sch    DUBLIN 5    September 2023      19409P    Casa Caterina S S    DUBLIN 7    September 2023      19499T    St Oliver Plunkett Sp Sc    CO DUBLIN    September 2023      19500B    Phoenix Park Specialist School    DUBLIN 8    September 2023      19520H    St Josephs Special Sch    DUBLIN 24    September 2023      19705T    Catherine Mc Auley N Sc    DUBLIN 2    September 2023      19757P    St Michaels Spec Sch    CO. DUBLIN    September 2023      20010O    St Roses Special School    DUBLIN 24    September 2023      20028K    Setanta Special School    DUBLIN 12    September 2023      20053J    Cheeverstown Sp Sch    DUBLIN 6W    September 2023      20121A    Carmona Special National School    CO. DUBLIN    September 2023      20279M    St Michael'S House Special NS Foxfield    DUBLIN 5    September 2023      20372C    Saplings Special School    DUBLIN 16    September 2023      20375I    Abacas Kilbarrack    DUBLIN 5    September 2023      20378O    Abacas Special School For Children With Autism    DUBLIN 24    September 2023      20381D    Red Door Special School    CO. DUBLIN    September 2023      20495S    Holy Family School For The Deaf    DUBLIN 7    September 2023      20548N    Danu Community Special School    DUBLIN 15    September 2023      20555K    Our Lady Of Hope School    DUBLIN 12    September 2023      20563J    Libermann Spiritan School    DUBLIN 6    September 2023      Schools currently in the scheme including the new schools eligible from September 2024 - including the date they were invited to join the scheme cont.      00714P    Lucan B N S    CO. DUBLIN    April 2024      09492W    Balscadden N S    CO. DUBLIN    April 2024      11894I    Scoil Mhuire    DUBLIN 4    April 2024      12358M    Swords Borough N S    CO. DUBLIN    April 2024      13217W    Holy Family National School    DUBLIN    April 2024      13447Q    Scoil Mhuire    CO. DUBLIN    April 2024      15132B    Harold Boys N S    CO. DUBLIN    April 2024      15895H    Drumcondra N S    DUBLIN 9    April 2024      16267G    St Patricks Boys National School    CO. DUBLIN    April 2024      16675V    Scoil Naomh Lucais    DUBLIN 15    April 2024      16966J    Scoil Naisiunta Stratford    DUBLIN 6    April 2024      20571I    St. Louis National School    DUBLIN 6    April 2024      17367P    Mary, Help Of Christians G.N.S.    DUBLIN 7    April 2024      17507F    S N Padraig Naofa    CO. DUBLIN    April 2024      17559B    S N Mhuire    CO. DUBLIN    April 2024      17595F    Cill Coscain    CO. DUBLIN    April 2024      17785K    San Nioclas Myra    DUBLIN 17       ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_551.xml"
            }
          },
          "debateSectionId": "dbsect_551",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_551",
          "showAs": "Emergency Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_592",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 592,
        "showAs": " 592. Deputy Jennifer Carroll MacNeill asked the Minister for Children, Equality, Disability, Integration and Youth the standard emergency plan that exists to accommodate adults in need of residential care if their carer, usually a family member, falls ill or unexpectedly dies; and if he will make a statement on the matter. [29917/24] ",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_552.xml"
            }
          },
          "debateSectionId": "dbsect_552",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_552",
          "showAs": "Disability Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_593",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 593,
        "showAs": " 593. Deputy Jennifer Carroll MacNeill asked the Minister for Children, Equality, Disability, Integration and Youth the budgetary measures implemented since 2020 to support and improve services for adults with additional needs, including residential beds and assisted living placements; and if he will make a statement on the matter. [29919/24] ",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  I wish to thank the Minister of State for raising this matter.  Residential Services make up the largest part of the Disability funding disbursed by the HSE, 58% of the total budget. As of April 2024, approximately 90 service providers provided residential services to 8,484 individuals throughout the country.  As Minister of State with responsibility for Disability, I am aware that there is a need for increased service provision within the disability sector and I have fought tirelessly to bring an unprecedented level of funding for specialist disability services.  The overall increase in recent years from €1.7 billion at the close of 2017 to close to €2.8 billion in 2024, reflects this Governments commitment to improving the lives of people with disabilities, signalling to those with a disability that this Government is serious about making a difference.    Residential Placement Delivery    Across the four years from 2020 to 2023 budget, this Government have provided funding to the HSE for additional residential placements both on a planned and emergency/priority basis through the National Service Plan (NSP), to deliver the following:  • NSP 2020: 56 new Priority 1 (Emergency) residential placements. 86 placements were developed.  • NSP 2021: 44 new Priority 1 (Emergency) residential placements, 68 planned residential places (102 total).  • NSP 2022: 50 new Priority 1 (Emergency) residential placements. 66 planned residential places (106 total)  • NSP 2023: 43 Priority 1 (Emergency), 23 residential packages for young people aging out of TUSLA placements, 18 delayed transfers of care in line with the Winter Plan. At the end of December 2023, 160 Priority 1 (Emergency) Residential Places were developed. This is significantly in excess of the NSP target of 43.  • NSP 2024: circa 100 new Priority 1 (Emergency) residential placements.  It is important to note that residential capacity in the system can be reduced. When residents of congregated settings sadly pass away, their places are not ordinarily re-utilised. This is in keeping with Government policy which is to move away from institutionalised settings.    Under 65’s in Nursing Homes    For some people under the age of 65, nursing homes are not an appropriate setting. The HSE Disability teams are identifying people under the age of 65 currently residing in nursing homes. The HSE are working with them to discuss their supports required to move into more appropriate community settings or to enhance the quality of life for those who will be continuing their nursing home placement in line with their will and preference.  In 2021 Government provided investment of €3 million to enable people under the age of 65yrs to transition to their own home with support. Budget 2022 provided a further allocation of €5.5 million (rising to €13.5 million in 2023), to address the situation of people with disabilities who may be inappropriately placed in nursing homes. Budget 2024 provides the basis to continue to improve access to enhanced disability services throughout the country.  The HSE is engaging with a cohort of 575 individuals for review and assessment for transition into the community or continued nursing home placements. As of April 2024, A total of 74 people have transitioned to homes of their choosing in the community since 2021 (the start of the programme). A further 55 individuals are in active planning for potential discharge. Additionally, 36 individuals have received additional enhanced quality of life supports, while they are currently continuing their placement in a Nursing Home.    Time to Move from Congregated Settings    Time to Move On from Congregated Settings (TTMO) – A Strategy for Community Inclusion was established under the Transforming Lives Programme. It is a model of support where people with disabilities are supported to move from congregated settings, often large institutions, to their own homes in the community, with the supports they need.  Time to Move On from Congregated Settings is progressing and continues to demonstrate very positive results for service users who have transitioned to living in homes in community settings. Progress made since the Time to Move On report (2009) shows that:  • 4,099 people were living in congregated settings at year end 2009  • By year end 2023, 1,532 people remained in congregated settings.  • 74 people moved from congregated to community settings in 2023, against an NSP target of 73 for the year.  The 2016 Programme for Government identified that there should be a one- third reduction in the number of individuals residing in congregated settings by the year 2021. This target has been met.    Assisted Living – Intensive Support Packages    In 2020, the HSE developed Intensive Support Packages, a new development initiative. The rationale behind the initiative was to demonstrate a person-centred approach to targeted supports designed to maintain the person in their own home and community.  These intensive transitional support packages, as referred to in NSP 2020, were mainly aimed at children and young people with complex/high support needs experiencing substantial levels of need, but who do not, as yet, require a long term residential placement. Intensive support packages are provided in addition to the traditional services, such as Day Services; Respite Services; Personal Assistance and Home Support Services.  In 2020, Disability Services committed to provide 144 intensive transitional support packages. However, at end of December 2020, a total of 857 intensive home support packages were developed across the 9 CHOs.  In 2021, €6 million in funding was allocated to Intensive Support packages. Disability Services committed to developing 358 additional intensive support packages and by year end had put in place 497 intensive support packages. This included 437 new packages and 60 packages approved in 2020 against additional Q4 funding, which were maintained in 2021.  The significant increase on the NSP targets was thought to be indicative of the requirement for additional in-home services to compensate for the reduction in the delivery of traditional respite services as a result of the Covid-19 pandemic.  In accordance with the NSP 2022, the HSE was allocated funding to provide 422 in home respite supports for emergency cases; this included 402 packages put in place in 2021, which have been maintained in 2022, plus 10 new supported living packages and 10 new intensive support packages to support transitions and discharges from acute services and the National Rehabilitation Hospital. At end of December 2022, 18 new intensive support packages and 19 new supported living packages were developed. As per the 2022 National Service Plan, funding for this was provided under all new measures.  In accordance with NSP 2023, Disability Services committed to the provision of 447 in home respite supports for emergency cases; this includes 420 packages put in place in 2022 which have been maintained in 2023, plus 27 additional in-home respite packages to children and young adults outlined in NSP 2023.  In 2023, we also developed a further 45 in home respite supports for Priority 1 cases, which added to the packages put in place in 2022 and were maintained in 2023, brings the number of in home respite supports for Priority 1 emergency cases delivered during the year to 465.  In accordance with NSP 2024, Specialist Disability Services is committed to providing 469 intensive support packages for priority 1 cases. This includes packages put in place in 2023 which have been maintained in 2024.    Future Planning    This Government is committed to the expansion of specialist services for people with disabilities. The Action Plan for Disability Services 2024-2026, which I published on 14th December 2023, represents a national strategy for capacity increases and service and policy reform in disability services. It was informed primarily by findings from the Disability Capacity Review, published in 2021. The Action Plan seeks to meet extra need over the 2024-2026 period in residential services through:  • Around 900 additional residential care places to tackle unmet needs and ensure supply keeps pace with demographic change;  • 500 new community-based residential care places to replace disability care in large institutional and campus-based settings, with a view to ending that form of provision by 2030;  • Increase support for people with disabilities to access supported independent living  • Provision of supports to live at home, in order to phase out long-term care in a nursing home for younger people with disabilities  • Around 550 additional intensive support packages to be put in place over 2024-2026, to limit need for high-cost residential care places.  €74 million has been allocated for new development measures in 2024. This will provide for greater investment across a range of disability services and contribute to the progressive realisation of the Action Plan. Of this, €20.5 million has been provided for circa 100 Residential placements for children and adults. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/mul@/dbsect_752.xml"
            }
          },
          "debateSectionId": "dbsect_752",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-09/writtens/dbsect_752",
          "showAs": "Health Services Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-09/pq_801",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 801,
        "showAs": " 801. Deputy Jennifer Carroll MacNeill asked the Minister for Health the number of adults currently waiting on a residential bed, by county; and if he will make a statement on the matter. [29918/24] ",
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-09",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2023-02-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-09/writtens/mul@/dbsect_250.xml"
            }
          },
          "debateSectionId": "dbsect_250",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-09/writtens/dbsect_250",
          "showAs": "Visa Applications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-02-09/pq_240",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 240,
        "showAs": " 240. Deputy Jennifer Carroll MacNeill asked the Minister for Justice if he will provide assistance on a stamp 4 renewal application by a person (details supplied); and if he will make a statement on the matter. [6207/23] ",
        "answerText": " Minister for Justice  As the person referred to by the Deputy is resident in Dublin, they can apply to renew their immigration permission through the online renewal system for the Registration office of my Department at: inisonline.jahs.ie/ . Currently, the Registration office is processing applications made in the week commencing 30 November 2022.  Queries in relation to the status of individual immigration cases may be made directly to my Department by e-mail using the Oireachtas Mail facility ( inisoireachtasmail@justice.ie ), which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Questions process. The Deputy may consider using the e-mail service except in cases where the response is, in the Deputy’s view, inadequate or too long awaited. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-02-09",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 64,
        "showAs": " 64. Deputy Jennifer Carroll MacNeill asked the Minister for the Environment, Climate and Communications if a universal rate will be decided on for microgeneration customers who have signed up to sell power from solar panels back to the national grid; if a date for these payments has been set, given that it was originally due to be in December 2021; and if he will make a statement on the matter. [63254/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_64",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Environment",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for the Environment, Climate and Communications  On 15th February of 2022 I signed the Regulations that create an obligation on all suppliers to offer the Clean Export Guarantee (CEG) tariff to new and existing micro-and small-scale generators so that they will receive payment for excess renewable electricity they export to the grid, reflective of the market value.  In December 2021 the Commission for Regulation of Utilities (CRU) published a Decision on an interim enabling framework for the CEG which outlines the arrangements for its implementation, including eligibility criteria and remuneration methodology (CRU21131-Interim-Clean-Export-Guarantee-Decision-Paper.pdf). As part of this, the CRU decided that suppliers would set their individual CEG tariffs on a competitive market basis. Payments will be backdated to the date of eligibility or the 15th February 2022 (the date the regulations were enacted), whichever is the latest.  The CRU has asked all suppliers to communicate their decision to their customers on when  CEG payments will be made at the earliest opportunity. I am aware that  suppliers have now advertised their rates, which range from €13.5c/kWh up to €21c/kW. The CRU advises customers to contact their supplier to obtain information on their suppliers' CEG tariff arrangements.  I am also aware that the CRU intends to review the CEG framework earlier in 2023 to ensure that remuneration rates are reflective of the current market.  CRU provides a dedicated email address for Oireachtas members, which enables them raise questions on general energy regulatory matters to CRU at oireachtas@cru.ie for timely direct reply. ",
        "debateSection": {
          "debateSectionId": "dbsect_84",
          "showAs": "Electricity Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_84.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_84"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 833,
        "showAs": " 833. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection if her Department will provide support for a person (details supplied) whose pension has been reduced; and if she will make a statement on the matter. [63184/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_833",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  The person concerned reached pension age on 24 August 2022.  According to the records of my department an application for State Pension (contributory) was received on 19 September 2022.  The person concerned has a total of 1,431 reckonable paid and credited social insurance contributions from 07 May 1975 to the end of December 2021.  This equates to a yearly average of 30 contributions giving an entitlement to 90% of the State Pension (contributory) rate of payment.  This is the correct rate commensurate with the social insurance record as held by my Department.  To qualify for State Pension (contributory) at the maximum rate, the person concerned would need a yearly average of at least 48 contributions.  I have arranged for a copy of the person’s social insurance record to issue to them.  If the person considers that additional contributions or credits have not been recorded, it is open to them to forward documentary evidence to my Department and their pension entitlement will be reviewed.  It is also open to them to apply for the means-tested State Pension (Non-Contributory), the maximum rate of which is over 95% of the maximum rate of the State Pension (Contributory).  I have arranged for a State Pension non-contributory application form to issue to them.  I hope this clarifies the matter for the Deputy. ",
        "debateSection": {
          "debateSectionId": "dbsect_748",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_748.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_748"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 908,
        "showAs": " 908. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection the status of the case of a person (details supplied) who has been refused a carer's support grant; and if she will make a statement on the matter. [1524/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_908",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  The Carer's Support Grant is an annual payment made to carers by my department.  I can confirm that my Department received an application for the Carer’s Support Grant (CSG) from the person concerned on 20 April 2022.  In order to qualify for CSG, a person must be providing full time care and attention.  Full time care and attention is defined as not less than 35 hours in a period of 7 consecutive days, and care is provided on any 5 days, whether consecutive or not within a period of 7 consecutive days.  As the person concerned stated that she was caring four hours per day, four days per week a total of 16 hours care per week, she was not providing full-time care and attention.  The application was disallowed, and a letter issued to the person concerned on 10 May 2022, informing her of the decision and of her of her right of review and appeal.  On the 7 July 2022 the person concerned requested a review of the decision.  She was notified by the Department, on the 11 July 2022, that on review the original decision was upheld.  On the 11 August 2022 a request for an appeal of the decision was received.  On 14 November 2022 the Social Welfare Appeals Office notified the person concerned that her appeal was disallowed.  I hope this clarifies the position for the Deputy. ",
        "debateSection": {
          "debateSectionId": "dbsect_817",
          "showAs": "Social Welfare Appeals",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_817.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_817"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 920,
        "showAs": " 920. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection the number of households receiving the over-70s fuel allowance; if there is a breakdown by local area, in tabular form, including Dún Laoghaire; and if she will make a statement on the matter. [2068/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_920",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  The Fuel Allowance scheme is a means tested payment to assist long-term social welfare dependent householders and those aged 70 and over with their winter heating costs.  The payment is a contribution towards heating costs; it is not intended to meet these costs in full.  The payment is made over the winter season at the weekly rate of €33.00 or, if preferred, by way of two instalment payments.  Only one Fuel Allowance is payable per household.  Those who qualify for the payment do not need to reapply annually.  I was pleased, as part of the Social Protection Budget 2023 Package of €2.2 billion, to announce that I had secured funding for the largest ever expansion of the Fuel Allowance scheme.  It is estimated that the changes introduced will see up to 81,000 additional households qualify for the scheme.  There is a more streamlined process in place for applicants aged 70 and over.  A new online Fuel Allowance application service was made available on MyWelfare on 5 December 2022, which makes it easier and quicker for customers to apply for the payment, at a time and place that suits them.  As at the end of December 2022, almost 8,600 recipients aged 70 and over had been awarded Fuel Allowance since the start of the 2022/23 fuel allowance season on 26 September 2022.   Of these, some 4,300 applicants qualified with effect from January 2023, when the new measures for the over 70s take effect.  While it is not possible to provide a local area breakdown, I am informed that almost 900 of these newly qualified households have an address in Dublin.  This is the largest ever expansion of the Fuel Allowance scheme and applications are being processed as quickly as possible.  Applicants who qualify for the payment will receive their full entitlement which will be backdated as appropriate.  I trust this clarifies the matter. ",
        "debateSection": {
          "debateSectionId": "dbsect_830",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_830.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_830"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 939,
        "showAs": " 939. Deputy Jennifer Carroll MacNeill asked the Minister for Children, Equality, Disability, Integration and Youth if he will provide an update on the management of a redress scheme for victims of abuse of an institution (details supplied); and if he will make a statement on the matter. [63147/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_939",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  There are no plans to establish a redress scheme in relation to the organisation referred to by the Deputy. It is important to note that this organisation is a voluntary body, governed by its own Board. It receives some of its funding from the Department of Children, Equality, Disability, Integration and Youth and raises other funding through member subscriptions and fund raising.  When very serious issues involving former safeguarding and governance practices in the organisation emerged in early 2018, the Department of Children, Equality, Disability, Integration and Youth, as a provider of substantial grant funding to the organisation, took a number of steps to satisfy itself in relation to current safeguarding and governance within the organisation:  - Funding to the organisation was suspended pending the appointment of a new Board, which is now in place  - In 2018, the Government commissioned an independent review of governance within the organisation, as well as a follow up review, published in May 2020. The latter found that the recommendations of the 2018 review had been satisfactorily implemented, while identifying a small number of outstanding matters to be addressed in a subsequent report by the organisation to the Department, which was delivered in September 2020.  - The Department required ongoing reports from the organisation in relation to the process of governance reform.  In addition, the organisation in question commissioned its own independent learning review of historical sexual abuse within the organisation. The then Minister met with this reviewer in May 2020 and was reassured, notwithstanding the reviewer’s very serious findings in relation to historical practices, by his satisfaction with current governance and safeguarding practice within the organisation.  These independent reviews indicate that safeguarding is now a strong focus and priority for the organisation and that robust safeguarding and governance structures have been put in place.  In revising its safeguarding policies, the organisation has worked closely with Tusla, which has indicated to the funding Department its satisfaction with the revised procedures in place. ",
        "debateSection": {
          "debateSectionId": "dbsect_849",
          "showAs": "Victim Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_849.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_849"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 965,
        "showAs": " 965. Deputy Jennifer Carroll MacNeill asked the Minister for Children, Equality, Disability, Integration and Youth if the new childcare policy has made the model less flexible for those not availing of full-time childcare (details supplied); and if he will make a statement on the matter. [63765/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_965",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  Significant investment is being made by my Department to address affordability for parents through the National Childcare Scheme (NCS). As the Deputy is aware, I announced additional funding of €121m as part of Budget 2023 for the NCS, which has been allocated to reduce average parental co-payments for early learning and childcare.  From 2 January 2023, all families accessing registered early learning and childcare received a minimum hourly NCS subsidy of €1.40. This is an increase of €0.90 from the previous minimum hourly rate.  Early learning and care (ELC) and school aged childcare (SAC) services are provided by private enterprises, either privately owned or operated by community organisations. While service providers are contracted by my Department to provide services at a subsidised rate to parents, and those providers must pass on the NCS subsidy in full and cannot increase fees, they are however free to set their own policies regarding levels of early learning and care offered, including whether or not they offer part-time places.  Notwithstanding this, the ECCE rules are clear in relation to children already registered on the ECCE programme and there is no requirement on the parent to avail of 5 days full time care in order to continue on the ECCE programme for the remainder of the ECCE programme year.  Section 2.4 of the ECCE rules states: “An Approved Provider may not displace a child availing of a shorter week in favour of a child applying for five days of ECCE after the child’s ECCE registration is complete”  Lastly, the Scheme has been designed to be flexible so that parents can access their award through any registered early learning and childcare service in contract to deliver the NCS. My Department funds a national network of County Childcare Committees (CCCs) who provide support and advice to parents and childcare providers. I would encourage the parent to contact their local CCC regarding any issues around childcare. The contact details for the CCCs can be found on myccc.gov.ie. ",
        "debateSection": {
          "debateSectionId": "dbsect_867",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_867.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_867"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1154,
        "showAs": " 1154. Deputy Jennifer Carroll MacNeill asked the Minister for Health when the community neurorehabilitation team for CHO 6 (details supplied) will be established; and if he will make a statement on the matter. [63143/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1154",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Health  As this question relates to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "debateSectionId": "dbsect_1049",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1049.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1049"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1161,
        "showAs": " 1161. Deputy Jennifer Carroll MacNeill asked the Minister for Health the entitlements that are available for children under seven years of age in terms of early intervention healthcare such as dental checks, hearing tests, eye tests and general medical check-ups; and if he will make a statement on the matter. [63158/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1161",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  Dental services for children up to 16 years of age are provided by the Public Dental Service of the Health Service Executive (HSE) through its dental clinics. HSE dental clinics provide a screening and fissure sealant programme for children at key stages of development, that is, children aged six to eight; children aged 11 to 16; and, where resources are available, children aged nine to 11. Emergency care for children up to 16 years of age is also provided.  The HSE Community Audiology Service provides a full range of hearing assessments to identify the presence (type, degree and configuration) of a hearing loss in children of all ages. All babies born in Ireland are offered a newborn hearing screening in order to check whether a baby has permanent hearing loss in one or both ears. Further hearing tests may be offered at later stages (e.g., when a child starts school at 4 or 5) or if a child is referred to the Service by their GP or other healthcare professionals.  Audiology services, including the provision of hearing aids (if needed), are free for all children under the age of 18. Those presenting in primary care settings with certain medical concerns are referred to Ear, Nose and Throat (ENT) services. ENT departments in hospitals treat acute hearing problems. They assess and treat hearing problems with surgery or medication if required. Where the ENT consultant identifies a longer-term (or 'chronic') hearing problem that cannot be treated with surgery or medication, they may refer the child to the HSE audiology service.  All children, including those not covered by a medical card, receive a vision screen while in national school from a Public Health Nurse. The HSE provides optical services free of charge to pre-school children and national school children referred from child health service and school health service examinations who are discovered to have sight problems. These children are referred to the appropriate consultant for treatment. In such circumstances, these services will continue to be provided until the child has reached the age of 16.  Children’s development is monitored by Public Health Nurses. This includes regular checks at 3 months, 9-11 months, 18-24 months, and 31/4 - 31/2 years. All stages of checks include assessing physical development such as growth, posture, and motor skills. Checks after 9 months include assessment of a child’s psychological development through social, emotional, and play behaviours. ",
        "debateSection": {
          "debateSectionId": "dbsect_1056",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1056.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1056"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1224,
        "showAs": " 1224. Deputy Jennifer Carroll MacNeill asked the Minister for Health the reason that a child (details supplied) has waited for 24 months for their developmental check; and if he will make a statement on the matter.  [63474/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1224",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "debateSectionId": "dbsect_1116",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1116.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1116"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 1325,
        "showAs": " 1325. Deputy Jennifer Carroll MacNeill asked the Minister for Health when the Covid bonus will be paid to healthcare staff (details supplied) who have been waiting for almost a year; and if he will make a statement on the matter. [63833/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-18/pq_1325",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly. ",
        "debateSection": {
          "debateSectionId": "dbsect_1206",
          "showAs": "Covid-19 Pandemic Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/mul@/dbsect_1206.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-18/writtens/dbsect_1206"
        },
        "date": "2023-01-18",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-18"
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 34. Deputy Jennifer Carroll MacNeill asked the Minister for Rural and Community Development the specific supports that are available for an organisation (details supplied) across Ireland, in particular in relation to a number of schemes announced recently; and if she will make a statement on the matter. [62742/22] ",
        "date": "2022-12-15",
        "questionNumber": 34,
        "answerText": " Minister for Rural and Community Development  My Department has provided a range of supports which both Men's and Women’s Sheds have availed of, depending on the works being completed.  For example, in 2018 the Community Enhancement Programme provided capital funding for community groups which included €0.5m that was ring-fenced for Men's Sheds and again in 2019, €0.5m was ring-fenced under the programme for both Men's and Women's Sheds.  In 2020, the Community Enhancement Programme received total funding of €7.2m, including €5m under the Government's July stimulus package for repairs and upgrades to community centres and community buildings. Under this programme, 124 men’s sheds projects benefited and received funding to the value of €207,836.  In 2021, the Community Enhancement Programme provided funding of €4.5m for small capital grants to community groups to enhance their facilities and towards the re-opening of facilities. Men's sheds along with other community groups could apply to this funding programme. 68 men’s sheds received funding to the value of €126,804 from this programme.  In November 2021, the €9m Community Activities Fund, under the Community Enhancement Programme was launched to support community groups impacted by COVID-19. This fund provided funding to support groups, particularly in disadvantaged areas, with their running/operating costs such as utility or insurance bills, as well as with improvements to their facilities. Men’s Sheds were eligible to apply for this funding via their LCDCs.  The Social Inclusion and Community Activation Programme (SICAP) has provided supports to over 200 Men’s Sheds since 2018, with small grants totaling over €98,000 awarded to 116 Men’s Sheds. This support is still is available from SICAP.  My Department also funded the Irish Men’s Sheds Association under the COVID-19 Stability Funding in 2020. They distributed €70,424 equally among their member sheds to support the organisation to continue to deliver services despite the challenges brought by COVID-19.  The Scheme to Support National Organisations (SSNO) provides multi-annual funding towards core costs of national, community and voluntary organisations. The current iteration commenced on 1 July 2022 and will cease on 30 June 2025. The Irish Men’s Sheds Association has been allocated total funding of €243,158 over the three year period of the scheme.  I recently awarded €800,000 in funding to Men's Sheds, meaning each Shed registered with the Irish's Men's Sheds Association could get a grant of up to €2,000 by applying to their parent organisation.  And finally, Men's Sheds can apply to the recently launched Community Support Fund which provides supports to small groups who are struggling with energy/running costs and for small capital works. Sheds should contact their local LCDC for details of this fund. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_34",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_70",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_70"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 90. Deputy Jennifer Carroll MacNeill asked the Minister for the Environment, Climate and Communications the Programme for Government commitments that have been achieved to date; the commitments with regards to broadband across Ireland that have been achieved to date; and if he will make a statement on the matter. [62740/22] ",
        "date": "2022-12-15",
        "questionNumber": 90,
        "answerText": " Minister of State at the Department of the Environment, Climate and Communications  The ambition of the Government with respect to digital connectivity is set out in the national digital strategy, Harnessing Digital – The Digital Ireland Framework that was published earlier this year. The strategy is aimed at driving and enabling the digital transition across the Irish economy and society.  This high-level framework in the strategy sets out a pathway to support Ireland’s ambition to be a digital leader at the heart of European and global digital developments. Core to achieving this will be making connectivity available to everyone, including through the National Broadband Plan, Remote Working Hubs and Broadband Connection Points, with a target of having all Irish households and businesses covered by Gigabit network no later than 2028 and all populated areas covered by 5G no later than 2030.  Last week my Department published Ireland's Digital Connectivity Strategy which has the aim of ensuring that all sectors will be armed with the connectivity needed to fully exploit digital opportunities, leading to more balanced regional development, while supporting the green transition. The strategy will facilitate greater access to regional talent and skills, and supports the implementation of a range of government priorities  The strategy will be achieved through:  - the implementation of the National Broadband Plan  - investment by commercial operators in Gigabit services ensuring that international connectivity infrastructure to and from Ireland is resilient, diverse and robust  - the transposition of the Communications Regulation Amendment Bill, and  - the implementation of the actions of the Mobile Phone and Broadband Taskforce  - the implementation of the National Cyber Security Strategy  Specifically with respect to access to high-speed broadband, as of 2nd December 2022, NBI advise that over 112,200 premises can order or pre-order a high-speed broadband connection across 25 counties, with over 101,700 premises passed across 25 counties and available for immediate connection. Construction is underway across 26 counties demonstrating that the project is reaching scale. To date, the level of connections is increasing on a daily basis and is exceeding projections.  Strategic Connection Points (SCPs) are a key element of the NBP providing high speed broadband in every county in advance of the roll out of the fibre to the home network. As of 02 December 2022, 823 SCP sites (280 Broadband Connection Points, which are publicly accessible sites, and 543 schools) have been installed and the high-speed broadband service will be switched on in these locations through service provider contracts managed by the Department of Rural and Community Development for BCPs and the Department of Education for school SCPs. My Department continues to work with the Department of Education to prioritise schools with no high-speed broadband, within the Intervention Area. Further details are available on the NBI website at nbi.ie/primary-schools-list/ .  Eir has committed to rolling out fibre to a further 1.6 million premises, bringing their fibre deployment to some 1.9 million premises. SIRO is currently completing the first phase of its fibre deployment and to date has passed more than 430,000 premises with gigabit services and it has recently announced plans to extend its network to an additional 320,000 premises. Virgin Media is offering 250Mbps as a standard offering with 500Mbps and 1Gbps available to many of their customers across the more than 1 million premises that they cover. Many other network operators and telecom service providers across the State also continue to invest in their networks. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_90",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_115",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_115.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_115"
        },
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 144. Deputy Jennifer Carroll MacNeill asked the Minister for the Environment, Climate and Communications the status of the progress of the implementation of the local Digital Strategy in each county as detailed under the National Broadband Plan; and if he will make a statement on the matter. [61850/22] ",
        "date": "2022-12-15",
        "questionNumber": 144,
        "answerText": " Minister of State at the Department of the Environment, Climate and Communications  While I do not have a direct role with respect to Local Digital Strategies, the deployment of high-speed fibre broadband networks under the National broadband Plan and through investment by commercial operators, will bring many new opportunities to communities to more fully participate in the Digital economy. Local Digital Strategies will bring a focus to how these fibre networks can be leveraged to the benefit of local communities. My Department has been advised by the Department of Rural and Community Development that 21 of the 31 Local Authorities have published their Local Digital Strategies and it I understand that it is expected that the remaining 10 will have an updated strategy published during the course of 2023. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_144",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_162",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_162"
        },
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 157. Deputy Jennifer Carroll MacNeill asked the Minister for the Environment, Climate and Communications the progress that his Department has specifically made with regard to delivering the National Broadband Plan; and if he will make a statement on the matter. [56288/22] ",
        "date": "2022-12-15",
        "questionNumber": 157,
        "answerText": " Minister of State at the Department of the Environment, Climate and Communications  The National Broadband Plan (NBP) state led intervention will be delivered by National Broadband Ireland (NBI) under a contract to roll out a high speed and future proofed broadband network within the intervention area which covers 1.1 million people living and working in over 560,000 premises, including almost 100,000 businesses and farms along with some 679 schools. There are over 2.47 million premises in the country of which:  - Over 564,00 (22.8%) are within the AMBER area which will be provided with high speed broadband through the State led Intervention;  - Over 1.9 million (77.2%) premises are within the BLUE area which represents those areas where commercial providers are either currently delivering or have plans to deliver high speed broadband services.  I am advised by NBI that, as of 02 December 2022, over 112,200 premises can order or pre-order a high-speed broadband connection across 25 counties, with over 101,700 premises passed across 25 counties and available for immediate connection. Construction is underway across 26 counties demonstrating that the project is reaching scale. To date, the level of connections is increasing on a daily basis and is exceeding, projections.  Strategic Connection Points (SCPs) are a key element of the NBP providing high speed broadband in every county in advance of the roll out of the fibre to the home network. As of 02 December 2022, 823 SCP sites (280 Broadband Connection Points, which are publicly accessible sites, and 543 schools) have been installed and the high-speed broadband service will be switched on in these locations through service provider contracts managed by the Department of Rural and Community Development for BCPs and the Department of Education for school SCPs. My Department continues to work with the Department of Education to prioritise schools with no high-speed broadband, within the Intervention Area. Further details are available on the NBI website at nbi.ie/primary-schools-list/.  Eir has said it will roll out fibre to some 1.9 million premises. SIRO is currently completing the first phase of its fibre deployment and to date has passed more than 430,000 premises with gigabit services and it has recently announced plans to extend its network to an additional 320,000 premises. Virgin Media is offering 250Mbps as a standard offering with 500Mbps and 1Gbps available to many of their customers across the more than 1 million premises that they cover. Many other network operators and telecom service providers across the State also continue to invest in their networks. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_157",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Broadband Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_173"
        },
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-15",
      "question": {
        "showAs": " 246. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection if support will be provided in relation to the case of a person (details supplied) who has yet to receive a backdated payment of a disability allowance; and if she will make a statement on the matter.  [62835/22] ",
        "date": "2022-12-15",
        "questionNumber": 246,
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a weekly allowance paid to people with a specified disability who are aged 16 or over and under the age of 66. This disability must be expected to last for at least one year and the allowance is subject to a medical assessment, means test and Habitual Residency conditions.  I can confirm that my department received an application for disability allowance (DA) from the person concerned on 18 October 2022.  The person concerned has been awarded disability allowance with effect from 19 October 2022. The person concerned was notified in writing of this decision on 12 November 2022. The first payment was made by their chosen payment method on 30 November 2022.  I can confirm that Arrears of payment due from 19 October 2022 to 29 November 2022 issued to the person concerned on 12 December 2022. A letter notifying the person of this issued on 12 December 2022.  I trust this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-15/pq_246",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_261",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-15/writtens/dbsect_261"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-14",
      "question": {
        "showAs": " 170. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection the further supports that are available for a person (details supplied) who is in receipt of disability allowance and who is living with a partner; and if she will make a statement on the matter. [62575/22] ",
        "date": "2022-12-14",
        "questionNumber": 170,
        "answerText": " Minister for Social Protection  The person concerned is in receipt of Invalidity Pension at the maximum weekly personal rate and has a travel pass. He is also in receipt of the Household Benefits Package which includes electricity allowance and free television licence. Fuel Allowance is in payment in the household.  From the information available to the department, the partner of the person concerned is in receipt of a payment in their own right and therefore an increase for a qualified adult is not payable in this case.  The person concerned received the Cost of Living double payment on 20 October 2022, the lump-sum Disability Support Grant of €500 on 17 November 2022 and the Christmas Bonus double payment on 8 December 2022. The person concerned is receiving his full entitlements from my department.  I trust this clarifies the matter for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-14/pq_170",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_217",
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-14/writtens/dbsect_217"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 61. Deputy Jennifer Carroll MacNeill asked the Tánaiste and Minister for Enterprise, Trade and Employment the progress that has been made to date with the ratification of International Labour Organization Convention on Violence and Harassment, 2019 (No. 190); the next steps envisaged in advance of ratification; and if he will make a statement on the matter.  [57496/22] ",
        "date": "2022-12-13",
        "questionNumber": 61,
        "answerText": " Deputy Jennifer Carroll MacNeill  I wish to ask the Tánaiste and Minister for Enterprise, Trade and Employment to update the House on the progress that has been made to date with the ratification of the International Labour Organization Convention on Violence and Harassment, noting the Cabinet decision at the end of last month to progress that and the next steps in advance of ratification. \n Deputy Leo Varadkar  Violence and harassment in the workplace are unacceptable and undermine the principles of human rights. We have comprehensive legislation in Ireland to protect against this and the International Labour Organization, ILO, convention sends a clear signal to workers and employers that every workplace must be free from harassment and violence.  I was committed to Ireland being an early ratifier of this convention. I am particularly pleased that we have met the timeline to ratify this convention before the end of 2022 in line with the Minister for Justice's new zero-tolerance action plan on domestic, sexual and gender-based violence.  Since the Government approved its ratification on 29 November 2022, my Department has engaged with the Department of Foreign Affairs and the ILO to arrange the signing of the instrument of ratification by the Minister for Foreign Affairs and the depositing of the treaty with the ILO in Geneva. We expect to complete the process by the end of 2022.  The ILO is unique in the UN system with governments, workers and employers working together to promote decent work and advance social justice. I thank IBEC and ICTU for their work on this. The strong relationship we have with employer and employee representative bodies is fundamental to our ability to play an active role within the ILO.  The world of work has altered so much since 1923 when Ireland, as a new State, joined the ILO, its first international organisation. I am pleased that Ireland, through ratification of this ILO convention, is taking a strong stand against violence and harassment in the workplace. \n Deputy Jennifer Carroll MacNeill  The Tánaiste's response is very welcome, particularly as it is in tandem with the implementation of the third strategy under the Department of Justice. I know the Department of Enterprise, Trade and Employment conducted a stakeholder consultation on it. I am interested in the tenor of some of the responses that came back and the extent to which they highlighted gender harassment and sexual harassment within the workplace. It is quite striking that the convention leads so strongly with gender-based violence and harassment disproportionately affecting women and girls and how difficult that can make working life for them. We have heard from victims of sexual harassment that when it happens in the workplace, it is so often a surprise and it is so often that the victim simply freezes and cannot believe it has happened in what should be a safe space - the place they go to work. Women in particular face a spectrum of sexual harassment but for that to occur in the workplace where they must go every day, albeit sometimes remotely now, makes life extremely difficult. \n Deputy Leo Varadkar  The convention is a legal instrument that recognises the right of everyone to a world of work free from violence and harassment, including gender-based violence and harassment as well. It acknowledges that gender-based violence and harassment disproportionately affects women and girls. The convention calls for states to recognise and address this as far as is possible and to minimise the effect of domestic violence and harassment at work.  The introduction of domestic violence leave by the Department of Children, Equality, Disability, Integration and Youth goes beyond what is required by the convention and does represent tangible action by the Government in this regard. Ratification of the convention is listed as a deliverable in the implementation plan for the third national strategy on domestic, sexual and gender-based violence. Other actions in that strategy provide an excellent response to C190's requirements in respect of victims of gender-based violence and harassment in the world of work. \n Deputy Jennifer Carroll MacNeill  The timing of this is wonderful because the Oireachtas Committee on Gender Equality, in which the Tánaiste participated at an earlier stage, will publish its report on Thursday, 15 December on ending gender stereotyping, in particular, in Ireland. So much of this, as the convention recognises, comes from what has been an unequal gender-based power relationship for many years. I would suggest that the Department could lean into the Department of Education in respect of its programme on relationships and sex education, which is really the only way to effect long-term inter-generational change - a cultural change - of the kind that is necessary to disrupt those unequal power relationships, which form the basis for so much of gender and other harassment but particularly gender harassment. \n Deputy Leo Varadkar  We will certainly do that. We are keen to work across government and different Departments to get this right and make some real changes in these areas. One of the things I have been pleased to be involved in in the past number of years is increasing the number of women on State boards and company boards. We have made real progress in that regard. It is more or less 50:50 or 45:55 on State boards and well over 30% on the boards of listed companies. Where it is still pretty weak is at the C suite - CEO, CFO and CPO. Boards are much better while leadership positions are really not great. These things will only fundamentally change in the workplace if there is an equal number of women in those senior positions in the first place. That is not to say men cannot be harassed by women but it is much less likely to occur. Again, it is something that is very much on the agenda. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_61",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_29",
          "showAs": "International Agreements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/debate/mul@/dbsect_29.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/debate/dbsect_29"
        },
        "to": {
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "oral"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 93. Deputy Jennifer Carroll MacNeill asked the Tánaiste and Minister for Enterprise, Trade and Employment the total budget for the national local enterprise week in 2022; and if he will make a statement on the matter. [61851/22] ",
        "date": "2022-12-13",
        "questionNumber": 93,
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  As part of Local Enterprise Week 2022, the 31 Local Enterprise Offices (LEOs) hosted a programme consisting of over 220 virtual and physical events including 12 free National Spotlight events on topics such as “Future Proofing Your Small Business”, “Internationalising Your Business”, and “Going Green”.  These events took place nationwide and featured topics and themes that sought to identify and address some of the key issues facing micro and small enterprises around the country.  These free-to-enter events were open to all, from budding entrepreneurs to established businesses and provided an opportunity to get expert advice on key areas of business from financial skills, raising finance, exporting, and boosting your business online to future trends such as sustainability and digitalisation.  The 31 LEOs funded the events through their annual budget allocation for enterprise training and development programmes, and the total cost of Local Enterprise Week is estimated at €511,911.  While Local Enterprise Week is seen as important to all businesses who attend, for many entrepreneurs it represents their first steps in starting a business and the positive engagement with their Local Enterprise Office will be key in building confidence and providing them with the assistance to continue on that journey. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_93",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_63",
          "showAs": "Enterprise Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_63"
        },
        "to": {
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 410. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection if her Department will provide support for a person (details supplied); and if she will provide an update on any outstanding applications or appeals that the person has with her Department; and if she will make a statement on the matter. [61936/22] ",
        "date": "2022-12-13",
        "questionNumber": 410,
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office functions independently of the Minister for Social Protection and of the Department and is responsible for determining appeals against decisions in relation to social welfare entitlements.  I have asked the Chief Appeals Officer to respond directly to the Deputy on this matter. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_410",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_338",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_338.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_338"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 445. Deputy Jennifer Carroll MacNeill asked the Minister for Children, Equality, Disability, Integration and Youth the timeframe within which Ukrainian refugees who have received rehoming letters from his Department are expected to be rehomed; the specific measures being taken to assist Ukrainian children with additional needs with the transition to and from temporary accommodation; and if he will make a statement on the matter. [61915/22] ",
        "date": "2022-12-13",
        "questionNumber": 445,
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  Since the outbreak of the war in Ukraine on 24 February, and the invoking of the temporary protection Directive by the European Union shortly afterwards, my Department has worked intensively as part of the cross-governmental response to the Ukraine crisis.  The operational challenges brought about by responding to the conflict are significant. Our country has never experienced an influx of displaced persons like the one that we have seen over the past months.  My Department is focused on the immediate, short-term accommodation needs of those who have fled here. To date, more than 66,000 people have arrived in Ireland and in excess of 48,000 of those have been referred to this Department seeking accommodation from the State.  The priority is to place people fleeing the war in safe and secure accommodation.  Regarding intra-accommodation moves, accommodation for new arrivals will continually need to be found throughout the Winter period as we expect a further 5,000 people to arrive from Ukraine by year-end. The wider situation in regard to accommodation remains extremely challenging. Ireland is now accommodating in excess of 70,000 people between those fleeing Ukraine and International Protection applicants, compared to 7,500 last year.  I am advised by my officials that generally large-scale moves occur due to contracts ending and my Department endeavours to provide as much advance notice as possible. Generally, 48 hours confirmation is issued in advance of moves of Beneficiaries of Temporary Protection (BOTPs). Where possible and in certain circumstances e.g. where a hotel contract may be coming to an end, greater notice periods may be provided. Generally, transfer is by way of coach, or if the group size is small enough by minibus. This has enabled all those in need of transport to avail of the accommodation where they wish to do so. Medical cases are, where at all possible, accommodated close to the medical centres where the BOTPs are receiving treatment. That said, special needs in relation to education, health (including specialised medical transport) etc, are services that fall outside the remit of this Department.  My Department is mindful of the impact that all such moves have on those affected, and will continue to deliver a humanitarian response to the needs of Beneficiaries of Temporary Protection (BOTPs) and those seeking International Protection. Where BOTPs can be moved to suitable pledged accommodation in the area this is also facilitated. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_445",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_370",
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_370.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_370"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 592. Deputy Jennifer Carroll MacNeill asked the Minister for Health if he will provide support for a person (details supplied), given the considerable length of time that they have been on the CDNT wait list; and if he will make a statement on the matter. [61932/22] ",
        "date": "2022-12-13",
        "questionNumber": 592,
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_592",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_518",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_518.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_518"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 593. Deputy Jennifer Carroll MacNeill asked the Minister for Health if he will provide support for a person (details supplied), given the considerable length of time that they have been on the CDNT wait list; and if he will make a statement on the matter. [61933/22] ",
        "date": "2022-12-13",
        "questionNumber": 593,
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_593",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_519",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_519.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_519"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 594. Deputy Jennifer Carroll MacNeill asked the Minister for Health if he will provide an update on a representation (details supplied); and if he will make a statement on the matter. [61935/22] ",
        "date": "2022-12-13",
        "questionNumber": 594,
        "answerText": " Minister for Health  The issues raised in the representation are outside the remit of the HSE. Professional exams are not managed by the HSE. Recruitment to postgraduate training programmes fall under the remit of the postgraduate training bodies.  The number of medical intern places has increased by 120 since 2019 to 854, providing more opportunities to all medical school graduates. In relation to the July 2022/3 intern year, all eligible candidates who applied were offered an intern post for the July 2022 training year.  We have been informed by the HSE that the Medical Schools inform international medical students prior to enrolling that intern places are not part of the undergraduate curriculum. Potential students are also informed that while internship is the first step in postgraduate training, the intern posts are employment posts and completion of the medical degree in Ireland does not guarantee an employment post with the HSE.  Changes to the Medical Practitioners Act implemented in 2020 have removed the barrier of the requirement for a recognised internship to apply for postgraduate training programmes. Following this amendment, a number of doctors are now eligible to apply to postgraduate training programmes where previously they were not.  Changes to the application of EEA community preference for the allocation to postgraduate training programmes were agreed in Autumn 2021. This change has meant that, following competitive interview, appointable candidates who hold a Stamp 4, along with EEA candidates, will be allocated training in the positions in the first instance following competitive interview.  Selection criteria for postgraduate training programmes, including eligibility and shortlisting criteria, are published on the relevant training body website in advance of the opening of schemes applications (including weighting for various elements of the selection process and marking system for the various elements of the selection process described). Training bodies provide interview feedback to facilitate feedback to applicants to national training programmes.  All postgraduate training bodies are required to apply the principles of the Code of Practice for Appointment to Positions in the Civil Service and Public Service. The Code sets out the principles to be observed in respect of both external and internal appointments to positions in the Health Service Executive. The code is available at www.cpsa.ie/en/Codes-of-Practice/  The average growth rate per year over the last five years of the total number of Training NCHDs is 5.5%. This equates to 24% more NCHDs in training (including interns) in 2021 compared to 2017. Continued growth for the postgraduate training programmes is planned which will provide more opportunities for all doctors.  It is also worth noting the Forum of Irish Postgraduate Medical Training Body postgraduate training strategy specifically outlines a key focus over the duration of this Strategic Framework will be the enhancement of organisational enablers to support diversity, inclusion and equity within postgraduate training with the objective to design, develop and implement a Forum Diversity and Inclusion Strategy for Training. Further information can be found at www.theforum.ie/wp-content/uploads/2021/11/Strategy-22-10.pdf  Further information on the HSE equality, diversity and inclusion policies can be found at: healthservice.hse.ie/staff/procedures-guidelines/diversity-equality-and-inclusion/ ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_594",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_520",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_520.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_520"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 598. Deputy Jennifer Carroll MacNeill asked the Minister for Health if he will provide an update in relation to a representation (details supplied). [61950/22] ",
        "date": "2022-12-13",
        "questionNumber": 598,
        "answerText": " Minister of State at the Department of Health  I thank the Deputy for her question. A reply will issue to her representation in the coming days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_598",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_524",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_524.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_524"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Disability Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_79.xml"
            }
          },
          "debateSectionId": "dbsect_79",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_79"
        },
        "questionType": "written",
        "questionNumber": 44,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_44",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 44. Deputy Jennifer Carroll MacNeill asked the Minister for Health the number of HSE funded therapists that have been allocated to special schools to date in 2022; the further measures and investment that is being made in disability services in general; and if he will make a statement on the matter. [60794/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister of State at the Department of Health  As the Deputy's question relates to a service issue, it has been referred to the HSE for direct reply. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_120.xml"
            }
          },
          "debateSectionId": "dbsect_120",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_120"
        },
        "questionType": "written",
        "questionNumber": 84,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_84",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 84. Deputy Jennifer Carroll MacNeill asked the Minister for Health the number of persons who are set to benefit from the national Traveller health action plan; the details of what is contained within the action plan; and if he will make a statement on the matter. [60793/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister of State at the Department of Health  The national Traveller Health Action Plan fulfils a commitment in the Programme for Government and the National Traveller and Roma Inclusion Strategy.  Travellers have the right to the highest attainable standard of health as is the norm in Irish society. The action plan is a comprehensive public health response to the health needs of Travellers, that provides tailored and affirmative measures to prevent disease, promote health and prolong life, and are delivered in partnership with Travellers.  The action plan acknowledges the difficulties Travellers can experience in accessing healthcare services. Low health literacy and poor communication channels impair interactions between Travellers and healthcare providers.  To address these barriers, the Action Plan adopts an inclusion health approach, which seeks to change how healthcare services are delivered. Central to this is the involvement of Travellers in healthcare delivery. The primary healthcare projects are an example of a peer-led model that trains Travellers as community health workers. The provision of services in a culturally sensitive manner is another feature of an inclusion health approach.  The action plan has four goals and 45 actions. Further details on the action plan are available here. www.hse.ie/eng/services/publications/socialinclusion/national-traveller-health-action-plan-2022-2027.pdf  The action plan will benefit all Travellers. The 2016 Census recorded approximately 30,987 Travellers in the Republic of Ireland. The recent annual Traveller count by the Department of Housing, Local Government and Heritage, reported 11,680 Traveller families.  I am fully committed to providing the leadership and resources to ensure the successful implementation of the action plan, along with my colleagues Minister Donnelly and Minister Butler. To support the delivery of the action plan, the Department of Health is providing new development funding of €1.3 million in 2023. This is in addition to the €10 million that is already allocated for Traveller-specific health services.  I believe the action plan is a significant step to improving health experiences and outcomes for the Traveller community. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Cost of Living Issues",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_164.xml"
            }
          },
          "debateSectionId": "dbsect_164",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_164"
        },
        "questionType": "written",
        "questionNumber": 137,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_137",
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 137. Deputy Jennifer Carroll MacNeill asked the Minister for Agriculture, Food and the Marine the way allocations in budget 2023 to the Department will help to tackle the cost-of-living crisis and rising energy costs; and if he will make a statement on the matter. [60792/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  To help all families, individuals and businesses deal with the rising cost of living, the Government announced a package of once-off measures worth €4.1bn as part of the overall €11bn Budget 2023.  Measures of particular assistance to the agri-food sector included: the continuation of the reduction of excise duty on agricultural diesel to nil; the Temporary Business Energy Support Scheme and the Ukraine Enterprise Crisis Scheme, which will provide important support for farmers and food businesses with their energy bills; and the delivery of new loan schemes.  In the Budget for 2023, I announced the highest-ever level of funding for my Department, a 13% increase overall, and I will continue to deliver the appropriate level of support, including working with my colleagues on business supports for farmers, fishers and food & drink businesses.  Significant implications are being seen across all sectors, including the agri-food sector as a result of Russia's illegal invasion of Ukraine.  As well as the immediate humanitarian crisis, which must take priority, we need to take the necessary steps to ensure that food security is maintained, for EU citizens, for the Ukrainian people and in the wider global context.  I am acutely aware of the challenges facing our farm families here in Ireland and my role is to support the sector in mitigating these impacts and to provide targeted measures where they are most needed.  Since the invasion of Ukraine started, I have announced a number of measures valued at €91 million, to assist the agri-food sector including an incentive for farmers to grow additional fodder, and specific supports for the pig, tillage & horticulture sectors.  In addition to supporting farm families dealing with the cost-of-living pressures and rising energy costs, Budget 2023 also lays the groundwork for strategic supports for the sector through the new €10 billion CAP Strategic Plan (CSP).  I am acutely aware of the challenges facing farm families, food businesses and coastal communities at present. We are living in uncertain times, but we need our farm families and fishers producing safe, sustainable, and high-quality food more than ever. I will continue to back them in doing that.  I continue to monitor the situation and I stand ready to support our farm families through this period of challenge. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Agriculture Industry",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_182.xml"
            }
          },
          "debateSectionId": "dbsect_182",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_182"
        },
        "questionType": "written",
        "questionNumber": 156,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_156",
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 156. Deputy Jennifer Carroll MacNeill asked the Minister for Agriculture, Food and the Marine his views on the cultural barriers preventing women taking over family farms; the steps his Department will take to support women in taking over family farms; and if he will make a statement on the matter. [60791/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Gender equality is a priority for Government. It is also a core principle of the European Union and the Common Agriculture Policy (CAP) Regulations place a particular focus on promoting the participation of women in the socio-economic development of rural areas, with special attention to farming.  At a European level the number of women in farming has been slowly increasing. 2016 data suggests that, on average, around 30% of farms across the EU are managed by a woman, but with some considerable differences between Member States. The Census of Agriculture 2020 reported that just 13% of farm holders in Ireland are female.  I am very pleased that, for the first time, Ireland’s new CAP Strategic Plan (CSP) includes specific measures aimed at increasing the participation of women in farming. Ireland’s CSP, which will deliver some €10bn to farm families over the next five years, includes innovative proposals to promote gender equality, including:  - An increased grant rate of 60% under the Capital Investment Scheme to fund investments by trained women farmers.  - The promotion of women-only Knowledge Transfer Groups.  - Improved recording and reporting of gender data and the leveraging of the National CAP Network to increase the involvement of all women in the implementation of CAP.  - All CAP interventions will be developed with a gender-aware perspective to ensure there are no inherent barriers to women's participation.  - European Innovation Partnerships offer an ideal opportunity for the sector to develop initiatives that will promote women's participation in farming.  In addition, since 2015, my Department has provided support for rural female entrepreneurs under the ACORNS programme. This initiative involves the development and implementation of a tailored programme to support early-stage female entrepreneurs living in rural Ireland.  Food Vision 2030, our shared strategy for the agri-food sector, recognises the importance of gender equality to its long-term sustainability and includes actions to promote and improve gender balance.  It proposed holding a national dialogue on women in agriculture. I formally launched that conference last week and announced that former Tánaiste and Minister for Agriculture, Mary Coughlan, will chair the event on 1st February next year, St Brigid’s Day. The Conference will examine gender equality in farming and the agri-food sector generally and hear the views of women themselves on what more can be done on this important issue. The outcomes of the Conference will feed into future policy in this regard. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Departmental Policies",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_245.xml"
            }
          },
          "debateSectionId": "dbsect_245",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_245"
        },
        "questionType": "written",
        "questionNumber": 219,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_219",
        "to": {
          "showAs": "Public",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 219. Deputy Jennifer Carroll MacNeill asked the Minister for Public Expenditure and Reform his views on a case (details supplied); and if he will make a statement on the matter. [61429/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Public Expenditure and Reform  The following rates are payable to members of Interview/Selection Boards in the Public Appointments Service. These rates have been in place since the 1st July 2013.  Retired Public Servants (on pension):     Secretary General    €377      Deputy Secretary    €295      Assistant Secretary    €200      Principal    €150      Assistant Principal    €130     As advised in my response to the Deputy’s representation on 22 April 2022, the rates paid to retired Public Servants for serving on Interview Boards are currently subject to a review by my officials.  My Department is continuing to engage with the relevant stakeholders to obtain all of the necessary data and evidence to inform policy decisions.  I expect the review to be finalised in the first half of 2023. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "State Properties",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_246.xml"
            }
          },
          "debateSectionId": "dbsect_246",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_246"
        },
        "questionType": "written",
        "questionNumber": 220,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_220",
        "to": {
          "showAs": "Public",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 220. Deputy Jennifer Carroll MacNeill asked the Minister for Public Expenditure and Reform the plans that are in place for disused Garda stations, for example, Dalkey and Kill O’The Grange Garda stations; and if he will make a statement on the matter. [61430/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister of State at the Department of Public Expenditure and Reform  The Office of Public Works (OPW) manages a property portfolio in excess of 2,500 properties ranging from heritage buildings, commercial office blocks, green field sites, warehouses, Coast Guard Stations and Garda Stations.  As would be the norm in such a large portfolio, at any given time, there will be a number of properties being refurbished or vacant.  The State will always retain a number of vacant properties for future use. As a matter of policy, no property or site is disposed of until there is absolute certainty that there is no alternative State use for that property.  Under the 2012/2013 Policing Plans of An Garda Síochána, 139 stations were identified as surplus to An Garda Síochána’s requirements and reverted to the Office of Public Works to identify an alternative State use or manage their disposal. In 2016, following a review by An Garda Síochána and the Policing Authority, six stations were identified for re-opening.  Of the 139 Garda stations that were closed under the 2013/2013 policing plans, 31 remain.  Schedule A attached sets out their status and future plans.  The OPW, like other State bodies, is obliged to follow central Government policies on the disposal of surplus properties. The arrangements involved are set out in the following Department of Public Expenditure and Reform (DPER) Circulars:  1. Circular 11/2015: Protocols for the Transfer and Sharing of State Property Assets  2. Circular 17/2016: Policy for Property Acquisition and for Disposal of Surplus Property  In a case where the OPW does not need to retain a property, and has deemed it surplus to requirements, the office follows a strict procedure.  The OPW's Disposal Policy (consistent with the aforementioned Department of Public Expenditure and Reform circulars on disposals of properties) with regard to vacant State property, is to:  1. Identify if the property is required/suitable for alternative State use by either Government Departments, Local Authorities or the wider public sector.  2. If there is no other State use identified for a property, the OPW will then consider disposing of it on the open market if and when conditions prevail, in order to generate revenue for the Exchequer.  3. If no State requirement is identified or if a decision is taken not to dispose of a particular property, the OPW may consider community involvement (subject to detailed written submission, which would indicate that the community/voluntary group has the means to insure, maintain and manage the property and that there are no ongoing costs for the Exchequer).  In line with OPW Policy, alternative state use was explored in respect of the former Garda station, Kill O’ the Grange, Dún Laoghaire, Co. Dublin, with Dún Laoghaire- Rathdown County Council confirming their interest in acquiring the Property.  This property is currently in the process of being transferred to Dún Laoghaire-Rathdown County Council under The Protocols for the Transfer and Sharing of State Property Assets.  As no alternative State use has been identified for the former Garda stations at  Tubbermore Road and Sorrento Road, Dalkey, Co. Dublin. These properties will be prepared for disposal by public auction, upon completion of the First Registration process with the Property Registration Authority of Ireland.  Housing and Community Use  In terms of alternative uses such as housing, the OPW notifies all relevant stakeholders of any vacant, surplus properties that may be considered for housing or other State use.  This includes notifying the Land Development Agency and the relevant local authorities or other State bodies.  While the provision of social/affordable and emergency residential accommodation is a function of the Local Authorities and the Department of Housing, Planning and Local Government, the OPW has in recent years provided:  - Eight residential units in Dublin City Centre that were transferred to Dublin City Council for use by the Peter McVerry Trust.  - A building in Crumlin, Dublin that is now licensed to Dublin City Council for use as a Family Hub.  - Five former Garda residences in Templemore that were transferred to Tipperary County Council for social housing.  - Two former Garda station properties at Goleen and Adrigole that were transferred to Cork County Council for social housing.  In addition, there are a number of properties that have been transferred or are in the process of being transferred to local authorities and the Land Development Agency, as follows:  - The former Central Mental Hospital, Dundrum which will be transferring to the Land Development Agency for housing purposes  - A further seven buildings and a site that are in the process of transferring to Cork County Council for social housing  - Two former Garda residences that are transferring to Tipperary County Council for social housing.  - A property at Carrigrohane, Cork City that is in the process of being leased to Cork City Council for housing purposes.  - The former Garda station at Inagh that is to be used as a local housing office by Inagh Housing Association following its transfer to Clare County Council.  - Two former Garda station properties at Tarmonbarry and Ballintobber recently transferred to Roscommon County Council for use under the Town and Village Renewal Scheme.  - The former Garda station Ashford, Co. Wicklow will shortly transfer to Wicklow County Council for use under the Town and Village Renewal Scheme.  - Two former Garda station properties at Dromahair and Keshcarrigan are in the process of being leased to Leitrim County Council for community purposes.  It should be noted that buildings owned or managed by the OPW are primarily commercial offices, Garda stations, warehouses or others that are not suited to residential use. However, the OPW has actively engaged with the Department of Housing, Planning and Local Government in providing information on any non-operational, vacant buildings owned.  The Department then assesses those buildings in terms of what might be suitable for residential use.  Accommodation for Ukrainian Refugees  The OPW has provided a list of its vacant properties, including former Garda stations, to DCEDIY, DHLGH and the relevant local authorities so that they can assess them for suitability for social or humanitarian housing purposes.  The OPW continues to engage with other State bodies on a regular basis in this regard.  Where either the local authorities or other State bodies do not require the properties in question, they are prepared for sale through public auction.  Further information on vacant Garda stations is available at the link:   Vacant Garda stations  ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-08",
      "question": {
        "debateSection": {
          "showAs": "Health Promotion",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/mul@/dbsect_343.xml"
            }
          },
          "debateSectionId": "dbsect_343",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-08/writtens/dbsect_343"
        },
        "questionType": "written",
        "questionNumber": 312,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-08/pq_312",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 312. Deputy Jennifer Carroll MacNeill asked the Minister for Health if he will provide an update on a case (details supplied); and if he will make a statement on the matter. [61428/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister of State at the Department of Health  I refer to your Representation no. HEA-MO-08185-2022 which you submitted on behalf of your constituent Sinead regarding folic acid fortification. I would like to inform you that this correspondence was responded to on Friday 2nd December. ",
        "date": "2022-12-08",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-07",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Payments",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/mul@/dbsect_95.xml"
            }
          },
          "debateSectionId": "dbsect_95",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/dbsect_95"
        },
        "questionType": "written",
        "questionNumber": 68,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-07/pq_68",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 68. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection if support will be provided for persons (details supplied) who have yet to receive their €400 lump sum payment which was due on 18 November 2022; and if she will make a statement on the matter. [61080/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Social Protection  The Fuel Allowance scheme is a means tested payment to assist pensioners and other long-term social welfare dependent householders with their winter heating costs.  The payment is a contribution towards heating costs, it is not intended to meet these costs in full.  The payment is made at the weekly rate of €33.00; or if preferred, by way of two lump sum payments; and is paid over the winter season.  Only one Fuel Allowance is payable per household.  Those who qualify for the payment do not need to reapply annually.  Based on the information available to my department, the persons concerned, who are in receipt of a State Contributory Pension (SPC), have not made an application for the Fuel Allowance scheme.  As part of the overall social welfare Budget 2023 package of €2.2 billion, I announced an additional lump sum payment of €400.00 to households in receipt of the Fuel Allowance payment.  The additional payment of €400.00 was paid to all households in receipt of Fuel Allowance in the week beginning 14th November 2022.  Those in receipt of weekly Fuel Allowance payments received their weekly payment of €33.00 plus the additional payment of €400.00, and those who received their payment by lump sum received the additional lump sum payment of €400.00.  The €400.00 lump sum will also be paid to all those whose entitlement to Fuel Allowance commenced on or before week beginning 14th November 2022, even though their claim may be decided later than that week.  The additional €400.00 payment was issued automatically to all recipients of Fuel Allowance; they did not need to contact my Department.  To make an application, the quickest and easiest way to apply is online at mywelfare.ie .  Alternatively, if the person concerned is unable to access online services, an application form for Fuel Allowance has been issued to the person concerned and their entitlement can be examined when they submit the completed application to the National Fuel Scheme Section in Sligo.  Only one Fuel Allowance is payable per household.  I trust this clarifies the matter for the Deputy. ",
        "date": "2022-12-07",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-07",
      "question": {
        "debateSection": {
          "showAs": "State Pensions",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/mul@/dbsect_100.xml"
            }
          },
          "debateSectionId": "dbsect_100",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/dbsect_100"
        },
        "questionType": "written",
        "questionNumber": 72,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-07/pq_72",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 72. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection to provide an update on a representation (details supplied); and if she will make a statement on the matter. [61148/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Social Protection  The person concerned applied for a State Pension (contributory) payment on the 10 February 2022.  Under current eligibility conditions, an individual must have 520 full-rate paid contributions in order to qualify for standard State pension (contributory).  520 full-rate contributions equate to 10 years of full-rate insurable employment.  According to the records of my Department, the person concerned has a total of 353 full-rate contributions and 60 modified contributions.  Since their contributions fall short of the requisite 520 paid full-rate contributions, they do not qualify for State pension (contributory).  They were notified in writing of this decision on 26 November 2022, provided with a copy of their social insurance record on which the decision was based, and afforded the right of review and/or appeal.  The spouse of the person concerned applied for the fuel allowance on the 22 September 2022. The Fuel Allowance is a contribution towards the energy costs of a household.  The payment of €33 per week for 28 weeks (a total of €924 each year) is paid from late September to April.  One of the conditions for receipt of fuel allowance is that a person must satisfy a means test.  From January 2023, there is a new means threshold for people aged 70 and over, of €500 for a single person and €1,000 for a couple. Following a means assessment, it was determined that the household means were €1267.25. As this exceeded the new means threshold for the household, the application was disallowed, and the person concerned was notified in writing.  I hope this clarifies the position for the Deputy. ",
        "date": "2022-12-07",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-07",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Eligibility",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/mul@/dbsect_101.xml"
            }
          },
          "debateSectionId": "dbsect_101",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/dbsect_101"
        },
        "questionType": "written",
        "questionNumber": 73,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-07/pq_73",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 73. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection to provide an update on a representation (details supplied); and if she will make a statement on the matter. [61150/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Social Protection  According to the records of my Department, the person concerned was in receipt of Jobseeker’s Allowance (JA) from 24/03/2022 until 26/07/2022.  Following the cancellation of her Temporary Protection Order by the Department of Justice, the person concerned was required to satisfy the Habitual Residence Condition (HRC) for continued eligibility to JA.  JA is subject to the HRC, wherein certain guidelines are followed in order to determine if an individual’s main centre of interest is the Republic of Ireland; the first step of which is determining a right to reside in the State.  It was determined that the person concerned did not meet the HRC eligibility criteria and therefore her application for JA and subsequent application for a basic Supplementary Welfare Allowance (SWA) were disallowed.  The person appealed the decision to disallow JA, which is currently under review by the independent Social Welfare Appeals Office (SWAO).  There is no record of the person requesting an appeal on the disallowance of her basic SWA application.  A second basic SWA application was registered for the person concerned with effect from 29/11/2022.  The application was assessed and was disallowed in a letter dated 05/12/2022 as the person concerned does not satisfy HRC.  It is open to the person concerned to seek a review and/or appeal the decision to the SWAO within 21 days.  I trust this clarifies the matter. ",
        "date": "2022-12-07",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-07",
      "question": {
        "debateSection": {
          "showAs": "Dormant Accounts Fund",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/mul@/dbsect_104.xml"
            }
          },
          "debateSectionId": "dbsect_104",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-07/writtens/dbsect_104"
        },
        "questionType": "written",
        "questionNumber": 77,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-07/pq_77",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 77. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection the status of a representation (details supplied); and if she will make a statement on the matter. [61207/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Social Protection  The representation to which the Deputy refers concerns funding provided to an organisation under the Dormant Accounts Action Plan 2021, Measure to Support the Employment of People with Disabilities. A total of 45 projects, including the one referred to in the representation, were awarded up to €7.6 million in funding. The programme started on 1 September 2021 and was due to conclude at the end of December this year.  I was very keen to avoid a gap in funding between the current Dormant Accounts Fund employment support measure for people with disabilities and an anticipated new programme under the European Social Fund Plus (ESF+) 2021-2027. It is anticipated that this new disability programme will be open by way of a competitive process in 2023 to applications from organisations across the country.  In this regard, I can confirm that I have extended funding to the organisations up until the end of 2023 and made provision for same under the Dormant Accounts Action Plan 2023.  Pobal, who manage the current measure on behalf of my department, have been in direct contact with all the projects concerned – including the organisation which is the subject of the Deputy’s representation - with further details.  I trust that this clarifies the position for the Deputy. ",
        "date": "2022-12-07",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-06",
      "question": {
        "debateSection": {
          "showAs": "Prison Service",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-06/writtens/mul@/dbsect_85.xml"
            }
          },
          "debateSectionId": "dbsect_85",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-06/writtens/dbsect_85"
        },
        "questionType": "written",
        "questionNumber": 59,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-06/pq_59",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 59. Deputy Jennifer Carroll MacNeill asked the Minister for Justice if she will provide an update on the steps being taken by her Department to promote and to support the reduction of reoffending; and if she will make a statement on the matter. [60359/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Justice  As the Deputy will be aware, the Programme for Government 2020 contains a broad range of policies and proposals that represent a coherent approach to enhancing and sustaining a more just and safe society, with a specific commitment to review policy options for prison and penal reform.  In respect of delivering on this commitment the Review of Policy Options for Prison and Penal Reform 2022-2024 was published in August 2022. This review is a very important development as we seek to reduce crime prevent offending and make everyone safer.  To reduce offending and reoffending and better support victims, families and communities, the Review of Policy Options for Prison and Penal Reform 2022-2024 identifies measures to expand community based sanctions that reflect the needs of Ireland’s diverse society; drive rehabilitative interventions that sustain desistance from offending; reduce the reliance on prison as a sanction and mitigate overcrowding in prisons; and embed collaborative, innovative approaches to the complex causes of offending at all stages of the criminal justice system.  The relationship between substance misuse and offending behaviour is well understood with a history of substance misuse a strong predictor for reoffending.  In this regard, and in fulfilment of another Programme for Government commitment, the Final Report and Recommendations of the High Level Task Force to consider the mental health and addiction challenges of those who come into contact with the criminal justice sector was published by the Minister for Justice and the Minister for Health in September 2022.  The recommendations of the Task Force ensure better support for people at the earliest point at which they come into contact with the criminal justice system seeking to divert them away from it where possible, while supporting them in their rehabilitation from addiction and in the recovery and management of their illness. Further, the recommendations seek to address the question of better support for prisoners in their rehabilitation when justice requires a prison sentence, and that the progress made in prison is not lost after release which is the foundation upon which the system works with that person to build a better future.  In addition, Minister Browne published the Youth Justice Strategy 2021-2027 last year, which provides a developmental framework to support children and young people subject to multiple disadvantage and guide them away from involvement in anti-social or criminal behaviours.  There are currently 105 Youth Diversion Projects in operation, which are community based organisations that are a key support to An Garda Síochána in the operation of the statutory Garda Youth Diversion Programme under the Children's Act 2001. The intention (in line with the Youth Justice Strategy) is to provide full geographic availability of youth diversion services throughout the State by the end of 2023.  To that end, Minister Browne secured almost €780,000 in funding from Budget 2022 to expand the  Youth Diversion Project network. The Department has invited proposals this week from community and youth service organisations to establish new Youth Diversion Projects in South Monaghan, Claremorris, Co. Mayo, South and East Co. Wicklow and West Cork.  An additional €2.5 million was secured in Budget 2023, to a total of €30.5 million, to implement the Youth Justice Strategy – this will help us expand these important services to everyone who needs them to create better outcomes for young people.  Expressions of interest in principle from community-based organisations in establishing new Youth Diversion Projects in any of these areas should be submitted to yjs@justice.ie by 12 January 2023, having regard to the operational requirements as set out at: www.gov.ie/en/collection/1a1cd-youth-diversion-projects/ . ",
        "date": "2022-12-06",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-06",
      "question": {
        "debateSection": {
          "showAs": "Domestic Violence",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-06/writtens/mul@/dbsect_90.xml"
            }
          },
          "debateSectionId": "dbsect_90",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-06/writtens/dbsect_90"
        },
        "questionType": "written",
        "questionNumber": 64,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-06/pq_64",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 64. Deputy Jennifer Carroll MacNeill asked the Minister for Justice if she will provide an update on the number of domestic violence refuge spaces to date in 2022; if she will provide an update on the number of domestic violence refuge spaces made available since government formation to date; if she will provide an update on the work underway to secure a domestic violence refuge in Dún Laoghaire; and if she will make a statement on the matter. [60360/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Justice  As the Deputy will be aware the Government will establish a statutory agency with a dedicated focus on Domestic Sexual and Gender-Based Violence.  The agency will have a specific mandate to drive the implementation of the Zero Tolerance: Third National Strategy on Domestic, Sexual and Gender-Based Violence across Government, bringing the expertise and focus required to tackle this complex social issue. Pending establishment of the Agency, responsibility for the allocation of funding for domestic violence services continues to be managed by Tusla.  As this will continue to be the case until services formally transfer to the new DSGBV agency, I have referred the question posed by the Deputy to Tusla for direct reply. ",
        "date": "2022-12-06",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2022-12-06",
      "question": {
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-06/writtens/mul@/dbsect_349.xml"
            }
          },
          "debateSectionId": "dbsect_349",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-06/writtens/dbsect_349"
        },
        "questionType": "written",
        "questionNumber": 340,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-06/pq_340",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "showAs": " 340. Deputy Jennifer Carroll MacNeill asked the Minister for Social Protection if a person (details supplied) has enough PRSI contributions to avail of the PRSI treatment benefit specifically free hearing aids; if there are any other benefits currently available that the person may not be availing of; and if she will make a statement on the matter. [60218/22] ",
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33"
        },
        "answerText": " Minister for Social Protection  The Treatment Benefit Scheme provides dental, optical and aural services to insured workers, the self-employed, retired people and their dependent spouse/partner who have the required number of social insurance (PRSI) contributions.  The person concerned has the required number of PRSI contributions paid to qualify for the treatment benefits scheme and is qualified for life.  The medical appliance scheme provides for a 500 euro grant towards the purchase of up to two hearing aids every 4 years. As the person concerned availed of the hearing aid grant in 2020, he will not qualify again until January 2024.  Under the dental benefit scheme, a qualified person can get a free examination and a subsidised dental cleaning once per year.  Under the optical scheme, they can get a free examination, together with free or subsidised spectacles/contact lenses every two years; repairs to spectacles are also covered.  I trust this clarifies the matter for the Deputy. ",
        "date": "2022-12-06",
        "by": {
          "showAs": "Jennifer Carroll MacNeill",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill"
        },
        "questionNumber": 40,
        "questionType": "written",
        "showAs": " 40. Deputy Jennifer Carroll MacNeill asked the Minister for Housing, Local Government and Heritage the engagement that his Department has had with local county councils to ensure that local authority housing departments are properly staffed and resourced; and if he will make a statement on the matter. [56907/22] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-01/writtens/dbsect_64",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-01/writtens/mul@/dbsect_64.xml"
            },
            "pdf": null
          },
          "showAs": "Local Authorities",
          "debateSectionId": "dbsect_64"
        },
        "date": "2022-12-01",
        "house": {
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-01/pq_40",
        "answerText": " Minister for Housing, Local Government and Heritage  Housing for All is the Government’s plan to increase the supply of housing to an average of 33,000 per year over the next decade. Housing for All is supported by an investment package of over €4bn per annum, through an overall combination of €12bn in direct Exchequer funding, €3.5bn in funding through the Land Development Agency and €5bn funding through the Housing Finance Agency. The Government plans to deliver more than 90,000 social homes to 2030, with a focus on the social housing build programme, with a target to reach delivery of more than 9,500 new-build homes on average each year for the next five years to 2026.  Housing for All also includes a commitment to strengthen the capacity of local authorities to initiate, design, plan, develop and manage housing projects. Significant work has been undertaken to identify the additional staff resources required by local authorities to deliver the social housing targets set out in Housing for All. During 2021, the Housing Delivery Coordination Office (HDCO) engaged with each local authority to identify their additional staff requirements to deliver social housing. Following this engagement, my Department approved funding for over 250 housing posts in local authorities nationally to address social housing delivery.  With the support of the HDCO, the Department undertook a review this year in relation to the requirements for affordable housing staff resources, focusing on local authorities with an identified affordability constraint. Key considerations in this review included the type of structure (administrative/professional staff) necessary to deliver affordable housing, scale of delivery programmes and alignment with the additional supports already provided for social housing delivery earlier in 2022.  Following on-going engagement and sanction from the Department of Public Expenditure and Reform, an initial tranche of 69 posts have now been approved and communicated to each of the respective local authorities who are now in the process of procuring same as applicable. This is a key requirement to underpin affordable housing delivery and ensuring the required structures are in place to enable affordable housing delivery as a matter of priority. The Department and the HDCO will be monitoring this programme further to a review of any additional supports being examined in 2023. "
      },
      "contextDate": "2022-12-01"
    },
    {
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Carroll-MacNeill.D.2020-02-08",
          "memberCode": "Jennifer-Carroll-MacNeill.D.2020-02-08",
          "showAs": "Jennifer Carroll MacNeill"
        },
        "questionNumber": 50,
        "questionType": "written",
        "showAs": " 50. Deputy Jennifer Carroll MacNeill asked the Minister for Housing, Local Government and Heritage if he will report on the possibility of an adapted first-homes scheme for areas such as Dún Laoghaire; and if he will make a statement on the matter. [56906/22] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-01/writtens/dbsect_72",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-01/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          },
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_72"
        },
        "date": "2022-12-01",
        "house": {
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-01/pq_50",
        "answerText": " Minister for Housing, Local Government and Heritage  The First Home Scheme, launched on 7 July this year, supports first-time buyers in purchasing new houses and apartments in the private market through the use of an equity share model. Full information on the First Home Scheme is available at the following link: www.firsthomescheme.ie.  The First Home Scheme’s applies regional price ceilings designed to temper inflationary pressures and to target support at the lower part of the price distribution, as well as encouraging the development of additional housing supply at this price level.  The First Home Scheme Ireland Designated Activity Company (DAC) now holds responsibility for maintaining the First Home Scheme, including any review and updating of price ceilings where appropriate. In line with a commitment made at scheme launch, I understand that the First Home DAC is currently in the process of reviewing the price ceilings for all areas with a view to completing same by year end. "
      },
      "contextDate": "2022-12-01"
    }
  ]
}