{
  "head": {
    "counts": {
      "questionCount": 6361,
      "resultCount": 6361
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 47. Deputy Paul Murphy asked the Minister for Children, Disability and Equality the details of the changes that will be  made to the Disability Act 2005 in relation to assessment of need; and if she will make a statement on the matter. [72891/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_89",
          "debateSectionId": "dbsect_89",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_47",
        "questionNumber": 47
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002. It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need. The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly.  These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  It is also important to note that children do not require an Assessment of Need to access health services, including Primary Care, Children’s Disability Network Teams or Mental Health Services.  The proposed legislative changes to the Disability Act 2005 are intended to support more effective delivery of Assessments of Need, and to provide clearer guidance and supports so that the process can be made more efficient, reduce delays and allow therapists to spend more time delivering services.  Key features of the bill are to include:  • An increased focus on the identification of a person’s needs and the services to meet those needs, rather than on the nature of their disability.  • The creation of statutory guidelines to support and enhance the decision-making capacity of HSE assessment officers, who are responsible for the production of assessment of need reports.  • A focus on the use of appropriate and proportionate clinical assessment(s) during the assessment of need process to ensure that they should only be used where required to establish the child’s needs.  Ensuring that there are sufficient resources allocated to the delivery of the Assessment of Need process, both in terms of staffing and financial resources, continues to be a focus for the Department and the HSE. This includes a number of measures:  • The Assessment of Need Targeted Waitlist Initiative was introduced in May 2024 to support the delivery of Assessments of Need to those families who have been waiting longest. Under this Initiative, the HSE provides for the procurement of clinical assessments from approved private providers. Recent HSE data shows that over 6,300 clinical assessments have been commissioned from private providers since the Initiative started in June 2024. Budget 2026 provides for the continuation of this Initiative next year with €20 million provided for the delivery of some 6,000 clinical assessments.  • In 2026, the HSE is also establishing eleven new teams, initially, to support HSE assessment processes, including Assessments of Need. Each team will include a psychologist, a speech and language therapist, an occupational therapist, and an administrator, to provide clinical guidance where required throughout the process.  • Work is ongoing to increase the staffing capacity of the HSE Assessment of Need Teams including assessment officers, liaison officers and administrative supports.  The provision of an effective and efficient Assessment of Need system continues to be a priority for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 82. Deputy Paul Murphy asked the Minister for Children, Disability and Equality the details of the way in which she envisages the new assessment of need process working; and if she will make a statement on the matter. [72890/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_126",
          "debateSectionId": "dbsect_126",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_126.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_82",
        "questionNumber": 82
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Paul Murphy  It seems we would be losing out on our country becoming a toxic waste ground. The new CRU large user policy enables further exponential expansion of data centres. It allows them to generate their own electricity using fossil fuels. The CRU is also allowing data centres to connect directly to the gas network in South Dublin County Council's area. How can the Government possibly say any of this is in line with our legal obligations to reduce both final energy consumption and carbon emissions? \n Deputy Timmy Dooley  I appreciate the Deputy's interest in this matter. It does not align with mine, but his is a well-held view and he has aired it on more than one occasion.  Ireland has attracted the best data centre and tech companies in the world. This is a really important relationship and the Government continues to work with the sector towards a secure and decarbonised energy future. Data centres are central to Ireland’s economic and digital future. However, data centres, like all large energy users, have to exist within the boundaries of our climate legislation and targets. Climate Action Plan 2025 includes measures to increase the proportion of renewable electricity to up to 80% by 2030. Data centres can be at the heart of our renewable future - using renewable electricity to power data, create jobs and to generate tax revenue for the State. In that context, the CRU’s LEU connection policy will support the Government's renewable energy targets because data centres above a certain threshold will be required to meet at least 80% of their annual demand with new additional renewable electricity generated in the Republic of Ireland.  The energy efficiency directive, EED, contains many new measures aimed at further enhancing energy efficiency across society, including requirements under Article 12 to enhance the energy efficiency of data centres across all EU member states. Ongoing mandatory data centre energy and sustainability performance reporting across the EU under the EED will enhance data centre sustainability and drive energy efficiency by requiring data collection to report on their energy performance. The EU Commission is using this data to establish an EU-wide rating scheme and further legislation to address energy usage.  The programme for Government contains a commitment to enhance data centres' use of renewable energy resources, energy-efficient technologies and effective solutions, such as waste heat capture, to reduce their carbon footprint. \n Deputy Paul Murphy  Will the Minister of State expand on how it is possible to have a policy of exponential growth of data centres that are using fossil fuels? How does that coincide with what he says to the effect that this has to exist within the bounds of our climate targets. We are signed up to the EED, which has a legally binding target to reduce energy consumption by 11.7% by 2030. Ireland's target reduction is 16%. Yet, we have a decision paper from the CRU which states that medium-term electricity demand from data centres could reach 5.8 GW. That is equal to the peak energy demand for the entire country. It is also more than the entire 5 GW target for offshore wind energy by 2030, which the Government is sure to meet.  It has been stated that Ireland's total electricity demand has grown by 30% over the past ten years, with the demand from data centres having greatly contributed to this level of growth. This level of growth is projected to continue over the next ten years, with data centres representing a larger share of total energy demand. How does that tally with a commitment and a legal obligation to reduce energy demand when it is being state that this is going to continue to go up fast and that data centres are a driving factor. \n Deputy Timmy Dooley  The Deputy has to look at it from a Government perspective. We have to ensure the economy remains robust and that we have a strategy in place to ensure - based on the sector trends - that we are able to attract investment in order to continue to provide employment for what is a growing population. Sometimes, others bury their heads in the sand - I am not suggesting Deputy Murphy does - and say that data centres are bad and that we cannot facilitate them any more. The Government does not agree with that position. The direction of travel in relation to the tech sector and the way we live our lives means that so much more is done in a cloud-based environment. You cannot, on the one hand, be of the view that we should have a strong economy and, on the other, ignore the fundamental building blocks of what that future economy will look like and operate. There is a requirement, and we have to live within the terms of the EU directive. As already stated, data centres, like all large energy users, have to exist within the boundaries of our climate legislation and targets. \n Deputy Paul Murphy  That is my question. The Minister of State is in the Department of the environment. He cannot just say something and then move on. It is completely illogical to say, on the one hand, that we are committed to this legally binding target of reducing energy consumption but, on the other, that we agree with a decision paper which states that our level of electricity usage will continue to grow and that this is going to be driven by the data centres. You have to pick one or the other. We will either reduce energy consumption or we are going to allow it to increase. Increasing energy consumption is going to lead to a significant increase in greenhouse gas emissions. The latter is because data centres are now directly connected to fossil fuel usage. Originally, it used to be the case that we should not worry and that it would all be renewables. In South Dublin County Council's area, the CRU has made a decision to grant permission for Gas Networks Ireland to connect a gas pipeline to the massive Vantage data centre in Profile Park. That decision states that the emissions will result in 3 million tonnes of CO2 equivalent. Some 32% of the emissions in that area already come from data centres. Emissions are going to go up even further. \n Deputy Timmy Dooley  The Deputy has to accept that the long-term strategy of the Government is to generate much more electricity from renewables. We have a target of 20 GW of offshore renewable energy by 2040. The Deputy is right in the sense that gas is a transition fuel, as we move away from fossil fuels. \n Deputy Paul Murphy  I did not say that. \n Deputy Timmy Dooley  It is. Deputy Murphy made the point that gas is the basis of his argument. We have to accept that as we work towards bringing more renewables onto the grid, we just cannot stand still, bury our heads in the sand and watch data centres and tech companies and the investment associated with them go elsewhere. If that happened, our society would be left behind, our economy would be in trouble and we would not be able to invest in services, hospitals or whatever else.  We have to have a balanced approach, while also keeping to our trajectory in the context of eliminating fossil fuels. We have a very clear plan for bringing renewables onto the grid by 2040. We are now moving ahead with a plan-led approach. We recently held the auction for 900 MW of offshore renewable energy at the Tonn Nua site. We intend to continue with that at pace. However, gas has to be a transition fuel as we work our way through the process. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 103. Deputy Paul Murphy asked the Minister for Climate, Energy and the Environment the action he will take to reduce energy demand and carbon emissions from data centres in view of our legal obligations to reduce both energy usage and carbon emissions; his views on whether the new CRU policy is compatible with those obligations; and if he will make a statement on the matter. [73592/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_20",
          "debateSectionId": "dbsect_20",
          "showAs": "Data Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_20.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_103",
        "questionNumber": 103
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  As Minister for Climate, Energy and the Environment, I am a \"prescribed body\" under the Planning and Development Act 2000 (as amended) to be notified of Strategic Infrastructure Developments and Rail Order developments by An Coimisiún Pleanála. As part of such notifications, I am requested to make a submission, where relevant, as a \"prescribed body\" on various development proposals such as those referred to by the Deputy. I have not been consulted specifically on the impact on carbon emissions reductions targets of delaying public transport projects.  The Environmental Protection Agency is mandated under Section 6D of the Climate Action and Low Carbon Development Act, 2015 (as amended) to carry out an inventory of greenhouse gases as soon as may be after the expiry of any carbon budget period. It is at this point that I will be informed of any exceedance or otherwise of the relevant sectors of the economy of their respective Sectoral Emissions Ceilings. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 128. Deputy Paul Murphy asked the Minister for Climate, Energy and the Environment if his Department was consulted on the impact on carbon emissions reductions targets of delaying public transport projects like Dart+ Southwest and Finglas Luas in order to prioritise road investment; and if he will make a statement on the matter. [72883/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_159",
          "debateSectionId": "dbsect_159",
          "showAs": "Greenhouse Gas Emissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_159.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_128",
        "questionNumber": 128
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  CRU’s published LEU Connection Policy Decision Paper sets out a pathway for new applications to connect to the electricity system that addresses security of electricity supply risks, system constraints and promotes renewable energy targets. The Decision supports the Government renewable energy targets, as data centres above certain thresholds will be required to meet at least 80% of their annual demand with new additional renewable electricity generated in the Republic of Ireland. The decision also requires that data centre’s above a certain size must provide dispatchable “onsite or proximate” generation and/or storage capacity which matches their demand.  The operation of fossil fuel generated back-up power systems is subject to strict statutory rules and environmental regulations aimed at limiting emissions, operating hours and interaction with the grid. All of these are overseen by the independent regulators the EPA, CRU, and the respective Distribution and System Operators EirGrid and ESB Networks regarding environmental regulation, connection policies, and system operation/connection.  Government policy on data centres firmly aims to enable the “twin transitions” of digitalisation and decarbonisation of our economy and society. This is further detailed in the 2022 Government Statement on Data Centres that sets out the principles for sustainable data centre development, including implementing decarbonised energy solutions and designs to increase energy efficiency. Government policy remains that ‘islanded’ data centres (that are not connected to the electricity grid and are powered mainly by on-site fossil fuel generation) would not be in line with national policy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 134. Deputy Paul Murphy asked the Minister for Climate, Energy and the Environment if he supports enabling data centres to build their own fossil fuel power plants; and if he will make a statement on the matter. [72887/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_166",
          "debateSectionId": "dbsect_166",
          "showAs": "Data Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_166.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_134",
        "questionNumber": 134
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Government recognises that our reliance on fossil fuels is incompatible with the Paris Agreement and a low-carbon future. Ireland supports measures that reinforce and advance our transition away from reliance on fossil fuels and will promote and support measures at international level which avoid locking in further long-term fossil fuel consumption.  While there is currently no definitive timeline for the removal of fossil fuels from our energy sector, much is being done to reduce our reliance on fossil fuels. The Programme for Government 2025, Securing Ireland’s Future, commits to taking decisive action to radically reduce our reliance on fossil fuels and to achieve a 51% reduction in emissions from 2018 to 2030, and to achieving net-zero emissions no later than 2050. In the Programme for Government we also set out our commitment to achieving 80% of Ireland’s electricity generation from renewable sources by 2030 and to take all necessary action to ensure and protect Ireland’s energy security. It is through delivering on this commitment that we are delivering and will continue deliver a secure and sustainable energy future.  International collaboration is key to achieving the widespread, transformative change needed to tackle climate change. Ireland will have a key role at COP31 in ensuring that the EU speaks with one voice and continues to drive global ambition on fossil fuel phase out. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 152. Deputy Paul Murphy asked the Minister for Climate, Energy and the Environment when fossil fuels will be phased out in this country; and if he will make a statement on the matter. [72884/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_182",
          "debateSectionId": "dbsect_182",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_152",
        "questionNumber": 152
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 153, 163 and 166 together.  In recent years, Government introduced a suite of measures to help households and businesses deal with higher energy costs. This included the provision of electricity credits to households worth €1,500 over four credit schemes, with a total cost of €3.3 billion. These universal credits were always envisaged as temporary, emergency measures because, while necessary at the time, they are not fiscally sustainable nor do they address the structural drivers of high energy costs.  The National Energy Affordability Taskforce was established in June of this year to identify, assess and implement measures that will enhance energy affordability for households and businesses. The first report of the taskforce, which was published last month, set out measures for consideration as part of the Budget 2026 process. Many of these options were reflected in Budget decisions. Examples of targeted Budget measures aimed at improving energy affordability include:  • the Fuel Allowance increasing by €5 per week to €38, supporting over 450,000 households who most require Government assistance to meet their energy costs;  • to directly support working families, the Fuel Allowance has been extended to recipients of the Working Family Payment. This will benefit over 43,000 families;  • from September 2026, those who move from Disability Allowance or Blind Pension to employment will be able to retain the Fuel Allowance for five years; and  • record funding of €558 million is being allocated for Sustainable Energy Authority of Ireland residential and community energy upgrade schemes (including the solar PV scheme) in 2026. This allocation will support the highest ever budget for the Warmer Homes Scheme, which is targeted at households in energy poverty.  In addition, the VAT reduction (from 13.5% to 9%) on electricity and gas bills has been extended to the end of 2030, saving households up to €100 per year.  It is important to note that the Department of Social Protection can also provide support through the Additional Needs Payment to help households meet expenses, including those who face difficulties with fuel bills. There are also a range of CRU customer protections are in place, including disconnection moratoria.  The National Energy Affordability Taskforce is now preparing an engagement and consultation process to inform the development of an action plan to be published mid-2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 166. Deputy Paul Murphy asked the Minister for Climate, Energy and the Environment if he will take any new measures to reduce or offset energy costs for households in light of the cost-of-living crisis; and if he will make a statement on the matter. [72886/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_183",
          "debateSectionId": "dbsect_183",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_183.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_166",
        "questionNumber": 166
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Paul Murphy  The Tánaiste's predecessor, Paschal Donohoe, said that there was no need for cost-of-living payments in the budget because “inflation has now returned to normal rates”. He said that inflation would be around 2% this year. That is clearly not the case. We have over 4% food price inflation and 3.3% energy price inflation. It is going to be a cold hard Christmas for many people. At this very late stage, I am asking the Tánaiste to bring forward emergency cost-of-living payments. \n Deputy Simon Harris  As stated earlier in relation to my Department’s forecast on inflation, an uptick was anticipated. That was down to what it describes as the base effects. The CSO outlined that the increase in inflation since September is largely accounted for by base effects. As a result, the assessment relating to inflation for next year has not materially changed. That is important to say because I understand that the cost-of-living pressures faced by people are real. They see individual items of inflation and individual reports and they wonder what that means for the year ahead. It is not only my Department and the European Commission. The ESRI has downgraded its inflation forecast for next year as recently as in its report this morning. We are now seeing wages growing faster than prices which should now mean the average worker experiencing real wage gains next year. I know that is much needed.  The Deputy and I will have a different perspective on this, but I would argue that we have endeavoured to provide significant support to households and businesses over the past number of years to help them absorb the worst impact of higher prices. These supports were temporary in nature. They balanced the need to provide assistance to the most vulnerable while avoiding a scenario whereby fiscal policy added to inflationary pressures. I say this for people at home: if the Government decides to spend lots more, it can have an inflationary effect and actually offset the benefit of what we are trying to achieve. As a result, we always have to achieve a balance between increasing investment and moderating the growth in day-to-day spending while avoiding doing anything that involves such a cost that it could create other difficulties for us in the time ahead.  We have taken a number of measures in the budget to try to assist people. The issue of the cost of energy is real and specific for people this winter. More people than ever will qualify for fuel allowance. The rate of the allowance will increase.  For the first time, people on the working family payment will get the fuel allowance as well. We also have a disconnection moratorium in place for the winter period, so nobody should feel the cold in their home this winter. We have supports in place to help those experiencing energy poverty. \n Deputy Paul Murphy  The truth is we are going to have the highest inflation rates in two years. They are not back to the extremely high rates we saw before that, but they are high. The whole premise upon which the Government justified not continuing with the cost-of-living payments was that inflation had returned to normal rates. There was a logic set out that has been confounded by reality, yet the Government is sticking with its position of no return of one-off payments.  The Minister knows that the impact of the withdrawal of one-off payments was very hard for the poorer sections of society. As a result of getting rid of the one-off payments, the bottom 10% lost 4.4% of their income. The next 10% lost 3.9%, so there were huge cuts in income and then particularly cruel, savage cuts reserved for disabled people of about €1,400 per year. \n Deputy Simon Harris  I very respectfully make the point that we put in place an extraordinary level of support for people over the past four years. Thank God this country was in a position to do that. We did it at a time of very high inflation. Those measures always had to be temporary. It is always difficult to unwind such measures, but I am crystal clear that if we did not get back to a situation of being able to deliver one regular budget each year, the position would not be fiscally sustainable into the future. It also would not necessarily be a good use of public resources.  Deputy Murphy probably does not need an energy credit this year. I do not mean that personally to him, I mean people in the Oireachtas do not need an energy credit this year. There are people who need assistance with their energy bills this year. We are constantly trying to get that balance right. We did say we are going to move to permanent targeted measures at a time when wages are thankfully growing above prices for the first time in a while.  We did of course keep the Christmas bonus measure in place, which is a one-off double payment that is paid to all those on long-term social welfare payments, including pensioners. Objectively, the budget was a progressive one. The permanent measures introduced in budget 2026 benefited those on lower incomes above and beyond those on higher incomes. \n An Ceann Comhairle  I am sorry to inform Deputy Murphy that we are actually out of time. I thank everyone very much for their co-operation. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 180. Deputy Paul Murphy asked the Tánaiste and Minister for Finance whether, in view of higher inflation than his predecessor predicted prior to the budget, he will bring in an emergency supplementary budget before Christmas to reinstate cost-of-living payments; and if he will make a statement on the matter. [69658/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_45",
          "debateSectionId": "dbsect_45",
          "showAs": "Cost of Living Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_45.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_180",
        "questionNumber": 180
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Government has provided a significant amount of support to households and businesses over the last four years to help absorb the worst impacts of rising prices. The policy response has included energy credits, reduced rates of tax on fuel and electricity, lump sum payments for social welfare recipients as well as mortgage and rent supports for households.  This was in response to the high rates of inflation that began in 2022. Inflation has reduced significantly over the first half of the year, although there has been an uptick in the last three months. I am advised that this, in part, reflects a ‘base effect’, in other words very low figures in the same months last year.  Government has moved away from the temporary ‘once-off’ packages of previous budgets in favour of introducing more targeted and permanent measures. For example, Budget 2026 extended the reduced rate VAT on gas and electricity in recognition of the fact that prices remain elevated.  Budget 2026 provides for €28.9 billion to be spent on social welfare in 2026. The measures contained in the Budget are designed to support the most vulnerable in our society with the increased cost of living and there is a particular focus on tackling child poverty.  The wide array of measures clearly demonstrates the huge focus the Government has placed on assisting vulnerable people and families. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 252. Deputy Paul Murphy asked the Tánaiste and Minister for Finance if he will bring in an emergency supplementary budget before Christmas in order that emergency winter cost-of-living payments can be made to disabled people and carers; and if he will make a statement on the matter. [69657/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_262",
          "debateSectionId": "dbsect_262",
          "showAs": "Budget Process",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_262.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_252",
        "questionNumber": 252
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  Unfortunately, Bus Éireann has reported difficulties in specific locations with a small number of contracted services, where it has not yet been possible to provide vehicles and/or drivers. The pupil referred to by the Deputy is assigned to one of these routes.  These difficulties have arisen in some cases due to lack of driver or contractor availability, or where either zero bids were received for a service, despite repeated efforts to procure one. The Bus Éireann School Transport team is working intensively to ensure that transport arrangements are put in place as soon as possible.  Both the Department and Bus Éireann are very conscious of the challenges faced by parents awaiting transport for students with special educational needs. Bus Éireann are required to tender services in line with procurement guidelines and are responsible for the allocating and Garda vetting clearance of a contractor to operate this service.  In such circumstances where there is no existing suitable service available to meet a child's needs, and while Bus Éireann are in the process of establishing the service for the child referred, the Department will offer an Interim Special Transport Grant (STG) to families of eligible children towards the cost of private transport arrangements. This is based on the number of days attended from the date of application until a suitable service becomes available. The family has been contacted in this regard. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 431. Deputy Paul Murphy asked the Minister for Education and Youth if she is aware of the following case (details supplied) and if she will instruct her Department to ensure that the child in question is able to have adequate transport to school. [73385/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_413",
          "debateSectionId": "dbsect_413",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_413.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_431",
        "questionNumber": 431
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The subject of this Parliamentary Question is not a matter for the Department of Foreign Affairs and Trade.  It is not within the responsibility of the Minister to facilitate the humanitarian evacuation of non-Irish citizens to a third country, in this case, to the United States. This would be a matter for the US authorities and queries from the family in question should be directed to the relevant US authorities. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 177. Deputy Paul Murphy asked the Minister for Foreign Affairs and Trade if an application (details supplied) has been received; and if she will instruct her Department to assist the family in question. [72301/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_111",
          "debateSectionId": "dbsect_111",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_111.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_177",
        "questionNumber": 177
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. As a commercial semi-state body, Córas Iompair Éireann (CIÉ) are responsible for the provision of pension schemes for their employees.  Regarding the recent engagement between CIÉ and the Trade Union Group (TUG) on the matter of the CIÉ Pension Schemes, the Department acknowledges the longstanding tradition within CIÉ of ensuring that terms and conditions of employees, which include pension provision, are negotiated collectively with recognised Trade Unions.  I welcome the constructive and collaborative approach of the Trade Union Group and CIÉ management in reaching agreement on a pathway forward, which is aimed at balancing the objectives of supporting the future sustainability of the schemes, protecting existing benefits for members of the scheme (including pensioners), and contributing to the overall financial stability of the CIÉ Group. I also acknowledge the positive outcome from the ballot held on the CIÉ Pension Proposal for both Schemes, which was agreed by CIÉ and the TUG in May of this year.  Keeping in line with the appropriate processes, compliance with all applicable requirements, and necessary approvals , my Department are currently engaging with CIÉ as well as financial advisors at NewERA, the Pensions Authority and the Department of Public Expenditure, Infrastructure, Public Services, Reform and Digitalisation on the next steps in progressing the agreement and bringing CIÉ pensions onto a more stable footing for the benefit of active, and retired scheme members. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 277. Deputy Paul Murphy asked the Minister for Transport if he plans to sign the Statutory Instrument to increase pensions for CIÉ pensioners before Christmas 2025 (details supplied). [71790/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_192",
          "debateSectionId": "dbsect_192",
          "showAs": "Córas Iompair Éireann",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_192.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_277",
        "questionNumber": 277
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Protecting vulnerable road users is a key priority for me and this government. This year we have seen too many pedestrians lose their lives on our roads. Working with all road safety stakeholders, I am determined to reduce the number of deaths and serious injuries on our roads.  It is the policy of both the Government and the RSA to recommend the use of high-visibility vests and armbands by vulnerable road users. To support this, the RSA has been running the ‘Be Safe, Be Seen’ campaign for over a decade to support road safety for pedestrians, cyclists, and motorists.  As part of this campaign, the RSA distributes thousands of free high-visibility vests and armbands each year. In 2025 alone, I am informed that the RSA distributed approximately 250,000 high-vis safety items, including jackets, vests, armbands, drawstring bags, rucksack covers and running bibs.  There has been a significant increase in spending on public awareness, communications and education campaigns by the RSA in 2025 in recent years. Next year, the RSA will again ringfence significant funding of approximately €18 million for awareness, education and promotional campaigns. This will ensure a continued focus on campaigns that make our roads safer for all road users, including pedestrians.  The RSA aired its older pedestrian safety TV-led campaign in September, ahead of the time of the year where increases in pedestrian fatalities tend to occur. The campaign reminders motorists and pedestrians to look out for each other to keep each other safe and shows an interaction between a pedestrian and a motorist at a pedestrian crossing. The campaign is supported by radio, digital audio, video on demand and social media.  Vulnerable road users including pedestrians were also the focus of the RSA’s October bank holiday media campaign with national and radio press engagement. The activity ran across today FM, NewsTalk, classic hits, spin southwest, Beat and 98Fm with presenters voicing stings and promos. It also ran across NewsTalk and Today Fm websites and social media channels, reminding motorists to look out for vulnerable road users and also reminding pedestrians, cyclists, motorcyclist and e-scooterists what they can do to help make sure they are seen.  The RSA is supporting An Garda Síochána’s social media campaign raising awareness that 4 in 10 pedestrians were killed this year in hours of darkness and reminding vulnerable road users including pedestrians to do what they can to help others see them on the roads.  The Government continues to support these campaigns and I would encourage all vulnerable road users to ensure that they are as safe as possible on our roads and to avail of these free high visibility safety materials. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 328. Deputy Paul Murphy asked the Minister for Transport the measures his Department is taking to promote pedestrian safety and increased visibility to road users during the winter months; and if he will make a statement on the matter. [72302/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_237",
          "debateSectionId": "dbsect_237",
          "showAs": "Road Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_237.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_328",
        "questionNumber": 328
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to was approved to enter the Department’s pipeline of school buildings under the Additional School Accommodation Scheme for a project providing a 2 Class SEN Base. The project is devolved to Dublin and Dún Laoghaire ETB (DDLETB) for delivery.  A Design Team was appointed in Q3 2025, and the Department is awaiting the Stage 1/2a report for review. Responsibility for progressing this project remains with DDLETB. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 490. Deputy Paul Murphy asked the Minister for Education and Youth further to Parliamentary Question No. 259 of 25 September 2025, for an update on the provision of an ASD unit in a school (details supplied); and the timeframe for this provision. [72236/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_381",
          "debateSectionId": "dbsect_381",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_381.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_490",
        "questionNumber": 490
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I am informed that the Chief State Solicitor’s Office has engaged both by telephone and in writing with the legal representative of the individual referenced regarding the matters referred, most recently by letter dated 3 December 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 724. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration further to Parliamentary Question No. 318 of 25 September 2025, to clarify the way in which the Chief State Solicitors Office has engaged with the solicitor of an individual, as the individual's solicitors have confirmed they have had no contact with the Chief State Solicitors Office; and if he will provide an update on the progress of an ex-gratia payment to the person in question. [72079/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_574",
          "debateSectionId": "dbsect_574",
          "showAs": "Departmental Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_574.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_724",
        "questionNumber": 724
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Safeguarding our communities is a priority for me as Minister for Justice, Home Affairs and Migration. I can assure the Deputy that there are a range of provisions in law and in practice in relation to the management of sex offenders after they have been released from prison.  The Sex Offenders (Amendment) Act 2023 strengthened our already robust system for the monitoring of sex offenders and provides for changes to the notification requirements for sex offenders, including a reduction of the notification period from seven to three days. A person convicted of an offence set out in the schedule of the Sex Offenders Act 2001 now has to notify An Garda Síochána –  • of their name and address within three days of leaving prison;  • of any change to their name or address within three days;  • if they are going to be outside the State for more than three days;  • if they are returning to the State having been outside it for three days;  • if they are at an address in the State for three days and that address has not been notified to the Gardaí;  • or every 12 months if they had not notified within the previous 12 months.  Other provisions include providing powers to the Gardaí to take fingerprints, palm-prints and photographs to confirm the identity of the person. The 2023 Act strengthens the management and monitoring of sex offenders in the community. It provides for electronic tagging and that a Court can explicitly prohibit a convicted sex offender from working with children or vulnerable people.  Where An Garda Síochána believe that a convicted offender poses a serious and imminent risk to the public, an application can also be made to the courts for a Sex Offender Order, under section 16 of the 2001 Act. A Sex Offender Order can prohibit the offender from doing anything the Court considers necessary, in order to ensure that the public is protected from serious harm. The Act also provides that a Court can impose conditions on a convicted sex offender as part of their post-release supervision, where a judge has included this as part of sentencing.  In addition, Sex Offender Risk Assessment and Management (SORAM) operates to support enhanced levels of co-operation and co-ordination between key statutory organisations involved in managing the risk posed to the community by convicted sex offenders and safeguarding the welfare of children. The Garda National Protective Services Bureau has a dedicated unit, the Sex Offender Management and Intelligence Unit, which has oversight and monitoring responsibility at national level for the management of registered sex offenders who are subject to notification requirements.  Our legal system also provides protection orders in the context of domestic violence, which in many respects covers sexual offences. Under section 10 of the Domestic Violence Act, there is a provision for the granting of protection orders. Similar to a safety order, it restrains a person, meaning the respondent is ordered not to use violence, threats, or molestations, thereby ensuring protection for the victim.  In relation to Part 5 civil orders under the Criminal Justice (Miscellaneous Provisions) Act 2023, while they are not specifically designed to address sexual violence, their applicability depends on the facts of each individual case. In principle, a victim of a sexual offence could apply for a part 5 civil order if the offender’s conduct could reasonably be considered likely to:  • cause the applicant to fear that violence will be used against the applicant or person; or  • serious alarm or distress that has a substantial adverse impact on his or her usual day-to-day activities.  Any legislation to introduce protection orders for victims of sexual abuse may have potential overlaps with existing mechanisms that would need to be fully explored to ensure that the proposed measure is necessary, proportionate, and compatible with established statutory frameworks.  While there are currently no plans to extend the range of persons who can apply for safety and protection orders, I would like to assure the Deputy that all civil and criminal legislation is kept under review and I will consider any changes necessary to ensure it remains effective, proportionate, and fully compliant with due process and the Constitution. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 753. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration his plans to progress legislation to ensure that the victim of a crime of sexual violence can have a civil protection order granted against a person who has been convicted of that crime. [72413/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_599",
          "debateSectionId": "dbsect_599",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_599.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_753",
        "questionNumber": 753
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 826, 827 and 828 together.  Statutory and operational responsibility for the delivery of child protection and welfare services is a matter for Tusla, the Child and Family Agency. The Deputy is seeking information in relation to an operational matter for Tusla. Consequently, I have referred the matter to Tusla, and requested that a direct response be provided to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 826. Deputy Paul Murphy asked the Minister for Children, Disability and Equality the outcome of the investigation by Tusla into a company (details supplied); the lessons that have been learned; and to detail any changes to practice as a result. [71823/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_652",
          "debateSectionId": "dbsect_652",
          "showAs": "Child and Family Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_652.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_826",
        "questionNumber": 826
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 826, 827 and 828 together.  Statutory and operational responsibility for the delivery of child protection and welfare services is a matter for Tusla, the Child and Family Agency. The Deputy is seeking information in relation to an operational matter for Tusla. Consequently, I have referred the matter to Tusla, and requested that a direct response be provided to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 827. Deputy Paul Murphy asked the Minister for Children, Disability and Equality the way in which a company (details supplied) was awarded a contract with Tusla. [71824/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_652",
          "debateSectionId": "dbsect_652",
          "showAs": "Child and Family Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_652.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_827",
        "questionNumber": 827
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 826, 827 and 828 together.  Statutory and operational responsibility for the delivery of child protection and welfare services is a matter for Tusla, the Child and Family Agency. The Deputy is seeking information in relation to an operational matter for Tusla. Consequently, I have referred the matter to Tusla, and requested that a direct response be provided to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 828. Deputy Paul Murphy asked the Minister for Children, Disability and Equality if the Government continues to use private operators to provide supervised access; if so, the procurement procedures for issuing these contracts; and the oversight processes for those companies who are awarded these contracts. [71825/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_652",
          "debateSectionId": "dbsect_652",
          "showAs": "Child and Family Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_652.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_828",
        "questionNumber": 828
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC, and with the Department of Public Expenditure, Infrastructure, Public Service Form and Digitalisation, in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 134. Deputy Paul Murphy asked the Minister for Education and Youth if she supports school secretaries and caretakers being treated equally with teachers in terms of access to a public sector pension and leave entitlements; and if she will make a statement on the matter. [70817/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_156",
          "debateSectionId": "dbsect_156",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_156.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_134",
        "questionNumber": 134
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC, and with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 167. Deputy Paul Murphy asked the Minister for Education and Youth to provide an update on a pensions deal for school secretaries and caretakers; and if she will make a statement on the matter. [70818/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_191",
          "debateSectionId": "dbsect_191",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_167",
        "questionNumber": 167
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Programme for Government 2025 commits to enacting the Inspection of Places of Detention Bill to enable ratification of the UN Optional Protocol to UN Convention on Torture (OPCAT).  The General Scheme of the Places of Detention Bill was approved by Government in June 2022 and it is currently being drafted by the Department with the Office of Parliamentary Counsel. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 474. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration the proposed timeline for the passage of the Inspection of Places of Detention Bill 2022; and for an update on its progress. [71022/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_464",
          "debateSectionId": "dbsect_464",
          "showAs": "Legislative Process",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_464.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_474",
        "questionNumber": 474
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The major pieces of legislation in Ireland that are in place to promote and protect the principles of equality and freedom from discrimination include the Employment Equality Acts (1998-2021) and the Equal Status Acts (2000-2018). Following a review of Ireland’s equality legislation, a General Scheme of the Equality (Miscellaneous Provisions) Bill was approved by Government in November 2024.  This was referred for pre-legislative scrutiny by the Joint Oireachtas Committee on Children and Equality. The Committee issued its pre-legislative scrutiny report on the Bill in October, and my officials are currently examining the recommendations in this report while work is ongoing on drafting the bill. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 528. Deputy Paul Murphy asked the Minister for Children, Disability and Equality the status of the Equality (Miscellaneous Provisions) Bill 2024. [71020/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_498",
          "debateSectionId": "dbsect_498",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_498.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_528",
        "questionNumber": 528
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Directives on Standards for Equality Bodies set minimum requirements for the effective and  independent operation of Equality Bodies in a number of key areas, in order to allow them to carry out their work more effectively in all Member States and to ensure a more uniform application of EU equal treatment law.  My officials have participated in expert group meetings and workshops on transposition of these Directives with the European Commission, and are meeting regularly with relevant bodies and departments. Work is ongoing on the preparation of draft Heads. It is expected that legislation to transpose the Directives will be in place by the deadline for transposition in June 2026. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 529. Deputy Paul Murphy asked the Minister for Children, Disability and Equality the steps the Government intends will take to transpose the EU Directives on standards for equality bodies; and the timeframe envisaged. [71021/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_499",
          "debateSectionId": "dbsect_499",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_499.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_529",
        "questionNumber": 529
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 11, inclusive, together.  The Government is committed to the delivery of a national security strategy and work is ongoing in finalising the strategy, co-ordinated by the national security secretariat in my Department and integrating inputs from a range of relevant stakeholders, including the Department of Foreign Affairs and Trade, the Department of Defence, the Department of Justice, Home Affairs and Migration, An Garda Síochána, the Defence Forces and the National Cybersecurity Centre.  The programme for Government, securing Ireland's future sets out a number of national security commitments, acknowledging that this is a time of upheaval, in particular geopolitical upheaval, with threats and challenges arising from a rapidly changing global geopolitical landscape. The preparation of a draft strategy covers a broad range of national security issues. There is necessarily a focus on the State’s internal security, including the evolving challenges we face from terrorism and extremism and from cyber threats, and a focus on the need to increase our investment in security and to modernise our legislation in the security field, notably in the investigatory powers available to our services. It will include also the implications of recent security, defence and international developments and their related impacts, notably the deteriorating security situation in Europe given Russia's ongoing war in Ukraine and the growth in cyber and hybrid threats in Europe. It will combine an enhanced maritime domain awareness with a prioritised focus on ensuring protection of critical maritime infrastructure, especially critical undersea infrastructure. The ongoing implementation of the report of the Commission on the Defence Forces and the modernisation of aspects of our defence legislation is also included in the preparations.  The National Cyber Security Centre has been placed under the remit of the Minister for Justice, Home Affairs and Migration. This is an important element of the realignment of our national security infrastructure, and a project has been initiated to establish this new statutory national security authority, led by the Department of Justice, Home Affairs and Migration. Earlier this year, I established the Ministerial Council on National Security, which comprises me as chair, the Tánaiste, the Minister for Foreign Affairs and Trade and for Defence, and the Minister for Justice, Home Affairs and Migration. The council will ensure that at the highest level there is a structured, ongoing review of our strategic national security interests and systematised monitoring of progress on delivering the Government’s commitments over the coming months, including the finalisation of the draft national security strategy. \n Deputy Tom Brabazon  As the Taoiseach is aware, drone sightings in Dublin Bay during the recent Zelenskyy visit underline and underscore the scale of our vulnerabilities and the urgency and need for preparing a strategic national security package. There are reports that international anti-drone units were deployed to Dublin during the visit to assist the emergency response unit. While we welcome the assistance of other states, we should not have to rely on others for our own defence. We should be self-reliant in the first instance. It should be expected that such activity will continue when Ireland takes over the EU Presidency next year, and a national security strategy would allow us to assess risks facing the State, including emergency aerial and technological threats, and set clear goals to guide Government and law makers. Can the Taoiseach provide an update to the House on the development of Ireland's national security strategy and an update on the drone sightings during the Zelenskyy visit? \n Deputy Albert Dolan  When we are talking about national security, it is vital we also give people confidence at a local level in our local security, particularly with regard to An Garda Síochána. In Galway East we have towns that are booming, thriving and growing such as Gort, Loughrea, Tuam and Athenry. Those towns are all feeding into Galway city. They have seen massive population increases and for those people to feel secure in those towns, we need an increase in our gardaí allocation and our gardaí numbers. More importantly, as the populations continue to grow in these towns, we need gardaí that become community gardaí, that the people know and connect with and can build relationships with into the future. These gardaí will serve the area. Our gardaí on the ground right now are working really hard but they need to be supported to handle the large caseloads right across the country but particularly in Galway East, we need additional gardaí. \n Deputy Paul Murphy  Does the Taoiseach think there is any national security implications for the significant decline in basic civil liberties that is happening in Britain, such as the proscription of organisations of Palestine protestors like Palestine Action, the denial of the right to a jury in the vast majority of trials and what is happening with the Palestine protesters who are charged with nothing more than property damage and who have been held for over a year without trial and without access to bail? The consequence is there are now eight protesters on hunger strike for over 30 days. This is the longest, most significant hunger strike since the H-block hunger strikers. Their demands are minimal, namely, the right to a fair trial, the right to access bail, the right to access medical care in prison and for the ending of the proscription of Palestine Action. There is an almost total media blackout on this in Britain, leading people to suspect there is a so-called D-notice in relation to this. Is the Taoiseach concerned about the decline of civil liberties and the fact that people are forced to go on hunger strike in Britain? \n Deputy Ryan O'Meara  Next year we will hold the Presidency of Europe. During that time, as the Taoiseach is more than aware, our national security will be of paramount importance. Given what has happened with drone activity and interference in Denmark, there is a fear the same will happen in Ireland. With President Zelenskyy's visit last week, we saw drones off the coast of Dublin. It is one thing for us to be a militarily neutral country, and that is right, but it is another thing for us to be able to say whether we can patrol our own skies and protect our own airspace. In light of the Presidency coming up in the middle part of next year, what will our national security strategy do? When will we see it? What will be in it regarding the protection of our skies and airports from rogue actors operating drones? \n Deputy Rose Conway-Walsh  The very serious incident of five drones endeavouring to intercept the plane carrying President Zelenskyy last week brought our unpreparedness on defence and national security into sharp focus. Was the C70 form completed to ensure that a Garda defence co-ordinated response was put in place? Were all protocols followed? Why did the navy ship not have drone-disabling equipment? Why were airlines not informed that there was drone activity in the vicinity into which they were flying?  Lieutenant General Rossa Mulcahy told John Mooney of The Sunday Times that the military needs more personnel, intelligence and high-tech capabilities to navigate these uncertain times. Why is the Taoiseach so reluctant to allow the defence and national security committee to do what its title suggests and have oversight of national security? \n Deputy Peadar Tóibín  Can the Taoiseach categorically say that the Government is able to protect all of the EU leaders who will come to this country during the EU Presidency? Who launched the drones that were seen off Dublin Bay during the Zelenskyy visit? Why were those drones not dealt with? Where did these drones come from? Where did they retreat to? How come none of that information is known at this stage? Who was behind the drones? We have heard statements that it is likely that they may have come from Russia, but what evidence is there of this? One of the more memorable answers the Taoiseach gave to a question on national security in the previous Dáil, when the issue of the so-called Russian spy was discussed, was that he did not receive those briefings. He quite pointedly said he did not receive the information he should be receiving on that. How can people in Ireland have confidence, given the fact that our Defence Forces have been run down for so long and we can only staff one ship on the seas at any given time? \n Deputy Paul Lawless  The national security strategy consultation launched in 2019 was intended to guide our strategy on security for the past five years, from 2020-25. Despite this, no strategy was published during this timeframe. During that timeframe we had a huge ransomware attack on the HSE which put a significant number of people's lives and health in jeopardy and cost the State several million euro. What is happening on this? When will the strategy be published? It is costing the State a significant amount of money. \n Deputy Ruairí Ó Murchú  We need some sort of detail and we need to know there is a plan to address cybersecurity and hybrid warfare. The HSE attack brought to light what was probably happening to a lot of businesses which did not provide information. There has been increased funding for the National Cyber Security Centre, NCSC, but we need to get down to brass tacks. There have been drone attacks over the past while and we need to make sure that we have the capacity and technological know-how to be able to deal with these issues. There has been a failure to date in respect of funding to ensure we have the full capacity required. \n Deputy Richard Boyd Barrett  One of the biggest atrocities and national security breaches was the Dublin-Monaghan bombing carried out by the Glenanne gang. There were headlines yesterday stating that there was no collusion in the Dublin-Monaghan bombing. First, the Kenova report yesterday dealt with Stakeknife, not the Dublin-Monaghan bombing. The Denton report will not be published until January. \n The Taoiseach  It was a summary of Denton. \n Deputy Richard Boyd Barrett  The report states that the British Army had the names of the killers on the night of the bombing but nobody was ever arrested. The representatives of the families think that smacks of collusive behaviour. The authors were also extremely critical of the Irish authorities, including the Garda, and the British authorities for destroying much of the files and evidence so that the people compiling the report could not gather conclusive evidence. The whole thing stinks to high heaven. The representatives of the families have asked for a public inquiry. Will the Taoiseach listen to them? \n The Taoiseach  I thank all Deputies who raised issues in terms of national security and the national security strategy. It reflects a growing awareness and engagement with this House, not before time, in respect of security and defence issues. There has been a wilful ignoring of these issues for far too long in the House. Particular perspectives have been taken on this. Even this morning, there were references to the United Kingdom, Europe or America as being threats. The clear threats right now in this era include a Russian threat to our security and security infrastructure. We have had engagement between Iran and Russia and North Korea and Russia. North Korean soldiers have been on European soil during a period of war, seeking to violate the territorial integrity of Ukraine and its sovereignty. These are the realities we face. We wish we were not facing these realities and we would prefer a Continent at peace and so on.  The strategy will be completed. Deputy Brabazon was the first to speak and referred to self-reliance. We will develop radar capacity, and that is very close to action in terms of procurement – a lot of work has gone into that. We need to co-operate and co-ordinate with other member states in the European Union and the United Kingdom in respect of all of these issues because a pattern has developed in terms of the emergence of these drones and the violation of the airspace of EU member states. The most notable incident occurred in Copenhagen at the time of the European Political Community meeting. Denmark sought help and advice from other EU member states at that time. There were incidents in Belgium, France, Poland, in terms of train tracks and so on, and in the Baltic Sea. We are agreed that, on the drone issue, disabling technology is important.  The visit of President Zelenskyy was very effective from a security perspective. I want to make it clear to everybody that an incident did occur on that night. A small number of unidentified drones were observed in the vicinity of a Naval Service vessel on patrol off the coast of Dublin. The drones were not a threat to President Zelenskyy's aircraft - that needs to be clear - because it had safely landed quite some time prior to the incident, nor were they a threat to his departure. An operational response was put in place that was appropriate to the circumstances by the commander of the naval vessel at the time and, subsequently, by the police and military authorities working in close co-operation. They worked closely together in advance of the visit and so on.  The Garda liaised with its Ukrainian partners throughout the visit of the President on the security arrangements, including with regard to this incident. The Garda special detective unit is carrying out an investigation of the circumstances of the incident with input from the Defence Forces. It is a very concerning incident, as I said, like other similar incidents in other European states. The circumstances are suggestive of this being part of an ongoing Russian-inspired hybrid campaign against European Union and Ukrainian interests. \n Deputy Paul Murphy  I would like the Taoiseach to present some evidence. He said the circumstances are suggestive----- \n The Taoiseach  Of course the Deputy would. Could I say to Deputy Brabazon----- \n Deputy Paul Murphy  The circumstances are contested. It might well have been the Russians but I would like to see some evidence if this will be used as an agenda to undermine our neutrality. \n An Ceann Comhairle  We just cannot have this, Deputy Murphy. \n The Taoiseach  The gardaí----- \n An Ceann Comhairle  We cannot have this interaction. \n The Taoiseach  I will come back to the Deputy. \n Deputy Paul Murphy  I thank the Taoiseach. \n The Taoiseach  An Garda Síochána is substantively enhancing and has enhanced its anti-drone capabilities. It has significant capabilities on land, and the navy likewise. The military generally has the capabilities throughout all three strands: air, sea and land. We will continue to enhance that and harness all technology available in the country, both private sector but also on our university campuses that can assist in that regard.  All politics is local and Deputy Dolan asked about gardaí in east Galway and the expanding towns. We have seen good progress in the recruitment of gardaí through Templemore. It has seen its highest intake this year. The Commissioner has been allocating significant numbers to given areas. Dublin benefited initially. Cork is benefiting now, to be quite frank, in terms of the city centre. The idea is to get around to the rest of the country but to do it in significant numbers so it really has impact. I understand we are pleading for patience on the Deputy's behalf and others but we are making progress. Funding is there to keep the throughput at the level it currently is in Templemore.  On the remarks made by Deputy Murphy, the United Kingdom does not present a national security threat to Ireland. \n Deputy Paul Murphy  The Taoiseach should have read the Denton report. \n The Taoiseach  On the issue he raised in terms of the civil liberties issue within the UK, it is an issue the UK has to challenge and deal with. I noted his comment, \"nothing more than property damage\". That was interesting. I do not believe people should be----- \n Deputy Paul Murphy  Interned for property damage. \n The Taoiseach  No one should be interned and there should be trials. I love the Deputy's casual approach to property damage. It is fine. It is grand. Do not worry about it. Let us continue doing it. \n Deputy Paul Murphy  That is not what I said. \n The Taoiseach  It is what he implied. \n Deputy Paul Murphy  No, it is not. \n The Taoiseach  Ah, come on. \n Deputy Paul Murphy  The point I was making is it is not normal to hold people----- \n The Taoiseach  We discussed this----- \n An Ceann Comhairle  Deputy Murphy made his point already. \n Deputy Paul Murphy  -----without trial for over a year for property damage. \n An Ceann Comhairle  We are not doing this, Deputy Murphy. We are not doing this. \n Deputy Paul Murphy  That is the point I was making and the Taoiseach knows it. \n An Ceann Comhairle  There are other Members to be regarded. \n The Taoiseach  Can I just say to Deputy Murphy that Deputies in this House have had their property damaged. I do not believe that should lead to internment or anything like that. \n Deputy Paul Murphy  Exactly. \n The Taoiseach  No, no. \n An Ceann Comhairle  Allow the Taoiseach to answer. \n The Taoiseach  Let us be very clear. In dealing with protest, there are different levels of protest. The right to protest and to free speech is absolutely inviolable. It has to be allowed and facilitated in any true democracy. When protests get too extreme, you then impact on other people's rights to personal safety, life and property. I respectfully suggest that is something the Deputy does not pay much attention to. \n Deputy Paul Murphy  Israeli weaponry property? No. \n The Taoiseach  In terms of the other issue Deputy O'Meara raised, I have dealt with some of the aspects of what happened on the night and so forth. In terms of the EU Presidency, which people have raised, there is a lot of work under way to prepare for that. An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office, led by the deputy commissioner of policing operations to oversee all aspects of operational planning, logistics and inter-agency engagement. There is ongoing interdepartmental engagement through a whole range of forums. Close co-operation with European policing and security partners concerning the Presidency is ongoing, as per the norm.  In the modern security arena, you have to co-ordinate, co-operate and share intelligence with other agencies. That is absolutely key. Otherwise, you are at nothing in terms of protecting the State or protecting our people. I do not want to go into all of the details here. Some of this is security sensitive. I have a report about the drone situation. When we are discussing security, there has to be an understanding there are limits to what can be put into the public domain. That impacts further gathering and garnering of intelligence. It also impacts on our capacity to withstand further threats and so on like that. There will be a lot of planning for VIP protection, venue security, transport management, cyber resilience and public order contingencies. All of that is being worked on. It is a mammoth task. It is a huge operation. Other member states have had to do something similar. It is symptomatic of where we are in terms of the threats to European security and so forth.  I think I have dealt with most of the issues Deputy Rose Conway-Walsh raised and I was responding to her in respect of that. \n Deputy Rose Conway-Walsh  Sorry, the Taoiseach has not----- \n An Ceann Comhairle  Absolutely not, Deputy. The Deputy has to take the answer. \n Deputy Rose Conway-Walsh  I just want to put it on the record the Taoiseach has not answered. \n The Taoiseach  I am not finished yet. No member state yet, bar France in the past 48 hours or so, has attempted to disabled drones or bring them down, for different reasons. That is a matter we have to leave to the operational people in charge. We cannot dictate that sort of a response here. \n Deputy Rose Conway-Walsh  Do we have the capacity? \n An Ceann Comhairle  Deputy, no. \n The Taoiseach  We have the capacity. \n An Ceann Comhairle  If the Deputy needs to raise a Topical Issue, she can put one down. This is not a back and forth. \n The Taoiseach  Once again, it is a matter for those on the ground and in the theatre to decide the best and most appropriate response at the time.  I have dealt with some of Deputy Tóibín's questions. The national security council has been established. There is a clear structure emanating from that in terms of awareness, being briefed and so forth. I was briefed on this incident. I sought a briefing immediately on it and I received it. Obviously, it is something that will be discussed at the national security council later.  In terms of Deputy Lawless----- \n Deputy Peadar Tóibín  The Taoiseach has not categorically----- \n An Ceann Comhairle  No. If the Deputy is not happy with the answer, put down----- \n Deputy Peadar Tóibín  -----stated that EU leaders will be safe during the Presidency. \n An Ceann Comhairle  Deputy Tóibín, you know you are wrong. \n Deputy Peadar Tóibín  He also has not stated where those drones came from and where they went. \n An Ceann Comhairle  I am asking the Deputy to stop addressing the Taoiseach until he finishes his answers, \n Deputy Peadar Tóibín  He has not answered those questions. \n An Ceann Comhairle  The Deputy might not like the answer but it is the Taoiseach's answer. Do not interject again, please. \n The Taoiseach  I was just about to make the point in terms of the cybersecurity attacks. Sorry, we will protect those who are coming into this country. There is no question. Do not always be so fast to denigrate ourselves. Do not listen to all the noise out there. What happened during President Zelenskyy's visit was a good security operation by our Defence Forces and by an Garda----- \n Deputy Peadar Tóibín  Why will the Taoiseach not answer the question about the drones? \n An Ceann Comhairle  Deputy, please have respect for the other Members. \n The Taoiseach  Through the Chair, we need to acknowledge that and the very effective work of An Garda Síochána and our Defence Forces. There is a lot of noise which suits other interests to portray Ireland in a certain light. The Deputy should be wary of that, too.  Deputy Lawless raised the issue of cybersecurity. Cyber threats and attacks have increased significantly since the Russian invasion of Ukraine. Some have been by criminal elements, some have been by professionals. There are also third party state actors in respect of cybersecurity threats. It is a very serious issue for both public utilities and private sector companies. It is costing a lot of funding to deal with that. We have brought the National Cyber Security Centre under the Department of justice. It is a very strong centre and has grown in capacity very significantly in the past five years. I remember when we started it. It has developed a really strong capacity under Richard Browne. Credit needs to be given in respect of that.  I make the point to Deputy Ó Murchú that there is not a failure in funding, frankly, and finance will not be an issue here. What is an issue is the procurement timelines, both within the European defence industry and more generally. We are working to see if we can accelerate procurement. We are doing that with the radar. That is why we took a joint country approach to procurement - to fast track it. In other words, we use the experience and expertise of countries that have experience of procuring the radar we are now seeking. Everyone will be about how fast we can procure. It will also be about taking an intelligent approach in terms of what we procure. The nature of modern warfare or security threats has changed radically. We are all witnessing the drone technology change, as well as the cybersecurity. What can we do undersea? How do we protect cables? How do we protect gas connectors? It is a whole-of-society security approach that is required here. It is not the traditional, conventional approach to defence and security. We need to consider and explore that point more, perhaps.  On the Dublin-Monaghan bombing, Deputy Boyd-Barrett is correct insofar as the summary of the Denton report was produced yesterday. It is regrettable that we do not have the full Denton report. I think there was some legal action taken to try to prevent it being published in full. The Kenova report has been published. We should have a debate on the Kenova report in this House in the new year. It reveals very sordid activity by state actors but also by paramilitaries, including the Provisional IRA. The Kenova report does not pull its punches in saying it was a threat to its own community or attacked its own community. What went on is quite unbelievable.  The Denton report stated that 120 people were murdered by a network of loyalist paramilitaries and RUC and UDR personnel, including those killed in the Dublin-Monaghan bombings. It is a very sordid story and both the Kenova and Denton reports cover it. I pay tribute to Jon Boutcher, who is now the head of the PSNI, for his leadership on Kenova, and also to Iain Livingstone. They withstood a lot of pressure. We will have two comprehensive reports, if we can get the latter one published. \n An Ceann Comhairle  That is it, Taoiseach. We move to questions Nos. 12 to 28, inclusive. With 16 Members and a remaining 18 and a half minutes, it is highly unlikely we will get to the third group of questions. I ask Members to be brief. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 6. Deputy Paul Murphy asked the Taoiseach for a report on the national security strategy. [65782/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_6",
        "questionNumber": 6
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 17. Deputy Paul Murphy asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [65783/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_17",
        "questionNumber": 17
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  All children and young people up to the age of 18 years, including those who come to Ireland as migrants or refugees, have access to free primary and post-primary education on the same basis as Irish nationals. A school must admit all students, regardless of nationality or immigration status, where it is not oversubscribed and places are available.  I do not envisage that the recent changes announced by my colleague the Minister for Justice, Home Affairs and Migration will change how children and young people access primary and post-primary education. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 198. Deputy Paul Murphy asked the Minister for Education and Youth her views on whether migrants and refugees will be discouraged from accessing education, training and upskilling supports that require people to be in receipt of a social welfare payment in light of proposals from the Department of Justice, Home Affairs and Migration to penalise migrants and refugees who rely on essential social welfare supports such as disability allowance, carer's allowance or working family payment in terms of eligibility for naturalisation; if her Department was consulted about these proposals; and if she will make a statement on the matter. [70608/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_162",
          "debateSectionId": "dbsect_162",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_198",
        "questionNumber": 198
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  I propose to take Questions Nos. 261, 262, 263 and 264 together.  Migrants play an essential and positive role in contributing to Irish society and are vital to addressing labour shortages in many sectors of the economy. For those migrants who establish themselves here, naturalisation provides a very effective means to enhance their integration and participation in Irish society.The granting of Irish citizenship through naturalisation is governed by the provisions of the Irish Nationality and Citizenship Act 1956, as amended. All applications for a certificate of naturalisation are processed and assessed individually in accordance with the provisions of the Act. I intend to propose a number of new statutory naturalisation conditions including the requirement to be self-sufficient. Being self-sufficient will mean that the applicant should not be indebted to the State or be in receipt of certain social protection payments in a defined time period prior to submitting an application.It is not the intention to bar anybody who has ever received a welfare payment from applying for citizenship. That said, it is reasonable to expect that a person seeking to become an Irish citizen has contributed to the country and has been in employment.The exact types of social welfare payment to be taken into account will be examined by my Department in consultation with the Department of Social Protection.The outlined conditions of being 'self-sufficient' will require legislative change to the 1956 Act and full scrutiny of the proposed changes will take place through the regular parliamentary process. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 261. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if an assessment will be carried out to understand how discouraging welfare access for refugees and migrants by linking it to eligibility for naturalisation will affect the labour market, education participation, integration outcomes and poverty rates. [70601/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_261",
        "questionNumber": 261
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  I propose to take Questions Nos. 261, 262, 263 and 264 together.  Migrants play an essential and positive role in contributing to Irish society and are vital to addressing labour shortages in many sectors of the economy. For those migrants who establish themselves here, naturalisation provides a very effective means to enhance their integration and participation in Irish society.The granting of Irish citizenship through naturalisation is governed by the provisions of the Irish Nationality and Citizenship Act 1956, as amended. All applications for a certificate of naturalisation are processed and assessed individually in accordance with the provisions of the Act. I intend to propose a number of new statutory naturalisation conditions including the requirement to be self-sufficient. Being self-sufficient will mean that the applicant should not be indebted to the State or be in receipt of certain social protection payments in a defined time period prior to submitting an application.It is not the intention to bar anybody who has ever received a welfare payment from applying for citizenship. That said, it is reasonable to expect that a person seeking to become an Irish citizen has contributed to the country and has been in employment.The exact types of social welfare payment to be taken into account will be examined by my Department in consultation with the Department of Social Protection.The outlined conditions of being 'self-sufficient' will require legislative change to the 1956 Act and full scrutiny of the proposed changes will take place through the regular parliamentary process. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 262. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if he has given consideration to the human rights impact of penalising migrants and refugees who rely on essential social welfare supports such as disability allowance, carer's allowance or working family payment in terms of eligibility for naturalisation; and if he will make a statement on the matter. [70602/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_262",
        "questionNumber": 262
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  I propose to take Questions Nos. 261, 262, 263 and 264 together.  Migrants play an essential and positive role in contributing to Irish society and are vital to addressing labour shortages in many sectors of the economy. For those migrants who establish themselves here, naturalisation provides a very effective means to enhance their integration and participation in Irish society.The granting of Irish citizenship through naturalisation is governed by the provisions of the Irish Nationality and Citizenship Act 1956, as amended. All applications for a certificate of naturalisation are processed and assessed individually in accordance with the provisions of the Act. I intend to propose a number of new statutory naturalisation conditions including the requirement to be self-sufficient. Being self-sufficient will mean that the applicant should not be indebted to the State or be in receipt of certain social protection payments in a defined time period prior to submitting an application.It is not the intention to bar anybody who has ever received a welfare payment from applying for citizenship. That said, it is reasonable to expect that a person seeking to become an Irish citizen has contributed to the country and has been in employment.The exact types of social welfare payment to be taken into account will be examined by my Department in consultation with the Department of Social Protection.The outlined conditions of being 'self-sufficient' will require legislative change to the 1956 Act and full scrutiny of the proposed changes will take place through the regular parliamentary process. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 263. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if a comprehensive impact analysis will be conducted in respect of the new proposals to discourage welfare access for refugees and migrants by penalising them in terms of eligibility for naturalisation; if he will commit not to further the development of these policies until such an analysis is conducted; and if he will make a statement on the matter. [70603/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_263",
        "questionNumber": 263
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  I propose to take Questions Nos. 261, 262, 263 and 264 together.  Migrants play an essential and positive role in contributing to Irish society and are vital to addressing labour shortages in many sectors of the economy. For those migrants who establish themselves here, naturalisation provides a very effective means to enhance their integration and participation in Irish society.The granting of Irish citizenship through naturalisation is governed by the provisions of the Irish Nationality and Citizenship Act 1956, as amended. All applications for a certificate of naturalisation are processed and assessed individually in accordance with the provisions of the Act. I intend to propose a number of new statutory naturalisation conditions including the requirement to be self-sufficient. Being self-sufficient will mean that the applicant should not be indebted to the State or be in receipt of certain social protection payments in a defined time period prior to submitting an application.It is not the intention to bar anybody who has ever received a welfare payment from applying for citizenship. That said, it is reasonable to expect that a person seeking to become an Irish citizen has contributed to the country and has been in employment.The exact types of social welfare payment to be taken into account will be examined by my Department in consultation with the Department of Social Protection.The outlined conditions of being 'self-sufficient' will require legislative change to the 1956 Act and full scrutiny of the proposed changes will take place through the regular parliamentary process. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 264. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if he will consult with relevant stakeholders (details supplied) before developing further or implementing proposals to link eligibility for naturalisation to welfare access; and if he will make a statement on the matter. [70604/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_264",
        "questionNumber": 264
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  This is a matter for my cabinet colleagues, the Ministers for Social Protection and the Ministers for Justice, Home Affairs and Migration. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 284. Deputy Paul Murphy asked the Minister for Children, Disability and Equality her views on the human rights impact of proposals to penalise migrants and refugees who rely on essential social welfare supports such as disability allowance, carer's allowance or working family payment in terms of eligibility for naturalisation, if her Department was consulted; and if she will make a statement on the matter. [70605/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Naturalisation Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_284",
        "questionNumber": 284
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality (Deputy Norma Foley)  This is a matter for my cabinet colleagues, the Ministers for Social Protection and the Ministers for Justice, Home Affairs and Migration. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 285. Deputy Paul Murphy asked the Minister for Children, Disability and Equality if her Department will carry out an analysis of the likely impact on child poverty, disability rights or community wellbeing of proposals to discourage welfare access for refugees and migrants by penalising them in terms of eligibility for naturalisation; and if she will make a statement on the matter. [70607/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_230",
          "debateSectionId": "dbsect_230",
          "showAs": "Naturalisation Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_230.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_285",
        "questionNumber": 285
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 328. Deputy Paul Murphy asked the Minister for Health the exact number of representatives with direct lived experience who are on the working group for the National Clinical Programme for Gender Healthcare. [70648/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_273",
          "debateSectionId": "dbsect_273",
          "showAs": "Gender Recognition",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_328",
        "questionNumber": 328
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 329. Deputy Paul Murphy asked the Minister for Health to provide a list of all interim care options being considered by the HSE while the HSE's transgender model of care is being developed. [70649/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_274",
          "debateSectionId": "dbsect_274",
          "showAs": "Gender Recognition",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_274.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_329",
        "questionNumber": 329
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Deputy will be aware, set out in the Programme for Government 2025, this Government is committed to ensuring a transgender healthcare service that is based on clinical evidence, respect, inclusiveness and compassion. I have acknowledged previously that the current public gender healthcare services are not meeting people’s full range of needs.  It is in this context that the HSE has established a new National Clinical Programme for Gender Healthcare to develop an updated clinical Model of Care with the aim of designing clinical pathways to deliver safe and effective health and social care for those seeking gender affirming healthcare services. This work will also inform an implementation plan for its delivery. As this work will take some time to complete Minister Mary Butler and I have requested that the HSE examine all avenues to improve interim care options while the Model of Care is being developed.  A key aspect of the development of the new model of care is stakeholder consultation. I am committed to ensuring that all stakeholders are heard and actively involved in this process. This inclusivity is vital for the success of the Model of Care that we aim to create.  Gaining an understanding of the experiences of those in the transgender community will be integral to the development of the model of care. That is why there has been and will continue to be a strong focus on the experience base which will bring in stakeholder perspectives and experience, as well as, the evidence base, which relates to the clinical research on the topic. This collaborative approach will ensure that the needs and perspectives of all stakeholders are considered, leading to a more inclusive and effective care model.  A number of lived experience engagement design sessions, attended by several advocacy groups, have already been held to inform the development of a plan to maximise stakeholder engagement. It is our sincere hope and expectation that this approach not only will strength the relevance and inclusivity of the final model but will also lead to better outcomes by the services truly reflect the experiences and populations they are meant to serve.  A cross-speciality Clinical Advisory Group has been established with the Royal College of Physicians of Ireland and convened in June 2025 to support the Model of Care design and development. In addition, a working group, which has a number of representatives with direct lived experience has also been established and the first meeting took place recently.  In terms of progressing the model of care, the HSE commenced the systematic review on the evidence base with respect to co-existing clinical needs in gender diverse people with support from the HSE Library Service. Interim results of this review were made available for public consultation during August of this year and the HSE are now reviewing the submissions and completing the evidence review.  Developing a model of care for Gender Healthcare Services is expected to be a complex process and the HSE and my department will work closely together to support the process, ensure transparency and keep the patient at the centre of the process.  It is important that the HSE is given time to develop a model of care that is based on the best clinical evidence and that will deliver the best outcomes for persons with gender incongruence or dysphoria. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 330. Deputy Paul Murphy asked the Minister for Health if she will commit to the trans community being consulted before implementing any interim care options while the HSE's transgender model of care is being developed. [70650/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_275",
          "debateSectionId": "dbsect_275",
          "showAs": "Gender Recognition",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_275.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_330",
        "questionNumber": 330
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 331. Deputy Paul Murphy asked the Minister for Health if she will confirm that the clinician in the recording mentioned during the trans healthcare Dáil debate on 3 December 2025 (details supplied) has no involvement in the National Clinical Programme for Gender Healthcare, including as a member of the working group or clinical advisory group. [70651/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_276",
          "debateSectionId": "dbsect_276",
          "showAs": "Gender Recognition",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_276.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_331",
        "questionNumber": 331
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 48 and 52 together.  The Rent Tax Credit, as provided for in section 473B of the Taxes Consolidation Act 1997 (TCA 1997), was introduced by the Finance Act 2022 and may be claimed in respect of qualifying rent paid in 2022 and subsequent years to end-2025. For the years 2022 and 2023 the Rent Tax Credit is valued at a maximum of €500 per single individual and €1,000 per jointly assessed couple. For the years 2024 and 2025 the Rent Tax Credit is valued at a maximum of €1,000 per single individual and €2,000 per jointly assessed couple.  As announced in Budget 2026 and as provided for in Finance Bill 2025, the Rent Tax Credit is being extended, in its current form, for a further three years, to the end of 2028. Therefore, the credit continues to be valued at a maximum of €1,000 per single individual and €2,000 per jointly assessed couple.  As the Deputies will be aware, the Programme for Government commits to “progressively increase the Rent Tax Credit”. However, due to competing demands for limited fiscal resources, the value of the credit was not increased in Budget 2026. However, consideration of further increases to the value of the credit will be given as part of future Budget and Finance Bill processes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 48. Deputy Paul Murphy asked the Tánaiste and Minister for Finance when the renter's tax credit will be increased; and if he will make a statement on the matter. [64198/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Tax Credits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_48",
        "questionNumber": 48
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Government is determined to stamp out hate-motivated crimes and to protect vulnerable communities.  The Criminal Justice (Hate Offences) Act 2024 came into effect at the start of this year. The new legislation provides for increased prison sentences for certain crimes, where they are proven to be motivated by hatred, or where hatred is demonstrated based on the identity of the victims.  I can assure the Deputy that An Garda Síochána takes hate crime very seriously. Every hate crime reported to An Garda Síochána is professionally investigated and victims supported during the criminal justice process.  In relation to the Deputy's question about an IPAS centre and residents, the Department cannot comment on a matter that is part of a current criminal investigation.  However, I can advise the Deputy that concerns about resident safety and welfare are treated as a priority. IPAS has a dedicated Resident Welfare Team who can provide supports to residents, and refer and connect them to specialist services as needed. They also have discretion to recommend a transfer of residents to alternative accommodation, where is this is considered necessary and where accommodation is available.  Without breaching confidentiality of any resident, I confirm that my officials are aware of this case and are giving it attention. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 651. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration in relation to three asylum seekers who have been targeted for physical attack, if they will be moved to a new location to ensure that they are not targeted again given the circumstances (details supplied). [69673/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_528",
          "debateSectionId": "dbsect_528",
          "showAs": "Asylum Seekers",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_528.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_651",
        "questionNumber": 651
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  Firstly, I understand the value of supporting the integration of migrants into our communities, and my Department invests in a range of measures to promote integration, including a series of community led initiatives.  I am delighted to announce today that 37 projects are set to receive over €1.5m in funding under the Ireland Against Racism Fund 2025, ensuring that both local and national organisations can carry out valuable and much-needed projects to promote cohesion and equality across our communities.  The wide range of projects receiving this funding further emphasises Ireland’s unwavering commitment to fairness, community and inclusion.  As the Deputy will be aware, last week Minister O'Callaghan and I announced a number of new policies and legislative changes to strengthen Ireland’s migration and asylum system.  We published the review of the non-EEA Family Reunification Policy, which has remained largely unchanged since 2013, and sets out how Irish citizens and most non-EEA Irish residents may apply to bring non-EEA family members to live with them in Ireland. The majority of these changes will take immediate effect, with longer term measures to be introduced as soon as operational considerations allow.  The policy will limit family reunification to immediate family members only.  An important consideration in all family reunification applications is the ability of the sponsor to demonstrate a clear capacity to provide for their family members if they are to be granted a permission to come to Ireland. New conditions will also be introduced over time to ensure sponsors have suitable private accommodation for their family before they arrive in Ireland.  The purpose of the revised Policy is not to deter people from integrating or making applications, but to ensure that people who are sponsoring an application have sufficient resources to provide for their family, without the reliance on public services or state funds.  Many of those arriving for the purposes of employment do have those resources and their applications will continue to be approved.  Separately, changes to legislation will ensure that Family Reunification for those granted International Protection status will only be granted in cases where it can be shown they have sufficient resources to support family members.  Minister O'Callaghan and I have also announced changes to the process for granting citizenship. Residency requirements for those granted international protection will rise from three to five years to bring them in line with the majority of other applicants. Clear guidance on the application of good character requirements will be developed, and a requirement will be introduced that applicants are not in receipt of certain social welfare payments in the period preceding their application.  I am of course committed to ensuring that migrants who have a legal basis to be here can integrate into society and I do not believe that the measures announced will have a detrimental effect on this. Earlier this week, 5,000 people were granted Irish citizenship in the latest of 25 joyful ceremonies held this year.  The measures I have outlined to the Deputy show how my Department support people to smoothly integrate into Irish society. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 79. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if he is concerned that his proposals on immigration will make it harder for refugees and other immigrants to integrate; and if he will make a statement on the matter. [68245/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_109",
          "debateSectionId": "dbsect_109",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_109.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_79",
        "questionNumber": 79
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 110 and 132 together.  As the Deputy will be aware, last week Minister O’Callaghan and I announced a number of new policies and legislative changes to strengthen Ireland’s migration and asylum system.  We published the review of the non-EEA Family Reunification Policy, which has remained largely unchanged since 2013, and sets out how Irish citizens and most non-EEA Irish residents may apply to bring non-EEA family members to live with them in Ireland. The majority of these changes took immediate effect, with longer term measures to be introduced as soon as operational considerations allow.  The policy limits family reunification to immediate family members only.  I can advise the Deputy that the income requirements for healthcare workers on General Employment Permits remain unchanged. They must have a gross income in excess of €30,000 in the previous year to sponsor a spouse or partner, and a gross income in excess of €44,300 to sponsor one child. The income thresholds, as before, are indexed against the Working Family Payment (WFP) based on the number of children a sponsor wishes to bring. This means that the threshold to sponsor one child will rise to €50,200 in January 2026. For such applicants, the requirement to produce financial records has reduced from two years to one year, to align with the existing one year waiting period.  An important consideration in all family reunification applications is the ability of the sponsor to demonstrate a clear capacity to provide for their family members if they are to be granted a permission to come to Ireland. New conditions will also be introduced as soon as operational considerations allow to ensure sponsors have suitable private accommodation for their family before they arrive in Ireland.  The purpose of the revised Policy is not to deter people from integrating or making applications, but to ensure that people who are sponsoring an application have sufficient resources to provide for their family, without the reliance on state funds. The policy also aims to ensure that the needs and welfare of children are considered when determining the eligibility of a sponsor.  The revised policy can be accessed on my Departments website at the following link: www.gov.ie/en/department-of-justice-home-affairs-and-migration/publications/revised-non-eea-family-reunification-policy-and-final-report-on-the-review-of-the-policy/. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 110. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if he has considered the rights of the child in devising barriers to family reunification; and if he will make a statement on the matter. [68246/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_134",
          "debateSectionId": "dbsect_134",
          "showAs": "Family Reunification",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_134.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_110",
        "questionNumber": 110
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 110 and 132 together.  As the Deputy will be aware, last week Minister O’Callaghan and I announced a number of new policies and legislative changes to strengthen Ireland’s migration and asylum system.  We published the review of the non-EEA Family Reunification Policy, which has remained largely unchanged since 2013, and sets out how Irish citizens and most non-EEA Irish residents may apply to bring non-EEA family members to live with them in Ireland. The majority of these changes took immediate effect, with longer term measures to be introduced as soon as operational considerations allow.  The policy limits family reunification to immediate family members only.  I can advise the Deputy that the income requirements for healthcare workers on General Employment Permits remain unchanged. They must have a gross income in excess of €30,000 in the previous year to sponsor a spouse or partner, and a gross income in excess of €44,300 to sponsor one child. The income thresholds, as before, are indexed against the Working Family Payment (WFP) based on the number of children a sponsor wishes to bring. This means that the threshold to sponsor one child will rise to €50,200 in January 2026. For such applicants, the requirement to produce financial records has reduced from two years to one year, to align with the existing one year waiting period.  An important consideration in all family reunification applications is the ability of the sponsor to demonstrate a clear capacity to provide for their family members if they are to be granted a permission to come to Ireland. New conditions will also be introduced as soon as operational considerations allow to ensure sponsors have suitable private accommodation for their family before they arrive in Ireland.  The purpose of the revised Policy is not to deter people from integrating or making applications, but to ensure that people who are sponsoring an application have sufficient resources to provide for their family, without the reliance on state funds. The policy also aims to ensure that the needs and welfare of children are considered when determining the eligibility of a sponsor.  The revised policy can be accessed on my Departments website at the following link: www.gov.ie/en/department-of-justice-home-affairs-and-migration/publications/revised-non-eea-family-reunification-policy-and-final-report-on-the-review-of-the-policy/. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 132. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if he has considered whether raising the income limits for family reunification will worsen labour shortages in critical areas like healthcare; and if he will make a statement on the matter. [68249/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_134",
          "debateSectionId": "dbsect_134",
          "showAs": "Family Reunification",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_134.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Ireland is currently accommodating almost 33,000 people seeking international protection in nearly 320 International Protection Accommodation Service (IPAS) centres around the country.  Extensive challenges were posed to the State in sourcing international protection accommodation during an unprecedented surge in applications from 2022 to 2024. Many of the impacts of this surge period remain in place at this time, though significant change is underway.  During this period, over 45,000 additional international protection applicants arrived in Ireland. Prior to this, a typical 3-year period would have seen close to 8,000 or 9,000 arrivals.  During the surge period, the State urgently sourced over 26,000 beds for international protection applicants, and in parallel, up to 60,000 beds for people fleeing the war in Ukraine.  From the end of 2023, accommodation shortages meant that not all applicants could be offered an accommodation place.  There is ongoing pressure on availability of accommodation in the international protection system, particularly in accommodation for single male applicants, with new arrivals each week. IPAS remains unable to make an offer to all single male applicants, as the limited number of available beds must be available as contingency for those who are most vulnerable on arrival.  People who are not offered accommodation are given a weekly allowance of €113.80 per week, an increase of €75 from the standard weekly allowance for asylum-seekers  IPAS has arrangements in place with a range of NGO partners to provide drop-in day services so people can access facilities including hot showers, meals and laundry services.  IPAS teams can currently make offers of accommodation to any applicant who is rough-sleeping, identified through outreach that is organised seven days a week.  While the demand for IPAS accommodation remains very high, the rate of increase in new applications for international protection has reduced since October 2024. This means that since March 2025, IPAS has been able to review the cases of people who are awaiting an offer of accommodation and make offers to those who have been waiting longest.  The review has reduced the number of unaccommodated people from over 3,500 in March to 613 in October 2025.  Depending on availability of spaces and numbers of new applicants, it is hoped to continue to make offers of accommodation to more people over the coming weeks and months.  Updated information on unaccommodated international protection applicants is published online at Gov.ie.  www.gov.ie/en/department-of-justice-home-affairs-and-migration/publications/statistics-on-international-protection-applicants-not-offered-accommodation/?referrer=https://www.gov.ie/en/publication/e202e-statistics-on-international-protection-applicants-not-offered-accommodation/. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 135. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration the action he will take to stop forcing homeless asylum seekers to sleep rough over the winter; and if he will make a statement on the matter. [68247/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "Asylum Seekers",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_135",
        "questionNumber": 135
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Government is determined to stamp out hate-motivated crimes and to protect vulnerable communities.  The Criminal Justice (Hate Offences) Act 2024 came into effect at the start of this year. The new legislation provides for increased prison sentences for certain crimes, where they are proven to be motivated by hatred, or where hatred is demonstrated based on the identity of the victims.  I can assure the Deputy that An Garda Síochána takes hate crime very seriously. Every hate crime reported to An Garda Síochána is professionally investigated and victims supported during the criminal justice process.  An Garda Síochána has an extensive network of nearly 600 trained Garda Diversity Officers who can engage with communities and individuals on a daily basis to provide them with re-assurance and address issues of concern for them. Gardaí also actively engage with representative and advocacy groups to support minority and diverse communities in Ireland.  There is ongoing pressure on availability of accommodation in the international protection system, particularly in accommodation for single male applicants, with new arrivals each week. IPAS remains unable to make an offer to all single male applicants, as the limited number of available beds must be available as contingency for those who are most vulnerable on arrival.  People who are not offered accommodation on arrival are given an enhanced weekly payment, an additional €75 per week compared to those who are offered accommodation.  IPAS has put arrangements in place with a range of NGO partners to provide drop-in day services so people can access facilities including hot showers, meals and laundry services.  IPAS can currently make offers of accommodation to any applicant who is rough-sleeping, identified through outreach that is organised 7 days a week.  Since March 2025, IPAS has been able to review the cases of people who are awaiting an offer of accommodation and make retrospective offers to those who have been waiting longest. The review has reduced the number of unaccommodated people from over 3,500 in March to 613 in October 2025.  Depending on the availability of accommodation, it is hoped that these offers can continue to be made to those without an offer of accommodation. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 138. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if he has concerns for the safety of homeless asylum seekers in light of racist attacks; the action he will take to protect them; and if he will make a statement on the matter. [68248/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_160",
          "debateSectionId": "dbsect_160",
          "showAs": "Asylum Seekers",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_160.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_138",
        "questionNumber": 138
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department’s main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places in the area.  Parents have the right to choose which school to apply to and where the school has places available for the relevant year, the student should be admitted. However, in schools where there are more applicants than places available, a selection process will be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some students not obtaining a place in the school of their first choice.  In accordance with the provisions of the Education (Admission to Schools) Act 2018, schools are required to clearly set out their selection criteria in their admission policies. The criteria to be applied by schools and the order of priority are a matter for the schools themselves. It is an important feature of the act that schools can only make a decision on an application for admission that is based on the school’s admission policy.  Under Section 29 of the Education Act 1998, the parent of the student, or in the case of a student who has reached the age of 18 years, the student, may appeal a decision of this school to refuse admission. An appeal may be made under Section 29 (1)(c)(i) of the Education Act 1998 where the refusal to admit was due to the school being oversubscribed.  TUSLA’s Education Support Service (TESS) is the statutory agency that can assist parents who are experiencing difficulty in securing a school place for their child.  Contact details for TESS are available at the following link https://www.tusla.ie/tess/get-in-touch/ or by email at tessinfo@tusla.ie . ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 275. Deputy Paul Murphy asked the Minister for Education and Youth if her attention has been drawn to a case (details supplied) and if she will ensure that the child in question is able to attend a school in their local area. [68623/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_263",
          "debateSectionId": "dbsect_263",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_263.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_275",
        "questionNumber": 275
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can advise the Deputy, there is no provision in national law for making international protection applications while a person is outside the State. Under Section 15(1) of the International Protection Act 2015, a person who wishes to make a claim for international protection in Ireland must be at the frontier of the State or already be present in the State.  It must be remembered that entry, to the State, of any non-EEA national is undertaken though the existing legal immigration pathways. It is possible to apply for a visa and for permission to remain in Ireland based on a variety of different reasons, including employment, education, or a family relationship. Any individual that wishes to relocate to Ireland must enter the State through an established legal pathway.  Details of these legal pathways can be found on the Immigration Service website at the following link: www.irishimmigration.ie/.  I can also inform the Deputy that no nationality is restricted from applying for an Irish visa. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 368. Deputy Paul Murphy asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to a case (details supplied); and if he will instruct his Department to evaluate the matter and provide guidance for people facing similar issues in terms of visa applications. [68609/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_338",
          "debateSectionId": "dbsect_338",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_338.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_368",
        "questionNumber": 368
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Access and Inclusion Model (AIM) is a model of supports designed to ensure that children with additional needs or a disability can access the Early Childhood Care and Education (ECCE) Programme. Access to AIM is based on the needs of the individual child, in the context of the pre-school setting, and does not require a diagnosis.  AIM Level 7 support enables providers to reduce the child-to-adult ratio in the pre-school room or to fund an extra staff member as a shared resource with other children in the ECCE setting. In recognition of best practice in this area, this support is designed to improve inclusion and ensure meaningful participation of all children in the room.  The ‘First 5’ whole-of-government strategy (2019) committed to the phased extension of AIM, a commitment reaffirmed by the findings of an independent end-of-year-three evaluation. Participants in the evaluation supported proposals that AIM be scaled up and were keen to see the extension of AIM support to hours outside the ECCE entitlement. Based on the evaluation AIM is now being extended on a phased basis as funding becomes available.  As a first step in this extension, all AIM targeted supports have, since September 2024, been available to ECCE children beyond the time that they spend in the ECCE programme, all year round. Children can now access these supports for up to an additional 3 hours per day during the ECCE term and up to 6 hours per day outside of the ECCE term (in holiday periods).  The child referenced is currently in receipt of 15 hours of AIM Standard per week while attending the ECCE programme and is also in receipt of an additional 15 hours of AIM Plus per week for hours attending outside of ECCE.  For the weeks that ECCE is not available 30 hours of non-term funding have been approved for the child.  The Pobal Early Years Specialist has previously engaged with both the service provider and the legal guardian, clarifying that the maximum allowable hours under the AIM programme have been awarded to the child.  It is intended that over time, all children with additional needs in early learning and childcare services will have access to AIM supports. The next phase of expansion focuses on a redesign of AIM for children under three, to meet the specific needs of this younger cohort. Consideration will then be given to an extension of AIM for children attending school-age childcare.  An action plan has been developed to respond to other areas for improvement including increasing awareness of AIM, streamlining the application process and strengthening support for autistic children. A key step taken in this regard is the 2024 publication of Introductory Guidelines to Support the Inclusion of Autistic Children in Early Learning and Care, School-Age Childcare and Childminding Settings, with the support of ASIAM.  While the Department oversees AIM, early learning and childcare providers are private entities and responsible for their own admissions policies, which are outside the Department’s remit. Parents and carers experiencing challenges in accessing early learning and childcare supports are encouraged to contact their local City or County Childcare Committee, who can provide advice and guidance on available options in their area. Contact details are available at: www.gov.ie/childcarecommittee. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 415. Deputy Paul Murphy asked the Minister for Children, Disability and Equality if she is aware of a case (details supplied); and if she will instruct her Department to investigate the matter and ensure the programme has sufficient resources to ensure children with additional needs are able to fully benefit from creche services. [68858/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_371",
          "debateSectionId": "dbsect_371",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_371.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_415",
        "questionNumber": 415
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter we have asked the HSE to respond directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 507. Deputy Paul Murphy asked the Minister for Health if she will instruct her Department to provide more resources and staff to CDNT8 (details supplied). [68859/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_456",
          "debateSectionId": "dbsect_456",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_456.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_507",
        "questionNumber": 507
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 13 to 23, inclusive, together.  Regulation, and the extent of any regulatory or administrative burden, has recently become a greater focus at European Union level and nationally as a means to further enhance competitiveness. At a European level, both simplification and implementation are important Commission priorities. The Commission is striving to simplify and lighten the administrative burden of European Union regulations to ensure they are proportionate, stable, coherent and technologically neutral.  Likewise, our national regulatory framework is a central focus for the Government as we strive to support competitiveness at a time of international economic uncertainty. In line with the programme for Government, we published an action plan on competitiveness and productivity on 10 September this year. The action plan includes actions across government to ensure the development of a more effective regulatory system which will support economic growth.  These actions reflect priority areas where targeted public policy intervention can have the greatest impact. These include a red-tape challenge to reduce regulation for SMEs; the application of the SME test by Government Departments to all measures, in particular policy initiatives where it is proposed to increase costs on small businesses; expediting the Environmental (Miscellaneous Provisions) Bill; commencing reforms, as we have done, under the Planning and Development Act 2024 to enhance delivery of infrastructure; and implementing the outstanding recommendations from the review of the administration of civil justice review group report.  Increased regulatory burden has also been identified as a barrier to infrastructure development and delivery. The Minister, Deputy Chambers, supported by the work of the accelerating infrastructure task force, this morning, with Government colleagues including me, the Tánaiste and the Minister of State, Deputy Harkin, published a plan which will include extensive regulatory reforms aimed at accelerating the delivery of critical infrastructure.  Today's plan provides the blueprint to reduce complexity and blockages in the system and deliver infrastructure with urgency. The changes we are initiating today are vital if we are to maintain our competitive position in an ever uncertain world. They are also necessary to support our citizens with top class public services, job security, access to housing and all other facilities necessary to enjoy the stability and good quality of life we are all entitled to expect.  The actions are ambitious but achievable, and delivering them will require commitment and co-operation across a broad and diverse range of stakeholders, from political, legal and public sectors, industry and society as a whole. We have established a cost-of-business advisory forum where business owners and representative bodies can speak directly to decision-makers about the real-world impact of regulations, fees and operational challenges. The work of that forum is under way. The Minister, Deputy McEntee, is working on the simplification omnibus packages put forward by the European Commission in a range of policy areas, most recently the Commission's digital simplification omnibus package, which was published last month.  My Department will play a co-ordinating role across these different regulatory reform initiatives, as outlined in the action plan on competitiveness and productivity, including the establishment of a central economic regulators' forum, and we will work with the Minister for Enterprise, Tourism and Employment and other Government colleagues on that agenda. \n Deputy Tony McCormack  I thank the Taoiseach for his response. I acknowledge the significant work he, the Minister, Deputy Chambers, and their two Departments are doing on infrastructure reform, particularly the steps being taken to modernise planning, reduce delays and ensure major projects move forward. Infrastructure reform is vital, but businesses and especially SMEs are also calling for a more streamlined regulatory environment. These firms consistently cite overlapping rules, slow approvals and heavy administrative demands as major obstacles to growth. Building on the work already happening on infrastructure, will the Taoiseach update the House on what specific measures his Department is pursuing to simplify compliance for SMEs, reduce unnecessary paperwork and make it easier for businesses to operate and expand? How will these reforms help to lower costs for employers and the taxpayer by making the system more efficient overall? \n Deputy Albert Dolan  It is vital that when we speak about regulatory reform, we talk about the administrative operations of existing systems in the function of the State. I will specifically reflect on the Sustainable Energy Authority of Ireland, SEAI, and the roll-out of grants. We are about to have a debate in this Chamber on energy costs. One thing that is vital is that the best way the Government can help to reduce energy costs in homes is to retrofit them for the future so that they simply do not need as much energy. That is the number one way to reduce the cost and it facilitates homes to be more efficient and takes pressure off the grid. The Government needs to do something to accelerate the rate at which homes can be retrofitted by the SEAI. For many constituents in my constituency, it is taking too long to get through the process of approval of the grant to construction. \n Deputy Ruairí Ó Murchú  We all accept there are huge issues with bureaucracy and red tape in planning. We should have seen simplification and streamlining. Conversations about this are occurring across Europe, but we know about the home-grown issues. It is an issue I have brought up previously, even within the planning systems involving State authorities. For example, Louth County Council is involved in the Ardee Education Together National School build and a particular issue has arisen. We do not have enough agility in the system. Multiple requests have gone in stating that there are not enough parking spaces. There are 21 spaces, including three disability spaces. There are only two set-down spaces for minibuses and there is a need for five as there are five autism spectrum disorder, ASD, classes and there is not even room for a full-size 52-seater bus to turn. There are 21 spaces for staff and there is a need for something closer to 40. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruairí Ó Murchú  It is possible to get this work done at this time, but if the works continue as planned, the problem will still need to be fixed but it could take more than €100,000, so we need something to be done. \n Deputy Darren O'Rourke  I raise the regulation of social media companies in the online space, particularly as it relates to children. The criticism that has been levelled at Coimisiún na Meán's online safety code is that an earlier draft had a recommendation that social media companies turn off recommender systems and it has been removed. Recommender systems profile people who are using apps and then drive them down often hateful and dangerous rabbit holes. It is not healthy for them or society. Will this be looked at? \n Deputy Ruth Coppinger  I raise regulatory reform of immigration and particularly family reunification. It is now being made much harder for many essential workers to be unified with their families, in particular migrant healthcare assistants who were brought over here on a visa programme and are working in private nursing homes. Last week on RTÉ radio, the Minister for justice was asked by the presenter whether these people are not entitled to a normal family life. They are caring for our older people and we have to show we care for them. The Minister's reply was that no one is forcing them to come here. That is absolutely heartless, shows zero empathy and is also completely counterproductive because many of them are nurses. They could go to other countries, but they have come to Ireland and are working below their grades or qualifications, giving huge added value to the nursing homes. I urge the Taoiseach to have a heart. We had a briefing here a few years ago, which Deputy Michael Healy-Rae attended because he knew the value of those healthcare assistants in nursing homes. These are essential workers and they will go elsewhere. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruth Coppinger  Please entitle them to have a normal family life. These mothers should not be separated from their kids. \n Deputy Paul Murphy  The programme for Government says the Government will move responsibility for the Multi-Unit Developments, MUD, Acts to the Department of housing from the Department of justice and establish a unit in the Housing Agency to regulate owners' management companies, OMCs, to ensure effective governance. That is important work that needs to happen. The problem is that it is not happening currently, but it has been agreed. Effectively what is holding it up is that, as a result of the Mulcreevy judgment, the primary legislation needs to be changed. At the moment, the MUD Act refers to the Minister for justice and not the Minister for housing. A simple amendment is needed to change the reference to the Minister for housing. Until that happens, all this work of regulatory oversight of OMCs and so on is simply not taking place. There was a meeting of the housing committee to discuss these issues. It invited various officials from the Department of housing and was told they could not come yet because their line Minister is not yet responsible for this. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Paul Murphy  The Housing Agency has not been allocated funding for doing any regulatory work as a result. This needs urgent action. \n Deputy Liam Quaide  There was a health committee session last week on the regulation of counselling and psychotherapy. In standards it has published, CORU has adopted a position that is entirely at odds with the main representative groups of those disciplines, which will reduce supervision requirements and remove mandatory personal therapy for trainees. These changes, if implemented, will degrade professional standards and undermine patient safety. CORU is showing a remarkable level of intransigence on these fundamentals of safe practice. Practitioners and representative bodies have warned that the proposals could also jeopardise recognition and mobility across the EU for counsellors and psychotherapists. We must protect high-quality training, preserve public confidence and ensure regulation strengthens, not weakens, these services.  I am not expressing some fringe opinion. The health committee was unanimous in supporting the counselling and psychotherapy representative groups and the session included some strong and insightful contributions from the Taoiseach's party colleagues, including Senator Costello. Will the Government immediately pause the CORU process, bring representative bodies and practitioners into full consultation and commit to reforms that prioritise client safety and high professional standards? \n Deputy Rose Conway-Walsh  I will talk about the regulation of quarries. The Taoiseach knows the price we have paid in this country and the price that families affected by the defective concrete blocks scandal have paid due to a lack of regulation.  Many of the homeowners I have spoken to in Mayo are not satisfied with the current regulations of quarries and in particular, that geologists are not examining the aggregate within the quarries that are being used to build homes now. I ask the Taoiseach to have a look at this area to see what can be done in that regard. It can be easily fixed by engaging and employing geologists to do the job and to make sure that people have confidence in the materials that are coming out of quarries. \n Deputy Richard Boyd Barrett  The Taxi Regulation Act 2013 clearly gives the Minister the power to impose regulations around the activities of dispatch companies. Today, for the third time in two weeks, taxi drivers in Dublin are protesting. There is a widespread protest against this across the country by taxi drivers over the behaviour of Uber, a multimillion euro company, that is trying to undermine the livelihood of nearly 20,000 taxi drivers by introducing a fixed fare system. This will undermine the regulated fare structure and therefore the livelihoods of taxi drivers and ultimately the industry itself. In the long run, as is clear from Uber's behaviour elsewhere in the world, it will not benefit the customer. Once the company gets hold of a market, fares and charges go up and the livelihoods of taxi drivers get smashed. Will the Taoiseach ask the Minister for Transport to impose such regulations to prevent Uber destroying the industry and livelihoods of taxi drivers around this fixed fare system and enforce the taxi regulation and meter stuff? \n The Taoiseach  Deputy McCormack raised infrastructure reform, particularly for small to medium-sized businesses. Some of the measures we have taken in respect of deferring the alignment of the minimum wage with the national living wage will help to avoid the escalation of costs because the SME sector has borne the brunt of a lot of additional costs over the past five years. There is no doubt the reduction in VAT on hospitality will help a lot of SMEs in the hospitality sector and hairdressing as well. The number of sick days leave is going to be quickly expanded. We have expanded it to three days. The cumulative cost of everything has been fairly excessive. The Small Business Forum is there to try to balance imposition on small business as well as the cost.  The other issue is the sequential approach to planning and regulations as opposed to a concurrent approach whereby instead of waiting for the planning to be done, agencies do the procurement. Instead of waiting for environmental assessments, doing them all in parallel would speed up a lot of activity. In many instances, we are constantly looking at the avoidance of increased cost for SMEs and trying to slow down the increased costs that have come their way. It is interesting the rate of youth employment has crept up in the past six to nine months. I believe that is related to costs on SMEs.  Deputy Dolan is correct that retrofitting is the most effective way to reduce costs. Between 2019 and September 2025, the Government provided over €1.5 billion in support to homeowners for over 228,000 upgrades, including 30,000 fully funded retrofits under the warmer homes scheme. It is estimated that if a deep retrofit is done, it can save a household up to €1,100 per year in energy costs. I get the Deputy's point that the administration of it needs to be faster. There is also resource demand in respect of it as well with some people not being able to afford to do retrofits because of the cost.  On Deputy Ó Murchú's issue, I do not have the specifics on Ardee Educate Together National School. I do not know what the interaction with the county council is, but in any event----- \n Deputy Ruairí Ó Murchú  The refusal to change----- \n The Taoiseach  They should sort it out. A school is an important facility. The county council should be facilitative in the building of a school. \n Deputy Ruairí Ó Murchú  It is not just the council. \n The Taoiseach  Deputy O'Rourke raised regulation online. We have now established the regulatory framework governing online. There is ongoing review in respect of it. Children must be protected. That has to be the optimal.  Deputy Coppinger raised healthcare assistants and family reunification. We have significant reunification in Ireland under our migration system, in particular when people leave direct provision who have residency. The Minister will bring forward legislation in respect of this and these are issues we can discuss in greater detail at that stage.  On Deputy Murphy's point, I will talk to the Ministers responsible. There has to be proper regulation of management companies. There are fundamental rights involved in terms of those complexes. I will pursue that with the Minister and see where we are in terms of amendment to primary legislation.  Deputy Quaide raised the issue of counselling and psychotherapy. On qualification frameworks and regulators generally, we want more therapists, but they have to be highly qualified. Public health is number one and the protection of the consumer. In some instances, they can be quite protectionist as well. The judgment called for regulators and I would like CORU to get the judgment right in terms of not having the bar so high that there are only highly qualified, and others are not. That is not just in terms of therapy and counselling; that is in terms of teaching and a range of other issues.  Deputy Conway-Walsh raised the regulation of quarries. I will talk to the Minister involved in that. We can overregulate too but I take the Deputy's point about the quality of aggregate and quality of the product. There are existing systems to deal with that. The SEAI is there. There are various regulatory bodies to deal with the quality of materials, but I will talk to the Minister in respect of that. New bodies were set up after the defective blocks scheme.  Deputy Boyd Barrett raised taxi regulation. I will talk to the Minister about the issues that the Deputy raised. There is a balance between consumers, those availing of taxis and the regulation of same. We had regulation a long time ago; it did not work. There was always an imbalance between supply and demand. I will look at this and will talk to the Minister for Transport in respect of it. He is fully aware of it. \n An Ceann Comhairle  We have a delegation of students visiting from Ukraine as our part of our EPAS programme hosted by Maynooth Post Primary School. They are most welcome. We had their president here yesterday, which we enjoyed immensely. ",
        "questionType": "oral",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 21. Deputy Paul Murphy asked the Taoiseach about his Department’s plans to co-ordinate a range of actions aimed at regulatory reform. [65781/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Regulatory Reform",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_21",
        "questionNumber": 21
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Act, 1981 & 2003. My Department supports fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding support for equipment and priority infrastructural projects. Fire service issues are managed in my Department by the National Directorate for Fire & Emergency Management (NDFEM).  The National Mobilisation and Communications System (NMACS) is operated by Limerick City & County Council on a shared service basis. My Department provides capital funding to Limerick City & County Council supporting the NMACS programme.  Fire Service staff in all regions are fully engaged, on an ongoing basis, in the project, throughout its development, procurement and implementation in the Munster and Western Regions as well as the planned migration in the Eastern region. Staff representing each of the three regional communication centres have participated in all phases of testing and development, working closely with the NMACS team.  Engagement with staff side associations and internal communications are a matter for Dublin City Council as the employer of DFB personnel. There is engagement currently taking place through the WRC between DFB management and the staff side. I would encourage both sides to actively engage with the WRC with a view to coming to a positive conclusion. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 154. Deputy Paul Murphy asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No 263 of 6 November 2025, his views on the concerns raised by Dublin Fire Brigade regarding the creation of two different CAD systems, one for fire and rescue calls, the other for ambulance calls, which poses a serious threat to the resilience currently present and threatens public safety and the health and safety of firefighter/paramedics. [68301/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Murphy.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Murphy.D.2014-10-10",
          "showAs": "Paul Murphy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_147",
          "debateSectionId": "dbsect_147",
          "showAs": "Fire Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_154",
        "questionNumber": 154
      },
      "contextDate": "2025-12-03"
    }
  ]
}