{
  "head": {
    "counts": {
      "questionCount": 49,
      "resultCount": 49
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 516. Deputy Gillian Toole asked the Minister for Housing, Local Government and Heritage the reason the real estate-property development industry is not required to demonstrate the price of new properties, additional phases nor cancellation-resale properties in accordance with the Sale of Goods Act 1980; and if he will make a statement on the matter.  [73591/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_488",
          "debateSectionId": "dbsect_488",
          "showAs": "House Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_488.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_516",
        "questionNumber": 516
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Under the Policing, Security, and Community Safety Act 2024 the Garda Commissioner is responsible for the management and administration of Garda business, including the management of the PULSE system.  I am advised by the Garda authorities that when information on a person's nationality is known, it is generally recorded as part of their PULSE record. I am further informed that An Garda Síochána is aligned with the practice of the Central Statistical Office of not publishing or compiling crime statistics based on nationality, ethnicity or citizenship.  As the Deputy will be aware the Central Statistics Office (CSO) is Ireland's national statistical agency. The CSO is not a body under my aegis as Minister for Justice, Home Affairs and Migration, and I have no role in the CSO's operations, functions, oversight or governance.  The CSO, as the national statistical agency, is responsible for the compilation and publication of all crime statistics. The CSO produces these statistics using data recorded on An Garda Síochána’s PULSE system and makes regular releases in relation to various crime statistics.  Further information is available on their website at the following link:  www.cso.ie/en/releasesandpublications/ep/p-rqcs/reviewofthequalityofrecordedcrimestatistics2023/userneedsforrecordedcrimestatistics/  I should add that my Department is currently finalising proposals for the introduction of a criminal justice unique identifier, based on the PPSN. This will improve administrative efficiency in the criminal justice system and will provide better data for statistical analysis and policy making. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 565. Deputy Gillian Toole asked the Minister for Justice, Home Affairs and Migration the reason ethnicity and nationality are not compulsorily recorded on the PULSE system, as in other EU member states; and if he will make a statement on the matter. [73590/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_538",
          "debateSectionId": "dbsect_538",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_538.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_565",
        "questionNumber": 565
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  On 16 December, I introduced regulations which confer additional powers on the Regulator. Under these regulations, the Regulator will have the capacity to compel price and market information from operators in cases where businesses have not complied with requests for information voluntarily.  The regulations will come into effect on 31 December 2026, allowing sufficient lead-in time for the Agri-Food Regulator to develop the necessary systems, processes and procedures to implement the new powers effectively. In the interim, the Regulator will continue to carry out its market analysis and reporting functions using publicly available information and data provided voluntarily by businesses. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 350. Deputy Gillian Toole asked the Minister for Agriculture, Food and the Marine when the agrifood regulator will have authority to investigate competition and pricing in the sale of food products, meat and poultry; and if he will make a statement on the matter. [73254/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "Departmental Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_350",
        "questionNumber": 350
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  In response to the COVID-19 pandemic, Ireland, through its participation in an EU led procurement process, gained access to a broad range of vaccines that it might not otherwise have had access to, and at a cost negotiated collectively by the EU.  As part of this procurement exercise, Ireland opted into Purchase Agreements with several pharmaceutical companies. The contents of the Purchase Agreements, including with regard to liability and indemnity, were negotiated with vaccine suppliers by the European Commission through its negotiation team, acting on behalf of Member States. Member States may have decided to opt in / opt out, but did not have scope to recast the provisions of any such Purchase Agreements. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 440. Deputy Gillian Toole asked the Minister for Health the details of the indemnification of manufacturers of messenger RNA gene therapy supplied during the SARS Cov 2 pandemic; and if she will make a statement on the matter. [73256/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_391",
          "debateSectionId": "dbsect_391",
          "showAs": "Covid-19 Pandemic",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_391.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_440",
        "questionNumber": 440
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Cineáltas: Action Plan on Bullying was published on 1st December 2022. Cineáltas is my department’s whole-education approach to preventing and addressing bullying behaviour in schools.  Cineáltas is dedicated to the prevention and addressing of bullying behaviour including cyber bullying, racist bullying, gender identity bullying and sexual harassment, among other areas, in schools. It is centred on a child rights-based approach and provides a collective vision and clear roadmap for how the whole education community and society can work together to prevent and address bullying behaviour in our schools.  Cineáltas incorporates each of the nine components of UNESCO’s Whole Education Approach to prevent and address bullying behaviour. It is rooted in four key principles: prevention, support, oversight and community. Implementation of Cineáltas is well advanced. The first implementation report, which relates to 2023, was published on 02 July 2025. The second implementation report, which relates to 2024, is due to be published shortly.  One of the more significant actions under Cineáltas was to update the 2013 Anti-Bullying Procedures for Primary and Post-Primary Schools. This action has been completed with the publication, on 19 June 2024, of Bí Cineálta: Procedures to Prevent and Address Bullying Behaviour for Primary and Post-Primary Schools. These updated procedures were developed in collaboration with the education partners, including the National Parents Council, and are heavily informed by the views of children and young people, parents, school staff, Board of Management members and the wider education community.  The Bí Cineálta procedures are centred on a child rights-based approach and support a partnership approach where all members of the school community work together to prevent and address bullying behaviour. The procedures have been updated to take account of gender identity bullying, cyberbullying, racist bullying, sexist bullying, and sexual harassment. They support schools to develop clear strategies to prevent and address these bullying behaviours. The Bí Cineálta procedures are being implemented in all schools since the beginning of the 2025/2026 school year.  Implementation of the procedures was supported by a suite of professional learning resources and information sessions for school staff, Board of Management members and parents.  One of the key objectives of the Children First Act 2015 is to ensure that organisations that provide services to children (referred to as “providers of a relevant service” in the Act) keep children safe from harm while they are availing of those organisations’ services. In that regard, the Act places certain statutory obligations on every such provider. These include obligations to ensure, as far as practicable, that children are safe from harm while availing of its services, to undertake an assessment of any potential for harm to a child while availing of the organisation’s services (referred to as a “risk”) and to produce a Child Safeguarding Statement in accordance with the Act. The Act requires that the Child Safeguarding Statement has due regard to Children First National Guidance 2017, any other child protection guidelines issued by the Minister for Children, Disability and Equality or any guidelines concerning child safeguarding statements that are issued by Tusla under section 11 (4) of the Children First Act 2015.  All recognised schools fall within the definition of a “provider” of a relevant service under the Children First Act 2015 and therefore have specific statutory obligations under the Act. The protection and welfare of children is of paramount importance for every school, and the obligations and responsibilities which arise from child protection procedures are taken very seriously by our schools.  A school’s Child Safeguarding Statement shall be reviewed each calendar year and the department has provided a qualitative review document that shall be used when schools are conducting the annual review of the Child Safeguarding Statement. As part of its annual review of the Child Safeguarding Statement, the board of management must seek feedback from parents and school personnel in relation to the school’s compliance with the child safeguarding requirements of the procedures and retain a record of the consultation. As part of the annual review, parents in the school should have an opportunity to have a voice and participate in the process.  My department takes child protection matters very seriously and considers the protection and welfare of children to be a fundamental responsibility of all involved in the care and education of children.  My department has robust oversight measures in place which provide direction and guidance to school authorities to deal with child protection concerns. These are set out in the updated Child Protection Procedures for Schools 2025 which were published in May. The obligations and responsibilities have been taken very seriously by our schools since their implementation and there is a very strong culture of child protection across the school sector.  During the period in question, 3,103 school evaluations included checks on schools’ compliance with anti-bullying requirements. From January 2024 to August 2025, these checks related to the 2013 Anti-Bullying Procedures for Primary and Post-Primary Schools . Over this period, compliance levels were high, with 97.2% (n = 2,435) found to be compliant and 2.8% (n = 70) identified as non-compliant.  From the beginning of the current school year, in September 2025, the focus of these checks shifted to the implementation of the Bí Cineálta policy, which replaced the 2013 Procedures. Since September 2025, compliance has remained strong, with 96.3% (n = 576) of evaluations found to be compliant and 3.6% (n = 22) non-compliant.  These results indicate consistently high levels of compliance with safeguarding and anti-bullying obligations, both under the 2013 Anti-Bullying Procedures and, more recently, under the Bí Cineálta policy.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 418. Deputy Gillian Toole asked the Minister for Education and Youth the analysis, review and risk assessments carried out on the í Cineálta primary and secondary-schools programme, to ensure compliance with the principles and protections in the Children First Act 2015 and the Children First: National Guidance for the Protection and Welfare of Children. [71340/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_313",
          "debateSectionId": "dbsect_313",
          "showAs": "Bullying in Educational Institutions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_418",
        "questionNumber": 418
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  My department has established an interdepartmental working group, which includes the Department of Health, the Department of Education and Youth, the Food Safety Authority of Ireland and the Department of Children, Equality and Disability to oversee and make recommendations on the operation of the scheme. This is a standing group which will make proposals on matters within its remits on an ongoing basis. The Interdepartmental working group have also met with suppliers, Educational Partners, School Principal representative bodies to outline the refinements to the procurement process, the exclusion of the foods high in salt and sugar, the recruitment of a dietitian to assist in the School Meals Programme and suppliers responsibilities.  While all primary schools are eligible for either the Hot School Meals or Cold lunch, the School Meals Programme is not mandatory for schools. The decision to apply lies with the school principal and board of management.  The Department provides the funding for the meals directly to the school. Funding under this programme is solely for food and cannot be redirected to other purposes.  If a school has any questions in relation to the School Meals Programme, they can contact officials of my Department at [ school.meals@welfare.ie ] . They will advise them of the meal options available to them and assist with any queries they may have.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 623. Deputy Gillian Toole asked the Minister for Social Protection the inter-Departmental consultation and communication taking place to ensure review of the school meals scheme, to include an opt-out if the school community requests same, with re-distribution of funding for other supports, deemed necessary by the school principal in consultation with the school community. [71341/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_485",
          "debateSectionId": "dbsect_485",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_485.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_623",
        "questionNumber": 623
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I would like to begin by clarifying that the correspondence of 13 November 2025 advised that your correspondence was being addressed \" in the context of the broader subject of aircraft noise policy \".  The Aircraft Noise (Dublin Airport) Regulation Act 2019 gave effect to EU Regulation 598/2014 (the EU Aircraft Noise Regulation) in Ireland, providing a wholly independent aircraft noise regulation process in accordance with the EU Aircraft Noise Regulation.  As the EU Aircraft Noise Regulation applies to airports with annual aircraft movements exceeding 50,000, based on traffic levels in Ireland, it only applies to Dublin Airport.  The competent authority for the purposes of aircraft noise regulation in Ireland is the Aircraft Noise Competent Authority (ANCA), a separate and independent Directorate within Fingal County Council which is headed at a senior level by a Director of Service, who is supported by a core executive team and specialist service providers.  On an annual basis, ANCA carries out an assessment of the effectiveness of the noise management measures at the airport and publishes a report on the findings on its website. This is in addition to publishing annual reports by the airport authority on the compliance by airport users with the noise management measures.  I understand that ANCA is currently carrying out an assessment of the noise situation at Dublin Airport and the potential noise impact of planning applications at Dublin Airport that seek permission for infrastructure and increases to the permitted passenger capacity of the airport.  To conclude, aircraft noise at Dublin Airport is subject to substantial regulation and oversight, as well as best practice mitigation measures. I do however want to reiterate that I fully recognise the legitimate concerns of communities affected by aircraft noise and that it is important to the Government to balance the economic benefits of aviation with the legitimate rights of local residents. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 101. Deputy Gillian Toole asked the Minister for Transport the Government’s aircraft noise policy and where can it be viewed, as referenced in correspondence to this Deputy on 13 November 2025, in queries relating to Dublin Airport Authority. [68407/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "showAs": "Dublin Airport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 266. Deputy Gillian Toole asked the Minister for Health the examination and evaluation of the recently published Central Statistics Office figures for medical mortality that are taking place or scheduled to take place. [68408/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_227",
          "debateSectionId": "dbsect_227",
          "showAs": "Mortality Rates",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_227.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_266",
        "questionNumber": 266
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The VAT rating of goods and services is subject to the requirements of EU VAT law, with which Irish VAT law is required to comply. In general, the EU VAT Directive provides that all goods and services are liable to VAT at the standard rate, unless they fall within categories of goods and services specified in Annex III of the VAT Directive, in respect of which Member States may apply a lower rate of VAT.  The supply of food supplements of a kind used for human oral consumption is subject to the reduced rate of VAT, currently 13.5%. The supply of medicine of a kind used for human oral consumption is subject to the zero rate of VAT.  Human oral medicines and food supplement products are separate categories of products. Food supplement products are not medicines and do not fall within the provision for human oral medicine. Only when a human oral product is licensed or authorised by the Health Products Regulatory Authority (HPRA) as a medicine will it be considered a medicine for VAT purposes. These products are listed on the HPRA website and carry a product number, such as a Product Authorisation (PA) number on the label. Certain folic acid and other vitamin products for oral human consumption are licensed / authorised by the HPRA and are therefore zero rated as human oral medicines.  Revenue has published detailed guidance on the VAT treatment of Human oral medicines and food supplement products on Revenue.ie.  Food supplements: www.revenue.ie/en/tax-professionals/tdm/value-added-tax/part03-taxable-transactions-goods-ica-services/Goods/goods-food-supplements.pdf.  Human medicines: www.revenue.ie/en/tax-professionals/tdm/value-added-tax/part03-taxable-transactions-goods-ica-services/Goods/vat-treatment-of-human-medicines.pdf. ",
        "to": {
          "showAs": "Finance",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_231.xml"
            }
          },
          "debateSectionId": "dbsect_231",
          "showAs": "Tax Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_231"
        },
        "questionNumber": 271,
        "date": "2025-11-27",
        "showAs": " 271. Deputy Gillian Toole asked the Tánaiste and Minister for Finance when a review of the rate of value added tax on oral vitamin and mineral supplements, currently 13.5% rate, will be carried out; and the reason there is a disparity in VAT classification between oral pharmaceuticals, and oral supplements for health promotion; and if he will make a statement on the matter. [67253/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_271"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The Education Therapy Support Service (ETSS) was established in June 2024 within the NCSE, through the permanent sanctioning of 39 therapist positions. Subsequently in June 2025, the 2025 Education Plan, confirmed government’s commitment to and approval of the establishment of the Education Therapy Service (ETS).  The development and delivery of the ETS will be informed by detailed engagement, which is on-going, with our colleagues in the HSE and stakeholders and will build on the National Council for Special Educations’ (NCSE) work previously completed through the Educational Therapy Support Service (ETSS) and the School Inclusion Model. The ETS is an additional support for children and young people in their school environment. It is not a replacement for existing children’s services from which provision will continue.  As referenced in Parliamentary Question No. 280 of 10 November 2025, it is anticipated that the ETS will commence in 45 special schools at a later stage in the 2025/26 school year and will be supported by a panel of 90 therapists comprising of senior and staff grade. The NCSE is currently finalising a large-scale recruitment campaign which is anticipated to go live in the coming weeks. Further roll out of the service will occur on a phased basis over the 2026/2027 schools year.  In addition to the ETS, the ETSS, which will be subsumed into the ETS, provides two strands of support, Regional Therapy and Sustained In-School Therapy to both mainstream and special schools.  Sustained in-school support (SIT) is provided to schools for a defined period of 18-24 months in line with the School Inclusion Model. 22 schools in the Eastern region are currently availing of this service and 28 schools in the Western region will receive support under SIT from September 25.  Regional therapy support provides Teacher Professional Learning (TPL) with follow on/implementation support by NCSE therapists. The focus of this support is to build the capacity of schools and to embed the learning from TPL into their teaching practice, through In-school coaching and co-facilitation of interventions, strategies and resources, with a focus on whole school (Tier 1) and targeted/school support levels (Tier 2) of a multitiered system of support. Regional Therapy seminars are available nationally for the 2025/2026 school year.  My Department and the National Council for Special Education (NCSE) are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_288.xml"
            }
          },
          "debateSectionId": "dbsect_288",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_288"
        },
        "questionNumber": 336,
        "date": "2025-11-27",
        "showAs": " 336. Deputy Gillian Toole asked the Minister for Education and Youth further to Parliamentary Question No. 280 of 10 November 2025, the reason for the delay in preparing a large scale recruitment campaign for the education therapy support service by the National Council for Special Education; the contingency plan if recruitment is unsuccessful; the interim supports that will be put in place for children later in the 2025-2026 school year; and if she will make a statement on the matter. [67251/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_336"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  A record capital investment of €67.9 million is being provided to the Irish Prison Service in 2026 and this forms part of a total capital investment of €527 million for the period 2026 to 2030. €495 million is being provided for capital works to build on a plan to deliver 1,595 prison spaces by 2031.  This will be the largest ever building programme in the prison estate and will include a large extension to the existing Cork Prison on the site of the old decommissioned Cork Prison. The programme will include a new block in Wheatfield, an additional block extension at Midlands prison, as well as additional spaces at Castlerea, Mountjoy, Cloverhill, Portlaoise, Limerick and Dóchas. It will also fund planning and commencement of the construction of a new prison at the Thornton site in North County Dublin.  A master plan for the Thornton site will be developed in 2026, determining its future use as a combined site for use by the IPS, International Protection Accommodation Services and An Garda Síochána.  As the project progresses, I can assure the Deputy there will be stakeholder engagement as part of a considered planning process. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_377.xml"
            }
          },
          "debateSectionId": "dbsect_377",
          "showAs": "Prison Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_377"
        },
        "questionNumber": 447,
        "date": "2025-11-27",
        "showAs": " 447. Deputy Gillian Toole asked the Minister for Justice, Home Affairs and Migration the revised plans for a location (details supplied); the consultation that has taken place or will take place with the local communities of the Ward, Ashbourne and Ratoath; and if he will make a statement on the matter. [67250/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_447"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  In Ireland, the Health Information and Quality Authority (HIQA) carries out Health Technology Assessments (HTAs), as requested by the Minister for Health, which are used to help decide what health technologies (such as drugs, medical tests, medical devices, surgeries, healthcare re-organisation) should be used and funded in our public healthcare system.  A HTA looks at the clinical effectiveness, safety and cost of different health technologies. An economic evaluation is often undertaken as part of a HTA and it compares the costs and benefits of different choices to see which one is the best use of resources.  The information considered can also include organisational and social aspects, and ethical and legal issues. The information is collected and presented in a systematic, unbiased and transparent manner. These HTAs are a fundamental part of the decision making process when deciding to add a vaccine to the national vaccination programme.  HIQA has developed national guidelines explaining how economic evaluations in HTAs should be undertaken in Ireland. I understand from these guidelines that economic evaluations fall into two major categories: the first is a cost-effectiveness analysis (including cost-utility analysis) and the second is a cost-benefit analysis. The guidelines note that in practice, cost-benefit analysis is rarely used in healthcare because of the difficulties of expressing health benefits directly in monetary terms. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_511.xml"
            }
          },
          "debateSectionId": "dbsect_511",
          "showAs": "Vaccination Programme",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_511"
        },
        "questionNumber": 587,
        "date": "2025-11-27",
        "showAs": " 587. Deputy Gillian Toole asked the Minister for Health the retrospective cost-benefit analyses of State vaccination programmes carried out in order to determine each annual campaign; and if she will make a statement on the matter. [67252/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_587"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  This is a matter for Department of Finance. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_512.xml"
            }
          },
          "debateSectionId": "dbsect_512",
          "showAs": "Medicinal Products",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_512"
        },
        "questionNumber": 588,
        "date": "2025-11-27",
        "showAs": " 588. Deputy Gillian Toole asked the Minister for Health when a review of the rate of value added tax on oral vitamin and mineral supplements, currently 13.5% rate, will be carried out; and the reason there is a disparity in VAT classification between oral pharmaceuticals, and oral supplements for health promotion; and if she will make a statement on the matter. [67255/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_588"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_185",
        "debateSection": {
          "debateSectionId": "dbsect_198",
          "showAs": "Protected Disclosures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_198",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_198.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Defence"
        },
        "questionNumber": 185,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 185. Deputy Gillian Toole asked the Tánaiste and Minister for Defence the status of the examination of a protected disclosure (details supplied) circulated to senior Cabinet members in July 2025 and asked as a Leader’s Questions on 22 October 2025; and if correspondences will be issued; and if he will make a statement on the matter. [62714/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Transport  I thank the Deputy for the question.  Following engagement with the daa on the matter of flightpaths at Dublin Airport , I have been advised that given the ongoing regulatory and planning processes in track regarding Dublin Airport, including matters under Judicial Review, it is not daa’s intention to embark on a flightpath review at this time.  Under EU legislation, the operator of an airport, daa in the case of Dublin Airport, is responsible for the design and maintenance of Instrument Flight Procedures (IFPs) which set flight paths into and out of an airport. While the Irish Aviation Authority, as the civil aviation safety regulator in Ireland, has responsibility for ensuring that IFPs adhere to safety standards set out in national, EU and international regulations.  Flight paths are also monitored for compliance with noise requirements by the Aircraft Noise Competent Authority, in line with EU Regulation 598/2014.  Separately, monitoring compliance with planning permission conditions is matter for the relevant planning authority that granted those permissions, and enforcement of planning conditions is a matter for those authorities.  Each of the aforementioned competent authorities has a range of powers of enforcement available where issues of non-compliance are identified. They are independent in the performance of their functions, and it is not open to me as the Minister, to intervene on matters which are the responsibility of these independent authorities. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_211",
        "debateSection": {
          "debateSectionId": "dbsect_224",
          "showAs": "Airport Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_224",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_224.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 211,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 211. Deputy Gillian Toole asked the Minister for Transport the responses from Dublin Airport Authority, AIRNAV and Irish Aviation Authority to the solutions for safer and lawful flight departure paths from the north runway at Dublin Airport, as proposed by the North Runway Technical Group in June 2025 (details supplied); and if he will make a statement on the matter. [62587/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Education and Youth (Deputy Michael Moynihan)  The Education Therapy Support Service (ETSS) was established in June 2024 within the NCSE, comprising of 39 therapists, providing 2 strands of support, Regional Therapy and Sustained In-School Therapy.  Officials from my department have engaged with colleagues in National Council for Special Education (NCSE) who provided the following details regarding recruitment.     Therapist Posts    Number of posts      Occupational Therapy Managers    2      Speech and Language therapy Managers    2      Senior Grade Occupational Therapists    12      Staff Grade Occupational Therapists    3      Senior Speech and Language therapists    14      Staff Speech and Language therapists    5      Total    38     As outlined in the Education Plan and the Programme for Government, it is this government’s ambition to extend therapy supports within the education system.  It is anticipated that the ETS will commence in 45 special schools at a later stage in the 2025/26 school year will be supported by a panel of 90 therapists comprising of senior and staff grade. The NCSE is currently preparing a large-scale recruitment campaign which is anticipated to go live in the coming weeks. Further roll out of the service will occur on a phased basis.  Separately, my Department through Public Jobs recently concluded a recruitment campaign for educational psychologists and successful candidates are currently being appointed to the National Educational Psychological Service (NEPS).  My department would not hold information of recruitment campaigns carried out by Health Service Executive. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_280",
        "debateSection": {
          "debateSectionId": "dbsect_287",
          "showAs": "National Council for Special Education",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_287",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_287.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Education"
        },
        "questionNumber": 280,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 280. Deputy Gillian Toole asked the Minister for Education and Youth the results of recruitment campaigns by the Health Service Executive and National Council for Special Education for healthcare professional roles (details supplied), in tabular form. [62589/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, under Section 16 of the Protected Disclosures Act 2014 (as amended), a person to whom a protected disclosure is made, and any person to whom a protected disclosure is referred in the performance of that person’s duties, shall not disclose to another person any information that might identify the person by whom the protected disclosure was made.  The Minister is therefore unable to confirm or deny the existence of any protected disclosures made to him, or to any body or agency under his aegis, as to do so could potentially identify a person if they have made such a disclosure. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_389",
        "debateSection": {
          "debateSectionId": "dbsect_372",
          "showAs": "Protected Disclosures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_372",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_372.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Justice"
        },
        "questionNumber": 389,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 389. Deputy Gillian Toole asked the Minister for Justice, Home Affairs and Migration the status of the examination of a protected disclosure (details supplied) circulated to senior Cabinet members in July 2025 and asked as a Leader’s Questions on 22 October 2025; and if correspondences will be issued; and if he will make a statement on the matter. [62716/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Agriculture, Food and the Marine  I am not aware of any plans to convene a Citizens’ Assembly on food.  Food is central to Ireland’s society, economy, and environment. Through Food Vision 2030, our stakeholder-led strategy for the agri-food sector, Ireland has adopted a food systems approach that promotes policy coherence including economic, environmental, health, social wellbeing and international development policy aspects. Its ambition is for Ireland to be a “World Leader in Sustainable Food Systems\", achieved through the engagement of all stakeholders, private and public.  Developed by a 32-member stakeholder committee and informed by extensive public consultation, Food Vision 2030 reflects a wide range of perspectives. Collaboration remains key to its implementation through dedicated sectoral groups and oversight by a High-Level Implementation Committee, which I chair, to monitor delivery of its four Missions:  • A Climate Smart, Environmentally Sustainable Agri-Food Sector.  • Viable and Resilient Primary Producers, with Enhanced Wellbeing.  • Food that is Safe, Nutritious and Appealing, Trusted and Valued at Home and Abroad.  • Innovative, Competitive and Resilient Agri-Food Sector, Driven by Technology and Talent.  Food Vision 2030 aligns closely with the Healthy Ireland Framework, supporting a sustainable, safe and nutritious food system, valued both domestically and internationally.  Recent geopolitical developments have challenged established assumptions on food security. However, Ireland remains among the most food secure countries in the world, ranked second in the most recent Global Food Security Index, underpinned by our strong agri-food sector, and our membership of the EU Single Market and participation in the Common Agricultural Policy (CAP).  Ireland continues to advocate for food systems transformation globally. Through the UN Food Systems Summit process, Ireland committed to sharing its experience in food systems transformation and supporting others through collaboration with the UN Food and Agriculture Organisation (FAO) and other partners.  A mid-term review of Food Vision 2030, which I announced recently, will ensure that it remains ambitious, coherent, and responsive to evolving challenges, including food security, health, and environmental goals. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_405",
        "debateSection": {
          "debateSectionId": "dbsect_387",
          "showAs": "Food Security",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_387",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_387.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Agriculture"
        },
        "questionNumber": 405,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 405. Deputy Gillian Toole asked the Minister for Agriculture, Food and the Marine when a Citizens' Assembly on food will be convened, to ensure an all-of-Government approach to Irish food security and meeting the objectives of the Healthy Ireland Policy and Actions. [62591/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to respond to the Deputy as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_484",
        "debateSection": {
          "debateSectionId": "dbsect_462",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_462",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_462.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Health"
        },
        "questionNumber": 484,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 484. Deputy Gillian Toole asked the Minister for Health the results of recruitment campaigns by the Health Service Executive and National Council for Special Education for healthcare professional roles (details supplied), in tabular form. [62588/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_485",
        "debateSection": {
          "debateSectionId": "dbsect_463",
          "showAs": "Departmental Policies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_463",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_463.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Health"
        },
        "questionNumber": 485,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 485. Deputy Gillian Toole asked the Minister for Health when a citizens' assembly on food will be convened, to ensure an all-of-Government approach to Irish food security and to meet the objectives of the Healthy Ireland policy and actions.  [62592/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Health  In accordance with the Protected Disclosures Act, the Department of Health does not comment on individual protected disclosures. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_504",
        "debateSection": {
          "debateSectionId": "dbsect_480",
          "showAs": "Protected Disclosures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_480",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_480.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Health"
        },
        "questionNumber": 504,
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 504. Deputy Gillian Toole asked the Minister for Health the status of the examination of a protected disclosure (details supplied) circulated to senior Cabinet members in July 2025 and asked as a Leader’s Questions on 22 October 2025; and if correspondences will be issued; and if she will make a statement on the matter. [62715/25] "
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29"
        },
        "questionNumber": 48,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works is leading on the redevelopment of the GPO Complex, as outlined in the Department of Taoiseach's Interdepartmental Group 'Report' and 'Roadmap for Delivery'.  As part of ‘Strand 1’, within the Roadmap for Delivery, the Office of Public Works is currently developing outline proposals for a wide-ranging non-statutory public consultation and engagement process which will be appropriate to the significance, nature and scale of this nationally important redevelopment project.  Prior to the procurement of a third-party to conduct the non-statutory public consultation and engagement process, the Office of Public Works has written to each Government Department seeking their nomination of a senior official to meet with the Office of Public Works; to contribute any relevant experiences/ insights to assist the Office of Public Works in this regard.  Subject to the outcomes of the non-statutory public consultation and engagement process, it is anticipated that the future GPO Complex will incorporate at least some, or all of the following:  1. Retention of a public post office function  2. A significant cultural use/ uses  3. Public realm enhancements at street level to encourage public use of the GPO complex.  4. High-quality offices on the upper floors to provide critical accommodation to meet ongoing/ additional Government requirements.  5. Reimagined retail components along Henry Street and in the GPO Arcade. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_81",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_81",
          "showAs": "Office of Public Works",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_81.xml"
            }
          }
        },
        "showAs": " 48. Deputy Gillian Toole asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will consider, evaluate and collaborate with other Departments to enable the establishment of an Irish academy of fine arts at the General Post Office, O’Connell Street, Dublin 1. [52873/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_48"
      }
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_196.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_196",
          "showAs": "Airport Policy",
          "debateSectionId": "dbsect_196"
        },
        "questionType": "written",
        "questionNumber": 194,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29"
        },
        "showAs": " 194. Deputy Gillian Toole asked the Minister for Transport the replies he received from Dublin Airport Authority, AIRNAV and IAA to the proposal for straight out departures from Dublin Airport north runway and other suggestions put forward by North Runway Technical Group at the meeting of 19 June 2025. [38642/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_194",
        "answerText": " Minister for Transport  I thank the Deputy for the question. It is important to Government in ensuring the sustainable development of Dublin Airport, to balance the legitimate rights of local residents who are concerned about noise levels at the airport, with the objectives of the National Aviation Policy, and the needs of business and tourism interests.  The Programme for Government includes a strong commitment to work with stakeholders to ensure relevant agencies engage effectively with all communities impacted by noise, flight movements and airport operations.  I have commenced a process of engagement with key stakeholders on a range of issues in relation to Dublin Airport in recent months. This includes meeting with the North Runway Technical Group on 19 June 2025 in relation to the impact of aircraft noise on those who live in and around the surrounds of Dublin Airport.  I can confirm that following this engagement, my Office received follow-up documentation on 25 June from the Group. As agreed at the meeting, I will be engaging with daa in relation to these proposals. ",
        "date": "2025-07-10"
      }
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_202.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_202",
          "showAs": "Tax Code",
          "debateSectionId": "dbsect_202"
        },
        "questionType": "written",
        "questionNumber": 200,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Finance",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29"
        },
        "showAs": " 200. Deputy Gillian Toole asked the Minister for Finance the reason a VAT rate, comparable to Northern Ireland, is not included as a stimulus measure for home building in Ireland; and if he will make a statement on the matter. [38645/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_200",
        "answerText": " Minister for Finance  Under the EU VAT Directive, with which Irish VAT legislation must comply, it is not possible to apply a VAT zero rate to the construction materials or to the construction of new buildings. The UK had a historical derogation to allow for a zero rate to apply to specific building projects (e.g. new builds meeting specific criteria such as being designed as a dwelling and which will only be used for a relevant charitable purpose).  It is not possible for Ireland to avail of such a historical derogation to avail of a zero rate for construction of housing. It should be noted that the 13.5% rate applies to all construction in Ireland which is also the result of a historical derogation as most Member States must apply a standard rate of VAT to construction with a reduced rate of VAT only available for the supply and construction of housing as part of a social policy.  It should be noted that following the UK departure from the EU they are no longer bound by the VAT Directive when it comes to the setting of reduced or zero rates. ",
        "date": "2025-07-10"
      }
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_231.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_231",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_231"
        },
        "questionType": "written",
        "questionNumber": 229,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29"
        },
        "showAs": " 229. Deputy Gillian Toole asked the Minister for Education and Youth to explain and provide documentary evidence of the rationale and detailed planning for re-designation of mild general learning disability schools to include children with more complex needs; how human and educational resources will be provided and utilised to ensure all children will receive equal assistance, attention and opportunities to be their best selves; and if she will make a statement on the matter. [38641/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_229",
        "answerText": " Minister of State at the Department of Education and Youth  Enabling children with special educational needs to receive an appropriate education is a priority for this government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special class and special school places are provided. This is in keeping with policy on an inclusive education, which promotes that children will be supported to receive an education in the most inclusive setting possible.  It is important to me and this Government that we build on the initiatives recently introduced to ensure that no matter where a child is enrolled they have access to the required supports to enable them to achieve their educational goals.  The government is committed to the provision of additional special school places for children with more complex educational needs. Over 300 new special school places are being provided for the coming 2025/26 school year. Five new special schools are being established in addition to the eleven new special schools opened over the last few years. Special school capacity is also being expanded across a number of special schools.  There are approximately 30 of our 129 special schools that were originally designated as schools for children with a mild general learning disabilities (MGLD). The establishment of these special schools predated the significant expansion in the range of supports offered in mainstream schools through additional special education teaching and special needs assistant resources and through the rapid expansion in special class provision.  It is noted that many of the children enrolling in MGLD special school do so around the transition point from primary to post-primary. The new senior cycle level 1 and level 2 programmes offers a new curriculum pathway for students with special educational needs at post-primary level now also.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "date": "2025-07-10"
      }
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_397.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_397",
          "showAs": "Covid-19 Pandemic",
          "debateSectionId": "dbsect_397"
        },
        "questionType": "written",
        "questionNumber": 393,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29"
        },
        "showAs": " 393. Deputy Gillian Toole asked the Minister for Health who set the Terms of Reference for the Covid Evaluation Committee; the reason clinical and vaccination information is not being sought; the reason the 2020-2022 timeframe has been chosen; and if she will make a statement on the matter. [38643/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_393",
        "answerText": " Minister for Health  The COVID-19 Evaluation, chaired by Professor Anne Scott, is completely independent in its functions. It decides on all matters relating to its operation, including its procedures and its programme of work, guided by its publicly available Terms of Reference. Information on its planned phased programme of work and future opportunities for consultation is available on www.covid19evaluation.ie. ",
        "date": "2025-07-10"
      }
    },
    {
      "question": {
        "questionNumber": 257,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_257",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 257. Deputy Gillian Toole asked the Minister for Climate, Energy and the Environment the status of the Land Use Review; the direction is being given to local authorities for balanced, common-good and needs'-based planning in the areas of Renewable Energy production, social infrastructure and housing; the reason there a disproportionate concentration of renewable energy facilities in south east Meath over 2000 acres under planned for solar energy harnessing and gas-fired peaking power plant and make a statement on these issues. [30457/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_189.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_189",
          "showAs": "Environmental Policy",
          "debateSectionId": "dbsect_189"
        },
        "answerText": " Minister for Climate, Energy and the Environment  The Programme for Government 2025: Securing Ireland’s Future, recommitted to the national land use review. The first phase was published in March 2023 and focused on evidence gathering. It was led by the Environmental Protection Agency. The final report of the independently chaired Land Use Review Phase 2 Oversight Group was submitted to Myself, the Minister for Agriculture, Food and the Marine, and the Minister of State at Housing, Local Government and Heritage in May. We are currently reviewing it, before reporting to government. It is a substantial body of work based on extensive analysis, research and consultation over the last four years. While it is a review and not an articulation of government policy, it is seeking to inform and balance environmental, social, and economic considerations and includes potential land use options on both public and private lands.  Under the aegis of the Accelerating Renewable Electricity Taskforce, officials from my Department, in collaboration with the Department of Housing, Local Government and Heritage, are developing a supporting policy framework for Ireland’s electricity supply which will deliver a regional balance and distribution of renewable technologies, including solar PV and onshore wind.  As part of this approach, regional renewable electricity capacity allocations for solar PV and onshore wind have been included in the First Revision of the National Planning Framework, published in April 2025. The inclusion of these regional allocations is a critical step towards achieving Ireland’s national renewable electricity targets and will support a plan-led approach to the strategic planning of renewable technologies, facilitate the accelerated roll-out and delivery of renewable electricity infrastructure and deliver a fair regional balance and distribution of the associated infrastructure. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 668,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_668",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 668. Deputy Gillian Toole asked the Minister for Education and Youth the timeline for the roll out of supportive therapies art, drama, equine therapies, wellbeing supports and nurture room grants to name some to mainstream primary and secondary schools, notwithstanding the prioritisation of special schools; and if she will make a statement on the matter. [30423/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_569.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_569",
          "showAs": "School Funding",
          "debateSectionId": "dbsect_569"
        },
        "answerText": " Minister of State at the Department of Education and Youth  The policy of the Department of Education is to allocate supports to recognised schools to cater for the needs of pupils with special educational needs in an educational context.  The provision of health-related supports is the responsibility of the HSE, and matters in relation to the provision of health-related services for children with disabilities, including physical and sensory therapy supports should therefore be directed to that body or to the Department of Health.  In general, schools supporting pupils with special educational needs can draw on a range of interventions, and it is a matter for schools to determine the approach or mix of approaches which they will use in each individual case.  The approach towards each child's education would be based on the individual educational needs of the child and would have regard to the child's individual education plan and supporting professional reports.  My department will continue to support schools through the provision of the necessary funding and capital investment to ensure all children are successful in accessing an education.  Furthermore, it is my intention to prioritise the Programme for Government commitment to introduce a National Therapy Service in education, commencing in special schools and subsequently extending to schools with special classes and mainstream provision. This service will be delivered by the National Council for Special Education (NCSE), building on the NCSE’s work previously completed through the Educational Therapy Support Service (ETSS).  It is intended that the National Therapy Service will commence in some special schools at a later stage in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out commencing in the 2026/27 school year. Initially the service will include the disciplines of Occupational Therapy and Speech and Language Therapy, over time further disciplines such as physiotherapy may be included.  The Education Therapy Support Service arose from the clearly identified need for wraparound support in schools in the areas of Occupational Therapy and Speech and Language therapy.  Based on this need we focused on the provision of Speech and Language and Occupational Therapy supports in schools.  The promotion of wellbeing is central to the Department of Education mission to enable children and young people to achieve their full potential and is set out in its Wellbeing Policy Statement and Framework for Practice. Furthermore, the Counselling in Primary Schools Pilot sees direct counselling supports being provided to selected primary schools and also, a number of Education Wellbeing Practitioners working under the direction and supervision of lead NEPS psychologists in schools. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 847,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_847",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 847. Deputy Gillian Toole asked the Minister for Housing, Local Government and Heritage the direction being given to local authorities for balanced, common-good and needs-based planning in the areas of renewable energy production, social infrastructure and housing; and if he will make a statement on the matter. [30421/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_720.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_720",
          "showAs": "Planning Issues",
          "debateSectionId": "dbsect_720"
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The National Planning Framework (NPF) is a broad national plan for strategic planning and sustainable development of urban and rural areas, with the objectives of securing balanced regional development and a sustainable approach to the form and pattern of future development.  The Revised NPF was approved by Government and the Oireachtas in April 2025. This concluded the Revision process and allows the revised NPF to take effect in the planning system. The Revised NPF provides the basis for the review and updating of Regional Spatial and Economic Strategies and local authority development plans to reflect matters such as updated housing figures, projected jobs growth and renewable energy capacity allocations, including through the zoning of land for residential, employment and a range of other purposes.  In relation to renewable energy, the Revised NPF includes new policies relating to the allocation of regional renewable electricity capacity allocations. This is in order to facilitate the accelerated roll-out and delivery of renewable electricity infrastructure for on-shore wind and solar generation development intended to support the achievement of the national targets set out in the Climate Action Plan.  From a strategic policy development perspective, the Revised NPF sets out that each Regional Assembly plan must, through their Regional Spatial and Economic Strategies, for the delivery of the Regional Target Power Capacity (MW) allocations for onshore wind and solar electricity. The regional strategies will be required to break down the regional capacity allocations into county level capacity allocations that will inform the updating/preparation of local level development plans.  This will result in the identification of suitable areas where such development should be directed.  The Revised NPF indicates a need to plan for approximately 50,000 housing units annually between now and 2040. Further to the finalisation of the NPF Revision process, it is intended to issue updated planned housing growth requirements at a city and county level to each local authority, to provide the basis for a significant increase in the capacity for housing to be delivered, in line with updated population and housing projections. This will require more land to be zoned, which will require co-ordination and prioritisation to ensure that the necessary infrastructure is in place both to support and enable housing delivery, and to ensure that housing delivery is aligned with the provision of services and facilities including education, childcare, healthcare and recreational facilities to support the expansion of existing settlements and the creation of new sustainable communities.  A further new element of NPF strategy results from the requirement to plan for population growth with a baseline 6.1m projection set out by the ESRI, and a potential need to plan for growth in line with the high migration scenario provided in the ESRI’s Report (6.3m). This is to be undertaken and delivered in line with longer term strategic planning for Transport Orientated Development (TOD) in Ireland’s five Cities to support the delivery of new sustainable communities at brownfield and greenfield locations along existing or planned high capacity public transport corridors. In terms of identifying locations for further growth and housing development at scale, it is critical that planning for these opportunities is aligned with phased infrastructure investment.  Responsibility for the zoning of land at a local authority level rests with the elected members of a local authority. In preparing their statutory plans, including in relation to the zoning of land for particular purposes, the elected members are required to consider and be consistent with, as appropriate, the National Planning Framework, the relevant Regional Spatial and Economic Strategy and relevant Ministerial planning guidelines. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 848,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_848",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 848. Deputy Gillian Toole asked the Minister for Housing, Local Government and Heritage the professional qualifications required by local authority planners, to adjudicate on renewable energy projects submitted for planning permission; and if he will make a statement on the matter. [30422/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_721.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_721",
          "showAs": "Planning Issues",
          "debateSectionId": "dbsect_721"
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Section 160 of the Local Government Act 2001 provides the Minister with the power to declare qualifications of such classes and descriptions as he or she thinks fit for a specified employment under a local authority or for such of the employments as belong to a specified class, description or grade.  Orders made under section 160 of the Local Government Act 2001 declaring qualifications for planning roles in the local government sector are available on my Department's website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/planning-services-in-local-authorities-qualifications/ "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1051,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1051",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 1051. Deputy Gillian Toole asked the Minister for Justice, Home Affairs and Migration the status of the Thornton Hall prison site in north County Dublin, Fingal, in light of recent announcements on the increase in prison spaces; and if he will make a statement on the matter. [30428/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_908.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_908",
          "showAs": "Prison Service",
          "debateSectionId": "dbsect_908"
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  The Programme for Government 2025 commits to a range of measures to explore alternatives to prison, enhance prison infrastructure and increase prison capacity. This includes the construction of a new prison at Thornton Hall.  The findings of the Working Group established in the second half of 2024 to further consider future prison capacity needs out to 2035 will support and inform future developments around Thornton Hall. Long range projections prepared by the group indicate that Ireland’s prison population out to 2035 will continue to grow, with a minimum prison population forecast of 5,600 and, in all likelihood see growth to or beyond 6,450 prisoners.  The report makes a number of recommendations in relation to developments needed within the existing prison estate, and also to future development on the old Cork prison site and at Thornton Hall.  It also recommends that opportunities to accelerate existing plans for large-scale capital projects should be urgently explored.  The Thornton Hall project is subject to the necessary funding being secured through the Government’s review of the National Development Plan. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1052,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1052",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 1052. Deputy Gillian Toole asked the Minister for Justice, Home Affairs and Migration the exact process of site selection for International Protection Accommodation Service centres; are local authorities using commercial rates information and approaching owners; if owners are being introduced by public representatives; the community infrastructure audit requirements that are to be submitted with prospective applications; and if he will make a statement on the matter. [30429/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_909.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_909",
          "showAs": "International Protection",
          "debateSectionId": "dbsect_909"
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  The State is currently accommodating almost 33,000 people who have applied for international protection (IP) in Ireland, about 9,500 of whom are children with their families. The International Protection Accommodation Service (IPAS) provides accommodation in over 320 centres around the country.  These centres are a mix of State-owned sites, long-term centres, and emergency accommodation contracted commercially. While work is ongoing to develop more State-owned accommodation options in this sector, at the moment over 90% of IPAS accommodation is commercially provided.  The contracting of properties as emergency centres became necessary as numbers of international protection applications surged from 2022 to 2024. However, the Department is dependent on the receipt of offers from external commercial providers, and does not predetermine their geographical location.  All offers of international protection accommodation are reviewed by the Department under a standardised appraisal procedure. Factors in the appraisal of international protection accommodation include the site and its potential, the value for money it offers, planning matters and any works required to meet the required standards.  Consideration is also given to the location and locality, access to services, resident welfare, health and wellbeing, and the current level of need in the sector.  Part of the appraisal process for a new contract includes review of the property’s services and planning compliance, and this done in conjunction with the Local Authority where relevant.  It should be noted that an application from a prospective provider to the Local Authority for confirmation of a planning exemption, referred to as a Section 5 application, does not mean that a decision has been made by the Department to use a property as international protection accommodation.  The Section 5 process refers to an application under the Planning and Development Act 2000 for change of use of that property for a new purpose, including as accommodation for international protection applicants.  This is often required by the external provider to confirm that the property can be offered and appraised. Such applications often occur before the Department has commenced a detailed appraisal.  A large volume of offers of accommodation are received and many are not successful for a variety of reasons including:  • The International Protection Procurement Service (IPPS) may deem a premises unsuitable for accommodation  • The premises may not be compliant with relevant statutory regulations  • IPPS and the prospective provider may not agree to contract terms  • The prospective provider may withdraw the offer during the appraisal process.  More information about this process is available on Gov.ie. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1599,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1599",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 1599. Deputy Gillian Toole asked the Minister for Health the total number of women affected directly by the misreading of their cervical smear tests to date; and if she will make a statement on the matter. [30424/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1407.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1407",
          "showAs": "Health Strategies",
          "debateSectionId": "dbsect_1407"
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1599, 1600 and 1601 together.  Although not directly related to the questions asked, I refer to Parliamentary Question No. 968 of 8 April 2025 (PQ 17189/25), where I provided information on the number of claims relating to CervicalCheck based on information provided to me by the State Claims Agency, but is the information available. The State Claims Agency has a statutory remit to manage personal injury claims on behalf of State Authorities. The response to the question can be found here: www.oireachtas.ie/en/debates/question/2025-04-08/968/#pq_968.  The Government is fully committed to the support and enhancement of our population screening programmes, including the advancement of cancer screening initiatives. Our population health screening programmes play a crucial role in our healthcare system. They promote both cancer prevention and early detection, enabling timely intervention and treatment that lead to better health outcomes. Several reviews and reports acknowledge that Ireland’s screening programmes operate to international standards with robust quality assurance. The Cervical Screening Programme has robust safeguards to ensure it performs to the highest standards. The HSE have advised that it is operating as expected.  Cervical cancer screening is excellent at detecting cancer early for as many women as possible, and it is deeply regrettable, but unavoidable, that screening doesn’t work for everyone If cervical cancer is found in between a woman’s cervical screening tests, it is called an interval cancer. This is because it is found in the interval between a previous test and the next test. Sometimes, interval cancer happens because of a false negative result. These are results that were reported as negative, even though there was an HPV infection or abnormal cells in the cervix. Other times, interval cancer happens even though there was no sign of abnormal cells in the previous screening test. These are known limitations of screening and are accepted internationally.  It is essential to emphasise that screening is not a diagnostic test, it is for healthy people who do not have symptoms, people who are between screening appointments, or are waiting for rescheduled appointments, are aware of symptoms, or if they have concerns or worries, should contact their healthcare provider, who will arrange appropriate follow-up care. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1600,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1600",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 1600. Deputy Gillian Toole asked the Minister for Health the total number of women who were directly affected by the misreading of their cervical smear tests who have passed away to date. [30425/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1407.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1407",
          "showAs": "Health Strategies",
          "debateSectionId": "dbsect_1407"
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1599, 1600 and 1601 together.  Although not directly related to the questions asked, I refer to Parliamentary Question No. 968 of 8 April 2025 (PQ 17189/25), where I provided information on the number of claims relating to CervicalCheck based on information provided to me by the State Claims Agency, but is the information available. The State Claims Agency has a statutory remit to manage personal injury claims on behalf of State Authorities. The response to the question can be found here: www.oireachtas.ie/en/debates/question/2025-04-08/968/#pq_968.  The Government is fully committed to the support and enhancement of our population screening programmes, including the advancement of cancer screening initiatives. Our population health screening programmes play a crucial role in our healthcare system. They promote both cancer prevention and early detection, enabling timely intervention and treatment that lead to better health outcomes. Several reviews and reports acknowledge that Ireland’s screening programmes operate to international standards with robust quality assurance. The Cervical Screening Programme has robust safeguards to ensure it performs to the highest standards. The HSE have advised that it is operating as expected.  Cervical cancer screening is excellent at detecting cancer early for as many women as possible, and it is deeply regrettable, but unavoidable, that screening doesn’t work for everyone If cervical cancer is found in between a woman’s cervical screening tests, it is called an interval cancer. This is because it is found in the interval between a previous test and the next test. Sometimes, interval cancer happens because of a false negative result. These are results that were reported as negative, even though there was an HPV infection or abnormal cells in the cervix. Other times, interval cancer happens even though there was no sign of abnormal cells in the previous screening test. These are known limitations of screening and are accepted internationally.  It is essential to emphasise that screening is not a diagnostic test, it is for healthy people who do not have symptoms, people who are between screening appointments, or are waiting for rescheduled appointments, are aware of symptoms, or if they have concerns or worries, should contact their healthcare provider, who will arrange appropriate follow-up care. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1601,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1601",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 1601. Deputy Gillian Toole asked the Minister for Health the total number of women currently alive who have received a terminal diagnosis as a direct result of the misreading of cervical cancer tests. [30426/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1407.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1407",
          "showAs": "Health Strategies",
          "debateSectionId": "dbsect_1407"
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 1599, 1600 and 1601 together.  Although not directly related to the questions asked, I refer to Parliamentary Question No. 968 of 8 April 2025 (PQ 17189/25), where I provided information on the number of claims relating to CervicalCheck based on information provided to me by the State Claims Agency, but is the information available. The State Claims Agency has a statutory remit to manage personal injury claims on behalf of State Authorities. The response to the question can be found here: www.oireachtas.ie/en/debates/question/2025-04-08/968/#pq_968.  The Government is fully committed to the support and enhancement of our population screening programmes, including the advancement of cancer screening initiatives. Our population health screening programmes play a crucial role in our healthcare system. They promote both cancer prevention and early detection, enabling timely intervention and treatment that lead to better health outcomes. Several reviews and reports acknowledge that Ireland’s screening programmes operate to international standards with robust quality assurance. The Cervical Screening Programme has robust safeguards to ensure it performs to the highest standards. The HSE have advised that it is operating as expected.  Cervical cancer screening is excellent at detecting cancer early for as many women as possible, and it is deeply regrettable, but unavoidable, that screening doesn’t work for everyone If cervical cancer is found in between a woman’s cervical screening tests, it is called an interval cancer. This is because it is found in the interval between a previous test and the next test. Sometimes, interval cancer happens because of a false negative result. These are results that were reported as negative, even though there was an HPV infection or abnormal cells in the cervix. Other times, interval cancer happens even though there was no sign of abnormal cells in the previous screening test. These are known limitations of screening and are accepted internationally.  It is essential to emphasise that screening is not a diagnostic test, it is for healthy people who do not have symptoms, people who are between screening appointments, or are waiting for rescheduled appointments, are aware of symptoms, or if they have concerns or worries, should contact their healthcare provider, who will arrange appropriate follow-up care. "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 1602,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-10/pq_1602",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 1602. Deputy Gillian Toole asked the Minister for Health if the guidelines for vaccination against SARS COV 2 of infants, children and adolescents, who do not have medical conditions that increase their risk of severe illness, will be amended in light of recent research findings in the Department of Health in Australia and the FDA in the USA whereby risk of side effects outweigh any benefit of vaccination. [30427/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-06-10",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/mul@/dbsect_1408.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-10/writtens/dbsect_1408",
          "showAs": "Vaccination Programme",
          "debateSectionId": "dbsect_1408"
        },
        "answerText": " Minister for Health  The national immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC). The committee's recommendations are based on the prevalence of the relevant disease in Ireland and international best practice in relation to immunisation. It makes recommendations on vaccination policy to my Department.  NIAC continues to revise recommendations to allow for the introduction of new vaccines in Ireland and to keep abreast of changes in the patterns of disease.  It also considers emerging evidence and therefore, the immunisation schedule will continue to be amended over time.   "
      },
      "contextDate": "2025-06-10"
    },
    {
      "question": {
        "questionNumber": 162,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-29/pq_162",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 162. Deputy Gillian Toole asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the improvements being made in how Government Departments “report capital spending on an annual basis to ensure greater transparency and oversight of expenditure on a regional basis”; and if he will make a statement on the matter. [28806/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-29",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-29/writtens/mul@/dbsect_169.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-29/writtens/dbsect_169",
          "showAs": "Public Expenditure Policy",
          "debateSectionId": "dbsect_169"
        },
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  There is substantial information made available on capital infrastructure projects to both Dáil Éireann and to the wider public through a number of formal reporting frameworks.  There is currently extensive reporting of capital projects in the financial statements of Government Departments and Offices as well as the annual reports and financial statements of bodies under their aegis.  All Government Departments and Offices, as well as nearly all bodies under their aegis, report their capital assets (Property, Plant and Equipment as well as Intangible Assets) on their Statement of Financial Position (Balance Sheet) along with extensive disclosure notes.  Bodies under the Aegis and Local Authorities report under accounting framework FRS 102 and from 2024, Government Departments report using Central Government Accounting Standards based on International Public Sector Accounting Standards. It is important to highlight that every euro spent in a given year is accounted for in the Appropriation Accounts and is audited by the Comptroller and Auditor General.  In the annual appropriation accounts of Government Departments, details of all major capital projects and Public Private Partnership projects, where the project value exceeds €10,000,000, are separately disclosed. Where the reported commitment level or projected project cost has varied by more than €500,000 compared with the previous year, the reason for the movement are also explained.  The Government is committed to detailing progress on the delivery of the NDP at regular intervals to allow for full transparency of the implementation of Project Ireland 2040. This is achieved through regular updates of the Project Ireland 2040 capital investment tracker and MyProjectIreland interactive map viewer as well as the publication of annual reports and regional reports highlighting Project Ireland 2040 achievements and giving a detailed overview of the public investments that have been made throughout the country.  The capital tracker and interactive map are key tools in overseeing the progress of Project Ireland 2040. Their purpose is to facilitate communication, monitoring and planning of investments, to inform citizens of the variety of projects currently in the planning and construction phase in their local regions and throughout the country.  They provide an aid to industry by giving a greater overview to the construction and infrastructure sectors of the Government's investment commitments and future opportunities for these sectors.  Government Departments and Local Authorities are also required to publish details of projects of €500,000 and more under management (these projects may not incur €500,000 in a single year but might be at that level over multiple years). The National Oversight and Audit Commission (NOAC) publish detailed updates for each county council on projects of a relatively modest value of €500,000 or more. The latest publication for end-2023 was published in September 2024 and can be found at the following link: www.noac.ie/noac_publications/report-70-public-spending-code-report-2023/.  The inventory table is included at Appendix 4 and it runs to over 100 pages of updates on individual projects at county council level. "
      },
      "contextDate": "2025-05-29"
    },
    {
      "question": {
        "questionNumber": 314,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-29/pq_314",
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "showAs": " 314. Deputy Gillian Toole asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the support his Department provides to the Irish Government Economic and Evaluation Service, to provide critical economic and value for money analysis; and if he will make a statement on the matter. [29166/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-29",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-29/writtens/mul@/dbsect_280.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-29/writtens/dbsect_280",
          "showAs": "Departmental Functions",
          "debateSectionId": "dbsect_280"
        },
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  I thank the Deputy for her question.  The Irish Government Economic and Evaluation service (IGEES), is an integrated, cross Government service that aims to support better policy formulation and implementation in the civil service through policy analysis and evaluation. Since its establishment in 2012, IGEES has expanded significantly, with over 300 economists and analysts now working across Departments, adding their skill set to the varied expertise working on policy analysis and formulation as directed by their Departmental business plans. IGEES has played an important role in strengthening policy analysis across the Civil Service, including through specialist recruitment, targeted learning and development, publication of analytical outputs and a focus on knowledge-sharing activities. These supports have been vital in building the analytical capacity needed to inform policy development and improve outcomes across Government.  Policy analysis is a core component of the public expenditure management and value for money frameworks. IGEES plays a key role in supporting all departments and offices in delivering on their value for money responsibilities through undertaking regular analysis of expenditure trends and policies. Alongside this, individual line Departments also maintain responsibility for conducting detailed policy analysis within their own sectors, contributing sector-specific insights and evidence to the wider policy making process. Reports are published on individual Departmental websites and where developed by IGEES, can also be accessed through the Irish Government Economic Evaluation Service (IGEES) website.  Securing value for money is an ongoing priority for this Government and is at the heart of all decision making, at every stage of a policy or programme lifecycle.  Delivering value for money is about securing the efficient and effective use of public resources in the pursuit of better public services, living standards and infrastructure for the people of Ireland. It is not solely concerned with costs and pricing; it also involves the consideration of quality, specialist expertise, and social and environmental impacts.  Value for Money requirements are underpinned by legislation and supported by a set of rules, guidelines and frameworks. These structures directly inform how all public bodies operate on a daily basis. A key role of my Department is the development, implementation, and continuous maintenance of these frameworks, which are essential in promoting and embedding value-for-money principles across the public service.  Achieving value for money is the responsibility of everyone involved in overseeing the use of public funds. Its delivery is dependent on the clear understanding of the roles and responsibilities of the various structures across the system. In the coming weeks, I will bring a memo to Government with a statement on the delivery of value for money. This statement will clarify the guidance and procedures available to support the efficient and effective use of public resources. Furthermore, this document will reemphasise the roles and responsibilities of the various decision makers across the system in the delivery of value for money. "
      },
      "contextDate": "2025-05-29"
    },
    {
      "contextDate": "2025-05-22",
      "question": {
        "answerText": " Deputy Gillian Toole  I wish to ask both the Minister and the Minister of State the timeline for the single-phase delivery of the new campus for Dunboyne College of Further Education and Training, Dunboyne, County Meath, to be funded from as many relevant streams as possible, including but not limited to SOLAS, sports capital funding, national training funding and national development plan funding. This college began with 50 students and two courses and it currently has 1,300 students, 70 courses and 45 apprenticeships. \n Minister of State at the Department of Further and Higher Education, Research, Innovation and Science (Deputy Marian Harkin)  I thank the Deputy for her question. I am pleased to say this is my first opportunity to respond to an oral question. I am also pleased that it relates to Dunboyne College, which I know. I am familiar with the great work that is happening there.  Louth Meath ETB, LMETB, is being supported by SOLAS in developing its preliminary business case, PBC, proposal for Dunboyne under the FET college of the future major projects fund and they have met as recently as this month to progress the application. The proposal put forward by LMETB relates to the development of a new fit-for-purpose facility on a greenfield site in Dunboyne to replace the existing rented accommodation in Dunboyne. It is one of 12 projects being progressed under this fund.  LMETB is refining its business case proposal and once completed, it will submit it to SOLAS for evaluation. The evaluation panel will be available to meet as soon as the updated business case is received. Business cases that meet the evaluation criteria will advance to the next stage of development: pre-tender, project design, planning, and procurement strategy. The development of a robust PBC is fundamental to the requirements of the infrastructure guidelines. The appropriateness or otherwise of a phased development of the proposal, which the Deputy inquired about, is a matter for the evaluation panel to determine.  Funding for all projects under this programme, including the proposal from LMETB for Dunboyne, will come from within the FET college of the future major projects fund envelope. The Department and I are committed to delivering this project as part of 12 key projects that were announced under the FET college of the future major projects fund.  Deputy Gillian Toole: I thank the Minister of State for her updated information. I reiterate that this college is delivering. At various times in this Chamber we have discussed the need for occupational therapists, speech and language therapists and the development of apprenticeship programmes and construction studies. LMETB colleges can deliver that. This process began in 2015 when Dunboyne was added to the building list of the then Department of Education and Skills. Currently, the rent roll is just short of €100 million a year to 23 landlords. That includes transportation costs. Such costs are unsustainable. Currently, the college is operating from an industrial estate where numerous health and safety issues arise. It is an absolute waste of money. I plead for the single-phase case, because since this process began in 2015 there has been a lot of to'ing and fro'ing with the Department. There has been significant engagement, including by staff members whose core function is the education of the students whom they highly value. \n Deputy Gillian Toole  I thank the Minister of State for the updated information. I reiterate that this college is delivering. At various times in this Chamber, we have discussed the need for occupational therapists, speech and language therapists and the development of apprenticeship programmes, as well as construction studies. LMETB colleges can deliver that. This process began in 2015, when Dunboyne was added to the building list of the then Department of Education and Skills. Currently, the rent roll is just short of €100 million a year to 23 landlords. That includes transportation costs. It is unsustainable. The college is operating from an industrial estate where numerous health and safety issues arise. It is an absolute waste of money. I plead for the single-phase case because this process began in 2015 and there has been a lot of toing and froing with the Department. There has been significant engagement, including by staff members whose core function is the education of the students, whom they highly value. \n Deputy Marian Harkin  I will begin with a comment. The Deputy spoke about a one-stage process. Whether it is a phased development or a one-stage development is a matter for the evaluation panel. The proposal is to develop fit-for-purpose accommodation on a greenfield site in Dunboyne. As the Deputy said, the college is currently located in poor accommodation in a large number of rental premises in an industrial estate. LMETB submitted its preliminary business case for evaluation in September 2024 and that needed to be refined. It submitted it again in March of this year and further refinement was needed. SOLAS is working with LMETB. Everybody wants to see a successful application from Dunboyne because, in truth, we want to get on with building this new facility. \n Deputy Gillian Toole  We are absolutely united in the spirit of getting this project progressed. Again, I would push the case in this instance based on the financial implications and the history of the project. There is no doubt of the intention in the programme for Government, where the intention is to communicate, collaborate and encourage more interdepartmental and intradepartmental collaboration. That is why I make the suggestion for alternative funding streams so it is not just limited to the FET fund.  On 24 February 2022, the Minister's predecessor and now Tánaiste, Deputy Harris, gave a commitment on record and on film, stating that he was delighted to confirm there is ring-fenced funding in place for the delivery of a purpose-built college for Dunboyne College. I am just asking for the honouring of the single-phase delivery of the project. \n Deputy Marian Harkin  I hear what the Deputy is saying and I know that what she is talking about is a ring-fenced, purpose-built building. I know the envelope that is available is available to all of the 12 different colleges that are looking for this funding. All have been approved and they just have to get through this preliminary stage. I know Dunboyne is working very hard with LMETB. Without being certain about this, I would be confident that, within the next short period of time, we will get to a point where its application can be successful and progress to the next part of the process. Eight out of the 12 original applicants have got to this point and I have no doubt Dunboyne will get there soon. It is a big piece of work and very important for the region. Like the Deputy, I recognise the really good work that is carried out by the college. I and my Department stand ready to support it. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Further and Higher Education",
          "roleType": null
        },
        "date": "2025-05-22",
        "showAs": " 5. Deputy Gillian Toole asked the Minister for Further and Higher Education, Research, Innovation and Science the timeline for the single-phase delivery of the new campus for Dunboyne College of Further Education and Training, Dunboyne, County Meath, to be funded from as many relevant streams as possible, including but not limited to SOLAS, sports capital and national training funding. [26525/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-22/pq_5",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseCode": "dail"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-22/debate/mul@/dbsect_7.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-22/debate/dbsect_7",
          "debateSectionId": "dbsect_7",
          "showAs": "Further and Higher Education"
        },
        "questionNumber": 5,
        "questionType": "oral"
      }
    },
    {
      "contextDate": "2025-05-22",
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  Higher Education Institutions (HEIs) in Ireland are autonomous bodies, as defined under relevant legislation, and are responsible for their own academic and administrative affairs. Higher education institutions receive funding from a diverse range of sources which support the broad spectrum of their activities.  Institutions are responsible for ensuring appropriate policies and procedures are in place to oversee the use of their resources. Sources of income may include exchequer core funding, student fees, state grants, competitive research funding, EU funding, investment income, donations, endowments, and other commercial revenues such as library services, catering, and other services. The President of a University, as the Accountable Person for the institution, is accountable to the Oireachtas in respect of the expenditure of Exchequer funding and their financial statements are audited independently by the Comptroller and Auditor General. Corporate sponsorship is one such source of funding and can take a variety of forms in the higher education sector. These can include support or additional support for research projects and centres, the establishment of professorships, funding of campus infrastructure, and the provision of scholarships and bursaries. Many Irish HEIs actively engage with private sector partners to secure both financial and in-kind contributions that align with their academic and strategic objectives or help establish future employment pathways for graduates. While corporate support plays an important role in the overall funding landscape, there is currently no single national policy that governs corporate sponsorship in further and higher education.  Given the institutional autonomy of HEIs, decisions relating to corporate partnerships are managed at the level of each institution, guided by their internal governance frameworks, ethical standards, and policies on academic independence.  My Department continues to monitor developments in this area, and remains open to engaging with relevant stakeholders to ensure transparency, academic integrity, and appropriate oversight in all funding relationships within the sector. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Further and Higher Education",
          "roleType": null
        },
        "date": "2025-05-22",
        "showAs": " 390. Deputy Gillian Toole asked the Minister for Further and Higher Education, Research, Innovation and Science if there is a policy for corporate sponsorship of further and higher education campuses; if so, the frequency with which it is reviewed; and the stakeholder consultation for same. [26526/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-22/pq_390",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseCode": "dail"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-22/writtens/mul@/dbsect_396.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-22/writtens/dbsect_396",
          "debateSectionId": "dbsect_396",
          "showAs": "Further and Higher Education"
        },
        "questionNumber": 390,
        "questionType": "written"
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "questionNumber": 263,
        "showAs": " 263. Deputy Gillian Toole asked the Minister for Transport the specific mechanisms through which the Secretary General, and other senior Department officials, exercise oversight of Dublin Airport Authority, regarding its operational and developmental obligations at Dublin Airport; and if he will make a statement on the matter. [23070/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-08/pq_263",
        "debateSection": {
          "debateSectionId": "dbsect_253",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/dbsect_253",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          },
          "showAs": "Dublin Airport Authority"
        },
        "answerText": " Minister for Transport  I propose to take Questions Nos. 263 and 264 together.  daa is a commercial State body and has statutory responsibility to operate, manage and develop Dublin Airport under the State Airports Act 2004. The Chairperson and Board are responsible to me as Minister, for the operation and proper functioning of daa.  Corporate governance oversight of daa by my Department is exercised in line with the Company’s governing legislation and the Code of Practice for the Governance of State Bodies 2016. The Code provides a framework for the application of best practice in corporate governance across commercial and non-commercial State bodies. The Code covers the internal practices of State bodies and their external relations with Government, the relevant Minister under whose aegis they fall, the Minister for Public Expenditure, NDP Delivery and Reform and their respective parent Departments. All commercial agencies under the aegis of my Department, including daa, are designated to NewERA under the National Treasury Management Agency (Amendment) Act 2014 for financial and commercial advice.?  In addition, Dublin Airport, like all airports, operates in a heavily regulated environment and in this regard is overseen by a number of independent regulators to ensure their compliance with domestic, European and international law.  Finally, planning matters, including compliance and enforcement, are a matter for the relevant independent planning authority which in the case of Dublin airport is Fingal County Council. ",
        "date": "2025-05-08"
      },
      "contextDate": "2025-05-08"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "questionNumber": 264,
        "showAs": " 264. Deputy Gillian Toole asked the Minister for Transport for a list of departmental personnel with responsibility for the oversight of Dublin Airport operations, to include planning compliance, environmental impact, public accountability, along with details of their relevant experience and qualifications; and if he will make a statement on the matter. [23071/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-08/pq_264",
        "debateSection": {
          "debateSectionId": "dbsect_253",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/dbsect_253",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-08/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          },
          "showAs": "Dublin Airport Authority"
        },
        "answerText": " Minister for Transport  I propose to take Questions Nos. 263 and 264 together.  daa is a commercial State body and has statutory responsibility to operate, manage and develop Dublin Airport under the State Airports Act 2004. The Chairperson and Board are responsible to me as Minister, for the operation and proper functioning of daa.  Corporate governance oversight of daa by my Department is exercised in line with the Company’s governing legislation and the Code of Practice for the Governance of State Bodies 2016. The Code provides a framework for the application of best practice in corporate governance across commercial and non-commercial State bodies. The Code covers the internal practices of State bodies and their external relations with Government, the relevant Minister under whose aegis they fall, the Minister for Public Expenditure, NDP Delivery and Reform and their respective parent Departments. All commercial agencies under the aegis of my Department, including daa, are designated to NewERA under the National Treasury Management Agency (Amendment) Act 2014 for financial and commercial advice.?  In addition, Dublin Airport, like all airports, operates in a heavily regulated environment and in this regard is overseen by a number of independent regulators to ensure their compliance with domestic, European and international law.  Finally, planning matters, including compliance and enforcement, are a matter for the relevant independent planning authority which in the case of Dublin airport is Fingal County Council. ",
        "date": "2025-05-08"
      },
      "contextDate": "2025-05-08"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "questionNumber": 1071,
        "showAs": " 1071. Deputy Gillian Toole asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media if the recently-published National Counter Disinformation Strategy includes provisions to address the dissemination of misleading or inaccurate information by State agencies or State-owned companies; and if not, how the Government intends to ensure that organs of the State are held to the same standards of truth, transparency and accountability that the strategy seeks to promote in media, civil society, and online platforms. [21024/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Tourism"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-29/pq_1071",
        "debateSection": {
          "debateSectionId": "dbsect_951",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/dbsect_951",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/mul@/dbsect_951.xml"
            },
            "pdf": null
          },
          "showAs": "Departmental Bodies"
        },
        "answerText": " Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media  Disinformation is a serious challenge which can only be met with a whole-of-society response. The National Counter Disinformation Strategy is aimed at coordinating national efforts to counter this complex issue. It is not about deciding on individual instances of disinformation but instead focuses on those harms arising from it. It is a first step in setting out what that response looks like.  The Strategy aims to, amongst other things, support the building of public knowledge, the building of resilience to disinformation and ensuring cross-sector coordination, collaboration and cooperation. Supporting the development of strong public communications and the provision of reliable, clear and accessible public information by Government can play an important role in reducing the impact of disinformation and supporting trust in government. There are a range of other agencies involved in the communication of trustworthy information, including the Citizens Information Board, the Central Statistics Office, libraries and others.  The importance of public communications and trust in public institutions is acknowledged in Commitment 2 of the Strategy and to help make that commitment a reality, there are actions around developing public communications capacity across government departments and agencies, embedding a unified government identity to signify government information and support trust in government and developing www.gov.ie as a reliable and accessible source of public information.  Now that the Strategy is published, the focus switches to overseeing and monitoring implementation. With that in mind, an Oversight Group will be established and it will prioritise an implementation plan. Officials in my Department will chair this Oversight Group. ",
        "date": "2025-04-29"
      },
      "contextDate": "2025-04-29"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "questionNumber": 1948,
        "showAs": " 1948. Deputy Gillian Toole asked the Minister for Children, Equality, Disability, Integration and Youth the specific measures now being implemented to improve community consultation, communication and integration of those proven to need international protection from the Government; and if she will make a statement on the matter. [21025/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-29/pq_1948",
        "debateSection": {
          "debateSectionId": "dbsect_1693",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/dbsect_1693",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/mul@/dbsect_1693.xml"
            },
            "pdf": null
          },
          "showAs": "International Protection"
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  My Department's Community Engagement Team (CET) was established in late 2023 to engage directly with elected representatives, local authorities, NGOs, Community Fora, local services, An Garda Síochána and other, in advance of opening accommodation centres for people seeking international protection.  The purpose of the team is to improve the flow of information about new and existing accommodation centres into communities, to assist with integration for the people joining our communities. Extra resources have been added to the CET during 2024 to extend our reach and impact.  When a decision is made by my Department to accommodate people at a new centre, the team then works to engage with and provide detailed information to the local community, in advance of the centre opening. They will give the full details of the property including the contracted capacity, resident profile and details about how the centre will be managed.  The team can also attend meetings for dialogue with local representatives and groups, providing background information, answering questions and listening to people's views, and helping to activate or support location partnerships where relevant to support accommodation openings.  The team also supports information sharing through a dedicated email service for queries from local groups about new and existing centres.  Between October 2023 to date, the CET has worked through the openings of over 130 IPAS and Ukraine accommodation centres. Some of these have involved a simple sharing of information through the relevant channels, while others have involved more detailed meetings with local community groups, local officials, public representatives and other key stakeholders.  There have been many consistent examples of meaningful and productive engagement, and service providers and elected representatives around the country demonstrate ongoing support for our work and for our residents.  Making the Department’s work better understood, providing information when needed, and being available to meet or speak with local representatives has assisted with the successful initiation of many centres.  In relation to larger State-owned sites, the model of engagement has been developed to plan for more meaningful dialogue to support these larger centres, particularly those on state-owned lands being developed under Government policy to move away from dependence on commercial providers.  Overall, it's important to note that we have over 320 accommodation centres in Ireland, we open new centres regularly as needed. Our centres operate with the support of the community, with dialogue and engagement, and thanks to the co-operation of the people in the area, IPAS and centre management, local public services of all sectors, and residents and advocates.  As part of the Programme for Government 2025, Securing Ireland’s Future, there is a commitment to provide for detailed discussions with communities and to plan more effectively for delivery of increased public services.  This work will be progressed as part of the development of a new Migration and Integration Strategy, and will shortly transfer from my Department to the Department of Justice on 1 May 2025.  I trust this information clarifies the matter. ",
        "date": "2025-04-29"
      },
      "contextDate": "2025-04-29"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29",
          "showAs": "Gillian Toole"
        },
        "questionNumber": 1949,
        "showAs": " 1949. Deputy Gillian Toole asked the Minister for Children, Equality, Disability, Integration and Youth when a youth Senator position will be established; if all committees of the 34th Dáil will be required to include 50% youth affairs in subject matter agenda and discussion; and if she will make a statement on the matter.  [21026/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-29/pq_1949",
        "debateSection": {
          "debateSectionId": "dbsect_1694",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/dbsect_1694",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/mul@/dbsect_1694.xml"
            },
            "pdf": null
          },
          "showAs": "Youth Services"
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I am not aware of plans to establish a youth Senator position, so cannot advise the Deputy on when one might be established. Nor can I comment on the content of the subject agenda for Dáil Committee meetings as decisions on agendas are matters for the Committees themselves.  My Department has worked to increase engagement with young people in both houses of the Oireachtas. This happens through the bi-annual Dail na nÓg  or youth parliament, where representatives from the Comhairle na nÓg (local youth councils) come together to debate issues of importance to young people. Dáil na nÓg 2024 took place in Leinster House, where we hope that it will find a permanent home.   Another occasion for youth engagement arose in 2022, when the Senate hosted the first sitting of Seanad na nÓg.  Young people representing Comhairle na nÓg, An Gaisce and the Joint Award Initiative in Northern Ireland came together to share and debate  their  ideas for improving the lives of all young people, including those from minority and disadvantaged backgrounds.  My Department will continue to build these established relationships, bringing young people into the heart of national level decision making structures, and implementing their right to have their voices heard. ",
        "date": "2025-04-29"
      },
      "contextDate": "2025-04-29"
    },
    {
      "contextDate": "2025-03-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-27/writtens/mul@/dbsect_96.xml"
            }
          },
          "debateSectionId": "dbsect_96",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-27/writtens/dbsect_96",
          "showAs": "Education and Training Boards"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-27/pq_70",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 70,
        "showAs": " 70. Deputy Gillian Toole asked the Minister for Further and Higher Education, Research, Innovation and Science the timeline for the single phase delivery of Dunboyne College of Further Education and Training, County Meath, serving six counties, based on the February 2022 commitment of the then-Minister. [14512/25] ",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I can advise the Deputy that Louth Meath ETB (LMETB) have been supported by SOLAS in developing their Preliminary Business Case (PBC) proposal for Dunboyne under the FET College of the Future Major Projects fund. The development of a robust PBC is fundamental to the requirements of the Infrastructure Guidelines.  The proposal put forward by LMETB relates to the development of a new fit for purpose facility on a green field site in Dunboyne, to replace the existing rented accommodation. It is one of twelve projects that are currently being progressed under this fund.  I understand that LMETB have now submitted their PBC proposal to SOLAS for evaluation, which is targeted to take place in early April. Following evaluation, PBCs which meet the relevant criteria will progress to the next stage of development as part of the Pre-tender – Project Design, Planning and Procurement Strategy Stage in line with the Infrastructure Guidelines.  My department and I remain committed to delivering these key projects for the sector which will deliver state of the art facilities to meet the needs of our learners and teaching staff in Meath and across the region. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-03-27",
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        }
      }
    },
    {
      "contextDate": "2025-03-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-27/writtens/mul@/dbsect_113.xml"
            }
          },
          "debateSectionId": "dbsect_113",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-27/writtens/dbsect_113",
          "showAs": "Renewable Energy Generation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-27/pq_99",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 99,
        "showAs": " 99. Deputy Gillian Toole asked the Minister for Rural and Community Development what forward planning and communication occurs intra- and inter-departmentally for balanced integration of renewable energy projects within rural areas, such projects having wide ranging effects on rural and community life and development. [14525/25] ",
        "answerText": " Minister for Rural and Community Development  Responsibility for policy and planning of renewable energy projects is a matter for the Department of the Environment, Climate and Communications. Indeed, I am informed that that Department recently ran a public consultation process on the operation of community benefit funds under the renewable electricity support scheme. That consultation sought views with regard to how local communities benefit from renewable energy projects, providing the public with an opportunity to input on how they see such a scheme providing the most benefit to communities. There are a number of actions within Our Rural Future relating to maximizing the potential of renewable energy generation for rural and coastal communities. This is an area of significant potential for rural areas in the context of both climate change and increasing energy costs. While these actions are the responsibility of the Department of the Environment, Climate and Communications, officials within my Department engage with officials from that Department through the regular reporting on implementation of Our Rural Future .  The process of developing a successor to Our Rural Future will include extensive engagement with other Departments, including in relation to the role of renewable energy for the rural economy and communities. I would also note that significant decisions with regard to energy infrastructure would be discussed at Government. This provides me, along with other Ministers, the opportunity to ensure the impact of any proposed decisions on rural communities are fully considered. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-03-27",
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        }
      }
    },
    {
      "contextDate": "2025-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-05/writtens/mul@/dbsect_54.xml"
            }
          },
          "debateSectionId": "dbsect_54",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-05/writtens/dbsect_54",
          "showAs": "Airport Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-05/pq_23",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 23,
        "showAs": " 23. Deputy Gillian Toole asked the Minister for Transport if he will outline the contents of a report from a company (details supplied) to the Dublin Airport Authority April 2024 on the possibility of re-designing flight paths from the north runway Dublin Airport [9900/25] ",
        "answerText": " Minister for Transport  As the Deputy will be aware, daa has the statutory responsibility to operate, manage and develop Dublin Airport, including the operation of flight paths arising from the use of the North Runway. I am aware that following the opening of the North Runway, an issue regarding the runway’s departure flightpaths was identified which resulted in some local communities being unexpectedly overflown. When this issue was identified, I understand that the daa advised local communities and elected representatives that they had commenced a review with the aim of resolving the issue. When the review was complete, daa reverted to these stakeholders advising that the current Standard Instrument Departures (SIDs) would be updated, resulting in flightpaths aligning more closely with those previously consulted on and used as part of the planning process.All flight paths at Dublin Airport are governed by international safety standards and as such the revised SIDs required regulatory review and approval before being implemented. daa in conjunction with the IAA Air Navigation Service Provider function (transferred to AirNav Ireland on 1 May 2023) submitted a revised departure process to the IAA Safety Regulation Division for the required safety assessment which was subsequently approved. The new flightpaths became operational on 23 February 2023. DAA advise that they continue to work closely with local communities, including the North Runway Technical Group, regarding any issues they are facing as a result of operations at Dublin Airport. As the matter raised in your question falls within the remit of daa, I have forwarded your question to daa for direct response. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-03-05",
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        }
      }
    },
    {
      "contextDate": "2025-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-05/writtens/mul@/dbsect_55.xml"
            }
          },
          "debateSectionId": "dbsect_55",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-05/writtens/dbsect_55",
          "showAs": "Bus Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-05/pq_24",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 24,
        "showAs": " 24. Deputy Gillian Toole asked the Minister for Transport when the National Transport Authority will allocate funding for a link bus from Ratoath County Meath to the M3 Parkway train station, thereby reducing commuter carbon emissions and improving commuter quality of life. [9901/25] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators. In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-03-05",
        "by": {
          "showAs": "Gillian Toole",
          "memberCode": "Gillian-Toole.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gillian-Toole.D.2024-11-29"
        }
      }
    }
  ]
}