{
  "head": {
    "counts": {
      "questionCount": 162,
      "resultCount": 162
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Education and Youth  The School Completion Programme(SCP) is a key support under my departments Delivering Equality of Opportunity in School programme (DEIS). SCP is an integral part of the DEIS plan and will continue to play a critical role in supporting children of school going age to stay in school for longer and to tackle rising rates of absenteeism.  Access to SCP is available to DEIS Post Primary, DEIS Urban Band 1 primary and DEIS Urban Band 2 primary schools.  The school referred to by the Deputy is a Rural DEIS primary school.  Rural DEIS primary schools do not currently have access to the SCP, however the DEIS programme and associated allocation model does provide additional resources to primary schools classified as DEIS rural schools, albeit at a lower level. Amongst other supports, the school in question benefits from additional funding in the form of a DEIS grant and can use this funding to mitigate educational disadvantage in line with the school’s DEIS planning process.  The DEIS programme is targeted at schools with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools are not required to apply for inclusion in the DEIS programme, and the model is applied fairly and equally to all schools. A detailed paper on the refined DEIS identification model is available on gov.ie.  My department is committed to narrowing the performance gap between DEIS and non-DEIS schools and introducing innovative solutions to address disadvantage. A new DEIS Strategy will be published in early 2026. The new DEIS Strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling educational disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data. The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy, which my department intends to publish in early 2026. Any future expansion of the DEIS programme and inclusion in the DEIS Plus scheme will be considered with the context of the new DEIS Strategy and the availability of resources.  It is my intention that this work will strengthen the greater integration of the supports provided to address educational disadvantage and will support those children and young people most at risk of early school leaving. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 388. Deputy George Lawlor asked the Minister for Education and Youth the reason a school that meets all of the nationally established criteria for inclusion in a School Completion Programme (SCP) cluster (details supplied) continues to be excluded from an SCP cluster; the process by which such schools can be admitted to an existing SCP cluster; the reason that schools with demonstrably high levels of need are repeatedly overlooked, resulting in the withholding of essential educational and attendance supports from some of the State's most disadvantaged children; and if she will make a statement on the matter. [69129/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_348",
          "debateSectionId": "dbsect_348",
          "showAs": "Education Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_348.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_388",
        "questionNumber": 388
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Tackling education disadvantage and helping students reach their full potential is a key priority for the Minister for Education and Youth . The DEIS programme is a key policy initiative of Government to address concentrated educational disadvantage at school level. It is a goal of this Government to reduce educational disadvantage and promote equity across Irish schools, focusing particularly on vulnerable groups including children from lower socio-economic backgrounds, children living in homelessness, Travellers, and Roma and migrant communities.  The DEIS programme is targeted at schools with the highest levels of concentrated disadvantage. Schools that were included in the most recent expansion of the programme in 2022 were those with the highest levels of concentrated disadvantage as identified through the refined DEIS identification model. Schools were not required to apply for inclusion in the DEIS programme and the model was applied fairly and equally to all schools. A detailed paper on the refined DEIS identification model is available on gov.ie.  Schools were identified for inclusion in the DEIS programme based on their standardised disadvantage score. Schools with the highest levels of concentrated disadvantage are included in the DEIS programme, with those urban primary schools having the very highest levels of disadvantage being assigned to Urban Band 1.  The Minister is committed to addressing the gap between DEIS and non-DEIS schools. A new DEIS Strategy will be published in early 2026. This strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling education disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  Any future expansion of the DEIS programme and overall allocation of resources will be considered within the context of the new DEIS Strategy which will published in early 2026. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 429. Deputy George Lawlor asked the Minister for Education and Youth if she will consider changing the DEIS status of a school (details supplied), from DEIS Rural to DEIS Band 1 status; and if she will make a statement on the matter. [69947/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_382",
          "debateSectionId": "dbsect_382",
          "showAs": "Disadvantaged Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_382.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_429",
        "questionNumber": 429
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a weekly allowance paid to people with a specified disability who are aged 16 or over and under the age of 66. This disability must be expected to last for at least one year and the allowance is subject to a medical assessment, means test and habitual residency conditions  I confirm that my Department received an application for DA from the person concerned on 03 September 2025. The processing time for individual DA claims may vary in accordance with their relative complexity in terms of the three main qualifying criteria, the person’s circumstances and the information they provide in support of their claim.  The person concerned was contacted to supply additional supporting documentation to determine his eligibility for DA on10 September 2025. A response was received on 18 September 2025. Their application was then referred to a Social Welfare Inspector for a report on the person’s means and circumstances.  This application, based upon all the evidence submitted, was refused on medical grounds as the person concerned was not considered substantially restricted in taking up employment. The application was also determined to have not satisfied the habitual residency conditions.  The person concerned was notified in writing of this decision on 05 December 2025 and was also notified of their right to request a review of this decision or to appeal it to the Social Welfare Appeals Office.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 572. Deputy George Lawlor asked the Minister for Social Protection when a decision will be made on a disability allowance payment application for a person (details supplied); and if he will make a statement on the matter. [70131/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_490",
          "debateSectionId": "dbsect_490",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_490.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_572",
        "questionNumber": 572
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  As outlined in the Programme for Government, the Government believes that culture and the arts are essential to a well-rounded society, providing opportunities for education, expression and community engagement.  A network of cultural infrastructure exists throughout the country, with the majority in the ownership of local authorities. Annual support, including programming and revenue supports, is provided to this arts and culture infrastructure by local authorities and the Arts Council. My Department focuses on providing capital grant funding to assist development and to maintain these arts and cultural facilities.  Cultural capital funding available at present in my Department includes Stream E of the Cultural Capital Scheme, where grants of up to €20,000 are available to not-for-profit dedicated arts and culture organisations at 85% grant funding rate. Larger grants of up to €50,000 are provided under Stream E at a maximum grant funding rate of 70%. Local authority owned facilities are subject to a maximum 60% grant funding rate.  This is a rolling scheme that is demand led and full details are available on my Department’s website.  Another cultural capital funding scheme available from my Department is the €6 million pilot Artist Workspaces Scheme which was launched in June 2024. Under this scheme, local authorities are invited to propose projects which enable them to provide additional artist workspaces in their regions on a sustainable basis and produce workspaces that are fit for purpose, design focused, and accessible. Funding of up to €300,000 is available for densely populated local authority areas and €150,000 for other local authorities.  As the Deputy may be aware, in Budget 2026 my Department was allocated €6m for a new programme of capital funding for arts and culture organisations across the country, in line with the commitment in the Programme for Government. This will see much needed capital supports for communities, including funding essential equipment for organisations such as amateur drama groups and musical societies.  My Department is in the process of designing the specifications of the scheme, including the setting of eligibility criteria. This will need the approval of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation before it is formally launched. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 306. Deputy George Lawlor asked the Minister for Culture, Communications and Sport if he intends to provide capital funding to long established arts centres that require capital works and structural repairs to their buildings or to improve accessibility or improve amenities for patrons; and if he will make a statement on the matter. [67667/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_283",
          "debateSectionId": "dbsect_283",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_283.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_306",
        "questionNumber": 306
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The person concerned reached pension age on 16 July 2013. There is no record of receipt of an application for state pension contributory or state pension non-contributory from the person concerned.  Correspondence issued on 19 May 2020 from my Department advising the person concerned that their employment from 1 January 2003 to 30 June 2011 was not insurable under social welfare legislation and that there was nil PRSI liability for this period. The Social Welfare Consolidation Act 2005 (as amended) Schedule 1 Part 2 (1) provides that employment in the service of a spouse or partner is an excepted employment for the payment of PRSI.  The person concerned was also advised that if they did not agree that they were in the employment of their spouse, a sole trader, the case could be referred to a Social Welfare Inspector to be investigated as a business partnership. It is still open to them to request this.  It is also open to the spouse of the person concerned to apply for a qualified adult increase on their state pension contributory pension for the person concerned. The increase for a qualified adult is a means tested payment based on the means of the qualified adult.  Alternatively, the person concerned could apply for the State Pension non-contributory which is a means-tested payment (based on their share of household means) with a maximum payment of 95% of the State Pension (contributory). The quickest way to apply is online at MyWelfare.ie if the person has a verified MyGovID account.  I have arranged for application forms for a qualified adult increase on State pension contributory and the state pension non-contributory to be sent to the person concerned.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 374. Deputy George Lawlor asked the Minister for Social Protection if he will arrange for a definitive answer to be provided to a person (details supplied) who has been in touch with his Department over the past several months seeking to determine her eligibility for a State pension (contributory); and if he will make a statement on the matter. [67665/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_336",
          "debateSectionId": "dbsect_336",
          "showAs": "State Pensions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_336.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_374",
        "questionNumber": 374
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 201. Deputy George Lawlor asked the Minister for Transport the number of each category of bus ticket that was sold for Bus Éireann route Number 2, Dublin to Wexford in 2024 and to date in 2025, in tabular form; and if he will make a statement on the matter. [65400/25] ",
        "debateSection": {
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_211",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_211",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_211.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "questionNumber": 201,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  Further, Bus Éireann's Expressway services, including route 2, is a commercial bus service and responsibility for the operation of the service is a matter for the company. I have, therefore, referred the Deputy's question to Bus Éireann for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_201",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 313. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment the number of WTE staff, by job title and gender, working at Enterprise Ireland offices in Shanghai and Lumpur as of 17 November 2025; and if he will make a statement on the matter. [65398/25] ",
        "debateSection": {
          "showAs": "Enterprise Policy",
          "debateSectionId": "dbsect_307",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_307",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_307.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "questionNumber": 313,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Enterprise Ireland have confirmed that they currently have 6 staff in their Shanghai Office and 1 staff member in their Kuala Lumpur Office, details of which are as follows:     Location    Job Title    Gender      Shanghai    Regional Director    Female      Shanghai    Overseas Manager    Male      Shanghai    Senior Market Adviser    Female      Shanghai    Assistant Market Adviser    Female      Shanghai    International Graduate    Male      Shanghai    International Graduate    Female      Kuala Lumpur    Senior Market Adviser    Female          ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_313",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 314. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment the number of WTE staff, by job title and gender, working at IDA offices in Johannesburg and Tokyo as of 17 November 2025; and if he will make a statement on the matter. [65399/25] ",
        "debateSection": {
          "showAs": "Industrial Development",
          "debateSectionId": "dbsect_309",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_309",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_309.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "questionNumber": 314,
        "answerText": " Minister for Enterprise, Tourism and Employment  My Department continues to place significant importance in promoting Ireland as a destination for Foreign Direct Investment (FDI) and we work alongside IDA Ireland to strengthen Ireland’s business environment and FDI value proposition and to identify and support strategic sectors in line with the IDA's current strategy.  In the first half of the year, there were 179 investments, a 37% increase on the same period last year, that are expected to lead to the creation of over 10,000 jobs. Notably, 52 of these investments were new or first-time investments into the country, while 43 were RD&I projects, reflecting Ireland's growing international reputation as a location for cutting edge innovation.  Global companies at the cutting-edge of their industries continue to select Ireland as their location of choice from which to grow and expand their international business. Stability and access to world class talent, coupled with the country’s position as a strategic hub for technological innovation, are amongst the primary reasons behind corporate decisions to locate here.  IDA Ireland continues to target investments from across the globe through their network of offices and with their Team Ireland colleagues in the Department of Foreign Affairs and Trade, Enterprise Ireland, Tourism Ireland, Bord Bia and Culture Ireland.  In that regard, the table below outlines the number of WTE staff, by job title and gender, based in IDA offices located in Johannesburg and Tokyo as of 17 November 2025.   Johannesburg       Job Title      WTE (Whole-Time Equivalent)      Gender       Pathfinder (not included in IDA headcount)    41%    Female        Tokyo       Job Title      WTE      Gender       Director, Asia Pacific    1    Male      Country Manager    1    Male      Sales & Marketing Executive    1    Male      Office Admin    1    Female      ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_314",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 841. Deputy George Lawlor asked the Minister for Health the number of WTE consultant in emergency medicine and emergency medicine registrars based within the accident and emergency department of Wexford General Hospital in 2023 and to date in 2025, by year, in tabular form; and if she will make a statement on the matter. [65403/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_753",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_753",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_753.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "questionNumber": 841,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_841",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 842. Deputy George Lawlor asked the Minister for Health the number of WTE paediatric occupational therapists posts, that were filled at Enniscorthy primary care centre in 2023 and to date in 2025, by year, by grade, in tabular form; and if she will make a statement on the matter. [65404/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_754",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_754",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_754.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "questionNumber": 842,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_842",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 173,
        "showAs": " 173. Deputy George Lawlor asked the Taoiseach the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; and the number of internal competitions for principal officer grade run by his Department since 2010 [63033/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Taoiseach"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_173",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_133",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_133",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          }
        },
        "answerText": " The Taoiseach  The Department of the Taoiseach prioritises building and sustaining a dynamic,agileand responsive workforce that supports the Taoiseach and the Government; and is aligned to the Department’s Statement of Strategy.  While the Programme for Government dictates our priority work areas and resources are assigned and reallocated to align with those priorities, the Department maintains a constant focus on being a lean, agile organisation by resourcing new and expanding work areas by reallocating existing resources and, only where necessary, recruiting additional staff.  The information requested in respect of the Department of the Taoiseach in the period specified, is set out in the below table:      Principal Officer Positions*      2022      2023      2024      To date 2025       Filled by internal competition    2      1    0    0      Filled by external competition    0    0    1      1      Filled by mobility (including secondment)    0    3      0    1         *Excludes politically appointed staff  In the period from 2010 to date, there were six internal competitions for promotion to Principal Officer in the Department of the Taoiseach.  The National Economic and Social Development Office (NESDO), the only body under the aegis of my Department, had one vacancy at Principal Officer level during the period specified.  This vacancy was filled by external competition in July 2025. NESDO had no internal competitions for Principal Officer grade from 2010 to date. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 192,
        "showAs": " 192. Deputy George Lawlor asked the Minister for Foreign Affairs and Trade the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63025/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Foreign"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_192",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_151",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_151",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_151.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Department of Foreign Affairs and Trade currently employs 33 Principal Officers (POs) including nine POs seconded to this Department to serve in missions abroad.  The table below outlines the number of officers recruited or promoted to fill PO vacancies in this Department across the years 2022 to 2025 from internal and open competitions. There were no PO roles filled via mobility during the period outlined.         Internal    Open      2022    2    0      2023    0    1      2024    3    0      2025    1    0       Total      6      1      Since 2010, the Department of Foreign Affairs and Trade has completed six internal PO competitions and one open competition for a fixed term contract at PO level. In addition, an open competition for a permanent role at PO level is currently underway. The Department also recruits for a number of roles equivalent to PO such as Counsellor, Legal Counsellor and Development Specialist Counsellor.  The Department of Foreign Affairs and Trade continues to work with Publicjobs on ensuring an adequate pipeline of staff across all grades. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 206,
        "showAs": " 206. Deputy George Lawlor asked the Minister for Climate, Energy and the Environment the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63019/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_206",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_165",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_165",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_165.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Climate, Energy and the Environment  I can confirm to the Deputy the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in my Department. The number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; and the number of internal competitions for principal officer grade run by my Department since 2020 is as set out in the attached tables.  Please note it is my Department's policy to provide information for the previous and current Dáil terms only.  There are 12 State bodies under the aegis of my Department. The information sought in the Question is an operational matter for each of the State bodies concerned and, as such, it is not information held by my Department. It is suggested that the Deputy contact the Bodies directly in relation to this matter. Contact details for each body is set out in the attached document.     List of Agencies under the aegis of Department of Climate, Energy and the Environemnt.    Email      Bord na Móna    Oireachtas@bnm.ie      CRU    oireachtas@cru.ie      EirGrid    oireachtas@eirgrid.ie      EPA    oireachtasqueries@epa.ie      ESB    Oireachtas@esb.ie      IFI    oireachtas@fisheriesireland.ie      INPC    enquiries@nora.ie      Loughs Agency    oireachtasqueries@loughs-agency.org      MARA    oireachtas@mara.gov.ie      Mining Board    GSPD@decc.gov.ie      NORA    enquiries@nora.ie      SEAI    oireachtas@seai.ie           Year      Vacancies      Filled      External      Internal        2022     15    15    8    7       2023     8    8    7    1       2024     22    22    17    5       2025     11    11    4    7     Mobility (Internal & External)      Year            2022     3       2023     5       2024     2       2025     1     The number of internal competitions for principal officer grade run by my Department since 2020 is 2. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 231,
        "showAs": " 231. Deputy George Lawlor asked the Minister for Defence the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63021/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Defence"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_231",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_184",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_184",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_184.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Defence  There are three bodies under the aegis of my Department; the Army Pensions Board, established under the Army Pensions Act 1927,  the Ombudsman for the Defence Forces (ODF), established pursuant to the provisions of the Ombudsman (Defence Forces) Act 2004 and the External Oversight Body of the Defence Forces (EOB), which was placed on a Statutory basis on 1 December 2024. The staffing of these bodies is included in the information set out below.  A total of 23 vacancies arose at Principal Officer level between 2022 and to date in 2025 from replacement of officers who left the Department and new positions.  13 of the vacancies were filled following various internal competitions and the remainder through external methods, seven positions were filled through advertised mobility and three on assignment from the Public Appointments Service.  A total of 15 internal competitions were held since 2010 for various positions at principal officer grade.  The Department subscribes fully to the implementation of the Commission for Public Service Appointments’ Codes of Practice when administering internal competitions. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 271,
        "showAs": " 271. Deputy George Lawlor asked the Minister for Transport the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63034/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_271",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_218",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_218",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_218.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  The number of Principal Officer level vacancies including Principal Officer equivalent posts that arose in my department, the numbers filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility are outlined in the table below:       Year    Number of Vacancies    Filled internally    Filled externally    Filled by Mobility      2022    8    1    7    3      2023    10    4    6    1      2024    6    2    4    1      2025 to date    8    5    3    2       My department ran direct competitions in 2024 and 2025 for Principal Officer, Head of Internal Audit and Principal Officer, Head of Finance vacancies. My department has run 5 internal Principal Officer competitions since 2010 in 2015, 2017, 2019, 2021 and 2024.  I have asked the Agencies under my aegis to provide the information directly to the Deputy. If you do not hear back from the Agencies within 10 working days please contact my office. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 352,
        "showAs": " 352. Deputy George Lawlor asked the Minister for Finance the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63024/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Finance"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_352",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_293",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_293",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_293.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Finance (Deputy Paschal Donohoe)    Principal Officer Vacancies at the Department of Finance    I wish to inform the Deputy that a total of 16 vacancies arose in the Department of Finance at Principal Officer level from 2022 to date in 2025.  The table below sets out the number of vacancies filled by internal and external methods. It also sets out the number filled by mobility. Since 2010, 14 internal competitions for promotions to Principal Officer level have been run by the Department.     -     2022      2023      2024      2025 (to date)        Number of vacancies that arose     0    8    6    2       Number of vacancies filled by internal methods     1    5    2    3       Number of vacancies filled by external methods     1    3    1    2       Number of vacancies filled via mobility     0    2    0    2      To Note: The number of vacancies arising each year does not always match the number of vacancies filled for the same year. The reasons for this include time lapses between arising vacancies and filling of those vacancies and the creation of new positions (in addition to vacancies).   The following information relates to the Bodies under the Aegis of the Department.    Principal Officer Vacancies at the Financial Services and Pensions Ombudsman       -     2022      2023      2024      2025 (to date)        Number of vacancies that arose     0    2    0    2       Number of vacancies filled by internal methods     0    0    0    0       Number of vacancies filled by external methods     0    0    2    0       Number of vacancies filled via mobility     0    0    0    0       Principal Officer Vacancies arising at the Irish Fiscal Advisory Council       -     2022      2023*      2024      2025 (to date)*        Number of vacancies that arose     0    1    0    1       Number of vacancies filled by internal methods     0    1    0    0       Number of vacancies filled by external methods     0    0    0    1       Number of vacancies filled via mobility     0    0    0    0     * The vacancies created in 2023 and 2025 both arose due to a principal officer going on secondment to another body. As a result, both of these vacancies were temporary, rather than permanent positions. In both cases, the successful candidate was an internal candidate.     Principal Officer Vacancies at the Office of the Comptroller and Auditor General       -     2022      2023      2024      2025 (to date)        Number of vacancies that arose     1    2    0    0       Number of vacancies filled by internal methods     0    0    0    0       Number of vacancies filled by external methods     1    2    0    0       Number of vacancies filled via mobility     0    0    0    0       Office of the Revenue Commissioners    I am advised by Revenue that in the period from January 2022 to date, there were 81 Revenue appointments to posts in the Principal Officer grade. This comprised 13 appointments from Publicjobs or Revenue open competitions; 22 from mobility; and 46 from internal promotion competitions. Furthermore, Revenue has run 22 internal PO competitions from 2010 to-date.    Principal Officer Vacancies at the Office of the Revenue Commissioners       -     2022      2023      2024      2025 (to date)        Number of vacancies that arose     28    21*    19    18       Number of vacancies filled by internal methods     14    9    9    14       Number of vacancies filled by external methods     10    1    2    0       Number of vacancies filled via mobility     4    8    8    2     * 3 vacancies not filled in this year    Principal Officer Vacancies at the Office of the Tax Appeals Commission       -     2022      2023      2024      2025 (to date)        Number of vacancies that arose     1    0    0    0       Number of vacancies filled by internal methods*     1    0    0    0       Number of vacancies filled by external methods     0    0    0    0       Number of vacancies filled via mobility     0    0    0    0     * The Tax Appeals Commission has organised one internal competition for the Principal Officer grade since its inception in 2016.  This PQ is not relevant to the remaining Bodies under the Aegis. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 379,
        "showAs": " 379. Deputy George Lawlor asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63030/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_379",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_320",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_320",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_320.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The information requested by the Deputy is set out in the tables below.   Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation       Year      No. of Vacancies (PO Level)      No. of vacancies filled with internal methods (PO Level)      No. of vacancies filled with external methods   (PO Level)     No. filled by mobility (PO Level)       2022    9    6    3    0      2023    11    3    7    1      2024    6    5    1    0      2025 (to date)    9    3    3    1       In addition to the above, I wish to advise the Deputy that 10 internal competitions for Principal Officer have been run by this Department since 2010.   Public Appointments Service           Year      No. of Vacancies (PO Level)      No. of vacancies filled with internal methods (PO Level)      No. of vacancies filled with external methods   (PO Level)     No. filled by mobility (PO Level)       2022    0    0    0    0      2023    2    1    1    0      2024    0    0    0    0      2025 (to date)    0    0    0    0          State Laboratory         Year      No. of Vacancies (PO Level)      No. of vacancies filled with internal methods (PO Level)      No. of vacancies filled with external methods   (PO Level)     No. filled by mobility (PO Level)       2022    0    0    0    0      2023    0    0    0    0      2024    1    0    0    0      2025 (to date)    0    0    1    0            Office of the Ombudsman         Year      No. of Vacancies    (PO Level)      No. of vacancies filled with internal methods    (PO Level)      No. of vacancies filled with external methods   (PO Level)     No. filled by mobility    (PO Level)       2022    1    1    0    0      2023    2    0    2    0      2024    3    0    2    1      2025 (to date)    1    1    0    0            Office of the Regulator of the National Lottery         Year      No. of Vacancies    (PO Level)      No. of vacancies filled with internal methods    (PO Level)      No. of vacancies filled with external methods   (PO Level)     No. filled by mobility    (PO Level)       2022    0    0    0    0      2023    0    0    0    0      2024    0    0    0    0      2025 (to date)    1    0    1    0        National Shared Services Office         Year      No. of Vacancies    (PO Level)      No. of vacancies filled with internal methods    (PO Level)      No. of vacancies filled with external methods   (PO Level)     No. filled by mobility    (PO Level)       2022    4    0    2    1      2023    5    0    1    1      2024    5    0    3    0      2025 (to date)    3    1    0    0        Office of Public Works         Year      No. of Vacancies    (PO Level)      No. of vacancies filled with internal methods (PO Level)      No. of vacancies filled with external methods   (PO Level)     No. filled by mobility    (PO Level)       2022    7    4    3    0      2023    7    2    4    1      2024    2    0    2    0      2025 (to date)    4    0    3    1      ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 407,
        "showAs": " 407. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63023/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_407",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_343",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_343",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Enterprise, Tourism and Employment  The detail in relation to the number of vacancies at Principal Officer Level in my Department and the Agencies under its remit in the years 2022, 2023, 2024 and to date in 2025 is set out below in a series of tables.  Vacancies at Principal Officer Level in my Department       2022    2023    2024    2025      12    13    15    15     Vacancies at Principal Officer/Equivalent Level in Agencies under remit of DETE       Agency    2022    2023    2024    2025      Competition and Consumer Protection Commission    2    5    3    4      Corporate Enforcement Authority    2    1    2    1      Enterprise Ireland    7    2    7    9      Fáilte Ireland    1    7    2    3      Health and Safety Authority    4    0    3    1      Irish Auditing & Accounting Supervisory Authority    1    0    3    0      IDA Ireland    2    2    2    0      Injuries Resolution Board    0    0    1    0      National Standards Authority of Ireland    11    11    10    4     Methods used to fill Principal Officer vacancies in my Department        Method    2022    2023    2024    2025      Internal    8    10    12    8      External    2    1    3    4      Mobility    2    2    0    3     Number of internal competitions for Principal Officer run by my Department since 2010       2010    1      2011    0      2012    0      2013    0      2014    1      2015    0      2016    0      2017    1      2018    0      2019    1      2020    0      2021    0      2022    1      2023    1      2024    0      2025    0      ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 444,
        "showAs": " 444. Deputy George Lawlor asked the Minister for Education and Youth the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in her Department and agencies under the aegis of her Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by her Department since 2010; and if she will make a statement on the matter. [63022/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_444",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_374",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_374",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_374.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth (Deputy Helen McEntee)  There have been five internal competitions for Principal Officer grade since 2010. The number of vacancies filled from 2022 to 2025 (year to date) is tabulated below.     -    2022    2023    2024    2025      Internal Promotion    4    2    0    6      Mobility    2    1    2    2      Externally Filled*    7    6    5    2       Total      13      9      7      10      * By open and interdepartmental competitions run by the Public Appointments Service ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 520,
        "showAs": " 520. Deputy George Lawlor asked the Minister for Culture, Communications and Sport the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63020/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_520",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_432",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_432",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_432.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Culture, Communications and Sport  The Department of Culture, Communications and Sport was established in its current configuration on 01 June 2025.  The number of vacancies at Principal Officer level since 1 June 2025 is six.  Of these, two were new posts to assist with the Department’s preparations for the Presidency of the EU, in Dublin and Brussels. Both posts were filled internally by competition in the Principal Officer grade.  Additionally, an internal competition is currently underway for Acting Up to Principal Officer to fill one vacancy.  Two further vacancies were advertised via Civil Service Mobility with one position filled to date.  The recruitment method for the one remaining vacancy is currently under consideration.  The details of vacancies, recruitment method to fill the vacancies and status are set out in tabular form as follows:      Vacancies at Principal Officer Grade      Recruitment Method      Current Position       Corporate Division EU Presidency Role Brussels (New Post)    Internal Competition    Position Filled      Corporate Division EU Presidency Role Dublin (New Post)    Internal Competition    Position Filled      Communications Division (Lateral Transfer)    Internal Competition    Process Underway      Sports Division (Retirement)    Civil Service Mobility    Position Filled      Communications Division (Vacant on transfer of functions)    Civil Service Mobility    Process Underway      Culture Division (Lateral Transfer)    To be confirmed    Vacant     With regard to staffing in bodies under the aegis of my Department, the information sought by the Deputy is an operational matter for those bodies and not something for which I have direct day-to-day responsibility. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 566,
        "showAs": " 566. Deputy George Lawlor asked the Minister for Housing, Local Government and Heritage the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63028/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_566",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_468",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_468",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_468.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Given the scale and diversity of functions and priorities, my Department does not maintain a fixed list of vacancies. According as posts are vacated, these are assessed against overall demand for resources meaning that the allocation of staffing is always directed towards the most critical areas. My Department keeps staffing matters under constant review in order to ensure that priority posts are filled in a timely manner and that resource allocations are balanced across the Department to meet key priorities as necessary. This approach is particularly important for roles as senior as that of Principal Officer. Priority posts are filled using the most suitable and available mechanism, and we must also have regard to officers on secondment or assignment to other bodies.  There have been 5 internal promotion competitions for the role of Principal Officer in my Department since 2010. Once established, an internal panel generally remains active for two years, or whenever the panel is exhausted.  I have listed the number of Principal Officer assignments made in the years since 2022 in the table below.      Year      Internal Competition      Open Competition      Mobility        2022      2      4      3        2023      0      2      5        2024      0      1      2        2025      0      1      3        Total      2      8      13      The details requested in relation to bodies under the aegis of my Department are a matter for the individual bodies concerned. Arrangements have been put in place by each Agency to facilitate the provision of information by State Bodies directly to members of the Oireachtas. The contact email addresses for each agency are set out in the table below:      Bodies under the Aegis of DHLGH      Oireachtas email       An Coimisiún Pleanála    oireachtasqueries@pleanala.ie      An Fóram Uisce    oireachtas@nationalwaterforum.ie      Approved Housing Bodies Regulatory Authority    oireachtasqueries@ahbregulator.ie      Construction Industry Register Ireland    info@ciri.ie      Docklands Oversight and Consultative Forum    infodocklands@dublincity.ie      Gas Networks Ireland    oireachtas@gasnetworks.ie      Heritage Council    oireachtas@heritagecouncil.ie      Housing and Sustainable Communities Agency    Oireachtas@housingagency.ie      Housing Finance Agency    oireachtas.enquiries@hfa.ie      Land Development Agency    oireachtas@lda.ie      Local Government Management Agency    oireachtasmemberqueries@lgma.ie      National Oversight and Audit Commission    oireachtas@noac.ie      National Traveller Accommodation Consultative Committee    ntacc@housing.gov.ie      Office of the Planning Regulator    oireachtas@opr.ie      Property Services Appeal Board    psabsecretary@psab.ie      Property Services Regulatory Authority    pq@psr.ie      Pyrite Resolution Board    oireachtasinfo@pyriteboard.ie      Residential Tenancies Board    OireachtasMembersQueries@rtb.ie      Tailte Éireann    Oireachtas@tailte.ie      Uisce Éireann    oireachtasmembers@water.ie      Valuation Tribunal    oireachtas@valuationtribunal.ie      Waterways Ireland    oireachtas@waterwaysireland.org      ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 707,
        "showAs": " 707. Deputy George Lawlor asked the Minister for Social Protection the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63032/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_707",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_556",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_556",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_556.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection  Please see below a table detailing Principal vacancies filled by year since 2022 in the Department of Social Protection by internal promotion, open competitions and civil service mobility. A number of lateral moves also took place within DSP that are not included in the figures below.      Year      Internal      Open      Mobility       2022    2    3    2      2023    8    3          2024    5    2    1      2025    2    1         An internal Head of Internal Audit competition at Principal level was held in DSP in 2017. In 2010, 2011, 2015, 2018, 2019, 2022 and 2024 internal generalist Principal competitions were held.  The Pensions Authority had three Principal vacancies arising in the years 2022, 2023, 2024 and to date in 2025. All these vacancies were advertised externally, therefore all Principal vacancies were filled by external competition. The Pensions Authority is a public sector body and does not have access to the Civil Service mobility scheme. The Authority’s policy is to fill permanent vacancies at Assistant Principal Officer grade and above through open public competition, so no such vacancies were filled by internal competition.  The Citizens Information Bureau filled one Principal vacancy in 2022 and one in 2024 by open competition. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 749,
        "showAs": " 749. Deputy George Lawlor asked the Minister for Justice, Home Affairs and Migration the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63029/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_749",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_597",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_597",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_597.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department has run five internal competitions for the position of Principal Officer since 2010, in the years 2010, 2014, 2018, 2022 and 2024. The breakdown of information requested by the Deputy for my Department is set out in the table below.      Department of Justice, Home Affairs and Migration*      Principal Officer Vacancies (on 1st Jan each year)      Vacancies filled internally      Vacancies filled externally      Vacancies filled by mobility       2022    13    4    8    1      2023    10    0    9    1      2024    3    0    3    0      2025 YTD    27    17    2    1      *Note: Figures supplied include the core Department and agencies in Justice Vote 24. For the time period in question, this includes: the Irish Film Classification Office; Insolvency Service of Ireland, Property Services Regulatory Authority, Legal Services Regulatory Authority, Judicial Council, Gambling Regulatory Authority of Ireland Dublin Coroner's Office, International Protection Appeals Tribunal; Cuan; Office of the Inspector of Prisons; Office of the State Pathologist; Parole Board; Private Security Authority; Probation Service; Forensic Science Ireland, Office of the Independent Examiner of Security Legislation, Criminal Assets Bureau and the Criminal Injuries Compensation Tribunal.   I am informed that the information received from the remaining Vote 24 agencies and the agencies in the Justice Vote Group is presented in the table below.     -     Principal Officer Vacancies      Vacancies filled internally      Vacancies filled externally      Vacancies filled by mobility        An Garda Síochána                       2022    9    2    4    0      2023    8    3    1    0      2024    9    2    1    0      2025 YTD    10    1    5*    0       Courts Service of Ireland                       2022    8    5    1    2      2023    9    7    1    1      2024    6    6    0    0      2025 YTD    5    3    0    1       Data Protection Commission                       2022    9    0    9    0      2023    2    0    2    0      2024    1    3    1    1      2025 YTD    3    1    1    0       Fiosrú**                       2022    1    0    0    0      2023    3    0    2    0      2024    2    0    1    1      2025 YTD    6    4    1    0       Gambling Regulatory Authority of Ireland                       2022    0    0    0    0      2023    0    0    0    0      2024    3    0    3    0      2025 YTD    3    0    2    1       Irish Prison Service                       2022    4    3    1    0      2023    1    1    0    0      2024    2    1    1    0      2025 YTD    2    1    0    1       Judicial Council                       2022    1    0    1    0      2023    0    0    0    0      2024    0    0    0    0      2025 YTD    0    0    0    0       Legal Aid Board                       2022    1    0    1    0      2023    1    0    0    0      2024    1    0    2    0      2025 YTD    2    1    1    0       Policing and Community Safety Authority (Incorporating the Policing Authority)***                       2022    0    0    0    0      2023    1†    0    0    0      2024    1    1    0    0      2025 YTD    1    0    1    0     * 2 to commence before year end  ** Fiosrú was established in April 2025 with a new Vote, replacing the functions of the Garda Síochána Ombudsman Commission  *** The Policing and Community Safety Authority was established in April 2025, incorporating the functions of the Policing Authority and the Garda Inspectorate.  † Position not filled in 2023 ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 850,
        "showAs": " 850. Deputy George Lawlor asked the Minister for Agriculture, Food and the Marine the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63017/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Agriculture"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_850",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_657",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_657",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_657.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is committed to ensuring that a skilled and motivated workforce is in place to meet its priority business needs. To achieve this, workforce planning is utilised in identifying and addressing the needs for all our locations. My Department continues to fill posts through a number of mechanisms, namely the Civil Service Mobility Scheme in addition to advertisements by either Public Jobs or by my Department’s Human Resources Division. To support this, all critical staffing vacancies are filled as soon as possible when suitable candidates become available, taking into account the balance of needs across the Department.  The table below identifies the number of Principal Officer vacancies which arose in each of the years 2022 to date in 2025. There were a total number of 25 Principal Officer vacancies within the period identified.     Principal Officer    2022    2023    2024    2025      Number of Vacancies Identified    5    9    6    5     The table below provides details of the mechanism used to address Principal Officer vacancies filled from 2022 to date. A total of 26 Principal Officer vacancies were filled during this timeframe, which includes one vacancy which arose in 2021 and was addressed in 2022.     Principal Officer    CS Mobility    Internal    External      Method used to fill vacancies 2022 - 2025    1    12    13     My Department has undertaken 10 internal promotion competitions to the grade of Principal Officer since 2010.  The information requested by the Deputy regarding agencies under the aegis of my Department is an operational matter for the public bodies themselves. I have referred this query to the bodies under the aegis of my Department for direct reply. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 908,
        "showAs": " 908. Deputy George Lawlor asked the Minister for Children, Disability and Equality the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in her Department and agencies under the aegis of her Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by her Department since 2010; and if she will make a statement on the matter. [63018/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Children"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_908",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_700",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_700",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_700.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Children, Disability and Equality  I wish to advise the Deputy that my officials have asked the bodies under the aegis of my Department to respond directly to you on this matter in relation to staff of their own organisations.  The below table shows the number of vacancies which arose at Principal Officer level for the years 2022, 2023, 2024 and to date in 2025 in this Department and the method in which they were filled. The number of vacancies include posts that were filled by head to head internal mobility transfers.         Vacancies    Internally Filled    Externally Filled      2022    18    8    10      2023    4    0    4      2024    12    6    6      2025    14    8    5       The numbers presented in the externally filled columns include, 1 position filled via mobility for 2024 and 2 positions filled via mobility for 2025.  Internal competitions for Principal Officer grade were run by the Department in 2013, 2016, 2019 and 2023. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1011,
        "showAs": " 1011. Deputy George Lawlor asked the Minister for Health the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of her Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if she will make a statement on the matter. [63027/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1011",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_796",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_796",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_796.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  There were 7 internal competitions for Generalist Principal Officer grade run by Department of Health since 2010.  I have asked the HSE to reply directly to the Deputy with the vacancy figures related to the HSE for the period of time requested.  Details for other bodies under the aegis of my Department are operational matters for the bodies concerned and the Deputy should contact the relevant Director/CEO/Registrar directly.   Vacancies 2022-2025  ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1171,
        "showAs": " 1171. Deputy George Lawlor asked the Minister for Further and Higher Education, Research, Innovation and Science the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63026/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Further and Higher Education"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1171",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_951",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_951",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_951.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Please note that our department does not hold complete records of staff vacancies for the period 2022–2023, as the HR function was shared with the Department of Education during that time.  The information in respect of state bodies, within the scope of the Deputy’s question, is not held by my department. Contact details for these bodies are set out in the attached document should the Deputy wish to contact them directly with this query.     -         Recruitment Pathway      Recruitment Pathway        Year     Total Vacancies    Mobility    Secondment       2024     7    1    1       2025     10*    3    1       - 5 PO Vacancies for 2024 were carried into 2025  - Following the completion of the Department’s first Internal Promotion to Principal Officer Competition in November 2025, 5 staff members will be appointed to PO by end of November 2025.   PQanswer  ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1181,
        "showAs": " 1181. Deputy George Lawlor asked the Minister for Rural and Community Development and the Gaeltacht the number of vacancies which arose at principal officer level for the years 2022, 2023, 2024 and to date in 2025 in his Department and agencies under the aegis of his Department; the number of these vacancies filled between internal and external methods; the number of vacancies each year at principal officer level filled by mobility; the number of internal competitions for principal officer grade run by his Department since 2010; and if he will make a statement on the matter. [63031/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Rural"
        },
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1181",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_961",
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_961",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_961.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The information sought by the Deputy is set out in the tables below. There are eight agencies under the aegis of my Department: Pobal, Western Development Commission, Charities Regulator, Water Safety Ireland, Údarás na Gaeltachta, Foras na Gaeilge, Oifig an Choimisinéara Teanga and the Ulster-Scots Agency.  The number of internal competitions since 2010 is details in the first row of the final column for each entities, with the other fields in those rows marked N/A. The number for the Department is from 2017 as that is the year the Department was established.     Department of Rural and Community Development and the Gaeltacht    Total Vacancies at PO Level    Number filled Internally    Number filled Externally - Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2017      2022    1    1    0    0    4      2023    3    1    0    2    N/A      2024    3    2    1    0    N/A      2025    2    0    1    1    N/A      Foras na Gaeilge    Total Vacancies at PO Level    Number filled Internally    Number filled Externally - Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    1    0    1    0    0      2023    0    0    0    0    N/A      2024    0    0    0    0    N/A      2025    0    0    0    0    N/A      Údarás na Gaeltachta    Total Vacancies at PO Level    Number filled Internally    Number filled Externally - Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    2    0    2    0    0      2023    0    0    0    0    N/A      2024    1    0    1    0    N/A      2025    2    0    2    0    N/A      Oifig an Choimisinéara Teanga    Total Vacancies at PO Level    Number filled Internally    Number filled Externally - Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    0    0    0    0    0      2023    0    0    0    0    N/A      2024    0    0    0    0    N/A      2025    1    0    1    0    N/A      Water Safety Ireland    Total Vacancies at PO Level    Number filled Internally    Number filled Externally - Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    1    0    1    0    0      2023    0    0    0    0    N/A      2024    0    0    0    0    N/A      2025    0    0    0    0    N/A      Western Development Commission    Total Vacancies at PO Level    Number filled Internally    Number filled Externally -Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    1    1    0    0    3      2023    1    0    1    0    N/A      2024    0    0    0    0    N/A      2025    0    0    0    0    N/A      Pobal    Total Vacancies at PO Level    Number filled Internally    Number filled Externally -Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    1    1    0    0    8      2023    0    0    0    0    N/A      2024    0    0    0    0    N/A      2025    1    0    1    0    N/A      The Ulster Scots Agency    Total Vacancies at PO Level    Number filled Internally    Number filled Externally -Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    0    0    0    0    0      2023    0    0    0    0    N/A      2024    0    0    0    0    N/A      2025    0    0    0    0    N/A      The Charities Regulator    Total Vacancies at PO Level    Number filled Internally    Number filled Externally - Open Competition    Number filled by Mobility    Number of Internal PO Competitions run since 2010      2022    0    0    0    0    0      2023    0    0    0    0    N/A      2024    1    0    1    0    N/A      2025    1 (still vacant)    0    0    0    N/A      ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  On 15 April, Government approved the General Scheme for the Short Term Letting and Tourism (STLT) Bill. This Bill, when enacted, will provide the statutory basis for the introduction of a register for all Short Term Lettings (STLs) in Ireland, to be implemented and managed by Fáilte Ireland from 20 May 2026, ensuring compliance with the new EU Short Term Rental Regulation, which was adopted on 11 April 2024.  The decision by Government to establish a register for short term letting (STL) has been broadly welcomed by the tourism sector.  Fáilte Ireland has estimated that, based on data for September 2025 which has been screen scraped from publicly available STL listings across four major booking platforms, there are c.34,680 STL properties in the State currently being advertised online and up to 65% of these properties are advertised as “entire” houses and apartments. The research points to a 25.1% increase from an estimated 27,720 units listed in September 2022. It is important, in such a fast-growing area, that we have oversight and data on where this growth is happening.  My officials hold regular stakeholder engagement meetings with tourism industry representatives, including the Irish Self Catering Federation who represent individual STL accommodation providers, the Irish Tourism Industry Confederation and the major booking platforms, the most recent on 29 April and 30 June.  These meetings were held to ensure all stakeholders are aware of the new STL registration requirements in advance of their introduction from 20 May next year. Earlier this week, as part of this engagement process officials from my Department, attended and spoke at the Irish Self Catering Federation Annual Conference in County Clare. This engagement provided another opportunity to hear the concerns of individual STL accommodation providers and to provide further clarity on the new regulatory requirements for this sector.  Tourism is an important economic driver that supports one in 10 jobs in Ireland, and I am acutely aware of its importance and the concerns of the tourism industry, in particular short-term letting accommodation providers based throughout rural Ireland.  The STL sector has emerged and developed at a fast pace over the past decade and most (99%) of the Short Term Letting (STL) accommodation providers are not associated with industry representative groups. To ensure all accommodation providers are aware of their obligations from next May, my Department launched a communications campaign on 28 October. This campaign relates to the Short Term Letting and Tourism (STLT) Bill and the establishment of the Short Term Letting (STL) Register, which is my responsibility.  My Department has also developed a webpage where information is easily accessible for the sector and this is available at enterprise.gov.ie/en/what-we-do/the-business-environment/tourism/short-term-letting/. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_243",
        "debateSection": {
          "debateSectionId": "dbsect_253",
          "showAs": "Tourist Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_253",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_253.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 243,
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 243. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment given the heavy reliance in previous consultations with online travel agent platforms, and the limited engagement with the grassroots micro-businesses who will be most impacted, if he will commit to structured, meaningful and time-bound consultation with representative short-term letting host groups; and if he will make a statement on the matter. [62412/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  The EU Short Term Rental (STR) Regulation was adopted by the EU on 11 April 2024 and is applicable from 20 May 2026. This Regulation lays down harmonised rules on the collection and exchange of data on short-term rental services for member states, hosts providing short-term accommodation rental services, and online platforms that offer services to hosts providing short-term accommodation rental services within the EU.  The Department of Enterprise, Tourism and Employment (DETE) has drafted the Short Term Letting and Tourism (STLT) Bill General Scheme in full alignment with the STR Regulation. The introduction of the STLT Bill will provide a more effective legal and administrative basis to regulate short term lettings. This Bill when enacted will provide the statutory basis for the introduction of a register for all Short-Term Lettings in Ireland, which will be implemented and managed by Fáilte Ireland from 20 May 2026.  The introduction of this legislation will have a number of potential impacts for local authorities as well as property owners who engage in Short-Term Letting. These property owners will be required to confirm that they are compliant with planning legislation. Where they are currently not compliant and wish to become compliant, they may seek planning permission from the local authority.  Following the approval received from Government on the 15 April to generally preclude new planning permissions for Short-Term Lets in large towns and cities my Department is working to give effect to this decision. This involves a review of the current Planning Acts with a view to remove references to Rent Pressure Zones in respect of short-term lets.  To ensure that there is a clear view, both at national level and local authority level, as to the overall policy approach to determining planning applications for Short-Term Lets, my Department is currently developing a National Planning Statement (NPS) for the Short-Term Letting sector to supplement and support the introduction of the STLT Bill. It will consider a variety of factors, such as existing planning legislation, the long term housing need in the local authority area, the location of the proposed short term let and balancing housing need with the potential impact on tourism and economic development.     Replies not received from Department for Questions Nos. 300 to 303, inclusive.  ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_299",
        "debateSection": {
          "debateSectionId": "dbsect_300",
          "showAs": "Planning Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_300",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_300.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 299,
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 299. Deputy George Lawlor asked the Minister for Housing, Local Government and Heritage if he will guarantee a realistic grace period, beginning only once planning rules are published and when local authority capacity is in place to ensure that compliant rural businesses are not forced to cease trading or be removed from platforms due to delays outside their control; and if he will make a statement on the matter. [62411/25] "
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1672. Deputy George Lawlor asked the Minister for Health if the service which was provided prior to Covid by opticians and then discontinued, of carrying out eye tests at home for people who are house bound and unable to leave their home, will be re-instated; and if she will make a statement on the matter. [58020/25] ",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1672",
        "questionNumber": 1672,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1439",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1439.xml"
            }
          },
          "debateSectionId": "dbsect_1439"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "answerText": " Minister for Finance  I propose to take Questions Nos. 194 and 197 together.  The Programme for Government has committed to support small and medium enterprises, especially those in the retail and hospitality sectors. The VAT reduction announced in Budget 2026 will apply to food and catering services and to hairdressing services.  The measure will not apply to entertainment such as admissions to cinemas, theatres, museums, fairgrounds, and amusement parks.  The 9% VAT rate already applies to magazines and periodicals and to admission to sports facilities.  It is not proposed to change the scope of the measure at this time. ",
        "by": {
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "memberCode": "George-Lawlor.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "date": "2025-10-16",
        "questionNumber": 197,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_199.xml"
            }
          },
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_197",
        "showAs": " 197. Deputy George Lawlor asked the Minister for Finance if tickets to concerts, shows and performances are included in the cut to VAT rate announced in the Budget 2026; and if he will make a statement on the matter. [56258/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_259",
          "debateSectionId": "dbsect_259"
        },
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Children, Disability and Equality  Government is committed to delivering and enhancing services to better support children with disabilities in Ireland.  The Children’s Disability Grant Fund aims to supplement the work of the Children's Disability Network Teams (CDNTs) by providing supports and services to children and their families who are currently waitlisted for services. To do this, the fund makes available €8 million for 52 organisations, to cover the cost of projects in full between 2025 and 2027.  The HSE has engaged intensively with shortlisted projects around the drawdown of funding and the financial and governance requirements in relation to the delivery of projects. The HSE have advised officials in this Department that they are working to finalise allocation of funding, where the HSE have confirmed recipients meet the grant requirements. Once agreements with applicants have been signed, payments are expected to issue within 7-10 working days.  The status of projects varies with some organisations/groups ready to commence and other organisations yet to confirm they wish to proceed with their project and/or provide required financial and governance documentation.  I am aware that there have been delays with some projects, as the HSE continues to work to support all applicants to complete and provide all required paperwork. I have requested the HSE to provide a detailed update on the project in question and I will respond to the Deputy with further details as soon as possible. ",
        "questionType": "written",
        "showAs": " 270. Deputy George Lawlor asked the Minister for Children, Disability and Equality if she will intervene, with the HSE, to ensure that funds are immediately released for the Wexford Strengthening Children's Disability Services project, which was formally approved by the HSE with a commitment that the initial payment would be processed in October (details supplied); and if she will make a statement on the matter. [55978/25] ",
        "questionNumber": 270,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "George Lawlor",
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_270"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Irish Language",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_775.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_775",
          "debateSectionId": "dbsect_775"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Official Languages (Amendment) Act 2021 has introduced a series of important changes and new measures as part of the overall ecosystem that the Act seeks to develop towards a fully bilingual public service.  One such measure relates to the correct recording and use by public bodies of names, addresses and titles in the Irish language, including the use of the síneadh fada (Section 9A) and was inserted into the principal Act in December 2024 by the commencement of Section 5 of the 2021 (Amendment) Act. This provision also includes ensuring that ICT systems used by public bodies are configured to accept same.  This duty is not a direct duty and public bodies must be prescribed for its purposes. Consultation on this prescription is underway in tandem with the drafting of Ministerial guidelines to assist with its implementation.  These guidelines have been prepared in accordance with the Act to provide a practical framework to assist public bodies in fulfilling their new obligations under this and other new sections of the Act (Sections 9A-9D). The guidelines are to issue shortly, once the current consultation phase has been completed.  In further support of this work, a technical working group is to be established under the National Plan for Irish Language Public Services to oversee implementation of this and other technical aspects of the Plan and the Act in general. This group has broad representation from across the public sector, between Government Departments and wider public bodies, with the membership focusing on core services and level of interaction with the public. This Group will act as pioneers in terms of ensuring the Irish language is embedded in various technological developments within participants' own organisations as well as sharing best practice among participating bodies and with the wider public service.  Much innovative work is underway under the Official Languages Acts and as part of same, I have no doubt that the simple act of ensuring that our systems across the public service can correctly capture names, addresses and titles in the Irish language will go a long way in instilling public confidence in that work.  I will continue to work with colleagues across Government to ensure the citizen's right to be addressed in the official language of their choice is reflected in both policy and practice. ",
        "questionType": "written",
        "showAs": " 927. Deputy George Lawlor asked the Minister for Rural and Community Development and the Gaeltacht if his Department has an official policy on the use of the fada in Irish names from official State sources; his views on whether citizens whose names contain a fada should be properly addressed in official communications; and if he will make a statement on the matter. [54917/25] ",
        "questionNumber": 927,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "George Lawlor",
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_927"
      }
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 190. Deputy George Lawlor asked the Minister for Transport the reason that, in the context of double tracking parts of the Rosslare to Dublin rail line, costly tunnelling through Bray Head has been included as part of the proposal; his views on whether more cost-effective ways of double tracking, for example, north of Greystones and south of Greystones as far as Wicklow town, adding a second platform to Wexford O' Hanrahan train station and increasing speeds in south Wicklow, would suffice; and if he will make a statement on the matter. [50880/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_203.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_203",
          "showAs": "Rail Network",
          "debateSectionId": "dbsect_203"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_190",
        "answerText": " Minister for Transport  As the Deputy may be aware, as Minister for Transport I have responsibility for policy and overall funding of public transport in Ireland, including, in conjunction with Iarnród Éireann, in relation to the rail network. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure, including in the Greater Dublin Area (GDA).  The All-Island Strategic Rail Review was undertaken in co-operation with the Department for Infrastructure in Northern Ireland. Following two public consultations, the Review’s Final Report was published in July 2024.  The Review's Final Report sets out 32 strategic recommendations to enhance and expand the rail system in Ireland and Northern Ireland up to 2050, aligning with net carbon zero commitments in both jurisdictions. The recommendations seek to transform the quality of the rail system to the benefit of passengers and wider society on the island, through additional track capacity, electrification, increased speeds, higher service frequencies and new routes.  The Review considered interventions to enable faster and more frequent journeys between Rosslare Europort and Dublin, including adding passing loops, tunnelling through Bray Head, developing a new railway along the M11 corridor, and building a new line for DART services along the N11 corridor. Many of these solutions would be very costly and unlikely to be justifiable as the line would not be expected to support more than one or two trains per hour in each direction. As these interventions were not further assessed under the Review, there was no cost-benefit analysis performed.  You may be aware the DART+ Coastal South project involves an improvement to DART services on the existing DART line south of Dublin city, with the current focus on enhancing services between Bray and Greystones.  In addition, the NTA's GDA Transport Strategy 2022-2042 includes a recommendation to extend the DART service to Wicklow town. I understand this extension can be facilitated through utilising the new battery-electric DART carriages, which are currently undergoing safety testing. The NTA is currently examining this issue with a view to progressing the extension by around 2029, subject to funding and approvals.  Noting the NTA's responsibility in this matter, I have referred the Deputy's questions to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionNumber": 190
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_1",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The EU and the US represents the largest bilateral trading relationship, with €4.4 billion worth of goods and services crossing the Atlantic each day. In the context of this highly important trading relationship, it is clear that imposition of large additional tariffs by the US would significantly affect Ireland’s export base.  At the Government Trade Forum on 2 July, Minister Paschal Donohoe T.D. presented updated modelling from the Department of Finance of the impacts arising from recent trade developments including on tariffs. The Government’s assessment is that the economy remains robust and will continue to grow in the short to medium term, albeit at a slightly slower pace. This modelling will be updated as part of the Government's preparations for Budget 2026.  The Joint Statement on an EU-US Framework Agreement on Reciprocal, Fair and Balanced Trade was published on 21 August. That deal confirms a single, all-inclusive 15% tariff on EU goods, including current Most Favoured Nation (MFN) rate. EU goods will therefore be subject to a 15% ceiling tariff except where the MFN rate is higher. It also provides assurance that the 15% rate will extend to pharmaceuticals and semiconductors. This provides an important shield to Irish exporters that could have been subject to much larger tariffs pending the outcomes of Section 232 US investigations into these sectors.  The Joint Statement also includes lower tariff rate carve outs for aircraft and aircraft parts, automobile and automobile parts, with further carve outs to be determined for certain products in generic pharmaceuticals and chemical precursors. These tariff rates will be at the pre-existing US MFN rate, most of which are zero.  On the import side, the EU will increase market opportunities for US exports by eliminating tariffs on industrial goods imported from the US as well as improving significantly market access in non-sensitive areas for certain seafood, nuts, dairy products, fresh and processed fruits and vegetables, processed foods, grains and planting seeds, soybean oilseeds, pork and bison meat. In general, these tariff reductions will be implemented via product-specific Tariff Rate Quotas (TRQs).  Since the beginning of the negotiations, the Government has been committed to finding a solution that re-establishes stability and predictability in our trading relations with the US. This has been a complex and lengthy process. The Government has welcomed the clarity that the Joint Statement has brought to what has been a turbulent period for Irish companies doing business with the US. Importantly, the Joint Statement leaves the door open for negotiation of further tariff reductions on in the future on products of strategic common interest. The Government will continue to engage with the EU and the US on efforts to expand this list. ",
        "date": "2025-09-24",
        "questionNumber": 1,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_46",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_46.xml"
            }
          },
          "debateSectionId": "dbsect_46",
          "showAs": "Trade Relations"
        },
        "showAs": " 1. Deputy George Lawlor asked the Tánaiste and Minister for Foreign Affairs and Trade the way in which tariffs influence Ireland’s trade relationship with the United States, particularly in terms of exports and imports; and if he will make a statement on the matter. [50737/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_25",
        "answerText": " Minister for Finance  The EU and US have now reached a deal on reciprocal trade. While the imposition of tariffs is, of course, regrettable, this deal represents a more optimal outcome for households and firms than the alternative landscape that would have almost certainly included higher tariffs, scope for retaliation and escalation and ultimately a higher degree of uncertainty.  Having said that, the introduction of tariffs will, of course, weigh on growth in employment over the coming years.  Indeed, my Department and the ESRI published analysis in March which assessed the potential impact of a range of different tariff scenarios. Overall, the paper estimated that the domestic economy would be around 1-2 per cent below the no-tariff baseline over the medium-term depending on the scenario.  The slowdown in domestic growth would be accompanied by lower-than-assumed employment growth, which was estimated to be around 2 to 3 per cent lower compared to a no-tariff baseline. Put differently, the level of employment would be around 55,000 to 85,000 lower compared to a scenario in which tariffs are not introduced over the medium-term. It should be stressed that employment is still expected to expand in these scenarios, but at a slower pace than would otherwise be the case.  My Department will publish updated macroeconomic forecasts alongside the Budget next month, which will inter alia incorporate the estimated impact of the introduction of 15 per cent tariffs on the Irish economy.  Given the more challenging external backdrop, it is even more important that we boost the resilience of the Irish economy. That is why Budget 2026 will focus on investment. This will help maintain competitiveness and boost productivity which is the foundation for long-term improvements in living standards.  Indeed, the Government has already been making significant strides in this regard. In July, Government set out in the National Development Plan its plan to invest in the strategic objectives of energy, water, housing and transport.  More recently, the Taoiseach, the Tánaiste and Minister Burke launched the Government’s Action Plan on Competitiveness and Productivity - a whole-of-Government plan focusing on the domestic drivers of competitiveness.  Last month, the Government launched the Action Plan on Market Diversification which outlines the key areas in which we need to focus our efforts to ensure continued resilience and diversification. Finally, we must continue to build up our fiscal buffers including through transfers to the Future Ireland Fund and the Infrastructure, Climate and Nature Fund. ",
        "date": "2025-09-24",
        "questionNumber": 25,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_66",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_66.xml"
            }
          },
          "debateSectionId": "dbsect_66",
          "showAs": "Trade Relations"
        },
        "showAs": " 25. Deputy George Lawlor asked the Minister for Finance to provide an estimate of the number of jobs in Ireland that may be at risk due to the 15% tariff imposed by the United States on EU goods; the measures being considered to mitigate this impact; and if he will make a statement on the matter. [50735/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Finance",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_48",
        "answerText": " Minister for Enterprise, Tourism and Employment  The Directive on Adequate Minimum Wages in the European Union was published on 19th October 2022 and was transposed in Ireland by 15th November 2024. No new legislation was required for transposition of the collective bargaining elements of the Directive in Ireland due to the existing legal framework in place which provides for collective bargaining.  Under Article 4, the Directive aims to promote collective bargaining on wages in all Member States. Each Member State in which the collective bargaining coverage rate is less than a threshold of 80 % (as in the majority of member states, including Ireland) shall provide for a ‘framework of enabling conditions’ for collective bargaining and shall also establish an Action Plan to promote Collective Bargaining by end of 2025. The Action Plan shall be reviewed at least every five years. The Programme for Government contains the commitment to finalise an action plan on the promotion of collective bargaining by the end of 2025, in line with the Directive. Work on developing the action plan in conjunction with the social partners, through a technical group, is currently ongoing.  The Code of Practice on Duties and Responsibilities of Employee Representatives sets out guidance for employers, employees, and trade unions which should be afforded to shop stewards in order to enable them to carry out their duties in an effective and constructive manner. The Code clearly states that employee representatives should be granted reasonable access to all workplaces where they represent trade union members and where such access is necessary to enable them to carry out their representative functions.  On protection against victimisation, Section 8 of the Industrial Relations Act 2004 outlines that victimising an employee for being or not being a member of a trade union or an excepted body or the employee engaging or not engaging in any activities on behalf of a trade union or an excepted body is illegal. Under Section 9 of the Act, the WRC may direct that the conduct which is the subject of the complaint should cease and make an award of compensation not exceeding 2 years remuneration. The Workplace Relations Commission’s Code of Practice on Victimisation refers to victimisation arising from an employee’s membership or non-membership, activity or non-activity for a trade union or a manager discharging their managerial functions or any other employees. It applies to situations where there are no negotiating arrangements and where collective bargaining has not taken place. A complaint under the Code may be made to the Workplace Relations Commission.  The work of the technical working group, consisting of Department officials and the social partners, will be essential in developing the content of the action plan. The capacity to engage effectively in collective bargaining is also key element of the Directive and the Government hopes to further support the social partners in this area. ",
        "date": "2025-09-24",
        "questionNumber": 48,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_86",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_86.xml"
            }
          },
          "debateSectionId": "dbsect_86",
          "showAs": "Wage-setting Mechanisms"
        },
        "showAs": " 48. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment the actions that have been undertaken to implement the Adequate Minimum Wages Directive and to publish a National Action Plan on the Promotion of Collective Bargaining with respect to increasing collective bargaining coverage, facilitating trade union access to workplaces, and enhancing protection for union activists facing victimisation from their employer; and if he will make a statement on the matter. [50734/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_49",
        "answerText": " Minister for Enterprise, Tourism and Employment  The Programme for Government recognises the rapidly changing geopolitical landscape across the world and the threats and challenges this entails.  The recently published Government Action Plan on Market Diversification represents one strand of a coherent Government response to global economic uncertainty, including the measures being taken to drive competitiveness and productivity and the investment in national infrastructure outlined in the new National Development Plan.  My role and that of my Department in relation to tourism lies primarily in the area of national tourism policy development and implementation of that policy is a matter for the tourism agencies, Fáilte Ireland and Tourism Ireland.  By continuing to support the tourism agencies, the Government seeks to strengthen Ireland’s reputation as a high-quality, accessible destination for both domestic and international visitors. In comparative international terms, Ireland is perceived as a safe, secure and stable travel destination and the warmth of the welcome remains a key strength in the Ireland visitor experience.  Throughout 2025, Tourism Ireland as the agency with responsibility for the overseas marketing of the island of Ireland, is investing in an extensive and targeted programme of activity across 14+ overseas source markets. Its overseas missions will deliver campaigns with a reach of over 1billion, publicity opportunities with a reach of over 1.6billion, and 30,000+ business-to-business meetings for tourism partners overseas in 2025 with a renewed focus on Business Events, luxury travel and adventure travel.  In line with the Action Plan for Market Diversification, Tourism Ireland is focused on supporting new opportunities to support the businesses and communities that depend on overseas tourism. The agency is conscious of the need to diversify from a potential over-reliance on certain markets and in terms of diversification, Tourism Ireland is proposing a number of key focus areas building on the robust current strategy that has driven proven results and grown inbound tourism to the island to €6.9 billion in 2024.  Requests for additional funding for the tourism sector by my Department will take place as part of the normal procedural aspects in the Government Estimates process. ",
        "date": "2025-09-24",
        "questionNumber": 49,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_87",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87",
          "showAs": "Tourism Promotion"
        },
        "showAs": " 49. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment given the ongoing geopolitical instability, if consideration will be given to significantly increasing funding for tourism agencies to enhance their efforts in promoting Ireland as a safe, secure, and stable travel destination on the global stage; and if he will make a statement on the matter. [50736/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_50",
        "answerText": " Minister for Enterprise, Tourism and Employment  Our long-established trade partnerships, forged over many decades, are evolving. At the same time, new markets are emerging, digital technologies are transforming industries and the global demand for sustainable solutions is accelerating.  I recently launched the Government Action Plan on Market Diversification. This Action Plan was the result of extensive collaboration across government and with the relevant State agencies and this collaborative approach proved essential for aligning strategies and leveraging expertise. It is a ‘whole of government’ reassessment of opportunities and what is needed to enable access to new markets.  The Government Action Plan on Market Diversification sets out a path support Ireland’s businesses – large and small – to adapt to the global trading environment by striking out into new and diverse markets while deepening their engagement in existing markets, and expanding where possible and opportunities exist. As a global and open trading economy deeply connected into international supply chains, the Action Plan also serves to mitigate the current risks and bolster our economic resilience.  The Action Plan is a stock-take of the current supports available domestically and internationally for exporting Irish-based companies, while also directing concerted action across Government Departments and State agencies with the shared objective of enhancing Ireland’s trading relationships.  With Enterprise Ireland having announced the Enterprise Ireland Market Research Grant which offers funding of up to €35,000 for companies to assess the full impact of tariffs, gain market insights and develop mitigation strategies.?? They have also announced a New Markets Validation Grant offering funding of up to €150,000 for companies to develop market entry strategies for new markets or new products.  These supports for businesses are very welcome and are part of the efforts to support businesses in diversifying their markets. ",
        "date": "2025-09-24",
        "questionNumber": 50,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_88",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_88.xml"
            }
          },
          "debateSectionId": "dbsect_88",
          "showAs": "Trade Relations"
        },
        "showAs": " 50. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment to outline the Government's long-term strategy to diversify trade partnerships and reduce reliance on any single market in view of the new tariffs; and if he will make a statement on the matter. [50738/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 558. Deputy George Lawlor asked the Minister for Children, Disability and Equality if she intends to allocate funding in the upcoming budget for a team for the south-east region, in line with the Programme for Government commitment to complete the nationwide rollout of community neurorehabilitation teams; and if she will make a statement on the matter. [49963/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_60.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_60",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_60"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_558",
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 37, 89, 522, 558, 559, 560, 562, 563 and 574 together.  The Programme for Government – 'Securing Ireland’s Future’ - includes a commitment for advancing Neuro-Rehabilitation services nationally including the completion of the national rollout of Health Service Executive (HSE) Community Neuro-rehabilitation Teams.  The HSE is leading on the implementation framework in respect of the recommendations of the National Policy and Strategy for the provision of Neuro-Rehabilitation Services in Ireland 2011-2015.  The Neuro-Rehabilitation Strategy Implementation Framework was launched in February 2019. The overarching aim of the Strategy is the development of neuro-rehabilitation services to improve patient outcomes by providing safe, high quality, person-centred neuro-rehabilitation at the lowest appropriate level of complexity. This must be integrated across the care pathway and provided as close to home as possible or in specialist centres where necessary.  The National Neurorehabilitation Strategy and National Clinical Programme for Rehabilitation Medicine outline the need for people who experience impairments resulting from a neurological illness or injury to have access to specialist Neuro-Rehabilitation services through coordinated networks called Managed Clinical Rehabilitation Networks.  The aim is to configure services into population based Managed Clinical Rehabilitation Networks (MCRNs) with the aim being to develop MCRNs around the country.  To support the HSE’s work in delivering on the implementation framework, responsibility for the development of in-patient services lies with the Department of Health, while the Department of Children, Disability and Equality holds responsibility for the development of community neuro-rehabilitation teams.  Community Neuro Rehabilitation Teams (CNRTs) are specialised teams providing specialist neuro-rehabilitation to people with complex needs close to home. They provide a critical link in the care pathway by facilitating early discharge and continuity from both acute and post-acute rehabilitation facilities.  The National Neuro-Rehabilitation Strategy is rolling out CNRTs nationally, underpinned by standardised process and procedures.  The HSE’s 2025 National Service Plan , sets out its commitment to develop Community Neuro-Rehabilitation Teams (CNRTs) in line with the 2019 Neuro-Rehabilitation Implementation Framework and enhance capacity for its implementation nationally, to ensure equity access for those who need it regardless of where they live.  To date, this Government has provided funding for Community Neuro-Rehabilitation Teams (CNRT) in HSE Galway, Roscommon and Mayo, HSE South-West, HSE Dublin South and Wicklow and HSE Dublin South West, South City and West and Kildare West Wicklow. Each team includes 12 Whole Time Equivalents and recruitment is progressing with all four teams currently being onboarded.  In addition to these new teams, there are two CNRTs in existence in HSE Donegal and HSE Mid West that predate the strategy.  Moving forward with the strategy, the intention is to enhance the existing CNRTs, develop CNRT’s in Regional Health Areas (RHAs) where they are currently not yet in place and to create a large population-based Community Neuro-Rehabilitation Team within each RHA, following the implementation of the new Regional Health Areas within Sláintecare.  Consideration of Specialist Disability Services and funding requirements for Budget 2026 is ongoing. The Department of Children, Disability and Equality has been actively engaging with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and the Health Service Executive throughout this process.  Confirmation and further information on funding to be provided will be made public following the announcement of the Budget 2026, later this year.  As Budget 2026 has not yet been announced, confirmation regarding funding for CNRTs in specific regions cannot yet be provided. Following confirmation of 2026 funding, the HSE will publish their 2026 National Service Plan , which will set out expected activity for 2026. ",
        "questionNumber": 558
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 421. Deputy George Lawlor asked the Minister for Enterprise, Tourism and Employment the number of whole-time equivalent, WTE, vacancies, by job title, at the Competition and Consumer Protection Commission; the estimated full-year costs of filling each of those vacancies; the timeframe for filling each of those vacancies, in tabular form; and if he will make a statement on the matter. [48462/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_335.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_335",
          "showAs": "State Bodies",
          "debateSectionId": "dbsect_335"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_421",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Competition and Consumer Protection Commission (CCPC) is the statutory body responsible for enforcing consumer protection and competition law in Ireland.  The CCPC remit continues to expand with recent legislation agreed at EU level designed to further strengthen protections for consumers and fairness in the operation of online markets. This includes the Digital Services Act (DSA), the Digital Markets Act (DMA), as well as the CCPC being designated as the competent authority for the Data Governance Act (DGA) and designated as the market surveillance of certain products and checking the compliance of services under the European Accessibility Act (EAA).  There has been significant additional competition and consumer enforcement powers given to the CCPC by way of legislation such as the Competition Amendment Act which represents the biggest overhaul of competition law in Ireland for a generation. This enhances the ability of the CCPC to tackle cartels, bid rigging in public procurement, anti-competitive practices, and anti-competitive mergers. The Consumer Rights Act 2022 represents the most significant reform of consumer protection law in Ireland in the last 40 years. It updates and strengthens existing Irish consumer law relation to the sale of goods and supply of services, unfair contract terms and consumer information and cancellation rights.  The CCPC’s funding has increased in recent years in light of these additional functions. The CCPC has been allocated €28.447 million for 2025.  As of 11th September 2025, the CCPC had 27 vacancies. The CCPC has informed my officials that it is making significant recruitment efforts, for example 18 of these vacancies are to be filled this year and the remainder in early 2026. Please see below for further details of the vacancies in the Competition and Consumer Protection Commission:      -      Role Title      Timeframe for filling vacancy      Estimated full year cost (incl. PRSI)       1    Deputy Director for Digital Regulation    Q3 2025    €107,453      2    Head of Unit – Accessibility    Q4 2025    €97,892      3    Commission Member    Q1 2026    €202,018      4    Head of Finance    Q3 2025    €103,072      5    Deputy Director    Q4 2025    €107,453      6    Senior Legal Advisor    Q4 2025    €97,892      7    Financial Education Manager    Q4 2025    €70,705      8    Senior Inspector/Investigator    Q4 2025    €70,705      9    Product Safety Executive    Q3 2025    €45,560      10    Product Safety Executive    Q3 2025    €45,560      11    Product Safety Executive    Q3 2025    €45,560      12    Senior Case Handler    Q4 2025    €70,705      13    Deputy Director    Q4 2025    €107,453      14    Financial Education Manager    Q4 2025    €70,705      15    Consumer Protection Executive    Q4 2025    €45,560      16    Consumer Protection Manager    Q4 2025    €70,705      17    Data Regulation Manager    Q4 2025    €70,705      18    Analyst / Investigator    Q4 2025    €45,560      19    Senior Investigator    Q4 2025    €70,705      20    Senior Director    Q1 2026    €152,609      21    Senior Director    Q1 2026    €152,609      22    Deputy Director of Legal Services (Mergers)    Q1 2026    €107,453      23    Financial Education Manager - Content    Q1 2026    €70,705      24    Data Regulation Manager    Q1 2026    €70,705      25    Deputy Director    Q1 2026    €107,453      26    Head of Unit    Q1 2026    €97,892      27    Consumer Contacts Executive    Q1 2026    €45,560      ",
        "questionNumber": 421
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 586. Deputy George Lawlor asked the Minister for Education and Youth to provide a list of all secondary schools in Wexford that are taking part in phase 1 and phase 2 of the attendance initiative, Anseo pilot scheme; and if she will make a statement on the matter. [49251/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_478.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_478",
          "showAs": "School Attendance",
          "debateSectionId": "dbsect_478"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_586",
        "answerText": " Minister for Education and Youth  In May I announced a range of measures to tackle school absenteeism. These measures are a key part of my plan to ensure that every child can achieve their full potential, regardless of their background or their ability. Regular attendance in school is essential not just for academic achievement, but for wellbeing, social development and long-term life outcomes.  One of the initiatives announced In May is 'Anseo', a Multi-Dimensional Multi-Tiered System of Supports approach to addressing School Attendance Problems. Anseo is an evidenced-based model that enables TESS staff to support schools to analyse their data in a tiered and systematic way and which allows schools to shape their response to their schools’ absence issues. The model was piloted in four schools in the 2023/24 school year.  Sixty schools have now been selected to take part in ‘Anseo’ from the start of the current school year. The sixty schools selected include a mixture of DEIS and non DEIS primary, post-primary, urban, rural, and special schools across the country. Included in the sixty schools is one post-primary school from County Wexford - Enniscorthy Community College.  TESS staff will work with the sixty schools throughout the 2025/26 school year, promoting and supporting the implementation of the model which will enable schools to develop effective and appropriate strategies to respond to the drivers of school absenteeism.  It is expected that Anseo will be offered to additional schools in early 2026 and the details of the schools selected will be available over the coming months. ",
        "questionNumber": 586
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 1082. Deputy George Lawlor asked the Minister for Children, Disability and Equality the number of persons under 18 years-of-age who are on an autism assessment waiting list in County Wexford; the length of time on the waiting list in each of the years from 2023 to date in 2025, in tabular form; and if she will make a statement on the matter. [48457/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_894.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_894",
          "showAs": "Disabilities Assessments",
          "debateSectionId": "dbsect_894"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1082",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1082
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 1083. Deputy George Lawlor asked the Minister for Children, Disability and Equality the number of student placements, by discipline offered to children's disability network teams within CHO5 in 2024 and to date in 2025, in tabular form; and if she will make a statement on the matter. [48458/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_895.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_895",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_895"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1083",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1083
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 1264. Deputy George Lawlor asked the Minister for Health the number of consultant ENT surgeons working in the public health service; her plans to expand this number; the international recommended best practice ratio for consultant ENT surgeons to population; the current ratio to population; and if she will make a statement on the matter. [48459/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1072.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1072",
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_1072"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1264",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1264
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 1265. Deputy George Lawlor asked the Minister for Health to provide a breakdown of the number of life-threatening calls that National Ambulance Service attended within 19-minutes in County Wexford in the first eight months of 2025; and if she will make a statement on the matter. [48460/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1073.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1073",
          "showAs": "Ambulance Service",
          "debateSectionId": "dbsect_1073"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1265",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1265
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 1278. Deputy George Lawlor asked the Minister for Health if medical card holders can recoup the cost of private dental work (details supplied); and if she will make a statement on the matter. [48606/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1087.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1087",
          "showAs": "Medical Cards",
          "debateSectionId": "dbsect_1087"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1278",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionNumber": 1278
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 1279. Deputy George Lawlor asked the Minister for Health if medical card holders can recoup the cost of private dental work (details supplied); and if she will make a statement on the matter. [48607/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1088.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1088",
          "showAs": "Dental Services",
          "debateSectionId": "dbsect_1088"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1279",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionNumber": 1279
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "George-Lawlor.D.2024-11-29",
          "showAs": "George Lawlor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/George-Lawlor.D.2024-11-29"
        },
        "showAs": " 1457. Deputy George Lawlor asked the Minister for Rural and Community Development and the Gaeltacht the number of applications for the Clár funding under measure 1 and measure 2 in 2024, and to-date in 2025; and the number of successful applications under each measure, in tabular form; and if he will make a statement on the matter. [48461/25] ",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1254.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1254",
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_1254"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1457",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department's CLÁR programme provides funding under a number of different measures for small-scale infrastructural projects in designated rural areas.  CLÁR Measure 1 funds the development of community facilities and amenities.  CLÁR Measure 2 funds mobility, cancer Care, community first responder and meals on wheels transport.  Details of the number of applications and approvals under both measures in 2024 and 2025 are outlined in the table below. I was pleased to announce funding of €1.7 million for 32 vehicles under Measure 2 of the 2025 programme last Friday. The successful projects under Measure 1 will be announced later in the year.      Measure      Received 2024      Approved 2024      Received 2025      Approved 2025       1    282    264    301    0      2    77    49    53    32      ",
        "questionNumber": 1457
      },
      "contextDate": "2025-09-17"
    }
  ]
}