{
  "head": {
    "counts": {
      "questionCount": 3719,
      "resultCount": 3719
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Thomas Gould  Will the Minister give a commitment to intervene to prevent the closure in mid-January of a homeless prevention service in Cork, and to ensure the service does not cease to provide vital community support to homeless young people through social care work? \n Deputy Norma Foley  I appreciate the Deputy raising this question. I have been informed, and it is my understanding, that the services managed by Tusla's Liberty Street House are not being curtailed. This is the information that has been given to me. Tusla is undertaking a reform programme that will continue to meet the needs of service users of Liberty Street House. The integration of services will mean that the services provided within Liberty Street House will align under the proposed structures of the front door teams. Front door teams are a feature of the new Tusla referral and service user management process that will ensure each referral is assessed and addressed by the appropriate experts. Staff will work as part of multidisciplinary teams to ensure a range of professionals with different skill sets in the area of social work and therapeutic services are available to respond to the needs of children, young people and families in the right way at the right time.  The preventive aspect of work undertaken in the Liberty Street House services will align with family support and safety and welfare structures. All relevant cases in Liberty Street House services will continue to be worked on with the newly aligned networks in 2026. Liberty Street House services provide a domestic violence and abuse support service. Under the reform programme the focus will move towards the impact of domestic violence, particularly on children, bringing in expertise developed in Liberty Street House to the front door teams across networks. Equally, Liberty Street House staff who have a developed skill set in working with teenagers will continue to utilise these skills in their alignment within the front door teams.  Tusla's structural reform will bring opportunities to young people and families that Liberty Street House services work with. It will also deliver an integrative response of early intervention, family support and child welfare. Liberty Street House has responded to these needs in myriad ways since it opened. I appreciate the work done by the team in Liberty Street House on behalf of the State and local government. \n Deputy Thomas Gould  I thank the Minister for the update but the information I have is that Liberty Street House will be out of staff by mid-January and is currently not recruiting. I understand it has not replaced the staff who have left, been redeployed or have retired. I want the Minister to be right, and I hope she is right, in what she has just said here. Liberty Street House has been operating very successfully for the last two decades in providing really vital services for young people who are at risk of homelessness. It is said now that it is being amalgamated with Tusla's front door teams. At one stage Liberty Street House was helping over 200 young people. Maybe the Minister's information is more correct but I am telling her, from the people who work on the ground, that the staff will be gone by mid-January. If the Minister is saying that is not the case, we need clarity on the matter. This is a vital service for young people at risk of homelessness. \n Deputy Norma Foley  I appreciate the Deputy raising this. My information is that the services provided by Liberty Street House are not being curtailed. Indeed, the cases will continue right throughout 2026. The new model of practice is to ensure that all services are available through multidisciplinary teams at the time when they are needed, in the one place at the right time. I am very happy for the Deputy to bring to me any specific information that he might not be in a position to share on the floor of the House. I am very happy to look at that and revert to the Deputy. It is my understanding, as I have said, that the services are not being curtailed. The new vision of service, which I think is a good vision of service, means that when a person presents themselves there is a single opportunity for all of the different supports they might need to be made available at that time from the front door teams. The front door teams approach emphasises the notion that there is no wrong door, that there is a single point of access, and that whatever supports the person requires are presented and available to him or her at that given time. \n Deputy Thomas Gould  I have two worries on foot of the Minister's comments. She is saying that the services are being integrated. Is Liberty Street House being closed down? Liberty Street House provides a service to young people who are at risk of homelessness and who enter homelessness. I am looking for a commitment now that this will not be closed down. The information I have is from people who are in the know. They have told me that no additional staff have been taken on to replace those who have left through retirements and redeployments, and that the few who remain will be gone by the middle or end of January. The Minister talks about integrating services, which sounds great, but I am worried about the children who are not as severely at risk, such as a young person who is at risk of homelessness. A young person who is sleeping on the streets needs intervention, 100%, but there is no point in a young person who is at risk of becoming homeless ending up on the streets too. We need both types of children to be looked after. I am worried, in light of what is being proposed now, that Tusla is going down a different road. We need to save Liberty Street House. \n Deputy Norma Foley  The information that has been given to me is that all the services the Deputy has outlined, which are really important intervention services, are not being curtailed and that all cases will continue into 2026. It is a very valuable service that is being provided. It is important that whatever supports are required within the family structure for individuals, for young people or for older people are available at a given time, at the right time and in the right place. My information is that nothing is being curtailed and that everything is continuing in terms of services in 2026. If there is something different that the Deputy wants to bring to me, I will be more than happy - sincerely - to engage further with him on the matter. I will happily do that with the Deputy at the beginning of the year if that is what he wishes. \n Deputy Thomas Gould  Go raibh maith agat. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 3. Deputy Thomas Gould asked the Minister for Children, Disability and Equality whether she will intervene to prevent the closure of homeless prevention services in an organisation (details supplied) in Cork in mid-January; and to ensure the service does not cease in providing vital community support to homeless young people through social care and work [73584/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_5",
          "debateSectionId": "dbsect_5",
          "showAs": "Homeless Persons Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_5.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_3",
        "questionNumber": 3
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  Respite is a key priority area for the HSE for people with disabilities and their families and we have seen significant investment in respite services, which has impacted positively on the level of service delivered in successive years.  The table at the following link shows Respite Services activity levels from 2019 – 2025:   Respite Services   The level of activity shows that pre COVID-19, the number of Respite Overnights provided by the HSE and its partner Provider Agencies was running at around 158,000 Overnights each year. The delivery of services was significantly impacted by the onset of the pandemic in 2020/21. The number of respite overnights operated at just over 50% of the NSP target for 2020, due mainly to necessary precautions to maintain physical distancing and to adhere to infection prevention and control requirements.  The figures presented above refer to both adults and children and while the HSE does not currently disaggregate respite activity data into separate child and adult profiles, we can say the following from a review conducted from the July 2025, HIQA Register of Designated Centres for Persons with a Disability:  There are 164 respite centres operating throughout the country with a total of 798 respite beds. These comprise of 90 centres with a total of 423 respite beds for Adults, 47 centres with a total of 227 respite beds for Children’s, and 27 centres with a total of 148 respite beds – Mixed (Some centres provide respite for both adults and children on alternating weeks).  Based on the above breakdown, we can extrapolate the approximate proportional split between adult and child respite services as: Adult – 62%; Children – 38%  In this context, the table at the link below shows the approximate number of respite overnights provided to children in the last five years:   Respite Services   Respite can occur in a variety of settings for various lengths of time, depending on the needs of the individual service user and their family or carer, and according to available resources. Respite is not always centre-based and can be provided in a number of ways, e.g. Centre based; In-Home; Home-to-Home; Family Support, etc. As a vital part of the continuum of services for families, respite potentially helps prevent out-of-home full-time residential placements, preserves the family unit, and supports family stability.  Since the pandemic, there has been increased investment in Respite Services that included additional allocation in successive National Service Plans. However, there has also been increased costs due to more stringent infection prevention and control measures and an overall increase complexity of presenting need. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 30. Deputy Thomas Gould asked the Minister for Children, Disability and Equality the number of respite hours provided for children in each of the past five years, respectively, in tabular form, including 2025 to date.  [71673/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_72",
          "debateSectionId": "dbsect_72",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_30",
        "questionNumber": 30
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 59. Deputy Thomas Gould asked the Minister for Children, Disability and Equality the number of publicly funded private assessments of needs delivered in Cork in 2025; and the number delivered publicly. [71672/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_102",
          "debateSectionId": "dbsect_102",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_59",
        "questionNumber": 59
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Minister O'Brien meets with a range of stakeholders on important topics including energy prices. In this regard, I can confirm that he has met with both the Commission for Regulation of Utilities (CRU), which is assigned consumer protection functions under the 1999 Electricity Regulation Act, and energy suppliers since being appointed as Minister.  On 26 September 2025, he met with the four biggest energy suppliers in Ireland - Electric Ireland, Bord Gáis, SSE Airtricity, and Energia. In addition to these meetings, officials from the Department meet with suppliers on a regular basis and a key message to them is the critical importance of prices being reduced as soon as possible.  Following engagement with suppliers, the Minister has received confirmation that hardship funds for those struggling to meet their energy costs will be made available to households this Winter. The hardship funds operate in different ways from supplier to supplier. I would, therefore, encourage customers that are experiencing difficulties paying their bills to engage with their suppliers. I would also highlight that customers engaging with their supplier will not be disconnected.  The CRU has also published enhanced customer protection measures for Winter 2025/2026. For the upcoming Winter period, some of the key customer protection measures that will remain in place include a disconnection moratorium for reasons of non-payment; discounted tariffs for financial hardship meter customers; and promotion by energy suppliers of the vulnerable customer register. This is in addition to the existing sources of support, such as the Fuel Allowance, Household Benefits Package and Additional Needs Payment Scheme operated by the Department of Social Protection.  In June of this year, the Department established a National Energy Affordability Taskforce to identify, assess and implement measures that will enhance energy affordability for households and businesses, operating within the broader policy context set by the Programme for Government. The taskforce has completed its first report, which included measures for consideration to support customers in the coming Winter, to inform Budget 2026 discussions. This report is available on gov.ie.  The taskforce will now proceed with further work to develop an Energy Affordability Action Plan, including a programme of public consultation and stakeholder engagement. The action plan will be published in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 111. Deputy Thomas Gould asked the Minister for Climate, Energy and the Environment the number of meetings he has held with ESB and other energy providers on energy costs to date in 2025. [71671/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Departmental Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_111",
        "questionNumber": 111
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  There has been significant investment and year-on-year growth in home energy upgrades under the National Retrofit Plan, with capital expenditure of over €1.6 billion since 2019 and over 239,000 home energy upgrades supported to end November 2025. This includes over 32,000 fully funded retrofits under the Warmer Home Schemes. The number of homes retrofitted under the Warmer Homes Scheme from January to end of November 2025 is 7,430.  The scheme has been delivering a greater number of deeper and more complex upgrades in recent years. This is reflected in the average cost of upgrades which the SEAI indicates has increased from €2,600 in 2015 to just over €29,000 in Q3 of 2025. These deeper upgrades mean that more lower income homeowners are benefitting significantly from warmer, healthier and more comfortable homes, with lower energy bills and reduced emissions.  My officials continue to work with the SEAI to further accelerate and maximise the output of fully funded energy upgrades. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 131. Deputy Thomas Gould asked the Minister for Climate, Energy and the Environment the number of homes retrofitted in 2025 under the warmer homes scheme. [71670/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_163",
          "debateSectionId": "dbsect_163",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_163.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_131",
        "questionNumber": 131
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  My Department has a contract with Ruepoint for media monitoring and Media HQ for press release distribution service. The Department carried out a procurement process, specifying the requirement for both of these services. On the assessment of the tenders received, the Department selected the aforementioned companies as those best placed to meet the needs of the Department, as outlined in the procurement documentation. Officials in my Department will be conducting a new procurement process following the end of the existing contracts in the first quarter of 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 239. Deputy Thomas Gould asked the Tánaiste and Minister for Finance the reason his Department pays an external company for media monitoring and another for press release distribution. [69851/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_252",
          "debateSectionId": "dbsect_252",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_252.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_239",
        "questionNumber": 239
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 613. Deputy Thomas Gould asked the Minister for Children, Disability and Equality whether she is aware that an organisation (details supplied) in Cork will be closing mid-January; and whether she will intervene to keep this vital service open and expand its staffing to allow it to reach its full potential.  [73402/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_586",
          "debateSectionId": "dbsect_586",
          "showAs": "Children in Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_586.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_613",
        "questionNumber": 613
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 614. Deputy Thomas Gould asked the Minister for Children, Disability and Equality the funding provided in each of the past five years for an organisation (details supplied) in Cork.  [73404/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_587",
          "debateSectionId": "dbsect_587",
          "showAs": "Care Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_587.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_614",
        "questionNumber": 614
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Micro-generation of electricity is the small-scale production of electricity by consumers who generate electricity at their own homes for their own consumption and sell the excess electricity produced to the grid.  Section 216D of the Taxes Consolidation Act 1997 provides that profits of up to €400 per year arising to an individual from the generation of electricity from renewable, sustainable or alternative sources of energy at the individual’s sole or main residence for the individual’s own consumption (referred to as the micro-generation of electricity) is exempt from Income Tax, USC and PRSI. The profits which are exempted are those profits arising from the domestic generation of electricity which is supplied to the national grid. The tax exemption is due to expire on 31 December 2025.  Finance Bill 2025 extends the exemption from Income Tax, USC and PRSI for householders for certain profits of up to €400 per annum from the microgeneration of electricity, for a further three years, to 31 December 2028.  Accordingly, there will be no change, next year, to the Income Tax treatment of these payments. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 170. Deputy Thomas Gould asked the Tánaiste and Minister for Finance whether electricity sent back to the grid will be taxed from next year. [72603/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_166",
          "debateSectionId": "dbsect_166",
          "showAs": "Electricity Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_166.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_170",
        "questionNumber": 170
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Significant progress has been made, in terms of the pay and conditions for Defence Force personnel, particularly over the last five (5) years. Under the current national pay deal, the Public Service Agreement a further 1% increase in basic pay, as well as allowances in the nature of pay, came into effect on 1 August 2025, and has a further positive financial impact, for members of the Defence Forces.  For context, in January 2020 a newly qualified three-star private could have expected to earn €28,844 gross per annum, on completion of his/her initial training.  Following the implementation of a number of pay related Commission on Defence Forces recommendations, coupled with ongoing pay increases being applied as part of national pay agreements, at present recruit pay, on completion of training (which takes approximately 24 weeks), starts at €41,880.  For the Officer cohort, a school leaver Cadet, on commissioning, was paid €31,581 in January 2020. As of 01 August 2025 a school leaver Cadet on commissioning, is now paid €45,795. After 2 years they are promoted to lieutenant and their pay rises to €51,184.  Where a graduate joins – the pay rate on commissioning begins at €51,184. These rates all include a pensionable military service allowance, which is an allowance that is paid to all ranks up to and including the rank of Colonel, for the unpredictable nature of the work encountered by the Defence Forces.  In the conversation surrounding the pay and conditions of members of the Defence Forces, it is important to point out that in addition to basic pay and military service allowance, certain positions in the Defence Forces also attract specialist and technical pay. Additionally there is scope for further income from duty allowances for specific duties carried out, as well as the possibility of earning a tax-free duty allowance, starting at €15,000, for a 6 month overseas deployment.  Key changes introduced to broader conditions include the extension of private medical care to all personnel; increases to mandatory retirement ages and recruitment ages, and earlier this year, the removal of the blanket exemption from the Organisation of the Working Time Act.  As outlined, positive progress has been made on pay and conditions in the Defence Forces. There is a significant increase in interest in joining the Defence Forces over the last two years. We will continue to ensure that Defence Forces remains an employer of choice. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 92. Deputy Thomas Gould asked the Minister for Defence the actions she has taken to improve pay and conditions in the Defence Forces; and if she will make a statement on the matter. [71668/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_37",
          "debateSectionId": "dbsect_37",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_37.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_92",
        "questionNumber": 92
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Government are committed to taking steps to increase recruitment and retention within the Defence Forces. Government has introduced several key measures to support recruitment and retention in the Defence Forces. Notable among these are increases in the maximum ages of recruitment and retirement respectively, the extension of private secondary healthcare to all personnel and the application of the provisions of the Working Time Directive across the Defence Forces subject to certain exemptions. Further measures include a doubling of the Patrol Duty allowance payable to Naval Service personnel after ten days at sea in a calendar year and the extension of the Naval Service tax credit for a further five years. There has been significant progress on pay with all personnel benefiting from a further pay award made in August of this year with the next increase due in February 2026.  The manpower requirement of the Defence Forces is monitored on an ongoing basis in accordance with the operational requirements of each of the three services including the number of people who leave the Permanent Defence Force (PDF). I am advised by the Defence Forces that there have been 335 resignations from the PDF in 2025, as at 31 October, the latest date for which this data is available for.  Personnel leave the Defence Forces for a variety of reasons including on age grounds, at end of contract and via voluntary discharges. A significant percentage of those who leave the Defence Forces do so with some form of pension. This can make taking up a position in the private sector very attractive where a full-time position, even at the same rates as those in the Defence Forces, could lead to an increase in an individual’s earnings.  The Commission on the Defence Forces stated in their report that they were satisfied that, in broad terms, levels of average turnover are not out of line with other military organisations internationally. Turnover levels for the past five years have averaged approximately 9%. Last year however saw a significant reduction in the number of discharges. A total of 674 personnel left the Defence Forces which was the lowest in 4 years. This trend has continued in 2025 with 508 discharges recorded to the end of October which represents a year-on-year reduction of 68.  Recruitment data provided to me by the Defence Forces provides further cause for encouragement. Last year saw a stabilisation in numbers with 708 inductions to the PDF and the military authorities have advised me that they are targeting 750 inductions at a minimum for 2025.  While recruitment and retention challenges undoubtedly remain, the allocation of record levels of expenditure to the Defence sector, and the policy initiatives implemented, is indicative of Government’s commitment in this regard. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 114. Deputy Thomas Gould asked the Minister for Defence the number of resignations from the Defence Forces in 2025. [71669/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_52",
          "debateSectionId": "dbsect_52",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_52.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_114",
        "questionNumber": 114
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that all new vehicles must comply with EU Type Approval standards, which specify the requirements for equipment to be sold and registered in the EU.  While EU Type Approval outlines the requirements and standards for each vehicle type, it does not prescribe how specific systems should operate. This applies not only to electric vehicle-specific systems, but also to more general controls such as indicators, lighting, windscreen wipers, handbrakes and air-conditioning systems. The operation of both mandatory and optional driver assistance and safety systems can also vary significantly from one vehicle to another.  All vehicle owners should familiarise themselves with the operating methods of the systems in their own vehicle. The operation of these systems may differ from vehicles the owner has previously driven. Details of system operation are outlined in the vehicle user manual and should be available to be demonstrated by motor dealers.  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the promotion of public awareness of road safety and of measures, including the advancement of education, relating to the promotion of the safe use of roads. I have therefore referred the Deputy's questions to the RSA for direct reply in relation to an information campaign. I would ask the Deputy to contact my office if a response is not received within 10 days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 317. Deputy Thomas Gould asked the Minister for Transport whether any work has been undertaken on safety concerns with electric vehicles. [72082/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_225",
          "debateSectionId": "dbsect_225",
          "showAs": "Electric Vehicles",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_225.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_317",
        "questionNumber": 317
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Bus Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 318. Deputy Thomas Gould asked the Minister for Transport the current number of drivers for Bus Éireann’s PSO route delivery in Cork city; and the number considered a full cohort. [72156/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_226",
          "debateSectionId": "dbsect_226",
          "showAs": "Bus Éireann",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_226.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_318",
        "questionNumber": 318
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, my role concerns overall policy direction and funding for public transport. Day-to-day operational matters, including addressing performance-related complaints, are the statutory responsibility of the National Transport Authority (NTA), working with the relevant transport providers.  For this reason, I have referred the Deputy’s question to the NTA so they may address the specific operational query raised. Please contact my private office, if a response is not received within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 319. Deputy Thomas Gould asked the Minister for Transport the number of complaints received by the NTA for the PSO route in Cork city. [72157/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_227",
          "debateSectionId": "dbsect_227",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_227.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_319",
        "questionNumber": 319
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, my office has held the 2 meetings this year where Cork’s bus service was on the agenda. The first meeting was with the Chair & CEO Bus Éireann on the 3rd April. The second meeting was with the NTA Chair on the 29th Sept 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 320. Deputy Thomas Gould asked the Minister for Transport the number of meetings his office has held this year where Cork’s bus service was on the agenda. [72158/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_228",
          "debateSectionId": "dbsect_228",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_228.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_320",
        "questionNumber": 320
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that the number of properties in Cork liable to vacant homes tax (VHT), and the VHT liability is provided in the table below.     Year    2024    2025    2026    Total      Number of properties    444    241    101    786      Vacant Homes Tax Liability  €m - as of December 2025    .21    .18    .12    .51      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 353. Deputy Thomas Gould asked the Tánaiste and Minister for Finance the number of homes in Cork subject to a vacant homes tax; and the overall sum raised. [72141/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_255",
          "debateSectionId": "dbsect_255",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_255.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_353",
        "questionNumber": 353
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Currently, there are 66 teaching positions allocated across 19 supply clusters in Co. Cork. This is an increase on 2020, when there were 29 positions across 11 clusters.     Cork    2020    2025      Total Supply Panel Teacher Allocation    29    66      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 480. Deputy Thomas Gould asked the Minister for Education and Youth the current number of teachers on the substitute supply panel in Cork; and the number in 2020. [72123/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_370",
          "debateSectionId": "dbsect_370",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_370.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_480",
        "questionNumber": 480
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Home School Community Liaison (HSCL) scheme is one of the key supports provided by my department as part of the overall DEIS programme. Tusla Education Support Service (TESS) manage the HSCL scheme on behalf of my department. The scheme seeks to promote partnership between parents, teachers and community family support services, with a view to supporting improved attendance, participation and retention.  All DEIS urban primary schools and all DEIS post-primary schools are included in the HSCL scheme, which currently serves 687 DEIS schools, catering for approximately 207,000 children and young people. The scheme is delivered by 528 full-time HSCL coordinators assigned to HSCL duties either in individual schools or in clusters of schools.  HSCL coordinators are released from teaching duties, for a maximum of five years, in order to work intensively with and support parents/guardians. The overarching goal of the HSCL coordinator is to improve educational outcomes for children through their work with the key adults in the child’s life.  In addition to the above, a pilot project to support Traveller and Roma pupils, under the National Traveller and Roma Inclusion Strategy, is in operation in four locations with one HSCL coordinator assigned in each location. A further ten HSCL coordinators support attendance, participation and retention among Traveller and Roma students, across fourteen non-DEIS post-primary schools.  In the 2020/21 school year there were 40 HSCL coordinators employed across schools in Cork city and county.  In the 2024/25 and 2025/26 school years there are 47 HSCL coordinators employed across schools in Cork city and county. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 481. Deputy Thomas Gould asked the Minister for Education and Youth the number of home-school liaison support workers in Cork in 2020, 2024 and the number in 2025. [72124/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_371",
          "debateSectionId": "dbsect_371",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_371.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_481",
        "questionNumber": 481
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies, or to provide funding to facilitate inclusion and access for pupils with special needs. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of a minimal scope works to address the emergency situation. The EWS is intended to remedy an emergency situation and usually provides only an interim measure until a permanent solution can be delivered under the Summer Works Scheme (SWS) which deals with upgrade works to the school.  Regarding applications received for Cork schools in 2025; there were a total of 187 applications received, 43 of which were rejected and 12 of which have requested a draw down of funds, the remaining 132 applications are in varying stages of assessment and officials continue to engage with the schools where required. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 482. Deputy Thomas Gould asked the Minister for Education and Youth the number of emergency works grant applications received for Cork schools in 2025; and the number refused, and the number  drawn down. [72125/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_372",
          "debateSectionId": "dbsect_372",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_372.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_482",
        "questionNumber": 482
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I refer the Deputy to my reply to Question No. 1,012 of 4 November 2025 which sets out the position in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 587. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the derelict sites levy, levied, collected, owed and cumulatively owed; the number of sites on the register as of 31 December 2024 and at the current date, by local authority, in tabular form. [72138/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_461",
          "debateSectionId": "dbsect_461",
          "showAs": "Derelict Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_461.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_587",
        "questionNumber": 587
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage (Deputy John Cummins)  Local Authorities are required to submit an annual return to my Department providing information on the operation of the Derelict Sites Act 1990 in their functional areas. The derelict sites returns for 2025 will be collected from the local authorities in Quarter 2 of 2026 ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 588. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the date for return of collection data for 2025 of the derelict sites levy.  [72139/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_462",
          "debateSectionId": "dbsect_462",
          "showAs": "Derelict Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_462.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_588",
        "questionNumber": 588
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Under the provisions of the Urban Regeneration and Housing Act 2015 (the Act), each local authority maintains a Vacant Sites Register in respect of their functional area with sites listed in such registers being liable to the vacant site levy, also introduced under the provisions of the Act. As provided for under the Act, the register in respect of each local authority is available for inspection at its offices and online on its website.  Under the vacant site levy provisions in the Urban Regeneration and Housing Act 2015, planning authorities were empowered to apply a vacant site levy of 3% of the market valuation of relevant properties which were listed on local authority vacant site registers in 2018, which relevant owners were liable to pay in January 2019. The rate of the levy increased to 7% for sites listed on local authority vacant sites register from 2019 onwards which site owners became liable to pay in January 2020.  Local authorities are responsible for the administration of the vacant site register in respect of their functional area, which includes identifying sites for inclusion on the register and applying the levy to same. The vacant site register of each local authority is available on their website.  The Vacant Sites Levy is being replaced by the Residential Zoned Land Tax, which was introduced in the Finance Act in 2021 and came into effect for the first time in 2025. In the interim period land continued to be placed on Vacant Site Registers and final demands for the payment of the levy for 2024 were issued by relevant local authorities earlier this year. However, no further levies will be issued as any land which remains ‘vacant and idle’ will now be subject to the Residential Zoned Land Tax.  The total value of the vacant site levy since its inception is currently not available as my Department is working on collating this data. It is expected the information will be available shortly.  The Residential Zoned Land Tax (RZLT) is being administered and collected by the Revenue Commissioners, further to the publication of maps identifying lands in scope by the 31 local authorities. The tax is not levied, instead it is administered as a self-assessed return by the landowner to the Revenue Commissioners.  The Residential Zoned Land Tax (RZLT) legislation does not require the identification of distinct sites by local authorities; rather it requires that all land which is zoned residential, or for a mixture of uses including residential, which is serviced and which does not benefit from an exclusion as set out in the legislation, is to be identified on the draft and final maps. Under the legislation, local authorities are required to publish the total area of land in hectares contained on their maps. Overall, circa 46,300 hectares of land comprising residential and mixed use including residential zonings are identified on the final maps for 2025. This information is broken down by Local Authority in the table below. It should also be noted however that where land identified on the maps is occupied by properties that are liable to pay the Local Property Tax (LPT), the land in question is not liable to RZLT     Local Authority    Final Map for 2025      Hectares (approx.)          Carlow    165      Cavan    465      Clare    1,085      Cork City    3,195      Cork County    3,140      Donegal    1,680      DCC    4,510      DLRCC    3,285      Fingal    3,695      Galway City    1,120      Galway County    1,060      Kerry    1,195      Kildare    1,690      Kilkenny    550      Laois    1,145      Leitrim    320      Limerick    1,805      Longford    410      Louth    1750      Mayo    880      Meath    2030      Monaghan    625      Offaly    980      Roscommon    105      Sligo    605      SDCC    2,705      Tipp    1,260      Waterford    1,545      Westmeath    1,150      Wexford    380      Wicklow    1,735         While the 2025 RZLT liability date fell on 1 February last, landowners had until 23 May 2025, being the due date for filing RZLT returns for 2025, to pay the liability, with the exception of where the landowner sells the relevant site between 1 February and 23 May 2025, as where a relevant site is sold, any outstanding RZLT liability must be paid prior to sale. Matters relating to the collection and payment of the tax are a matter for the Department of Finance. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 589. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the latest data on the amounts levied, collected, owed and cumulatively owed; the number of sites on each register for the vacant sites levy and the residential zoned land tax, by local authority, in tabular form. [72140/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_463",
          "debateSectionId": "dbsect_463",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_463.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_589",
        "questionNumber": 589
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 590 and 591 together.  The Governments new housing action plan, Delivering Homes, Building Communities 2025 – 2030 , reinforces and expands the range of existing measures being implemented to tackle the issues of supply and affordability. The new action plan supports and extends the various affordable housing schemes now being delivered by a range of delivery partners, and will drive delivery beyond the16,900 affordable housing supports that have already been delivered since the launch of Housing for All, including over 2,300 in Cork.  Both Cork City and Cork County Councils have established a significant pipeline of affordable housing delivery in the Cork area and continue to work proactively with all delivery partners. Building on this progress, my Department will continue to engage with all delivery partners, including Cork City and Cork County Councils, to further the development of the affordable housing delivery pipeline, to meet affordable housing needs in the Cork area.  My Department publishes programme-level statistics on affordable housing delivery activity by local authorities and delivery partners in each local authority area. Data for the years 2022 up to Q2 2025 is published on the statistics page of my Department’s website at the following link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/overall-social-and-affordable-housing-provision/ ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 590. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the number of affordable homes delivered in Cork in 2025.  [72142/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_464",
          "debateSectionId": "dbsect_464",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_464.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_590",
        "questionNumber": 590
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 590 and 591 together.  The Governments new housing action plan, Delivering Homes, Building Communities 2025 – 2030 , reinforces and expands the range of existing measures being implemented to tackle the issues of supply and affordability. The new action plan supports and extends the various affordable housing schemes now being delivered by a range of delivery partners, and will drive delivery beyond the16,900 affordable housing supports that have already been delivered since the launch of Housing for All, including over 2,300 in Cork.  Both Cork City and Cork County Councils have established a significant pipeline of affordable housing delivery in the Cork area and continue to work proactively with all delivery partners. Building on this progress, my Department will continue to engage with all delivery partners, including Cork City and Cork County Councils, to further the development of the affordable housing delivery pipeline, to meet affordable housing needs in the Cork area.  My Department publishes programme-level statistics on affordable housing delivery activity by local authorities and delivery partners in each local authority area. Data for the years 2022 up to Q2 2025 is published on the statistics page of my Department’s website at the following link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/overall-social-and-affordable-housing-provision/ ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 591. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the number of cost rental homes delivered, by county, in 2025. [72143/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_464",
          "debateSectionId": "dbsect_464",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_464.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_591",
        "questionNumber": 591
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Please see below timeline for delivery of the Cork North West Quarter Regeneration (CNWQR) projects, by phase. Please note that the table below only includes projects that are fully approved; it does not include projects that are still going through the approval process.  Responsibility for the progression of individual proje     Project Name    Phase    No of Units    Project Funding Status    Construction Status    Projected Delivery Date/Completion Date      CNWQR Croppy Boy Phase 1    1/1    24    Stage 4 Approved    Onsite    Q4 2025      CNWQR Knocknaheeny Phase 1B    1/1    29    Complete    Completed    Q3 2017      CNWQR Knocknaheeny Phase 1C    1/1    41    Stage 4 Approved    Onsite    Q4 2025      CNWQR Knocknaheeny Phase 2A    1/1    47    Complete    Completed    Q4 2019      CNWQR Knocknaheeny Phase 2B    1/1    38    Stage 4 Approved    Onsite    Q2 2026      Regen CNWQR Knocknaheeny Phase 3B    1/1    62    Stage 4 Approved    Not Started    Q2 2027      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 592. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the timeline for delivery of the Northwest Quarter Regeneration, by phases, in Cork. [72144/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_465",
          "debateSectionId": "dbsect_465",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_465.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_592",
        "questionNumber": 592
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  To date, over €96m has been allocated to projects that are either completed or on-site under the Cork North West Quarter Regeneration (CNWQR) Programme.  The current CNWQR Programme runs until 2028, and it is envisaged that projects will be on-going until this date. The programme is funded project-by-project as submissions are received and reviewed in my Department. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 593. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the overall funding provided to the NWQR, to date in 2025. [72145/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_466",
          "debateSectionId": "dbsect_466",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_466.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_593",
        "questionNumber": 593
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department publishes comprehensive programme-level statistics on a quarterly basis on social and affordable housing delivery activity by local authorities and Approved Housing Bodies (AHBs) in each local authority. This data is available to the end of Q2 2025 and is published on the statistics page of my Department’s website at the following link: www.gov.ie/en/collection/6060e-overall-social-housing-provision/.  My Department also publishes the Social Housing Construction Status Report (CSR), which provides details of social housing developments and their location that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The most recent publication was for Quarter 2 2025. All CSRs are available at the following link: www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/.  A version of the CSR file can also be downloaded for analysis by local authority, location etc. at this link: [ opendata.housing.gov.ie/dataset/social-housing-construction-status-report-q2-2025 ].  My Department does not collate data on the number of social homes delivered to universal design standards.  Delivering Homes, Building Communities, published 13 November 2025 commits to ensuring that the increased supply of social homes includes homes that reflect universal design principles, fostering inclusivity.  My Department jointly published the National Housing Strategy for Disabled People 2022-2027 and Implementation Plan with the Department of Health and the Department of Children, Disability, and Equality. The Strategy and Implementation Plan may be accessed on my Department’s website at the following link: www.gov.ie/en/publication/60d76-national-housing-strategy-for-disabled-people-2022-2027/. The Strategy and Implementation Plan sets out the actions to achieve the vision of the joint Strategy for delivering housing and related supports for disabled people to 2027 operating under the new housing plan Delivering Homes, Building Communities.  Separately, my Department published a Design Manual for Quality Housing which is available on my Department’s website at the following link: www.gov.ie/en/publication/b3e02-design-manual-for-quality-housing/. The Manual is intended to guide local authorities and Approved Housing Bodies, and their consultants, on the design of social housing including the internal layouts of individual social homes. The manual includes guidance on the approach to ‘Housing for People with Disability’ (Section 5.3.2) and specific design approaches developed with the input of the Centre for Excellence in Universal Design. My Department is encouraging all local authorities and Approved Housing Bodies to utilise this Design Manual as the best way to ensure funding support for the wide range of housing situations that can arise.  Local authorities play a key role in the planning and provision of social housing in their areas, and decide on the number and types of dwellings to provide, based on identified need.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 594. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the overall percentage of social housing delivered in 2025 under universal design principles. [72147/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_467",
          "debateSectionId": "dbsect_467",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_467.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_594",
        "questionNumber": 594
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 555, 556 and 595 together.  Details on the number of households qualified for social housing support in each local authority administrative area is provided in the annual statutory Summary of Social Housing Assessments (SSHA).  The SSHA 2025 process is currently underway and I expect to publish the summary report before the end of Q1 2026.  The most recently published summary for all counties, conducted in November 2024, is available on my Department's website, along with all summaries since 2011 at www.gov.ie/en/collection/62486-summary-of-social-housing-assessments/ .  SSHA data is collected and collated at local authority level and therefore a breakdown of the numbers by town is not provided. Details of households qualified for social housing support for each local authority are included in tables 1.1 in the report.  Details on the length of time spent on the respective lists of each local authority are included in tables 2.8 and A1.8 in the report. It does not provide a breakdown of the number of years beyond the category of more than 7 years. Data regarding the number of housing applicants requesting particular sized accommodation is not held by my Department. However, tables 2.4 and A1.4 of the report provide details on household size.     ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 595. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage whether he will publish figures on the numbers of people on social housing lists longer than seven, eight, nine and 10 years and so on, respectively, by local authority administrative area based on SSHA figures provided by local authorities. [72149/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_437",
          "debateSectionId": "dbsect_437",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_437.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_595",
        "questionNumber": 595
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 596 and 597 together.  I expect the parameters of the 2026 Second Hand Acquisitions Programme, including individual local authority allocations, to be notified to local authorities early next year.  Progress by Cork City and Cork County Councils under the 2025 Second Hand Acquisitions Programme is set out in the table below.     -    Allocation    Current Projected Drawdown    Total Acquisitions to Date    Homeless Exit Acquisitions    Tenancy Sustainment Acquisitions    Priority Cohorts Acquisitions    Buy and Renew Acquisitions      Cork City    €20m    €21m    63    28    27    2    6      Cork County    €15m    €9.9m    34    5    28    1    0     I allocated an additional €2 million in September to support acquisitions by Cork City Council for households, particularly larger families with children, to exit emergency homeless accommodation into housing. Any funding not drawn down from this allocation this year will be carried into 2026 and remain ringfenced from the council's broader 2026 Second-Hand Acquisitions Programme allocation.  Notably, there was more than adequate scope available within the original €325 million allocated to the programme this year to support all acquisitions that could be completed by local authorities by end-year. Accordingly, those local authorities that indicated they would likely expend their full initial allocation, but could progress and complete additional acquisitions and draw down the relevant funding this year if additional monies were available, were approved to do so. Both Cork City and County Councils were approved to progress additional acquisitions on this basis.  Local authorities have also been authorised to enter into commitments for 2026 to a value of up to 30% of their original 2025 acquisitions budget. This has allowed them commit, pending an agreed programme budget for 2026, some €95 million extra in 2025 for acquisitions that will complete and draw down nest year. This effectively provides for a multi-annual approach to programme delivery, facilitating local authorities to plan and progress acquisitions from one year to the next with a higher level of certainty vis-à-vis future funding availability.  This provides Cork City and County Councils with scope to commit €6 million and €4.5 million respectively for acquisitions would be likely only to complete and drawdown in 2026. This includes acquisitions to support exits from homelessness, tenancy sustainment via tenant in situ, and other priority cohorts such as older persons, persons with disabilities, etc. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 596. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the allocation for 2026 social housing acquisition programme. [72150/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_468",
          "debateSectionId": "dbsect_468",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_468.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_596",
        "questionNumber": 596
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 596 and 597 together.  I expect the parameters of the 2026 Second Hand Acquisitions Programme, including individual local authority allocations, to be notified to local authorities early next year.  Progress by Cork City and Cork County Councils under the 2025 Second Hand Acquisitions Programme is set out in the table below.     -    Allocation    Current Projected Drawdown    Total Acquisitions to Date    Homeless Exit Acquisitions    Tenancy Sustainment Acquisitions    Priority Cohorts Acquisitions    Buy and Renew Acquisitions      Cork City    €20m    €21m    63    28    27    2    6      Cork County    €15m    €9.9m    34    5    28    1    0     I allocated an additional €2 million in September to support acquisitions by Cork City Council for households, particularly larger families with children, to exit emergency homeless accommodation into housing. Any funding not drawn down from this allocation this year will be carried into 2026 and remain ringfenced from the council's broader 2026 Second-Hand Acquisitions Programme allocation.  Notably, there was more than adequate scope available within the original €325 million allocated to the programme this year to support all acquisitions that could be completed by local authorities by end-year. Accordingly, those local authorities that indicated they would likely expend their full initial allocation, but could progress and complete additional acquisitions and draw down the relevant funding this year if additional monies were available, were approved to do so. Both Cork City and County Councils were approved to progress additional acquisitions on this basis.  Local authorities have also been authorised to enter into commitments for 2026 to a value of up to 30% of their original 2025 acquisitions budget. This has allowed them commit, pending an agreed programme budget for 2026, some €95 million extra in 2025 for acquisitions that will complete and draw down nest year. This effectively provides for a multi-annual approach to programme delivery, facilitating local authorities to plan and progress acquisitions from one year to the next with a higher level of certainty vis-à-vis future funding availability.  This provides Cork City and County Councils with scope to commit €6 million and €4.5 million respectively for acquisitions would be likely only to complete and drawdown in 2026. This includes acquisitions to support exits from homelessness, tenancy sustainment via tenant in situ, and other priority cohorts such as older persons, persons with disabilities, etc. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 597. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the number of tenant-in-situ sales approved in Cork city and county respectively to date in 2025. [72151/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_468",
          "debateSectionId": "dbsect_468",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_468.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_597",
        "questionNumber": 597
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department's role in relation to homelessness involves the provision of a national framework of policy, legislation and funding to underpin the role of housing authorities in addressing homelessness at local level. Statutory responsibility in relation to the provision of homeless services rests with individual housing authorities.  My Department does not fund any homeless service directly but provides funding to housing authorities towards the operational costs of homeless accommodation and related services under Section 10 of the Housing Act, 1988. Under Exchequer funding arrangements, housing authorities must provide at least 10% of the cost of services from their own resources. Furthermore, housing authorities may also incur additional expenditure on homeless related services outside of the Exchequer funding arrangements provided by my Department.  While responsibility for the provision of accommodation for homeless persons rests with individual housing authorities, the administration of homeless services is organised on a regional basis, with nine administrative regions in place and a lead authority in each region. A homelessness consultative forum has been established in each region in accordance with Chapter 6 of the Housing (Miscellaneous Provisions) Act, 2009. It is a matter for the management group of the consultative forum, in the first instance, to determine the services and the funding required to address homelessness in each region.  Exchequer funding for homeless services is provided through my Department to housing authorities on a regional basis. The table below sets out the Exchequer funding provided to each of the nine homeless regions to date in 2025, with further funding recoupments due to be made based on regional End of Year expenditure.     -    Exchequer funding provided to Homeless Regions - € 2025 (to date)      Dublin (Dublin City Council)    196,990,706      Mid East (Kildare County Council)    10,251,744      Midlands (Westmeath County Council)    1,326,662      Mid West (Limerick City & County Council)    14,874,433      North East (Louth County Council)    4,980,309      North West (Sligo County Council)    2,597,455      South East (Waterford City & County Council)    7,508,392      South West (Cork City Council)    25,906,484      West (Galway City Council)    12,503,573     Financial reports from each of the homeless regions setting out expenditure on homeless accommodation and related services are published on my Department's website at the following link;  [ www.housing.gov.ie/housing/homelessness/other/homelessness-data ]. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 598. Deputy Thomas Gould asked the Minister for Housing, Local Government and Heritage the funding provided by local authority for the provision of homeless services to date in 2025. [72152/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_470",
          "debateSectionId": "dbsect_470",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_470.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_598",
        "questionNumber": 598
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an Automatic Enrolment (AE) system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system will be called 'My Future Fund' and it will launch from the 1st January 2026.  Current and new employees aged between 23 and 60 years of age and earning €20,000 or above per annum (across all employments) who are not already in an approved supplementary pension scheme will be automatically enrolled into the My Future Fund. Those who fall outside the age and earnings threshold, i.e., those aged between 18 and 23 or between 60 and 66, and/or who earn below €20,000 per annum will be able to join the new retirement savings system voluntarily by opting in.  Contributions into My Future Fund will be made by the employee, the employer and the State. Based on the employee’s gross earnings, employer and employee matching contributions will start at:  - 1.5% of gross earnings for Years 1-3,  - rising to 3% in Years 4-6,  - to 4.5% in Years 7-9, and  - to the maximum contribution rate of 6% from Year 10 onwards.  A State top-up will also be contributed, which will be at the rate of a third of the employee’s contribution.  It should be noted that ‘years’ here, as provided for in the Automatic Enrolment Retirement Savings System Act 2024, refers to years from when contribution collection commences (i.e., January 2026) and not years of service. Therefore, changes in employment do not reset the contribution rates to 1.5%, they will continue at the prevailing rate for the system at that time - so at 3% in the case posited in the question.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 650. Deputy Thomas Gould asked the Minister for Social Protection if a person who moves jobs after four years must start auto-enrolment again at 1.5% or will remain at 3%. [72033/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_512",
          "debateSectionId": "dbsect_512",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_512.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_650",
        "questionNumber": 650
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 652 and 653 together.  The delivery of crucial and locally based community welfare services to meet the challenges and the needs of people across the country is a priority for my department. The Community Welfare Service (CWS) continues to provide a flexible service to meet the different needs of people, who may find themselves in a financially difficult or vulnerable situation. This service is easily accessible and responsive to our client’s needs.  CWOs are available in over 50 locations across the country, including the Intreo Centre at Abbeycourt House in Cork City, where they can be seen without an appointment, during business hours, Monday to Friday.  Alternatively, CWOs can facilitate an appointment within a short time of a person requiring such a meeting, at a mutually agreed location, including at the person's home or indeed anywhere suitable. These arrangements ensure people who need a service have comprehensive options for accessing the service in person.  Under the Supplementary Welfare Allowance (SWA) scheme, my department may make an ANP to help meet expenses that an eligible person cannot pay from their weekly income, personal and/or household resources. The ANP scheme is demand led and administered by Community Welfare Officers (CWOs) in the Community Welfare Service (CWS), taking into account the requirements of the legislation and all the relevant circumstances of the case in order to ensure that the payments target those most in need of assistance.  Claim processing times are monitored at both a national and local level in the CWS, with targeted interventions available to support and mitigate delays in any area across the Country, where fluctuations in claim loads are observed. This maintains the claim processing timeframes nationwide for ANPs.  My department cannot provide a breakdown analysis of average claim processing times specific to Cork City however, work on hands nationally for ANPs is within the scheme's normal processing levels and fully completed applications, where the required documentation is supplied, are generally processed within ten working days. Where it is clear that a person has an urgent or immediate need, every effort is made to ensure that the claim is processed on the same day. CWOs are very experienced and can generally assess when a case is so urgent that it requires an immediate response.  When considering an application from people in financial difficulty for any payment under the SWA scheme, the CWO must consider all of the relevant circumstances when examining a case in determining the most appropriate scheme type and level of assistance required. The CWO may ask for a number of supporting documents to ensure the customer receives a level of payment appropriate to their needs. Where an application cannot be finalised promptly, the delay is normally due to the need for additional information or documentation and the time it takes for the information to be provided. Upon receipt of this information, the application is then processed quickly.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 652. Deputy Thomas Gould asked the Minister for Social Protection the average wait time for an additional needs payment in Cork city. [72112/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_514",
          "debateSectionId": "dbsect_514",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_514.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_652",
        "questionNumber": 652
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 652 and 653 together.  The delivery of crucial and locally based community welfare services to meet the challenges and the needs of people across the country is a priority for my department. The Community Welfare Service (CWS) continues to provide a flexible service to meet the different needs of people, who may find themselves in a financially difficult or vulnerable situation. This service is easily accessible and responsive to our client’s needs.  CWOs are available in over 50 locations across the country, including the Intreo Centre at Abbeycourt House in Cork City, where they can be seen without an appointment, during business hours, Monday to Friday.  Alternatively, CWOs can facilitate an appointment within a short time of a person requiring such a meeting, at a mutually agreed location, including at the person's home or indeed anywhere suitable. These arrangements ensure people who need a service have comprehensive options for accessing the service in person.  Under the Supplementary Welfare Allowance (SWA) scheme, my department may make an ANP to help meet expenses that an eligible person cannot pay from their weekly income, personal and/or household resources. The ANP scheme is demand led and administered by Community Welfare Officers (CWOs) in the Community Welfare Service (CWS), taking into account the requirements of the legislation and all the relevant circumstances of the case in order to ensure that the payments target those most in need of assistance.  Claim processing times are monitored at both a national and local level in the CWS, with targeted interventions available to support and mitigate delays in any area across the Country, where fluctuations in claim loads are observed. This maintains the claim processing timeframes nationwide for ANPs.  My department cannot provide a breakdown analysis of average claim processing times specific to Cork City however, work on hands nationally for ANPs is within the scheme's normal processing levels and fully completed applications, where the required documentation is supplied, are generally processed within ten working days. Where it is clear that a person has an urgent or immediate need, every effort is made to ensure that the claim is processed on the same day. CWOs are very experienced and can generally assess when a case is so urgent that it requires an immediate response.  When considering an application from people in financial difficulty for any payment under the SWA scheme, the CWO must consider all of the relevant circumstances when examining a case in determining the most appropriate scheme type and level of assistance required. The CWO may ask for a number of supporting documents to ensure the customer receives a level of payment appropriate to their needs. Where an application cannot be finalised promptly, the delay is normally due to the need for additional information or documentation and the time it takes for the information to be provided. Upon receipt of this information, the application is then processed quickly.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 653. Deputy Thomas Gould asked the Minister for Social Protection the average wait time for an appointment with a community welfare officer in Cork city. [72113/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_514",
          "debateSectionId": "dbsect_514",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_514.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_653",
        "questionNumber": 653
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Under the supplementary welfare allowance scheme, my Department may make Additional Needs Payments to help meet essential expenses that a person cannot pay from their weekly income. These payments are available through our Community Welfare Officers.  Additional Needs Payments statistics are maintained on a county basis. Table 1 below shows the number of Additional Needs Payments issued, by category, in County Cork in Q3 in the years 2020, 2024 and 2025. Q3 statistics have been used in order to provide a like for like comparison, given that the last quarter is not yet available for 2025.  In addition, my Department publishes statistics on Additional Needs Payments in the Quarterly Statistics report which is available at [ g ]ov.ie  Any person who considers that they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office. In addition, applications can be made online via [ www.mywelfare.ie ].  I trust this clarifies the matter for the Deputy.  Table 1 - The number of Additional Needs Payments issued, by category, in County Cork in Q3 in the years 2020, 2024 and 2025     Category    Q3 2020    Q3 2024    Q4 2025      Bills    25    71    94      Child Related    26    38    33      Clothing    207    370    283      Funeral    62    64    72      General    353    338    301      Housing    448    512    547      Illness    4    7    3      Urgent Needs Payment    4    5    18      Other Supplements        1    1      Grand Total    1,129    1,406    1,352      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 654. Deputy Thomas Gould asked the Minister for Social Protection the number of people who have availed of an additional needs payment in the last quarter of this year and the same period in 2020 and 2024 respectively, in Cork city, by category of payment, in tabular form. [72114/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_515",
          "debateSectionId": "dbsect_515",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_515.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_654",
        "questionNumber": 654
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Department is committed to providing a quality service to all its customers. Claim refusal rates vary across schemes. The majority of applications and appeals are processed centrally and not on a geographic basis, therefore it is not possible to provide a breakdowns of the number of claims refused by payment in Cork; and the number accepted on appeal.  Further detailed information can be found through my Department's statistics landing page, gov.ie/dsp/statistics and in the the Annual Report of the Chief Appeals Officer, ([ News and Publications from the Social Welfare Appeals Office (www.gov.ie) ].  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 655. Deputy Thomas Gould asked the Minister for Social Protection the number of claims refused by payment in Cork; and the number accepted on appeal. [72115/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_516",
          "debateSectionId": "dbsect_516",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_516.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_655",
        "questionNumber": 655
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  The number of schools in receipt of the Breakfast Club and children benefitting in Cork are detailed below.       Roll No.    School Name    Pupils Benefiting      05940D    SCOIL URSULA    188      10724B    SOUTH ABBEY NS    221      11262R    DRUIMNE N S    64      12473M    GREENMOUNT MONASTERY NS    237      13031I    ST JOSEPHS CONVENT N S    204      13543M    DERRINACAHARA N S    77      13696O    ST VINCENTS CONVENT N S    207      13980L    S N B TOGHER CORK    250      14000C    SCOIL NAOMH MHUIRE    320      16159D    CONVENT GIRLS SENIOR NATIONAL SCHOOL    30      16680O    SCOIL COLMCILLE    250      17011W    MOCOMHOG N S    20      17024I    SCOIL NA CROISE NAOFA    197      17045Q    ST PATRICKS B N S    153      17105I    MUIRE GAN SMAL C    296      17281F    TOGHER N S    26      17993R    SCOIL MHUIRE GAN SMAL B    418      18153B    S N PADRAIG NAOFA C    134      18154D    S N PADRAIG NAOFA    86      18217B    SCOIL PADRE PIO N S    279      18292P    GAELSCOIL AN TEAGHLAIGH NAOFA    186      18377A    IOSEF NAOFA    98      18734V    REALT NA MAIDINE    107      18786R    SCOIL IOSAGAIN    6      19203S    ST PAUL'S SCHOOL    80      19256Q    SCOIL GHOBNATAN    470      19426P    S N MHARCUIS B    88      19427R    S N BHREANNDAIN C    105      19433M    HOLY FAMILY S S    67      19730S    SCOIL OILIBHEIR    15      19908K    GAELSCOIL MHACHAN    139      19909M    GAELSCOIL PEIG SAYERS    287      19989N    SCOIL MHUIRE NA TROCAIRE    211      20004T    SCOIL AN CROI RO NAOFA    12      20024C    BUN SCOIL MUIRE    510      20036J    NORTH PRESENTATION PRIMARY SCHOOL    290      20038N    SCOIL AISEIRI CHRIOST    233      20074R    ST GABRIELS SPECIAL SCHOOL    50      20140E    SCOIL MHUIRE FATIMA BOYS SENIOR    195      20389T    SCOIL MARIA ASSUMPTA    164      20493O    CANON SHEEHAN PRIMARY SCHOOL    171      20497W    SCOIL MHUIRE AGUS EOIN    300      20553G    STRAWBERRY HILL NATIONAL SCHOOL    316      20586V    BANDON PRIMARY SCHOOL    376      62530F    NORTH MONASTERY SECONDARY SCHOOL    261      62531H    GAELCHOLÁISTE MHUIRE    683      62540I    COLÁISTE ÉAMANN RÍS    760      62590A    ST VINCENT'S SECONDARY SCHOOL    255      62621I    NANO NAGLE COLLEGE    136      62630J    ST ALOYSIUS SCHOOL    310      62650P    URSULINE COLLEGE BLACKROCK    336      62693K    PRESENTATION SECONDARY SCHOOL    50      62730N    ST PATRICKS COLLEGE    201      70910L    ST. BROGAN'S COLLEGE    861      70970G    CARRIGNAFOY COMMUNITY COLLEGE    320      70990M    COLÁISTE AN CHRAOIBHÍN    920      71020G    DAVIS COLLEGE    1010      71040M    COLÁISTE FIONNCHUA    410      71050P    ST COLMAN'S COMMUNITY COLLEGE    1125      71101G    ST AIDAN'S COMMUNITY COLLEGE    306      71110H    NAGLE COMMUNITY COLLEGE    297      76067L    COLAISTE POBAIL NAOMH MHUIRE    568      76086P    MARIA IMMACULATA COMMUNITY COLLEGE    23      76090G    COLÁISTE POBAIL BHEANNTRAÍ    47      91397T    BISHOPSTOWN COMMUNITY SCHOOL    200      91400F    MAYFIELD COMMUNITY SCHOOL    320      91516B    SKIBBEREEN COMMUNITY SCHOOL    38      Total    67    17570     I trust this clarifies the matter.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 656. Deputy Thomas Gould asked the Minister for Social Protection the number of schools with funded breakfast clubs in Cork. [72126/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_517",
          "debateSectionId": "dbsect_517",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_517.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_656",
        "questionNumber": 656
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Under the Policing, Security, and Community Safety Act 2024 the Garda Commissioner is by law responsible for all operational policing matters, including the management and administration of the PULSE system.  I have been informed by the Garda authorities that the following offence codes under the Control of Horses Act 1996 exist in PULSE.     Offence Code    Offence      A6516    Failure To Obey Garda Direction/Comply With Notice Etc.      A7209    Wilfully Permit a Horse to Pose Danger/ Injury etc.      A7236    Animals Cruelty To Contrary to Section 1 Protection of Animals Act, 1911, as amended by Protection of Animals Act, 1965 and Section 48 of the Control of Horses Act, 1996      A72A05    Keep Horse Without a Licence in Control Area – Owner (Control of Horses)      A72A06    Keep Horse Without a Licence in Control Area – Other Person (Control of Horses)      A72A09    Permit Horse to Pose Danger/Injure/Damage Person or Property      A72A16    Fail to Produce Horse Licence Within 10 Days (Control of Horses)      A72A65    Obstruction of Authorised Person/Garda Member (Control of Horses)      A72A75    Have/Keep/Ride/Drive a Horse in Prohibited Area      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 725. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration whether the Gardaí have coded offences under the Control of Horses Act 1996. [72088/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_575",
          "debateSectionId": "dbsect_575",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_575.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_725",
        "questionNumber": 725
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 726 and 727 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes all operational policing matters. This includes all decisions related to the opening hours of individual Garda stations.  The opening hours of individual Garda Stations including those in Cork City Division and Cork County Division are publicly available on the Garda Station Directory, which can be found at the following link: www.garda.ie/en/contact-us/station-directory/. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 726. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration the number of Garda stations in Cork open during the hours of 9pm and 9am. [72089/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_576",
          "debateSectionId": "dbsect_576",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_576.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_726",
        "questionNumber": 726
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 726 and 727 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes all operational policing matters. This includes all decisions related to the opening hours of individual Garda stations.  The opening hours of individual Garda Stations including those in Cork City Division and Cork County Division are publicly available on the Garda Station Directory, which can be found at the following link: www.garda.ie/en/contact-us/station-directory/. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 727. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration the opening hours of each of the Garda stations in the Cork city and county divisions, in tabular form. [72090/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_576",
          "debateSectionId": "dbsect_576",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_576.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_727",
        "questionNumber": 727
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the distribution and stationing of Garda personnel throughout the State.  The overall Garda workforce, which includes Gardaí, civilian staff and Reserves is close to the highest ever at over 18,000. This includes 14,290 Garda members, 3,487 staff and 291 reserves.  In the interest of transparency, information in relation to the allocation of Garda Staff by Division and Station is publicly available and can be found at the following link:  [ www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ ] .  The Deputy should select the most recent month and access the file titled “Garda Staff by Division and Station to the most recent date” for a breakdown of total Gardaí numbers going back to 2010.  The Deputy should note that this breakdown only includes Garda Staff assigned to stations and does not include staff assigned to Headquarters or National Units. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 728. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration the number of civil servants working in Garda stations currently, by county, in tabular form. [72091/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_578",
          "debateSectionId": "dbsect_578",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_578.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_728",
        "questionNumber": 728
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 729. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration the number of horses seized in Cork to date in 2025. [72094/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_579",
          "debateSectionId": "dbsect_579",
          "showAs": "Animal Welfare",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_579.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_729",
        "questionNumber": 729
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I last met the Chief Superintendent in Cork city on 4 April 2025, during a visit to Tougher Garda Station. This meeting was also attended by senior Gardai based at Anglesea Street and Togher Garda Station.  The Garda Commissioner is responsible for the distribution and stationing of Garda personnel throughout the State under section 33 of the Policing, Security and Community Safety Act 2024. As Minister, I have no role in this matter.  It may be of interest to the Deputy to know that An Garda Síochána publishes detailed breakdowns on the allocation of Gardaí including the allocation of Probationer Gardaí by Division and Station. This information is updated on a monthly basis and can be found at the following link: [ www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ ]. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 730. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration the date of her last meeting with the Chief Superintendent in Cork city; and whether Garda numbers arose as an issue. [72095/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_580",
          "debateSectionId": "dbsect_580",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_580.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_730",
        "questionNumber": 730
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I am advised by the Garda authorities that from 1 January 2025 to 30 November 2025, there were 19 incidents in which scramblers were detained or seized by An Garda Síochána in the Cork Garda Divisions.  These include vehicles seized or detained under the following incident types - ‘Vehicle Detained’, ‘Vehicle Detained (Section 41 RTA)’ and ‘Property Seized’.  These statistics are based on operational data recorded on the PULSE system as of 15 December 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 731. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration the number of scramblers seized in Cork in 2025. [72096/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_581",
          "debateSectionId": "dbsect_581",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_581.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_731",
        "questionNumber": 731
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can advise the Deputy that the report in question has been noted by Cabinet.  The Irish Prison Service has submitted an action plan in response to the recommendations made in this report and the Inspector of Prisons has requested that the inspection report and action plan are published at the same time. The Department is liaising with the Irish Prison Service and the Inspector of Prisons to progress publication of both documents. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 732. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration for an update on the publication of the latest Inspector of Prisons report into Cork Prison. [72097/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_582",
          "debateSectionId": "dbsect_582",
          "showAs": "Prison Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_582.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_732",
        "questionNumber": 732
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have secured a record capital investment of €527 million for the Irish Prison Service (IPS) over the next 5 years, of which €495 million will be invested in building projects to further increase capacity. The target is to deliver over 1,500 new spaces by 2031. This will be the largest ever building programme in the prison estate.  The proposed project for the extension to the existing Cork Prison, on the site of the old, decommissioned Cork Prison, is still at a very early planning stage. Any new prison facility proposed on the Old Cork Prison site will be an extension of the function of the existing prison and will not be a second prison in The Glen area. This intended approach will ensure efficiencies with the design and the practical operations of the new facility in parallel with the existing prison. I am further advised that, as the project progresses, there will be engagement as part of the planning process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 733. Deputy Thomas Gould asked the Minister for Justice, Home Affairs and Migration for an update on plans for a second prison in the Glen; and whether he has met with the community on same. [72098/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_583",
          "debateSectionId": "dbsect_583",
          "showAs": "Prison Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_583.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_733",
        "questionNumber": 733
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 804. Deputy Thomas Gould asked the Minister for Children, Disability and Equality the number of WTE staff in each of the Cork CDNTs; the number considered a full cohort; and the number currently on leave, by role, in tabular form. [72101/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_629",
          "debateSectionId": "dbsect_629",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_629.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_804",
        "questionNumber": 804
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As the subject matter of the Deputy's question relates to an operational matter for Tusla, I have referred the matter to them for a direct reply. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 845. Deputy Thomas Gould asked the Minister for Children, Disability and Equality the number of childcare facilities in Cork that have given notification of closure in each of the past five years. [72154/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_668",
          "debateSectionId": "dbsect_668",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_668.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_845",
        "questionNumber": 845
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The National Childcare Scheme (NCS) provides financial support to help parents reduce the cost of early learning and childcare.  Subsidies are available for children aged between 24 weeks and 15 years of age. The minimum rate available is €2.14 per hour, which is available for up to 45 weekly hours and is paid directly to the childcare provider.  The number of children using the Scheme has grown by over 70% since 2022 due to enhancements further improving the affordability of childcare for parents. These include the extension of the upper age eligibility for the Universal award from 3 years of age to 15 years of age in August 2022. There have also been two increases to the minimum hourly subsidy rate bringing it up to the current rate of €2.14. Since September 2024, all childminders are able to register for the NCS making the scheme more accessible to more parents.  This growth was further supported by Core Funding, which aims to ensure affordability for parents through fee management conditions and ensuring that providers offer NCS and ECCE to all eligible children.  For your information, the table below details the number of services which have left the NCS over the past five years.             Of which:    Of which:      Programme call    Number of services who had a contract for the specified programme year but not for the next programme year (i.e. left NCS for at least one programme year) and are still open    The number of services who re-contracted to NCS after a gap of at least one programme year and are still open    The number of services that never re-contracted to NCS but are still open.      NCS 2020    137    87    50      NCS 2021    63    34    29      NCS 2022    47    20    27      NCS 2023    79    15    64      NCS 2024    69    NA    NA          ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 846. Deputy Thomas Gould asked the Minister for Children, Disability and Equality the number of childcare facilities that have removed themselves from the NCS scheme in each of the past five years. [72155/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_669",
          "debateSectionId": "dbsect_669",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_669.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_846",
        "questionNumber": 846
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  I have asked the HSE, as sponsoring agency with day-to-day responsibility for the delivery of the new elective treatment centres to respond to you directly in relation to the matters raised. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1019. Deputy Thomas Gould asked the Minister for Health the timeline for delivery of the new elective hospital in Cork; and when this will be fully operational. [72100/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Thomas-Gould.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Thomas-Gould.D.2020-02-08",
          "showAs": "Thomas Gould"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_832",
          "debateSectionId": "dbsect_832",
          "showAs": "Healthcare Infrastructure Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_832.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1019",
        "questionNumber": 1019
      },
      "contextDate": "2025-12-16"
    }
  ]
}