{
  "head": {
    "counts": {
      "questionCount": 530,
      "resultCount": 530
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The two funds – the Future Ireland Fund and Infrastructure, Climate and Nature Fund – were created in response to the exceptional levels of corporation tax revenue we have experienced over the last number of years as well as the fiscal costs associated with demographic change.  These funds have two primary purposes which help to ensure the long-term sustainability of the public finances: they ensure that a portion of ‘excess’ corporation tax receipts are saved, rather than used to fund day-to-day expenditure, and they partially fund the expenditure costs associated with known structural challenges that the Irish economy will face, such as ageing costs and decarbonisation.  Over the course of this year, some €6 billion has been transferred from the Exchequer into the Future Ireland Fund and Infrastructure, Climate and Nature Fund. Corporation tax is projected at about €32 billion for the year, excluding the once-off proceeds from the Court of Justice of the EU ruling. In effect, therefore, we are saving around one-fifth of corporation tax receipts.  This brings the total amount that has now been saved in the two funds to over €16 billion.  In 2024, around €4 billion was transferred into the FIF and €2 billion was transferred into the ICNF from the dissolution of the National Reserve Fund. A further €4 billion was also transferred from the Exchequer to the FIF in 2024.  Next year, Government will transfer €6.5 billion into the two funds. This represents a significant portion of the €34 billion corporation tax receipts that are projected to be received in 2026.  Legislation passed by this house does not permit for drawdown from the FIF to occur until 2041. This is to provide sufficient time for the capital of the fund to grow. From 2041, the interest from the FI Fund can be withdrawn each year, up to a maximum of 3% the Net Asset Value of the Fund, maintaining the Capital and allowing the Fund to continue to grow, and provision be made for the future.  There are two mechanism by which drawdown from the ICNF may occur. Firstly up to 25% of the fund can be used to support State expenditure in a year where the Irish Fiscal Advisory Council and Minister for Finance are satisfied that there is a significant deterioration in the economic or fiscal position of the State.  Secondly, between 2026 and 2030, up to 22.5% of the value of the fund may be drawn down annually, up to a total of €3.15 billion, in order to support expenditure on designated environmental projects.  While our finances are currently in a strong position, it is essential that we take action to secure the public finances over the long term to ensure we can meet the future expenditure requirements we know will arise, that is what this Government is doing in committing to these funds. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 186. Deputy Naoise Ó Cearúil asked the Tánaiste and Minister for Finance the proportion of corporation tax receipts currently being set aside in the State’s savings funds; the extent to which this has changed since 2024; and if he will make a statement on the matter. [69880/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_200",
          "debateSectionId": "dbsect_200",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_200.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_186",
        "questionNumber": 186
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Medium-Term Fiscal and Structural Plan (MTP), will be published in the coming days. In line with all relevant European regulations and procedures, the Plan will be submitted to the European Commission shortly thereafter.  Although each Member State has discretion over the content of its MTP, information is required on three core elements: the fiscal strategy, investment plans and structural reforms. Of these, the fiscal strategy is the key component.  Further details will be available when the Plan is published. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 197. Deputy Naoise Ó Cearúil asked the Tánaiste and Minister for Finance when a revised medium-term fiscal plan will be submitted to the European Commission; and if he will make a statement on the matter. [69881/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_212",
          "debateSectionId": "dbsect_212",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_212.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_197",
        "questionNumber": 197
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The EUDR aims to ensure that products consumed within the EU do not contribute to global deforestation and forest degradation. The Commodities that will be subject to the Regulation are rubber, oil palm, soy, wood, cattle, cocoa, and coffee.  Annex I of the regulation lists all of the products to which the EUDR applies. \"Printed books, newspapers, pictures and other products of the printing industry, manuscripts, typescripts and plans, of paper\" were originally included on this list.  However, on December 17th the European Parliament adopted changes to the EUDR, which had already been informally agreed with Member States on 4th December. Among these amendments is the removal of printed products from the scope of this regulation. This is indeed a welcome amendment, and one I have been in support of since its proposal by the European Parliament, as communicated by my Department as part of the ongoing discussions at EU level. My department also met stakeholders representing this sector and has been acutely aware of their concerns.  I continue to advocate for simplifications at EU level, aiming to achieve optimal outcomes, without placing excessive burdens on small business or unnecessary disruption to supply chains. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 586. Deputy Naoise Ó Cearúil asked the Minister for Agriculture, Food and the Marine if he will assess the impact of the EU deforestation regulation on the Irish book industry, particularly the requirement for importers to file due diligence statements for each title; if he will consider designating the relevant tariff code for printed books as ultra-low risk to reduce administrative burdens; and if he will make a statement on the matter. [73281/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_560",
          "debateSectionId": "dbsect_560",
          "showAs": "Forestry Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_560.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_586",
        "questionNumber": 586
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 638. Deputy Naoise Ó Cearúil asked the Minister for Health if she will provide an update on the site selection for the proposed primary care centre for Maynooth/Leixlip, in light of reports that the location may be along the R449 road; and if she will make a statement on the matter.  [73301/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_612",
          "debateSectionId": "dbsect_612",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_612.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_638",
        "questionNumber": 638
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 283 to 285, inclusive, together.  In 2021, following the second call for proposals under the Urban Regeneration and Development Fund (URDF), a provisional allocation of €1,908,750 in URDF support was announced for Kildare County Council's successful proposal – Maynooth Town Centre Renewal – Strengthening the Grid. Comprised of 5 individual projects, the proposal will support the preparation of a Masterplan and the preparation of Key Town Renewal projects. The current approved allocation for the overall proposal is €1,921,696.09.  In relation to the current status of the projects please see the following table:      Project Title      Description of Works      Project Type      Status       Maynooth Town Renewal Masterplan (TRMP)    Preparation of a TRMP to increase town centre living    Technical Assistance    Approval Gate 3 - Final Business Case approved and work has commenced on the Masterplan.      District Heating Exploration project in the historic grid town centre    Funding towards Feasibility Study to determine potential for district heating scheme serving commercial and residential community    Technical Assistance    Approval Gate 3 – Final Business Case has been submitted. Queries have issued to the Council with a response awaited.      Harbourfield Park    Funding towards design and planning stages only.    Technical Assistance    Approval Gate 3 – Final Business Case submission currently under consideration and a response will issue to the Council in due course.      Potential Pilot Project – participatory urban design    Funding towards consultation with stakeholders and community during design process - may include development of online platform    Technical Assistance    Approval Gate 3 – Final Business Case submission awaited from the Council.      Development of Key town renewal projects    Funding towards the progressing key reactivation and urban renewal projects to be identified in the completed Maynooth Town Centre Renewal Plan, to ‘shovel ready’ stage.    Technical Assistance    Strategic Assessment Approved. Upon completion of the Maynooth TRMP, the Council will need to send in an Approval Gate 1 Preliminary Business Case submission on the priority projects identified through the Masterplan for further development.       In relation to the overall costs of the proposal, any increases in costs on URDF projects, are dealt with as part of the Approval Gate submissions for individual projects. Responses will issue to the Council in due course where any additional URDF support has been sought.  It should be noted that while my Department works closely and communicates regularly with Kildare County Council in respect of their URDF Programme of works, responsibility for the advancement of their supported projects through the various stages of planning, development and completion is, in the first instance, a matter for Kildare County Council. Accordingly, queries regarding the technical details of projects should be directed to the Council. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 283. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage to provide an update on the district heating exploration within the Maynooth Town Centre Renewal (URDF Call 2; €1.9 million), including the technical findings and decision gate progress; and if he will make a statement on the matter. [72705/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_263",
          "debateSectionId": "dbsect_263",
          "showAs": "Urban Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_263.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_283",
        "questionNumber": 283
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 283 to 285, inclusive, together.  In 2021, following the second call for proposals under the Urban Regeneration and Development Fund (URDF), a provisional allocation of €1,908,750 in URDF support was announced for Kildare County Council's successful proposal – Maynooth Town Centre Renewal – Strengthening the Grid. Comprised of 5 individual projects, the proposal will support the preparation of a Masterplan and the preparation of Key Town Renewal projects. The current approved allocation for the overall proposal is €1,921,696.09.  In relation to the current status of the projects please see the following table:      Project Title      Description of Works      Project Type      Status       Maynooth Town Renewal Masterplan (TRMP)    Preparation of a TRMP to increase town centre living    Technical Assistance    Approval Gate 3 - Final Business Case approved and work has commenced on the Masterplan.      District Heating Exploration project in the historic grid town centre    Funding towards Feasibility Study to determine potential for district heating scheme serving commercial and residential community    Technical Assistance    Approval Gate 3 – Final Business Case has been submitted. Queries have issued to the Council with a response awaited.      Harbourfield Park    Funding towards design and planning stages only.    Technical Assistance    Approval Gate 3 – Final Business Case submission currently under consideration and a response will issue to the Council in due course.      Potential Pilot Project – participatory urban design    Funding towards consultation with stakeholders and community during design process - may include development of online platform    Technical Assistance    Approval Gate 3 – Final Business Case submission awaited from the Council.      Development of Key town renewal projects    Funding towards the progressing key reactivation and urban renewal projects to be identified in the completed Maynooth Town Centre Renewal Plan, to ‘shovel ready’ stage.    Technical Assistance    Strategic Assessment Approved. Upon completion of the Maynooth TRMP, the Council will need to send in an Approval Gate 1 Preliminary Business Case submission on the priority projects identified through the Masterplan for further development.       In relation to the overall costs of the proposal, any increases in costs on URDF projects, are dealt with as part of the Approval Gate submissions for individual projects. Responses will issue to the Council in due course where any additional URDF support has been sought.  It should be noted that while my Department works closely and communicates regularly with Kildare County Council in respect of their URDF Programme of works, responsibility for the advancement of their supported projects through the various stages of planning, development and completion is, in the first instance, a matter for Kildare County Council. Accordingly, queries regarding the technical details of projects should be directed to the Council. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 284. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage to provide an update on the Harbourfield Park project within the Maynooth Town Centre Renewal (URDF Call 2; €1.9 million), including the dates for Part 8, tender and commencement on site; and if he will make a statement on the matter. [72706/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_263",
          "debateSectionId": "dbsect_263",
          "showAs": "Urban Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_263.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_284",
        "questionNumber": 284
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 283 to 285, inclusive, together.  In 2021, following the second call for proposals under the Urban Regeneration and Development Fund (URDF), a provisional allocation of €1,908,750 in URDF support was announced for Kildare County Council's successful proposal – Maynooth Town Centre Renewal – Strengthening the Grid. Comprised of 5 individual projects, the proposal will support the preparation of a Masterplan and the preparation of Key Town Renewal projects. The current approved allocation for the overall proposal is €1,921,696.09.  In relation to the current status of the projects please see the following table:      Project Title      Description of Works      Project Type      Status       Maynooth Town Renewal Masterplan (TRMP)    Preparation of a TRMP to increase town centre living    Technical Assistance    Approval Gate 3 - Final Business Case approved and work has commenced on the Masterplan.      District Heating Exploration project in the historic grid town centre    Funding towards Feasibility Study to determine potential for district heating scheme serving commercial and residential community    Technical Assistance    Approval Gate 3 – Final Business Case has been submitted. Queries have issued to the Council with a response awaited.      Harbourfield Park    Funding towards design and planning stages only.    Technical Assistance    Approval Gate 3 – Final Business Case submission currently under consideration and a response will issue to the Council in due course.      Potential Pilot Project – participatory urban design    Funding towards consultation with stakeholders and community during design process - may include development of online platform    Technical Assistance    Approval Gate 3 – Final Business Case submission awaited from the Council.      Development of Key town renewal projects    Funding towards the progressing key reactivation and urban renewal projects to be identified in the completed Maynooth Town Centre Renewal Plan, to ‘shovel ready’ stage.    Technical Assistance    Strategic Assessment Approved. Upon completion of the Maynooth TRMP, the Council will need to send in an Approval Gate 1 Preliminary Business Case submission on the priority projects identified through the Masterplan for further development.       In relation to the overall costs of the proposal, any increases in costs on URDF projects, are dealt with as part of the Approval Gate submissions for individual projects. Responses will issue to the Council in due course where any additional URDF support has been sought.  It should be noted that while my Department works closely and communicates regularly with Kildare County Council in respect of their URDF Programme of works, responsibility for the advancement of their supported projects through the various stages of planning, development and completion is, in the first instance, a matter for Kildare County Council. Accordingly, queries regarding the technical details of projects should be directed to the Council. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 285. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage whether his Department has approved any cost re baselining for the Maynooth Town Centre Renewal to address inflationary impacts; and if he will make a statement on the matter. [72707/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_263",
          "debateSectionId": "dbsect_263",
          "showAs": "Urban Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_263.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_285",
        "questionNumber": 285
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 286 and 303 together.  The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in project to regenerate the public realm.  In that respect, and as set out in Delivering Homes, Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated National Development Plan (NDP). Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support urban regeneration projects and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream are currently under development following the completion of the NDP Review process. Further details should issue to the local authorities in the coming weeks.  In the meantime, the existing €2 billion URDF continues to drive delivery of the 132 successful applications for funding. It comprises of approximately 430 individual projects which are currently progressing through the various stages of the project lifecycle, along with a dedicated programme of acquisitions in each local authority to address long term vacancy and dereliction.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any current and future applications for URDF funding, such as those in Leixlip, and their advancement through the various stages of planning, development and completion will remain, in the first instance, a matter for the relevant local authority. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 286. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage whether capital will be provided under the URDF or its successor to deliver the priority projects identified in the Leixlip Town Renewal Masterplan, including streets, public realm and site assembly; and if he will make a statement on the matter. [72708/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "Urban Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_286",
        "questionNumber": 286
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The Government’s ‘Town Centre First’ (TCF) Policy Approach was launched by my Department and the then Department of Rural and Community Development in 2022, and since then, a range of supports and measures to encourage more people to live, do business and visit our town centres have been introduced.  Using the Town Centre First approach, town centres are developed so that they become viable, vibrant and attractive locations for people to live and work in and to visit, while also supporting the retail and economic role of our towns. A network of Town Regeneration Officers in the local government sector assist the delivery of Town Centre First initiatives. These officers lead the local efforts, and collaborate with their colleagues and stakeholders to ensure an integrated approach is taken.  The Town Centre First policy lays the foundation for each town to develop their own plan-led path forward through a tailored Town Centre First Plan which is underpinned by a clear diagnosis of local strengths and challenges. This TCF Plan is driven by the local community and businesses as part of a Town Team who are be supported by Town Regeneration Officers and technical expertise within each Local Authority.  26 ‘Pathfinder’ towns were identified to prepare the first phase of TCF Plans and these were launched in February 2024. Further TCF Plans have been completed and are under preparation across the country in towns of varying sizes.  These community based plans are identifying regeneration projects and initiatives for subsequent appropriate funding applications and delivery – projects for tackling vacant sites, creating community parks and river walkways, boosting SME and tourism, renovating historical landmarks, and attracting more people to live and work in our town centres.  Town Centre First and wider town generation is currently being supported by the Urban Regeneration and Development Fund (URDF) with new regeneration investment funding in towns of over a €650m committed under the URDF programme. These capital projects focus on improvement to town centres and their environments such as public realm improvements, pedestrian infrastructure and amenities. Details of these projects are available at: [ URDF Tracker ]  The Rural Regeneration and Development Fund (RRDF) operated by the Department of Rural and Community and the Gaeltacht is providing similar support for the implementation of Town Centre First projects for smaller towns and settlements nationally.  THRIVE (Town Centre First Heritage Revival) Scheme is a grant scheme of c. €120million for local authorities which is co-funded by the Government and the European Union and delivered under Ireland’s two ERDF (European Regional Development Fund) Regional Programmes. The THRIVE Scheme provides funding for the preparation of Town Centre First Plans, strategies and project development work in towns (c. €5 million in total) to enable future capital funding applications to be made to Government for the identified projects in these plans. THRIVE also supports town regeneration through direct capital funding of €115 million in total for the implementation of identified heritage-related projects in town centres – with 19 projects currently being funded across the country.  Further details are available at:  www.nwra.ie/erdf/schemes/thrive/  southernassembly.ie/erdf-priority-3/thrive/ ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 287. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage how the Town Centre First policy and the Rural Regeneration and Development Fund (RRDF) can be combined with the Urban Regeneration and Development Fund (URDF) to advance town centre projects from plan to implementation, with clear key performance indicators and phasing; and if he will make a statement on the matter. [72709/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_287",
        "questionNumber": 287
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 288, 289, 299 and 304 together.  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  The URDF applies to the five cities and their metropolitan areas, larger towns with a population of more than 10,000 people and to a number of smaller towns with fewer than 10,000 people but with more than 2,500 jobs and which function as significant centres of employment.  The URDF is complemented by the Rural Regeneration and Development Fund (RRDF), which is applicable to towns not eligible for the URDF and is overseen by the Department of Rural and Community Development.  The 7 areas eligible for URDF support in Kildare include: Celbridge, Leixlip, Maynooth, Naas, Newbridge, Athy, Kildare Town, with Athy and Kildare Town added in 2024 following publication of the Census 2022 results.  To date Kildare County Council has been provisionally allocated €21,991,603 in URDF support towards their seven successful proposals approved under Call 1 and Call 2. The table below has further details on the drawdown to date for Call 1 and 2 projects in Kildare.     Project Title    Allocation    Drawdown      Naas Library (including Public Realm works)    €6,826,897.56    €6,826,897.56      Celbridge Southern Relief Road & Second Liffey Crossing    €419,560.09    €419,560.09      Newbridge Cultural and Civic Quarter    €520,722.81    €520,722.81      Canal Quarter Naas    €383,104.47    €304,437.15      Maynooth Town Centre Renewal - Strengthening the Grid    €1,921,696.09    €192,989.71      Naas Town Centre Renewal Masterplan    €1,682,121.96    €1,412,411.24      Celbridge to Hazelhatch Link Road    €10,237,500    €726,151.28       While Calls 1 and 2 were for specific regeneration projects, the third round of funding (Call 3) is specifically focussed towards addressing long term vacancy and dereliction, while supporting the key objectives of Housing for All and Town Centre First.  The Council was allocated €7,000,000 for their approved Call 3 programme.  As a signal of Government commitment to this initiative Kildare County Council received €800,000 of their Call 3 allocation by way of forward funding, so that they were well resourced to begin addressing this issue.  The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in projects to regenerate the public realm;  • include all towns with a population over 10,000 in the designation of 'key towns' and ensure towns which fall slightly below the population thresholds are considered for applications under the Fund.  In that respect, and as set out in Delivering Homes, Building Communities, the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support urban regeneration projects and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream, including the towns that will be eligible for funding, are currently under development following the completion of the National Development Plan Review process. Further details should issue to the local authorities in the coming weeks.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any applications for funding and their advancement through the various stages of planning, development and completion will remain, in the first instance, a matter for the relevant local authority. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 288. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage to detail the funding routes available for towns in Kildare north which have comparable regeneration needs but historically sat outside the URDF large town thresholds (details supplied); and if he will make a statement on the matter. [72710/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_266",
          "debateSectionId": "dbsect_266",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_266.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_288",
        "questionNumber": 288
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 288, 289, 299 and 304 together.  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  The URDF applies to the five cities and their metropolitan areas, larger towns with a population of more than 10,000 people and to a number of smaller towns with fewer than 10,000 people but with more than 2,500 jobs and which function as significant centres of employment.  The URDF is complemented by the Rural Regeneration and Development Fund (RRDF), which is applicable to towns not eligible for the URDF and is overseen by the Department of Rural and Community Development.  The 7 areas eligible for URDF support in Kildare include: Celbridge, Leixlip, Maynooth, Naas, Newbridge, Athy, Kildare Town, with Athy and Kildare Town added in 2024 following publication of the Census 2022 results.  To date Kildare County Council has been provisionally allocated €21,991,603 in URDF support towards their seven successful proposals approved under Call 1 and Call 2. The table below has further details on the drawdown to date for Call 1 and 2 projects in Kildare.     Project Title    Allocation    Drawdown      Naas Library (including Public Realm works)    €6,826,897.56    €6,826,897.56      Celbridge Southern Relief Road & Second Liffey Crossing    €419,560.09    €419,560.09      Newbridge Cultural and Civic Quarter    €520,722.81    €520,722.81      Canal Quarter Naas    €383,104.47    €304,437.15      Maynooth Town Centre Renewal - Strengthening the Grid    €1,921,696.09    €192,989.71      Naas Town Centre Renewal Masterplan    €1,682,121.96    €1,412,411.24      Celbridge to Hazelhatch Link Road    €10,237,500    €726,151.28       While Calls 1 and 2 were for specific regeneration projects, the third round of funding (Call 3) is specifically focussed towards addressing long term vacancy and dereliction, while supporting the key objectives of Housing for All and Town Centre First.  The Council was allocated €7,000,000 for their approved Call 3 programme.  As a signal of Government commitment to this initiative Kildare County Council received €800,000 of their Call 3 allocation by way of forward funding, so that they were well resourced to begin addressing this issue.  The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in projects to regenerate the public realm;  • include all towns with a population over 10,000 in the designation of 'key towns' and ensure towns which fall slightly below the population thresholds are considered for applications under the Fund.  In that respect, and as set out in Delivering Homes, Building Communities, the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support urban regeneration projects and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream, including the towns that will be eligible for funding, are currently under development following the completion of the National Development Plan Review process. Further details should issue to the local authorities in the coming weeks.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any applications for funding and their advancement through the various stages of planning, development and completion will remain, in the first instance, a matter for the relevant local authority. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 289. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage whether the new Towns and Cities Infrastructure Investment Fund will explicitly include towns in Kildare north, or whether the RRDF and Town Centre First will be the primary route; and to outline the timeline for access (details supplied); and if he will make a statement on the matter. [72711/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_266",
          "debateSectionId": "dbsect_266",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_266.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_289",
        "questionNumber": 289
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 288, 289, 299 and 304 together.  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  The URDF applies to the five cities and their metropolitan areas, larger towns with a population of more than 10,000 people and to a number of smaller towns with fewer than 10,000 people but with more than 2,500 jobs and which function as significant centres of employment.  The URDF is complemented by the Rural Regeneration and Development Fund (RRDF), which is applicable to towns not eligible for the URDF and is overseen by the Department of Rural and Community Development.  The 7 areas eligible for URDF support in Kildare include: Celbridge, Leixlip, Maynooth, Naas, Newbridge, Athy, Kildare Town, with Athy and Kildare Town added in 2024 following publication of the Census 2022 results.  To date Kildare County Council has been provisionally allocated €21,991,603 in URDF support towards their seven successful proposals approved under Call 1 and Call 2. The table below has further details on the drawdown to date for Call 1 and 2 projects in Kildare.     Project Title    Allocation    Drawdown      Naas Library (including Public Realm works)    €6,826,897.56    €6,826,897.56      Celbridge Southern Relief Road & Second Liffey Crossing    €419,560.09    €419,560.09      Newbridge Cultural and Civic Quarter    €520,722.81    €520,722.81      Canal Quarter Naas    €383,104.47    €304,437.15      Maynooth Town Centre Renewal - Strengthening the Grid    €1,921,696.09    €192,989.71      Naas Town Centre Renewal Masterplan    €1,682,121.96    €1,412,411.24      Celbridge to Hazelhatch Link Road    €10,237,500    €726,151.28       While Calls 1 and 2 were for specific regeneration projects, the third round of funding (Call 3) is specifically focussed towards addressing long term vacancy and dereliction, while supporting the key objectives of Housing for All and Town Centre First.  The Council was allocated €7,000,000 for their approved Call 3 programme.  As a signal of Government commitment to this initiative Kildare County Council received €800,000 of their Call 3 allocation by way of forward funding, so that they were well resourced to begin addressing this issue.  The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in projects to regenerate the public realm;  • include all towns with a population over 10,000 in the designation of 'key towns' and ensure towns which fall slightly below the population thresholds are considered for applications under the Fund.  In that respect, and as set out in Delivering Homes, Building Communities, the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support urban regeneration projects and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream, including the towns that will be eligible for funding, are currently under development following the completion of the National Development Plan Review process. Further details should issue to the local authorities in the coming weeks.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any applications for funding and their advancement through the various stages of planning, development and completion will remain, in the first instance, a matter for the relevant local authority. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 299. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the eligibility under the Urban Regeneration and Development Fund Calls 1, 2 and 3; the amounts allocated, profiled and drawn down to date; the key milestones achieved for towns in Kildare North (details supplied); and if he will make a statement on the matter. [73046/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_266",
          "debateSectionId": "dbsect_266",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_266.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_299",
        "questionNumber": 299
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 300 to 302, inclusive, together.  In line with the agreed Programme for Government, and as set out in Delivering Homes Building Communities, the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP.  The URDF supported capital programme is applicant-led and while my Department works closely and communicates regularly with Kildare County Council in respect of project delivery, responsibility for the advancement of URDF-supported projects, such as the Celbridge to Hazelhatch Link Road project, through the various stages of the project lifecycle is, in the first instance, a matter for the Sponsoring Agency (in this case Kildare County Council).  It is a condition of URDF support that advancement of proposals/projects and related funding arrangements must accord with the Department’s Guidance on applying the Infrastructure Guidelines (formerly the Public Spending Code) to URDF-supported projects.  This requires a local authority to ensure that at each of three Approval Gates it provides a submission to my Department for approval prior to progressing to the next stage of the project lifecycle. These Approval Gates are:  • AG1 - Approval in Principle (Preliminary Business Case)  • AG2 - Pre-Tender Approval (Project Design, Planning and Procurement Strategy)  • AG3 - Post-Tender Approval (Final Business Case)  Approximately €10 million of URDF funding has been allocated towards Kildare County Council’s Call 2 proposal for a Celbridge to Hazelhatch Link Road. This project involves the proposed delivery of a 2km link road and a second bridge over the River Liffey, which includes the land purchase and construction of the bridge with 300m of road. It would provide essential infrastructure to support compact urban growth in Celbridge as well as enhanced connectivity between the town and Hazelhatch Train Station.  In February 2025, Kildare County Council submitted an Approval Gate 1 Preliminary Business Case (PBC) for the project, which outlined a substantial increase in overall project costs. Following an initial review of the Council's submission and clarification on the estimated costs, my Department recently met with the Council to discuss how best to progress the project. At this meeting, a revised proposal to utilise the approved URDF allocation to provide for further design work and some construction elements, including completion of the bridge, was discussed.  On foot of this meeting, my Department wrote to the Council on 11 November 2025 confirming provisional support for its proposal. This provisional support is subject to the Council forwarding a revised PBC submission detailing its proposed options for proceeding with the revised proposal. This submission will also set out options for delivery of the remainder of the original proposal.  My Department is currently awaiting this submission.  In respect of the query on the Maynooth Town Centre Works, the Deputy should refer to the response to his question (No. 283 of 17 December) on the Call 2 Maynooth Town Centre Renewal – Strengthening the Grid proposal. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 300. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the reasons for delays or slippage in the delivery of projects funded under the Urban Regeneration and Development Fund Calls 1, 2 and 3, with reference to the proposed second Liffey crossing in Celbridge and the Maynooth town centre works, in view of the significant allocations made to County Kildare under these calls; and if he will make a statement on the matter. [73048/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_272",
          "debateSectionId": "dbsect_272",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_272.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_300",
        "questionNumber": 300
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 300 to 302, inclusive, together.  In line with the agreed Programme for Government, and as set out in Delivering Homes Building Communities, the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP.  The URDF supported capital programme is applicant-led and while my Department works closely and communicates regularly with Kildare County Council in respect of project delivery, responsibility for the advancement of URDF-supported projects, such as the Celbridge to Hazelhatch Link Road project, through the various stages of the project lifecycle is, in the first instance, a matter for the Sponsoring Agency (in this case Kildare County Council).  It is a condition of URDF support that advancement of proposals/projects and related funding arrangements must accord with the Department’s Guidance on applying the Infrastructure Guidelines (formerly the Public Spending Code) to URDF-supported projects.  This requires a local authority to ensure that at each of three Approval Gates it provides a submission to my Department for approval prior to progressing to the next stage of the project lifecycle. These Approval Gates are:  • AG1 - Approval in Principle (Preliminary Business Case)  • AG2 - Pre-Tender Approval (Project Design, Planning and Procurement Strategy)  • AG3 - Post-Tender Approval (Final Business Case)  Approximately €10 million of URDF funding has been allocated towards Kildare County Council’s Call 2 proposal for a Celbridge to Hazelhatch Link Road. This project involves the proposed delivery of a 2km link road and a second bridge over the River Liffey, which includes the land purchase and construction of the bridge with 300m of road. It would provide essential infrastructure to support compact urban growth in Celbridge as well as enhanced connectivity between the town and Hazelhatch Train Station.  In February 2025, Kildare County Council submitted an Approval Gate 1 Preliminary Business Case (PBC) for the project, which outlined a substantial increase in overall project costs. Following an initial review of the Council's submission and clarification on the estimated costs, my Department recently met with the Council to discuss how best to progress the project. At this meeting, a revised proposal to utilise the approved URDF allocation to provide for further design work and some construction elements, including completion of the bridge, was discussed.  On foot of this meeting, my Department wrote to the Council on 11 November 2025 confirming provisional support for its proposal. This provisional support is subject to the Council forwarding a revised PBC submission detailing its proposed options for proceeding with the revised proposal. This submission will also set out options for delivery of the remainder of the original proposal.  My Department is currently awaiting this submission.  In respect of the query on the Maynooth Town Centre Works, the Deputy should refer to the response to his question (No. 283 of 17 December) on the Call 2 Maynooth Town Centre Renewal – Strengthening the Grid proposal. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 301. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage when approval Gate 1 will be completed, approval Gate 2 and Gate 3 scheduled for the Celbridge/Hazelhatch Link Road and second Liffey crossing; and if he will make a statement on the matter. [73049/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_272",
          "debateSectionId": "dbsect_272",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_272.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_301",
        "questionNumber": 301
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 300 to 302, inclusive, together.  In line with the agreed Programme for Government, and as set out in Delivering Homes Building Communities, the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP.  The URDF supported capital programme is applicant-led and while my Department works closely and communicates regularly with Kildare County Council in respect of project delivery, responsibility for the advancement of URDF-supported projects, such as the Celbridge to Hazelhatch Link Road project, through the various stages of the project lifecycle is, in the first instance, a matter for the Sponsoring Agency (in this case Kildare County Council).  It is a condition of URDF support that advancement of proposals/projects and related funding arrangements must accord with the Department’s Guidance on applying the Infrastructure Guidelines (formerly the Public Spending Code) to URDF-supported projects.  This requires a local authority to ensure that at each of three Approval Gates it provides a submission to my Department for approval prior to progressing to the next stage of the project lifecycle. These Approval Gates are:  • AG1 - Approval in Principle (Preliminary Business Case)  • AG2 - Pre-Tender Approval (Project Design, Planning and Procurement Strategy)  • AG3 - Post-Tender Approval (Final Business Case)  Approximately €10 million of URDF funding has been allocated towards Kildare County Council’s Call 2 proposal for a Celbridge to Hazelhatch Link Road. This project involves the proposed delivery of a 2km link road and a second bridge over the River Liffey, which includes the land purchase and construction of the bridge with 300m of road. It would provide essential infrastructure to support compact urban growth in Celbridge as well as enhanced connectivity between the town and Hazelhatch Train Station.  In February 2025, Kildare County Council submitted an Approval Gate 1 Preliminary Business Case (PBC) for the project, which outlined a substantial increase in overall project costs. Following an initial review of the Council's submission and clarification on the estimated costs, my Department recently met with the Council to discuss how best to progress the project. At this meeting, a revised proposal to utilise the approved URDF allocation to provide for further design work and some construction elements, including completion of the bridge, was discussed.  On foot of this meeting, my Department wrote to the Council on 11 November 2025 confirming provisional support for its proposal. This provisional support is subject to the Council forwarding a revised PBC submission detailing its proposed options for proceeding with the revised proposal. This submission will also set out options for delivery of the remainder of the original proposal.  My Department is currently awaiting this submission.  In respect of the query on the Maynooth Town Centre Works, the Deputy should refer to the response to his question (No. 283 of 17 December) on the Call 2 Maynooth Town Centre Renewal – Strengthening the Grid proposal. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 302. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage whether his Department will commit to the end 2027 completion date referenced locally for the Celbridge/Hazelhatch Link Road and second Liffey crossing, in view of the €10.23 million allocated under call 2 and the €400,000 allocated under call 1 for technical assistance; and if he will make a statement on the matter. [73050/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_272",
          "debateSectionId": "dbsect_272",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_272.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_302",
        "questionNumber": 302
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 286 and 303 together.  The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in project to regenerate the public realm.  In that respect, and as set out in Delivering Homes, Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated National Development Plan (NDP). Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support urban regeneration projects and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream are currently under development following the completion of the NDP Review process. Further details should issue to the local authorities in the coming weeks.  In the meantime, the existing €2 billion URDF continues to drive delivery of the 132 successful applications for funding. It comprises of approximately 430 individual projects which are currently progressing through the various stages of the project lifecycle, along with a dedicated programme of acquisitions in each local authority to address long term vacancy and dereliction.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any current and future applications for URDF funding, such as those in Leixlip, and their advancement through the various stages of planning, development and completion will remain, in the first instance, a matter for the relevant local authority. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 303. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the timeline for the establishment of the Towns and Cities Infrastructure Investment Fund to replace the URDF; and if he will make a statement on the matter. [73051/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "Urban Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_303",
        "questionNumber": 303
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 288, 289, 299 and 304 together.  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  The URDF applies to the five cities and their metropolitan areas, larger towns with a population of more than 10,000 people and to a number of smaller towns with fewer than 10,000 people but with more than 2,500 jobs and which function as significant centres of employment.  The URDF is complemented by the Rural Regeneration and Development Fund (RRDF), which is applicable to towns not eligible for the URDF and is overseen by the Department of Rural and Community Development.  The 7 areas eligible for URDF support in Kildare include: Celbridge, Leixlip, Maynooth, Naas, Newbridge, Athy, Kildare Town, with Athy and Kildare Town added in 2024 following publication of the Census 2022 results.  To date Kildare County Council has been provisionally allocated €21,991,603 in URDF support towards their seven successful proposals approved under Call 1 and Call 2. The table below has further details on the drawdown to date for Call 1 and 2 projects in Kildare.     Project Title    Allocation    Drawdown      Naas Library (including Public Realm works)    €6,826,897.56    €6,826,897.56      Celbridge Southern Relief Road & Second Liffey Crossing    €419,560.09    €419,560.09      Newbridge Cultural and Civic Quarter    €520,722.81    €520,722.81      Canal Quarter Naas    €383,104.47    €304,437.15      Maynooth Town Centre Renewal - Strengthening the Grid    €1,921,696.09    €192,989.71      Naas Town Centre Renewal Masterplan    €1,682,121.96    €1,412,411.24      Celbridge to Hazelhatch Link Road    €10,237,500    €726,151.28       While Calls 1 and 2 were for specific regeneration projects, the third round of funding (Call 3) is specifically focussed towards addressing long term vacancy and dereliction, while supporting the key objectives of Housing for All and Town Centre First.  The Council was allocated €7,000,000 for their approved Call 3 programme.  As a signal of Government commitment to this initiative Kildare County Council received €800,000 of their Call 3 allocation by way of forward funding, so that they were well resourced to begin addressing this issue.  The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in projects to regenerate the public realm;  • include all towns with a population over 10,000 in the designation of 'key towns' and ensure towns which fall slightly below the population thresholds are considered for applications under the Fund.  In that respect, and as set out in Delivering Homes, Building Communities, the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support urban regeneration projects and the development of sustainable communities.  The detailed arrangements for the implementation of this additional funding stream, including the towns that will be eligible for funding, are currently under development following the completion of the National Development Plan Review process. Further details should issue to the local authorities in the coming weeks.  My Department will work closely with local authorities in respect of project development under the URDF. However, responsibility for the composition of any applications for funding and their advancement through the various stages of planning, development and completion will remain, in the first instance, a matter for the relevant local authority. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 304. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage whether towns that have URDF masterplans but limited capital and towns outside the URDF's historic thresholds will be eligible for site assembly, public realm and enabling infrastructure under the new fund (details supplied); and if he will make a statement on the matter. [73052/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_266",
          "debateSectionId": "dbsect_266",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_266.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_304",
        "questionNumber": 304
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The revised National Development Plan (NDP) was published in July and set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, annual sectoral capital allocations have been agreed for departments for 2026 to 2030. As part of the NDP Review, €36 billion in Exchequer funding was allocated to my Department.  In line with the agreed Programme for Government, and as set out in Delivering Homes Building Communities, the initial €2 billion allocation to the Urban Regeneration and Development Fund (URDF) has been extended by a further €500 million to 2030 under the updated NDP. Working alongside other funding streams, this additional funding will expand URDF-type investments to provide broader public investment to support regeneration and the development of sustainable communities. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 305. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the interim supports available pending completion of the national development plan review; and if he will make a statement on the matter. [73053/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_274",
          "debateSectionId": "dbsect_274",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_274.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_305",
        "questionNumber": 305
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 306 and 307 together.  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  While Calls 1 and 2 were for specific regeneration projects, the third round of funding (Call 3) is specifically focussed towards addressing long term vacancy and dereliction, while supporting the key objectives of Housing for All and Town Centre First. Call 3 provided a €150 million revolving fund for local authorities to acquire long-term vacant or derelict properties in URDF eligible towns and cities.  The most recent (Q1 2025) report on the Call 3 programme that was provided to the Department of Public Expenditure Infrastructure, Public Service Reform and Digitalisation shows that a total of 1,377 residential and commercial properties were approved by my Department for inclusion on Local Authority’s Approved Programmes.  It should be noted that properties approved for inclusion in the programme are not immediately acquired by local authorities. An initial engagement by the local authority with the property owner provides an opportunity for that owner to bring the property back into use in the first instance and without the need for further local authority intervention. Some 361 properties are being brought back into use by property owners in this manner and these properties will be monitored by local authorities to ensure follow-through.  A breakdown of progress made to date by Kildare County Council is shown below:     -     Current Number of approved properties      Proceeding through engagement stages      Found not vacant, Brought back into use by owner, or Being dealt with under different programme      Process to Purchase commenced      Properties acquired        Kildare     56    27    19    7    3       The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in project to regenerate the public realm.  In that respect, and as set out in Delivering Homes, Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. It is on this basis that I intend to extend the reach of URDF Call 3 to better deal with derelict sites or lands, in order to increase the delivery of new homes. This will enable a focus on problematic infill derelict sites where acquiring and developing homes will remove dereliction, and support regeneration of adjoining buildings.  While suitable properties continued to be added to the Call 3 programme following the initial announcement of each approved programme of acquisitions, each Local Authority will be encouraged to make further submissions to my Department for the inclusion of additional properties based on the extended scope of the programme.  I intend to publish an updated report, covering the period to the end of Q3 2025, in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 306. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage if he will provide quarterly reporting on the number and location of properties approved for acquisition under URDF Call 3 in County Kildare; the number acquired to date; and the number resold and brought back into residential use; and if he will make a statement on the matter. [73054/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_275",
          "debateSectionId": "dbsect_275",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_275.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_306",
        "questionNumber": 306
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 306 and 307 together.  A flagship element of Project Ireland 2040, the Urban Regeneration and Development Fund (URDF) is supporting a programme of significant transformational capital projects that will contribute to the regeneration and rejuvenation of Ireland’s cities and other large towns, in line with the objectives of the National Planning Framework and the National Development Plan.  While Calls 1 and 2 were for specific regeneration projects, the third round of funding (Call 3) is specifically focussed towards addressing long term vacancy and dereliction, while supporting the key objectives of Housing for All and Town Centre First. Call 3 provided a €150 million revolving fund for local authorities to acquire long-term vacant or derelict properties in URDF eligible towns and cities.  The most recent (Q1 2025) report on the Call 3 programme that was provided to the Department of Public Expenditure Infrastructure, Public Service Reform and Digitalisation shows that a total of 1,377 residential and commercial properties were approved by my Department for inclusion on Local Authority’s Approved Programmes.  It should be noted that properties approved for inclusion in the programme are not immediately acquired by local authorities. An initial engagement by the local authority with the property owner provides an opportunity for that owner to bring the property back into use in the first instance and without the need for further local authority intervention. Some 361 properties are being brought back into use by property owners in this manner and these properties will be monitored by local authorities to ensure follow-through.  A breakdown of progress made to date by Kildare County Council is shown below:     -     Current Number of approved properties      Proceeding through engagement stages      Found not vacant, Brought back into use by owner, or Being dealt with under different programme      Process to Purchase commenced      Properties acquired        Kildare     56    27    19    7    3       The agreed Programme for Government included a commitment to establish a new Towns and Cities Infrastructure Investment Fund to:  • invest in infrastructure, acquire land, assemble sites, de-risk sites;  • support the development of new transport orientated development towns as necessary; and  • continue and expand URDF (Urban Regeneration and Development Fund) investments in project to regenerate the public realm.  In that respect, and as set out in Delivering Homes, Building Communities , the initial €2 billion allocation to the URDF has been extended by a further €500 million to 2030 under the updated NDP. It is on this basis that I intend to extend the reach of URDF Call 3 to better deal with derelict sites or lands, in order to increase the delivery of new homes. This will enable a focus on problematic infill derelict sites where acquiring and developing homes will remove dereliction, and support regeneration of adjoining buildings.  While suitable properties continued to be added to the Call 3 programme following the initial announcement of each approved programme of acquisitions, each Local Authority will be encouraged to make further submissions to my Department for the inclusion of additional properties based on the extended scope of the programme.  I intend to publish an updated report, covering the period to the end of Q3 2025, in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 307. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the plan to scale the URDF Call 3 revolving fund beyond current approvals, in the context of the national €142.5 million allocation and Kildare's reported €7 million for 27 properties; and if he will make a statement on the matter. [73055/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_275",
          "debateSectionId": "dbsect_275",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_275.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_307",
        "questionNumber": 307
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Under the Urban Regeneration and Development Fund's (URDF) first Call for Proposals, a provisional allocation of €195,000 in URDF support was announced for Kildare County Council's proposal to develop a Masterplan for the Canal Quarter area of Naas.  The Council received Preliminary Business Case approval for the development of the Canal Quarter Masterplan in August 2023 and Final Business Case Approval in June 2024 for the appointment of consultants to deliver the project. The project is estimated for completion in early 2026. The Masterplan incorporates the principles of Town Centre First - A Policy Approach for Irish Towns (2021) including consultation with a wide range of stakeholders and building on the Naas Local Area Plan (LAP). The URDF allocation currently approved for this project is €383,104.  Naas Library and Cultural Centre, was approved as a separate project under the first call for proposals, with URDF support of €6,826,898 provided towards the redevelopment of and rejuvenation of Naas Town Hall to provide a library and cultural centre in a historic town centre site. The library was officially opened to the public on 19th January 2024.  In 2021, following the second call for proposals under the Urban Regeneration and Development Fund (URDF), a provisional allocation of €3,496,374 in URDF support was announced for Kildare County Council's proposal – Naas Town Renewal Masterplan which consists of the following components:  • Naas Town Renewal Masterplan  • Background Assessments  • Assembly of Strategic Sites  • Technical Assistance for future Transport Interventions  As a result of some of the proposed site acquisitions under the Site Assembly project no longer being available to purchase, the allocation approved for the overall Naas Town Renewal Masterplan proposal is now €1,682,122, with the savings transferred to cover cost increases on other URDF projects in County Kildare. Kildare County Council has drawn down €1,412,411 in URDF support to date on the overall Naas Town Renewal Masterplan proposal.  Subject to satisfactory completion of both the Canal Quarter Masterplan and Naas Town Renewal Masterplan, it will be a matter for Kildare County Council to decide the next steps on any further advancement of the completed masterplans.  Finally, while my Department works closely and communicates regularly with Kildare County Council, it should be noted that responsibility for the advancement of URDF-supported projects through the various stages of the project lifecycle is, in the first instance, a matter for the Sponsoring Agency (in this case Kildare County Council). Any further queries regarding timelines for these projects should be directed to the Council. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 308. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the way in which the URDF support for the Naas Canal Quarter Masterplan will be sequenced to integrate with the Naas Library and Cultural Centre and nearby assets; to confirm the drawdown profile for the €3.49 million Naas Town Renewal Masterplan allocation; and if he will make a statement on the matter. [73056/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_276",
          "debateSectionId": "dbsect_276",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_276.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_308",
        "questionNumber": 308
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 16 to 24, inclusive, together.  I attended the leaders’ summit at COP30 in Belém, Brazil, on 6 and 7 November. Coming a decade after the Paris Agreement and during a period of enhanced geopolitical turbulence, my attendance at the summit was an important opportunity to show Ireland’s continuing commitment to the objectives of the UN Framework Convention on Climate Change and the Paris Agreement to limit emissions in order to avoid the worst impacts of climate change. I delivered Ireland’s national statement on 6 November, highlighting the reality that climate change is no longer a distant threat and pointing to the remarkable litany of record-breaking climate events in the 12 months since COP29 in Azerbaijan, including Storm Éowyn which brought the strongest wind gusts ever recorded in Ireland and the highest storm surges on the western seaboard. We saw the damage that Storm Bram caused last week to counties all over the country. I also argued that the sharpest impacts of climate change are felt by the world’s most vulnerable people and countries and noted that no country can successfully address the crisis of climate change alone.  I participated in two thematic round tables with my fellow leaders to discuss climate issues of common concern. The first focused on \"Climate and Nature: Forests and Oceans\". I reiterated Ireland’s strong support for the agreement reached at COP15 to protect at least 30% of land and oceans by 2030. The second thematic session took the form of a panel discussion on \"Energy transition and ten years of the Paris Agreement: NDCs and financing\". I expressed Ireland’s commitment to ensuring a just and inclusive energy transition pathway for all nations. I also shared Ireland’s focus on accelerating the delivery of renewable generation. I also participated in a small round table hosted by President Lula da Silva and attended also by the United Nations Secretary General, António Guterres, on climate adaptation and resilience. I spoke of Ireland’s commitment in this area with 80% of our climate finance concentrated on adaptation.  I also attended an event launching the Tropical Forest Forever Fund, hosted by President Lula. This global initiative aims to finance the conservation of tropical forests. I reaffirmed Ireland’s commitment to the preservation and sustainable use of the Amazon rainforest. I announced Ireland’s commitment to provide €15 million over the next three years to the Amazon fund, with the aim of preventing and combating deforestation.  While in Belém, I also took the opportunity to visit the offices of the United Nations High Commission for Refugees, where I met with representatives of some of the refugees they work with, including indigenous people from the Amazon displaced by climate change. To date in 2025, Ireland has provided over €25.5 million in funding to UNHCR. \n Deputy Malcolm Byrne  I welcome the fact that the Taoiseach attended the COP in Brazil as head of Government. It is appropriate that he did so. I welcome his remarks while there. I ask the Taoiseach to consider that Ireland might consider hosting a future COP to raise awareness of the important issues he has outlined.  I do want to express concern that if we are going to reduce our own dependence on fossil fuels and get people out of cars, we have to provide them with a realistic public transport alternative. I am passionate about rail travel but unfortunately the M11 is increasingly becoming a car park every morning. The problem for those travelling along the M11 into the capital, unlike a number of other commuter routes, is that we do not have a realistic rail alternative. We have fewer services, worse rolling stock and more overcrowding than any other rail service. What particularly annoys me is the fact that yesterday, the rail project prioritisation strategy made no commitments whatsoever about improvements for the Rosslare rail line and further looked at abandoning the proposals to develop and reopen the Rosslare to Waterford rail line. If we are to provide a real alternative and reduce our dependence on fossil fuels and car use, there has to be a real public transport alternative. I want assurances that the Department of Transport has not abandoned the rail commuters along the Rosslare rail line. \n Deputy Naoise Ó Cearúil  I note that, following the Taoiseach's attendance at COP in Belém, the EU made a significant decision to permanently stop Russian gas imports and phase out Russian oil. Similar to Deputy Byrne, I wish to highlight the issue of reducing our reliance on fossil fuels in the context of significant investment in public transport, in terms of DART+ West, for example, going to Maynooth and then Kilcock. The prioritisation of DART+ South West was not announced. There is significant traffic and build-up on the N7, M7, N4 and M4, particularly the N7 coming from Naas, Sallins and Celbridge. Indeed, Deputy Shane Moynihan has raised it previously. We need to ensure that these key pieces of infrastructure are prioritised along the commuter line that is causing the greatest amount of traffic. \n Deputy Darren O'Rourke  One of the most effective ways we can reduce emissions is by encouraging people on to public transport. I want to raise the lack of public transport in Bellewstown, County Meath. A 13-year-old boy, James Black, has started a campaign there and has hundreds of petition signatures calling for a public bus services for the village of Bellewstown. Fair play and well done to him for that. He has got an amount of media attention about it. He is very articulate and very clear in what he is trying to achieve.  The connecting Ireland scheme in the Department of Transport is a very good one but it is underfunded and Bellewstown is not included in it. Will the Taoiseach increase funding to the connecting Ireland scheme and will he include Bellewstown, County Meath in it? \n Deputy Liam Quaide  We heard a lot during the last Government about how much more investment went into the National Parks and Wildlife Service but in east Cork and Waterford, the level of under-resourcing has been baffling. In east Cork, we have had no ranger for approximately 12 of the last 15 years. There has been no district conservation officer for 18 months and no regional manager in place for years over east Cork and Waterford. It is difficult to give precise figures for these vacancies, because the Department has been incredibly opaque in response to questions I have submitted on recruitment to the NPWS. In one response, the Minister referred to \"perceived vacancies\", as if we were all imagining those roles being vacant. Also, bizarrely, the Department will not give details of staffing by geographical area for \"operational security reasons\". This is akin to An Garda Síochána not sharing numbers of gardaí employed in a given division. The Department also will not give any information on recruitment campaigns being undertaken. Meanwhile, hedgerows and trees are being trashed with impunity and the whole idea of habitat protection looks more like a bad joke in this country. When are we going to see more transparency from the Department of heritage on staffing of the NPWS? When are we going to see those crucial roles in east Cork and Waterford filled? \n Deputy Peadar Tóibín  Today the Minister of State, Deputy Thomas Byrne, stated that the Mercosur deal held many benefits for the Irish farmers and the wider economy. He said that for Ireland, Mercosur could be a significant beneficiary. This is incredible. It is the Minister of State putting up the white flag of surrender in terms of Mercosur. It comes just a few days after the Government put up the white flag in terms of the Irish fishing industry. Make no mistake about it, the Mercosur trade agreement will damage the livelihoods of hundreds of thousands of farmers in this country. All the fine words about COP mean nothing if we are going to facilitate or allow Mercosur to go through. It beggars belief that at a time of climate crisis, we will be bringing in Brazilian beef, which is produced in an environmentally unfriendly way, by which forests are burnt down and land is overgrazed, not to mention the environmental cost of transporting all that beef from South America to Europe. Will the Government stop speaking from both sides of its mouth in terms of Mercosur? \n Deputy Ruairí Ó Murchú  It is difficult to believe that we are talking about rail services being cancelled. These are proposed new services that make complete sense because we want people to move to public transport. We know the advantages that exist in that regard. One of the new rail services that was being proposed between Clongriffin and Drogheda has been mothballed. This would have allowed for further express services to Dundalk, Drogheda, Newry and Belfast. Such services are absolutely necessary because they are allowed to skip slower services. What is happening does not make any sense at this point. Will the Taoiseach seek some clarity in respect of this matter? I other colleagues in expressing absolute anger if this is the road we are going to take. No pun intended. \n The Taoiseach  I thank Deputy Byrne for acknowledging that it was important to attend the COP, even though it was a long distance to go. We needed to send a signal given that we are at a point at which the issue of climate change is receding in terms of political prioritisation. This is a real concern. Some people are pulling back from their commitments.  On hosting a future COP in Ireland, next autumn we will have the largest ever political meeting held in Ireland. There will be over 40 states represented. It is a ginormous undertaking to host a COP, but it is something the country should aspire to do in the future. It depends on the shape and nature of a COP. In some ways it has become very big. Maybe it is has gone too far in some respects in the context of how it has evolved. We need to get back to the more fundamental origin and idea around COP, which was countries coming together to make decisions on global agreements in respect of sustainability, the future of the planet and the impact of climate change.  I will look at the matter of rail project prioritisation. I take on board what the Deputy said. We have a lot of projects that are needed. We do not have commensurate capital, but I will have a look at where the Rosslare railway line is. We put a lot of money into Rosslare on the custom side and all of that in the context of Brexit. We did it in double-quick time. Rosslare to Waterford is an important link. I will have a look at that to see what we can do and where we are. \n Deputy Malcolm Byrne  There is nothing on the roster----- \n An Ceann Comhairle  This is not a back-and-forth. \n The Taoiseach  I said I am going to have a look at it. The Deputy asked me to have a look at it, so I am telling him that I am going to have a look at it.  Deputy Ó Cearúil is correct on the moves we made in terms of dependency on Russian oil and gas. On public transport, it is key. I have spoken to the Ministers for public expenditure and Transport in respect of DART+ South West. That has gone through all the planning and is shovel ready. The county council has zonings for between 10,000 to 18,000 houses. It feels that this is essential infrastructure. I am seeing if we can do something to make that we progress the project. That is work I am engaged in at the moment with the relevant Ministers.  Deputy O'Rourke referred to public transport more generally and to a young person named James Black. I pay tribute to him for his civic initiative, participation and being involved in something like that in terms of public service for Bellewstown. I will talk to the Minister and make him aware of that. On Connecting Ireland, I take on board the Deputy's views.  Deputy Quaide referred to the National Parks and Wildlife Service, NPWS. There has been huge investment in recruitment. The investment in the NPWS has more or less doubled since 2020. I took a personal interest in this. I worked previous with the then Minister, Malcolm Noonan, on it and continue to work on it with the Minister of State, Deputy Christopher O'Sullivan. Recently, we announced a €700,000 lifeline for Fota Wildlife Park through the NPWS because of the understanding work that Fota does in respect of conservation of particular species and so forth. I will engage with NPWS in respect of the issues the Deputy has raised to see if we can throw some light on the situation.  Deputy Tóibín referred to Mercosur. There was no agreement on that. It was not put to COREPER last Friday. I do not have the up-to-date information, but it seems unlikely now that it will put before COREPER before Christmas. What we have undertaken to do is work with like-minded countries, particularly France and Italy----- \n Deputy Peadar Tóibín  What is our position? \n The Taoiseach  -----in terms of securing additional safeguards. Quite a significant number of safeguards have been secured. That is contrary to what was there a year ago. They are taking the form of legal instruments that the Commission has committed to.  We succeeded in securing the nitrates derogation. It is a significant advancement that we now have that for a further three years. It was challenging and difficult. We worked hard with the Commission to get it over the line. Approximately 200,000 tonnes of Mercosur beef come into Europe on an annual basis as it stands. The new initiative under Mercosur would allow 99,000 of those to be brought in under a reduced tariff preference. The Minister of State, Deputy Thomas Byrne, spoke about the wider issues around Mercosur. All trade agreements bring benefits and losses. There is no any heresy in saying that. The Canada deal was tremendous for Ireland in terms of the increased exports for SMEs and so on. I accept that every agreement is different. At the moment, there is no sense of any breakthrough or agreement in respect of Mercosur. That is where we are at present.  Deputy Ó Murchú referred to the Clongriffin to Drogheda service. Capital is not limitlessness. \n Deputy Ruairí Ó Murchú  I get that. I was just wondering. \n The Taoiseach  If we were to add up the figures from everybody's contributions, I would guess that we would arrive at another €50 billion. We have to try keep things moving with planning in the context of progressing as many projects as we possibly can and to make sure that we have sustainability, financing and all of that. I will have to look at the rail prioritisation strategy that emerged on Friday. \n An Ceann Comhairle  I thank the Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 18. Deputy Naoise Ó Cearúil asked the Taoiseach if he will report on his attendance at COP30 in Belém. [65719/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Taoiseach's Meetings and Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_18",
        "questionNumber": 18
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 121, 151 and 155 together.  A widely reported incident occurred on Monday, 1st December, regarding drones operating in the vicinity of a Naval Service vessel in the Irish sea. Notwithstanding some suggestions, at no stage was the flight of President Zelensky compromised and the security operation, led by An Garda Síochána was successfully deployed through multiple means ultimately leading to a safe and successful visit to Ireland by President Zelensky. As previously mentioned, I would ask Deputies to reflect that ongoing speculation in respect of this incident is neither accurate nor helpful to our reputation.  I have been fully briefed in my capacity as Minister for Defence as part of the National Security Committee on the initial findings and I am reassured that both the Defence Forces and An Garda Síochána have and are examining this matter extensively.  One of my key priorities as Minister is to ensure that Defence Forces capabilities are maintained, developed and enhanced so that the organisation can meet all Government-assigned roles, including those that may arise as a result of drone incursions. The Defence Forces’ work in this space aligns with broader national security planning.  In this context, work is well underway on the Military Radar Programme, which is a significant capability enhancement. Full delivery of the Programme will be complex; but has been prioritised with elements of this capability being rolled out in phases, from 2026, two years ahead of the scheduled delivery for the full suite of Radar capability. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 121. Deputy Naoise Ó Cearúil asked the Minister for Defence the assessments undertaken of Defence Forces protocols for securing airspace, following the recent drone incident near a Naval Service vessel during President Zelenskyy’s visit to Ireland; and if she will make a statement on the matter. [71852/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_60",
          "debateSectionId": "dbsect_60",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_60.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_121",
        "questionNumber": 121
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Deputy should be reassured that mechanisms already exist which allow for a Defence Forces response where required, acting in support of An Garda Síochána or in defence of Defence Forces personnel and assets.  The operational judgement of the Defence Forces acting under Government direction applies. As such it would not be appropriate for me to comment further. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 126. Deputy Naoise Ó Cearúil asked the Minister for Defence the way in which coordination between the Defence Forces, An Garda Síochána and the Irish Aviation Authority is being strengthened to manage drone activity in Irish airspace; and if she will make a statement on the matter. [71851/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_65",
          "debateSectionId": "dbsect_65",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_65.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_126",
        "questionNumber": 126
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  On 2 December, an Taoiseach and President Zelenskyy signed the 2030 Roadmap on Ukraine-Ireland Partnership at Government buildings.  The Roadmap, which represents a key outcome of the visit of President Zelenskyy to Ireland, builds on the bilateral Agreement on Support for Ukraine and Cooperation between Ukraine and Ireland , signed in Kyiv on 4 September 2024.  The Roadmap contains a series of commitments to develop cooperation with Ukraine, which will strengthen bilateral relations across a range of areas, including political and security cooperation; support for Ukraine’s recovery and reconstruction; cooperation in innovation and education; economic cooperation, including the establishment of an annual Ireland Ukraine Economic Forum; and cultural cooperation.  The Roadmap further highlights Ireland’s support for accountability mechanisms in relation to the conflict in Ukraine, and contains reference to our intention to sign the Convention establishing a Claims Commission for Ukraine, which is being established within the framework of the Council of Europe.  The Roadmap includes a commitment by Ireland to provide an additional €100 million in non-lethal military support for Ukraine, building on the figure of €100m in military support already provided in 2025. The Roadmap also contains a contribution of €25 million to support Ukraine’s energy needs.  Other areas include continuing support for Ukraine's EU accession path, including during our EU Presidency in the second half of 2026, and a commitment to share with Ukraine our experience of engagement as an EU Member State.  The Roadmap also establishes an annual Strategic Dialogue between Ireland and Ukraine at the level of Foreign Minister, the first of which was held on 2 December in Dublin. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 173. Deputy Naoise Ó Cearúil asked the Minister for Foreign Affairs and Trade if she will report on the 2030 Roadmap on Ukraine-Ireland Partnership that was signed with President Zelenskyy on 2 December 2025. [70939/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_107",
          "debateSectionId": "dbsect_107",
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_107.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_173",
        "questionNumber": 173
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Climate Action Plan (CAP) sets out policies, measures and actions to achieve sectoral emissions ceilings for the residential sector.  The National Heat Study, published by the Sustainable Energy Authority of Ireland (SEAI), contains detailed analysis that is being used by my Department to inform the development of policies and measures to decarbonise Ireland’s heating by 2050. The study considered a number of potential decarbonisation options for a wide range of dwellings and business premises. The recommendation of the heat study is that heat pumps are the optimal decarbonisation path for heating systems in buildings, with district heating also being an option that can be widely deployed.  Since 2019, there has been a record level of over €1.6 billion invested in SEAI schemes to support almost 240,000 home energy upgrades, including over 81,000 BER B2s, 18,000 heat pump installations and over 32,000 fully-funded upgrades for households at risk of energy poverty under the Warmer Homes Scheme. In addition, the Department of Housing, Local Government and Heritage funded a further 14,300 Local Authority upgrades, including over 7,250 heat pumps between 2019 to 2024. This means that over 25,000 heat pumps have been installed with Government support since 2019.  The Programme for Government 2025 commits to targeting older homes still using oil to switch to renewable heating systems and to consider the use of sustainable biofuels to reduce emissions from existing home boilers where deep retrofits are not possible in the short term. These commitments are framing the work underway to develop a Heat Policy Statement and the Roadmap to Phase Out Fossil Fuel Heating Systems which will jointly set out Ireland's overarching approach to decarbonising the heat sector.  Increasing the uptake of energy efficiency measures among homeowners continues to be a key priority for my Department working in partnership with the SEAI. Further policies and measures will be introduced on an annual basis to support the achievement of our retrofit and heat pump targets. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 182. Deputy Naoise Ó Cearúil asked the Minister for Climate, Energy and the Environment the number of heat pumps installed since 2020 under the National Retrofitting Programme; the projected installation rate to 2030; and whether his Department has assessed alternative solutions for the 300,000+ rural homes unlikely to be retrofitted. [71512/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_117",
          "debateSectionId": "dbsect_117",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The National Heat Study, published by the Sustainable Energy Authority of Ireland, considered a number of potential decarbonisation options for a wide range of dwellings and business premises. These included the use of liquid biofuels, as well as heat pumps and district heating networks. While the recommendation of the Heat Study is that heat pumps are the optimal decarbonisation path for heating systems, the heat study also recognised the potential role for sustainable bioenergy for buildings that require alternative routes to decarbonisation. This is being considered as part of a suite of measures to decarbonise heat.  The Programme for Government 2025 commits to targeting older homes still using oil to switch to renewable heating systems and to consider the use of sustainable biofuels to reduce emissions from existing home boilers where deep retrofits are not possible in the short term. These commitments are framing the work underway to finalise a Heat Policy Statement and prepare a Roadmap to Phase Out Fossil Fuel heating systems, which will jointly set out Ireland's overarching approach to decarbonising the heat sector.  My Department is also working on the introduction of the Renewable Heat Obligation (RHO). Under current proposals, the RHO will obligate suppliers of all fossil fuels used for heating purposes to ensure a proportion of the energy they supply is renewable. As such, all renewable fuels, including bioliquids used for heat that satisfy the sustainability criteria of the Renewable Energy Directive, will be considered eligible for certification under the scheme. Introduction of the RHO is a key objective for me, as Minister, with priority drafting of the Renewable Heat Obligation Bill 2025 now underway.  As part of the RHO development and design process, my Department completed two phases of analysis which included a full impact assessment on the scheme structure, considering critical factors, including the availability of renewable fuels to meet the obligation, the likely economic and social impact of the obligation, and resulting costs to end consumers. Detail in relation to each phase of analysis, including the full assessment carried out on potential obligation rates, is available on gov.ie at:  www.gov.ie/en/department-of-climate-energy-and-the-environment/publications/renewable-heat-obligation/#general-scheme-design ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 183. Deputy Naoise Ó Cearúil asked the Minister for Climate, Energy and the Environment if he will publish an analysis comparing the emissions savings from a 20% biofuel blend in existing boilers versus deep retrofitting and heat pump installation. [71513/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_118",
          "debateSectionId": "dbsect_118",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_118.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Hydrotreated vegetable oil (HVO) is a bioliquid which can be used as a renewable energy source and which, in a transport context, is classified as a biofuel. HVO is currently available for consumers to purchase for use for both transport and heating. The Climate Action Plan includes a range of measures to address the use of fossil fuels in heating systems in buildings, with the National Heat Study, published by the Sustainable Energy Authority of Ireland, containing the detailed analysis that is informing the development of options to decarbonise the heating and cooling sectors in the period to 2050.  The Heat Study considered a number of potential decarbonisation options for a wide range of dwellings and business premises. These included the use of liquid biofuels such as HVO, solid biomass, biogases, as well as heat pumps and district heating networks. The recommendation of the Heat Study is that heat pumps are the optimal decarbonisation path for heating systems, with district heating also being an option that can be widely deployed. However, the Heat Study also recognised the potential role for sustainable bioenergy for buildings that require alternative routes to decarbonisation, and that is being considered as part of a suite of measures to decarbonise heat.  The Programme for Government 2025 commits to targeting older homes still using oil to switch to renewable heating systems and to consider the use of sustainable biofuels to reduce emissions from existing home boilers where deep retrofits are not possible in the short term. These commitments are framing the work underway to finalise a Heat Policy Statement and prepare a Roadmap to Phase Out Fossil Fuel heating systems, which will jointly set out Ireland's overarching approach to decarbonising the heat sector.  My Department is working on the introduction of a Renewable Heat Obligation (RHO) for the heat sector. Under current proposals, the RHO will obligate suppliers of all fossil fuels used for heating purposes to ensure a proportion of the energy they supply is renewable. As such, all renewable fuels, including bioliquids used for heat that satisfy the sustainability criteria of the Renewable Energy Directive, will be considered eligible for certification under the scheme. The RHO Heads of Bill were approved by Government and drafting of the RHO legislation is currently underway. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 184. Deputy Naoise Ó Cearúil asked the Minister for Climate, Energy and the Environment the progress on the Programme for Government commitment to consider the use of sustainable biofuels to reduce emissions from existing home boilers where deep retrofits are not possible, including timelines for implementation. [71514/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_119",
          "debateSectionId": "dbsect_119",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_119.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_184",
        "questionNumber": 184
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 185 and 186 together.  Introduction of the Renewable Heat Obligation (RHO) is a key priority for me, as Minister, with the primary objective of supporting the achievement of Ireland's renewable heating targets by the most cost-effective means available.  Design of the RHO has included two phases of analysis, stakeholder engagement activities, and extensive industry engagement. Feedback received informed a full impact assessment on the scheme structure, considering critical factors, including the availability of renewable fuels to meet the obligation, and the likely economic and social impact of the obligation. Results of this work informed the general scheme of the Renewable Heat Obligation Bill 2025, recently approved by Government.  Decisions made in relation to initial starting rates were based on an extensive examination of the scale of obligation required to meet Ireland’s renewable heat targets, and resulting impact on end consumer costs. While no final decisions have been taken in relation to the next RHO rate increase in year 3, or a final RHO target level, more ambitious rates have been examined that would enable us to meet our renewable energy and climate targets. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 185. Deputy Naoise Ó Cearúil asked the Minister for Climate, Energy and the Environment the rationale for setting initial Renewable Heat Obligation (RHO) rates at 1.5% and 3%, given Departmental analysis indicating that achieving RES-H targets requires at least 15% by 2030; and whether he will revise these rates upward for liquid fuels. [71515/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_120",
          "debateSectionId": "dbsect_120",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_120.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_185",
        "questionNumber": 185
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 185 and 186 together.  Introduction of the Renewable Heat Obligation (RHO) is a key priority for me, as Minister, with the primary objective of supporting the achievement of Ireland's renewable heating targets by the most cost-effective means available.  Design of the RHO has included two phases of analysis, stakeholder engagement activities, and extensive industry engagement. Feedback received informed a full impact assessment on the scheme structure, considering critical factors, including the availability of renewable fuels to meet the obligation, and the likely economic and social impact of the obligation. Results of this work informed the general scheme of the Renewable Heat Obligation Bill 2025, recently approved by Government.  Decisions made in relation to initial starting rates were based on an extensive examination of the scale of obligation required to meet Ireland’s renewable heat targets, and resulting impact on end consumer costs. While no final decisions have been taken in relation to the next RHO rate increase in year 3, or a final RHO target level, more ambitious rates have been examined that would enable us to meet our renewable energy and climate targets. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 186. Deputy Naoise Ó Cearúil asked the Minister for Climate, Energy and the Environment if he will consider a phased trajectory for liquid fuels under the Renewable Heat Obligation (RHO), starting at 5% and rising to 15% by 2030, as proposed by industry stakeholders' if he will publish his Department’s cost and emissions modelling for this approach. [71516/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_120",
          "debateSectionId": "dbsect_120",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_120.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_186",
        "questionNumber": 186
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Tax policy is a matter for my colleague the Minister of Finance, and any queries the Deputy may have in relation to the treatment of excise and carbon tax should be addressed to the Department of Finance in the first instance.  As part of the Renewable Heat Obligation (RHO) development and design process, my Department completed two phases of analysis which included a full impact assessment on the scheme structure, considering critical factors, including the availability of renewable fuels to meet the obligation, the likely economic and social impact of the obligation, and resulting costs to end consumers. Detail in relation to each phase of analysis, including the full assessment carried out on potential obligation rates, is now available at: www.gov.ie/en/department-of-climate-energy-and-the-environment/publications/renewable-heat-obligation/  Introduction of the RHO is a key objective for me, with priority drafting of the Renewable Heat Obligation Bill 2025 now underway. Once finalised in early 2026, I intend to submit the Renewable Heat Obligation Bill, along with any further information in relation to obligation rates and consumer costs, for Government approval to publish. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 187. Deputy Naoise Ó Cearúil asked the Minister for Climate, Energy and the Environment to publish an assessment of the consumer cost impact of introducing a 5% biofuel blend for home heating; and whether his Department will review excise and carbon tax treatment of renewable fuels to offset additional costs. [71517/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_121",
          "debateSectionId": "dbsect_121",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_121.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_187",
        "questionNumber": 187
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Introduction of the Renewable Heat Obligation (RHO) is a key objective for me, as Minister. Priority drafting of the RHO Bill 2025 is now underway with an expected completion date in early 2026. Once finalised, I intend to submit the final scheme for Government approval to publish and to ensure its timely enactment in 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 188. Deputy Naoise Ó Cearúil asked the Minister for Climate, Energy and the Environment to provide an update on the legislative timeline for the Renewable Heat Obligation (RHO), including expected enactment and commencement dates; and whether contingency plans exist if the 2026 start date proves unachievable. [71518/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_122",
          "debateSectionId": "dbsect_122",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_122.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_188",
        "questionNumber": 188
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The introduction of a Derelict Property Tax was announced in Budget 2026 which will replace the Derelict Sites Levy and will be collected by the Revenue Commissioners. Currently, the Derelict Sites Levy is an annual levy of 7% of the land’s market value. Local authorities will continue to have responsibility for identifying derelict properties. It is intended to introduce legislation providing for the Derelict Property Tax in the Finance Act in 2026. A preliminary register of derelict properties is to be published in 2027 with the tax to be implemented as soon as possible after that.  Where local authorities find that the acquisition of particular vacant and derelict properties is the appropriate mechanism to return them to use, they are enabled by the provisions of the Housing Act and the Derelict Sites Act to acquire them compulsorily. This approach is now supported through the Urban Regeneration and Development Fund (URDF), which has established a €150 million revolving fund specifically for local authorities to acquire vacant or derelict properties (residential and/or commercial), if necessary using their compulsory purchase powers and to carry out any associated works needed to make them more attractive for re-use or sale. The current total of residential and commercial properties approved for inclusion on Local Authority’s Approved Call 3 Programmes is 1,418.  Under Delivering Homes, Building Communities, more will be done to tackle vacancy and dereliction aggressively. The existing grants and schemes will be improved, expanded and further promoted. Their use will ensure that additional homes are provided by renovating and refurbishing existing homes and repurposing commercial and ‘above the shop’ vacant space. As a result, families and individuals can become part of, and contribute to vibrant thriving communities.  These actions will build on existing schemes and programmes, such as CPO Activation Programme (launched in April 2023) that require a proactive and systematic approach by local authorities to identifying vacant and derelict properties and engaging with owners to bring those properties back into use and using their compulsory purchase powers where engagement with owners is not successful. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 565. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage if his Department holds targets or key performance indicators for bringing derelict dwellings back into use nationally and in County Kildare; to provide the most recent performance data; the remedial actions where targets are not being met; and if he will make a statement on the matter. [71711/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_446",
          "debateSectionId": "dbsect_446",
          "showAs": "Derelict Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_446.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_565",
        "questionNumber": 565
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Greater Dublin Drainage Project (“GDD”) is a critical project to provide for growth in the Greater Dublin Area (GDA). It will provide wastewater treatment and network capacity to support the long term sustainable growth of the GDA and to ensure treatment of wastewater remains compliant with the requirements of the Urban Wastewater Treatment Directive.  Uisce Éireann has statutory responsibility for all aspects of water services planning, delivery and operation at national, regional and local levels. The scope, prioritisation and progression of individual projects and expenditures is a matter for Uisce Éireann, and is approved through its own internal governance structures. I have no role in relation to day to day capital or operational matters.  However, Uisce Éireann is also subject to the Infrastructure Guidelines, which sets out the value for money guidelines for the evaluation, planning and management of public investment project.  The GDD is currently at Approval Gate 2 of the Guidelines which relates to the Detailed Business Case and Procurement Strategy.  The project will be brought to Government for approval at Approval Gate 3 – Final Business Case in due course, which will include the full cost of the project following procurement and the measures for ensuring the project is delivered on time and in accordance with budget. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 574. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the measures being taken to control costs and prevent overruns in the greater Dublin drainage project. [71510/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_453",
          "debateSectionId": "dbsect_453",
          "showAs": "Wastewater Treatment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_574",
        "questionNumber": 574
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 582, 583, 584, 585 and 586 together.  Local Property Tax (LPT) is administered and collected by the Revenue Commissioners and subsequently transferred into the Local Government Fund (LGF). The funds are redistributed, by my Department, to local authorities in accordance with the Government’s allocation policies.  Funding allocations are decided in advance of collection, based on estimates (from the Revenue Commissioners) of the LPT yield in individual local authority areas for the following liability year. Apart from the yield, there are three other factors that ultimately determine the annual LPT allocation for an individual local authority; namely, the local authority’s LPT baseline (minimum funding requirement), the amount of any surplus above an authority’s LPT baseline used to self-fund certain local housing or roads services, and, finally, the local adjustment factor. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the allocations are determined on a local authority basis, rather than by Municipal District, or any other geographical area. My Department does not collate data regarding any further redistribution of LPT funding by a local authority to a Municipal District, as that is a matter for the authority itself, in accordance with its own budgetary priorities.  The LPT allocation mechanism was changed in 2023 to allow for 100% of the estimated LPT yield to be retained locally within the local authority area where it is collected. As an authority with expected LPT receipts in excess of its baseline, Kildare County Council does not require equalisation funding from the Exchequer, nor does it contribute towards the equalisation funding of other local authorities.  In accordance with the recommendations of the 2023 Baseline Review working group, baselines for each local authority were adjusted for 2024, in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/ . Following the review, every authority received an increase in baseline funding of at least €1.5m, including Kildare County Council.  Building on the baseline increase of 2024, there will be a further increase of €2m for Kildare County Council in 2026, in line with the expected increased yield from revaluation expected in the local authority area. Accordingly, Kildare County Council’s baseline is increased by €3.5m, or nearly 30% from 2023 to 2026.  In addition, the allocation model for 2026 is changed to allow those authorities, such as Kildare County Council, with an LPT income above their baseline to retain a greater portion of the surplus for their own use, increasing from 22.5% to 31% of overall yield. The combination of the baseline increase along with the increased surplus retained (i.e. 31%), will lead to an overall increase in own use funding for Kildare County Council in the sum of €7.4m from 2023 to 2026, before any local variation decision is taken into account.  Under section 20 of the Finance (Local Property Tax) Act 2012, as amended, a local authority may, as a reserved function, resolve to vary the basic rate of the Local Property Tax within its functional area by a maximum of +/- 15%. The decision to vary must be taken by resolution of the Council. While recent changes to the LPT legislation will allow elected members to adjust the Local Adjustment Factor (LAF) upwards to a maximum of 25%; due to the timing of the legislation, commencement of this section will be delayed until the 2027 LPT liability year.  Any variation in the basic rate will have an impact on the local authority, on those paying LPT, and on those receiving council services. An estimation of the financial effect of a variation decision on all stakeholders must be considered in a report prepared under the direction of the Chief Executive and provided to the elected members at least 3 days before the day on which they meet to consider setting a local adjustment factor. The subsequent publication of any report prepared for this purpose is a matter for the local authority concerned.  Kildare County Council most recently passed a resolution to vary the base rate of LPT in Kildare upwards by 10% for the 2026 and 2027 liability years. This decision will generate an additional €2.9m for the authority’s own discretionary use in 2026. The overall 2026 LPT allocation for Kildare County Council is €32.3m, of which €27.3m is for the authorities own discretionary use with the remaining €5m required to self-fund housing services in the local authority area. It is a matter for Kildare County Council to determine the spending priorities of its ‘own use’ LPT funding in the context of the annual budgetary process having regard to both locally identified needs and available resources.  Detailed information regarding LPT allocations for each year is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/ . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 582. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the breakdown of local property tax allocations to Kildare County Council, by municipal district, including north Kildare, for each of the past five years; and if he will make a statement on the matter. [72083/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_582",
        "questionNumber": 582
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 582, 583, 584, 585 and 586 together.  Local Property Tax (LPT) is administered and collected by the Revenue Commissioners and subsequently transferred into the Local Government Fund (LGF). The funds are redistributed, by my Department, to local authorities in accordance with the Government’s allocation policies.  Funding allocations are decided in advance of collection, based on estimates (from the Revenue Commissioners) of the LPT yield in individual local authority areas for the following liability year. Apart from the yield, there are three other factors that ultimately determine the annual LPT allocation for an individual local authority; namely, the local authority’s LPT baseline (minimum funding requirement), the amount of any surplus above an authority’s LPT baseline used to self-fund certain local housing or roads services, and, finally, the local adjustment factor. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the allocations are determined on a local authority basis, rather than by Municipal District, or any other geographical area. My Department does not collate data regarding any further redistribution of LPT funding by a local authority to a Municipal District, as that is a matter for the authority itself, in accordance with its own budgetary priorities.  The LPT allocation mechanism was changed in 2023 to allow for 100% of the estimated LPT yield to be retained locally within the local authority area where it is collected. As an authority with expected LPT receipts in excess of its baseline, Kildare County Council does not require equalisation funding from the Exchequer, nor does it contribute towards the equalisation funding of other local authorities.  In accordance with the recommendations of the 2023 Baseline Review working group, baselines for each local authority were adjusted for 2024, in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/ . Following the review, every authority received an increase in baseline funding of at least €1.5m, including Kildare County Council.  Building on the baseline increase of 2024, there will be a further increase of €2m for Kildare County Council in 2026, in line with the expected increased yield from revaluation expected in the local authority area. Accordingly, Kildare County Council’s baseline is increased by €3.5m, or nearly 30% from 2023 to 2026.  In addition, the allocation model for 2026 is changed to allow those authorities, such as Kildare County Council, with an LPT income above their baseline to retain a greater portion of the surplus for their own use, increasing from 22.5% to 31% of overall yield. The combination of the baseline increase along with the increased surplus retained (i.e. 31%), will lead to an overall increase in own use funding for Kildare County Council in the sum of €7.4m from 2023 to 2026, before any local variation decision is taken into account.  Under section 20 of the Finance (Local Property Tax) Act 2012, as amended, a local authority may, as a reserved function, resolve to vary the basic rate of the Local Property Tax within its functional area by a maximum of +/- 15%. The decision to vary must be taken by resolution of the Council. While recent changes to the LPT legislation will allow elected members to adjust the Local Adjustment Factor (LAF) upwards to a maximum of 25%; due to the timing of the legislation, commencement of this section will be delayed until the 2027 LPT liability year.  Any variation in the basic rate will have an impact on the local authority, on those paying LPT, and on those receiving council services. An estimation of the financial effect of a variation decision on all stakeholders must be considered in a report prepared under the direction of the Chief Executive and provided to the elected members at least 3 days before the day on which they meet to consider setting a local adjustment factor. The subsequent publication of any report prepared for this purpose is a matter for the local authority concerned.  Kildare County Council most recently passed a resolution to vary the base rate of LPT in Kildare upwards by 10% for the 2026 and 2027 liability years. This decision will generate an additional €2.9m for the authority’s own discretionary use in 2026. The overall 2026 LPT allocation for Kildare County Council is €32.3m, of which €27.3m is for the authorities own discretionary use with the remaining €5m required to self-fund housing services in the local authority area. It is a matter for Kildare County Council to determine the spending priorities of its ‘own use’ LPT funding in the context of the annual budgetary process having regard to both locally identified needs and available resources.  Detailed information regarding LPT allocations for each year is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/ . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 583. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the per capita figures for local property tax allocations across all municipal districts in Kildare, including north Kildare; and if he will make a statement on the matter. [72084/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_583",
        "questionNumber": 583
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 582, 583, 584, 585 and 586 together.  Local Property Tax (LPT) is administered and collected by the Revenue Commissioners and subsequently transferred into the Local Government Fund (LGF). The funds are redistributed, by my Department, to local authorities in accordance with the Government’s allocation policies.  Funding allocations are decided in advance of collection, based on estimates (from the Revenue Commissioners) of the LPT yield in individual local authority areas for the following liability year. Apart from the yield, there are three other factors that ultimately determine the annual LPT allocation for an individual local authority; namely, the local authority’s LPT baseline (minimum funding requirement), the amount of any surplus above an authority’s LPT baseline used to self-fund certain local housing or roads services, and, finally, the local adjustment factor. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the allocations are determined on a local authority basis, rather than by Municipal District, or any other geographical area. My Department does not collate data regarding any further redistribution of LPT funding by a local authority to a Municipal District, as that is a matter for the authority itself, in accordance with its own budgetary priorities.  The LPT allocation mechanism was changed in 2023 to allow for 100% of the estimated LPT yield to be retained locally within the local authority area where it is collected. As an authority with expected LPT receipts in excess of its baseline, Kildare County Council does not require equalisation funding from the Exchequer, nor does it contribute towards the equalisation funding of other local authorities.  In accordance with the recommendations of the 2023 Baseline Review working group, baselines for each local authority were adjusted for 2024, in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/ . Following the review, every authority received an increase in baseline funding of at least €1.5m, including Kildare County Council.  Building on the baseline increase of 2024, there will be a further increase of €2m for Kildare County Council in 2026, in line with the expected increased yield from revaluation expected in the local authority area. Accordingly, Kildare County Council’s baseline is increased by €3.5m, or nearly 30% from 2023 to 2026.  In addition, the allocation model for 2026 is changed to allow those authorities, such as Kildare County Council, with an LPT income above their baseline to retain a greater portion of the surplus for their own use, increasing from 22.5% to 31% of overall yield. The combination of the baseline increase along with the increased surplus retained (i.e. 31%), will lead to an overall increase in own use funding for Kildare County Council in the sum of €7.4m from 2023 to 2026, before any local variation decision is taken into account.  Under section 20 of the Finance (Local Property Tax) Act 2012, as amended, a local authority may, as a reserved function, resolve to vary the basic rate of the Local Property Tax within its functional area by a maximum of +/- 15%. The decision to vary must be taken by resolution of the Council. While recent changes to the LPT legislation will allow elected members to adjust the Local Adjustment Factor (LAF) upwards to a maximum of 25%; due to the timing of the legislation, commencement of this section will be delayed until the 2027 LPT liability year.  Any variation in the basic rate will have an impact on the local authority, on those paying LPT, and on those receiving council services. An estimation of the financial effect of a variation decision on all stakeholders must be considered in a report prepared under the direction of the Chief Executive and provided to the elected members at least 3 days before the day on which they meet to consider setting a local adjustment factor. The subsequent publication of any report prepared for this purpose is a matter for the local authority concerned.  Kildare County Council most recently passed a resolution to vary the base rate of LPT in Kildare upwards by 10% for the 2026 and 2027 liability years. This decision will generate an additional €2.9m for the authority’s own discretionary use in 2026. The overall 2026 LPT allocation for Kildare County Council is €32.3m, of which €27.3m is for the authorities own discretionary use with the remaining €5m required to self-fund housing services in the local authority area. It is a matter for Kildare County Council to determine the spending priorities of its ‘own use’ LPT funding in the context of the annual budgetary process having regard to both locally identified needs and available resources.  Detailed information regarding LPT allocations for each year is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/ . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 584. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the way in which population growth in north Kildare has been taken into account in local property tax allocation decisions; and if he will make a statement on the matter. [72085/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_584",
        "questionNumber": 584
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 582, 583, 584, 585 and 586 together.  Local Property Tax (LPT) is administered and collected by the Revenue Commissioners and subsequently transferred into the Local Government Fund (LGF). The funds are redistributed, by my Department, to local authorities in accordance with the Government’s allocation policies.  Funding allocations are decided in advance of collection, based on estimates (from the Revenue Commissioners) of the LPT yield in individual local authority areas for the following liability year. Apart from the yield, there are three other factors that ultimately determine the annual LPT allocation for an individual local authority; namely, the local authority’s LPT baseline (minimum funding requirement), the amount of any surplus above an authority’s LPT baseline used to self-fund certain local housing or roads services, and, finally, the local adjustment factor. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the allocations are determined on a local authority basis, rather than by Municipal District, or any other geographical area. My Department does not collate data regarding any further redistribution of LPT funding by a local authority to a Municipal District, as that is a matter for the authority itself, in accordance with its own budgetary priorities.  The LPT allocation mechanism was changed in 2023 to allow for 100% of the estimated LPT yield to be retained locally within the local authority area where it is collected. As an authority with expected LPT receipts in excess of its baseline, Kildare County Council does not require equalisation funding from the Exchequer, nor does it contribute towards the equalisation funding of other local authorities.  In accordance with the recommendations of the 2023 Baseline Review working group, baselines for each local authority were adjusted for 2024, in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/ . Following the review, every authority received an increase in baseline funding of at least €1.5m, including Kildare County Council.  Building on the baseline increase of 2024, there will be a further increase of €2m for Kildare County Council in 2026, in line with the expected increased yield from revaluation expected in the local authority area. Accordingly, Kildare County Council’s baseline is increased by €3.5m, or nearly 30% from 2023 to 2026.  In addition, the allocation model for 2026 is changed to allow those authorities, such as Kildare County Council, with an LPT income above their baseline to retain a greater portion of the surplus for their own use, increasing from 22.5% to 31% of overall yield. The combination of the baseline increase along with the increased surplus retained (i.e. 31%), will lead to an overall increase in own use funding for Kildare County Council in the sum of €7.4m from 2023 to 2026, before any local variation decision is taken into account.  Under section 20 of the Finance (Local Property Tax) Act 2012, as amended, a local authority may, as a reserved function, resolve to vary the basic rate of the Local Property Tax within its functional area by a maximum of +/- 15%. The decision to vary must be taken by resolution of the Council. While recent changes to the LPT legislation will allow elected members to adjust the Local Adjustment Factor (LAF) upwards to a maximum of 25%; due to the timing of the legislation, commencement of this section will be delayed until the 2027 LPT liability year.  Any variation in the basic rate will have an impact on the local authority, on those paying LPT, and on those receiving council services. An estimation of the financial effect of a variation decision on all stakeholders must be considered in a report prepared under the direction of the Chief Executive and provided to the elected members at least 3 days before the day on which they meet to consider setting a local adjustment factor. The subsequent publication of any report prepared for this purpose is a matter for the local authority concerned.  Kildare County Council most recently passed a resolution to vary the base rate of LPT in Kildare upwards by 10% for the 2026 and 2027 liability years. This decision will generate an additional €2.9m for the authority’s own discretionary use in 2026. The overall 2026 LPT allocation for Kildare County Council is €32.3m, of which €27.3m is for the authorities own discretionary use with the remaining €5m required to self-fund housing services in the local authority area. It is a matter for Kildare County Council to determine the spending priorities of its ‘own use’ LPT funding in the context of the annual budgetary process having regard to both locally identified needs and available resources.  Detailed information regarding LPT allocations for each year is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/ . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 585. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage if he will publish any impact assessments carried out before Kildare County Council applied local property tax variation factors; and if he will make a statement on the matter. [72086/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_585",
        "questionNumber": 585
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 582, 583, 584, 585 and 586 together.  Local Property Tax (LPT) is administered and collected by the Revenue Commissioners and subsequently transferred into the Local Government Fund (LGF). The funds are redistributed, by my Department, to local authorities in accordance with the Government’s allocation policies.  Funding allocations are decided in advance of collection, based on estimates (from the Revenue Commissioners) of the LPT yield in individual local authority areas for the following liability year. Apart from the yield, there are three other factors that ultimately determine the annual LPT allocation for an individual local authority; namely, the local authority’s LPT baseline (minimum funding requirement), the amount of any surplus above an authority’s LPT baseline used to self-fund certain local housing or roads services, and, finally, the local adjustment factor. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the allocations are determined on a local authority basis, rather than by Municipal District, or any other geographical area. My Department does not collate data regarding any further redistribution of LPT funding by a local authority to a Municipal District, as that is a matter for the authority itself, in accordance with its own budgetary priorities.  The LPT allocation mechanism was changed in 2023 to allow for 100% of the estimated LPT yield to be retained locally within the local authority area where it is collected. As an authority with expected LPT receipts in excess of its baseline, Kildare County Council does not require equalisation funding from the Exchequer, nor does it contribute towards the equalisation funding of other local authorities.  In accordance with the recommendations of the 2023 Baseline Review working group, baselines for each local authority were adjusted for 2024, in accordance with five criteria: population, area, deprivation levels, an authority’s locally raised income and achievement of National Policy Priorities. A summary report which outlines the weighting and application of the criteria to individual baselines is available at this link: https://www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/summary-report-on-local-property-tax-baseline-review-2023/ . Following the review, every authority received an increase in baseline funding of at least €1.5m, including Kildare County Council.  Building on the baseline increase of 2024, there will be a further increase of €2m for Kildare County Council in 2026, in line with the expected increased yield from revaluation expected in the local authority area. Accordingly, Kildare County Council’s baseline is increased by €3.5m, or nearly 30% from 2023 to 2026.  In addition, the allocation model for 2026 is changed to allow those authorities, such as Kildare County Council, with an LPT income above their baseline to retain a greater portion of the surplus for their own use, increasing from 22.5% to 31% of overall yield. The combination of the baseline increase along with the increased surplus retained (i.e. 31%), will lead to an overall increase in own use funding for Kildare County Council in the sum of €7.4m from 2023 to 2026, before any local variation decision is taken into account.  Under section 20 of the Finance (Local Property Tax) Act 2012, as amended, a local authority may, as a reserved function, resolve to vary the basic rate of the Local Property Tax within its functional area by a maximum of +/- 15%. The decision to vary must be taken by resolution of the Council. While recent changes to the LPT legislation will allow elected members to adjust the Local Adjustment Factor (LAF) upwards to a maximum of 25%; due to the timing of the legislation, commencement of this section will be delayed until the 2027 LPT liability year.  Any variation in the basic rate will have an impact on the local authority, on those paying LPT, and on those receiving council services. An estimation of the financial effect of a variation decision on all stakeholders must be considered in a report prepared under the direction of the Chief Executive and provided to the elected members at least 3 days before the day on which they meet to consider setting a local adjustment factor. The subsequent publication of any report prepared for this purpose is a matter for the local authority concerned.  Kildare County Council most recently passed a resolution to vary the base rate of LPT in Kildare upwards by 10% for the 2026 and 2027 liability years. This decision will generate an additional €2.9m for the authority’s own discretionary use in 2026. The overall 2026 LPT allocation for Kildare County Council is €32.3m, of which €27.3m is for the authorities own discretionary use with the remaining €5m required to self-fund housing services in the local authority area. It is a matter for Kildare County Council to determine the spending priorities of its ‘own use’ LPT funding in the context of the annual budgetary process having regard to both locally identified needs and available resources.  Detailed information regarding LPT allocations for each year is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/ . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 586. Deputy Naoise Ó Cearúil asked the Minister for Housing, Local Government and Heritage the way in which the local property tax equalisation mechanism impacts Kildare County Council's receipts, with particular reference to north Kildare; if he will consider publishing disaggregated data on an annual basis; and if he will make a statement on the matter. [72087/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_586",
        "questionNumber": 586
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1031. Deputy Naoise Ó Cearúil asked the Minister for Health to clarify the rationale for including the Adamstown primary care centre in Dublin within the ARK assessment process for primary care centre development intended to serve Kilcock, Maynooth and Leixlip; and if she will make a statement on the matter. [72117/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_844",
          "debateSectionId": "dbsect_844",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_844.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1031",
        "questionNumber": 1031
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1032. Deputy Naoise Ó Cearúil asked the Minister for Health in view of Kilcock's designation as a standalone facility, the investment and staffing measures planned to ensure that Maynooth is adequately resourced and formally recognised within the ARK framework; and if she will make a statement on the matter. [72118/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_845",
          "debateSectionId": "dbsect_845",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_845.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1032",
        "questionNumber": 1032
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1033. Deputy Naoise Ó Cearúil asked the Minister for Health the way in which Maynooth, which currently operates only as a satellite of the Celbridge primary care centre, will be resourced to address the requirements of a growing population without recognition as a standalone centre under the ARK model; and if she will make a statement on the matter. [72119/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_846",
          "debateSectionId": "dbsect_846",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_846.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1033",
        "questionNumber": 1033
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 32. Deputy Naoise Ó Cearúil asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to detail how the Accelerating Infrastructure Action Plan will ensure balanced regional delivery of projects, particularly in high-growth commuter areas such as Kildare north; and if he will make a statement on the matter. [70778/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_32",
        "questionNumber": 32
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Over €223m has been invested in schools in Kildare North in that period.  The NDP Implementation Plan for the Education and Youth sector will be published next week and the first tranche of projects to progess to construction will be published in January. The department’s implementation plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity and progressing priority projects where local capacity across schools in the area is insufficient.  It is important to note, however, that school enrolment pressures are not necessarily reflective of capacity issues and are typically driven by factors such as school of choice and draw from outside the area. Nevertheless, demographic data, including information on planned residential development, continues to inform the department’s forward planning processes.  Despite substantial new housing delivery in North Kildare, reductions in birth rates and family sizes mean primary school demand has already peaked, albeit some specific local pressures may remain. While post-primary enrolment pressures exist in many areas, it is important to note that there are sufficient places available overall, with 111 first year places going unfilled in North Kildare in 2024/25.  The importance of supporting children to access school places in a fair and transparent way that reduces stress on families is recognised by the department. That is why, in addition to prioritising school place needs as part of NDP project rollout, the department will continue to work towards a nationwide common application system.  The Apply to School pilot for September 2026 admissions included schools in Celbridge. This pilot provided good data including clarity on there being sufficient first year places in the town to meet local needs. Learnings from the pilot will inform how a common application system can streamline the process overall and give earlier certainty to families on school places. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 107. Deputy Naoise Ó Cearúil asked the Minister for Education and Youth when her Department will publish clear timelines for the delivery of new school building and extension projects in Kildare north, given the admissions data showing enrolment pressures; and if she will make a statement on the matter. [70777/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_129",
          "debateSectionId": "dbsect_129",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_129.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_107",
        "questionNumber": 107
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving from primary schools and post-primary schools means that close to 4,000 specialist places were available for the 2025/26 school year.  407 new special classes were sanctioned for the 2025/26 school year. Of these 17 are in County Kildare, 14 at primary and 3 at post-primary level.  This brings to 148 the number of special classes currently in operation in the county. There are also 6 special schools in County Kildare with approximately 359 students enrolled.  The NCSE is undertaking analysis of information provided through the Parents Notify process which closed on 1 October to plot demand for specialist places for the 2026/27 school year. Once the analysis is complete, the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that many of these special classes will be sanctioned by 31 December 2025.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and consequently demand for specialist provision is subject to ongoing review. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 185. Deputy Naoise Ó Cearúil asked the Minister for Education and Youth the forward planning measures in place to address the shortage of ASD class places in both primary and secondary schools in Kildare north, given rising population and demand; and if she will make a statement on the matter. [70776/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_210",
          "debateSectionId": "dbsect_210",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_210.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_185",
        "questionNumber": 185
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Supporting learners with disabilities is a core priority for my Department. Last year, my Department hosted a national Disability Symposium in Dublin, bringing together students, families, educators, Disabled Persons Organisation's and key stakeholders to share their experiences and shape future action.  Following this engagement, the Department has commenced a project focused on better supporting students with disabilities. This project will examine transitions into further and higher education, map the supports and services available to students with disabilities within the further and higher education system, and develop new approaches to supporting students as they move into employment following college.  The work of the Project forms one of my Department’s key commitments under the National Human Rights Strategy for Disabled People 2025–2030 and supports Ireland’s obligations under the UN Convention on the Rights of Persons with Disabilities.  A key element of the project is to map and identify the supports available for disabled students across further and higher education. This is the first step in ensuring they have the right resources, as identified by them, to fully participate and succeed. The mapping phase is expected to commence as part of the project in 2026.  In addition, the Department already provides support to students with disabilities through the National Access Plan, which aims to promote inclusion and participation for underrepresented groups, including students with disabilities.  This includes the Fund for Students with Disabilities in Higher Education. As part of Budget 2026 I was pleased to increase the Fund's allocation in both further and higher education. In higher education the budget was increased by over 10% bringing it to €10.5 million in 2026. FSD funding is provided as a block grant to HEIs  for the purposes eligible under the Fund. The extra funding will help students at undergraduate and postgraduate levels who require specific and tailored supports. These include non medical helpers such as personal assistants and notetakers, as well as transport and assistive technology.  The Deputy may also be aware that the National Human Rights Strategy for Disabled People commits to developing a national policy regarding Personal Assistance. A HSE-led Review Group’s work will inform the development a policy approach that ensures a focus on the ethos of self-directed care and promotes a coordinated approach to Personal Assistance service provision across different sectors.  My Department will engage fully with any recommendations that relate to further or higher education and support their implementation.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 219. Deputy Naoise Ó Cearúil asked the Minister for Further and Higher Education, Research, Innovation and Science the progress made on the provision of the personal assistants initiative for persons with a disability in third level institutions; and if he will make a statement on the matter. [67834/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_231",
          "debateSectionId": "dbsect_231",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_219",
        "questionNumber": 219
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department has secured €650m NTF funding package for the tertiary sector over the period 2025 to 2030. In line with the purposes of the National Training Funding this capital funding will be used in programmes/initiatives that raise the skills of those in employment, or to provide training to those who wish to acquire skills for the purposes of taking up employment, or to provide information in relation to existing, or likely future, requirements for skills in the economy.  Plans are in place to target the strengthening of training capacity in key skills areas such as healthcare, veterinary skills, apprenticeships and further education. NTF capital will also enhance research capacity through an increase in PhD stipends, ensuring Ireland remains competitive in attracting and developing research talent. It will also enable a major new specialist equipment programme for the further education and training (FET) sector. This initiative will deliver investment in innovative kit, equipment, and technology to align with current and emerging skills needs, and will strengthen specialist skills provision in six priority areas, construction, manufacturing, technology, healthcare, hospitality and the experience economy, and the green transition.  My Department will allocate NTF funding to institutions in line with the objectives of the fund, and through capital programmes/initiatives. Accordingly, the criteria used to assess and approve investment proposals will be aligned with these objectives and national skills priorities. In assessing proposals, my Department will prioritise initiatives/programmes that enable:  • Upskilling reskilling and enhancing areas experiencing skills shortages;  • Enhanced productivity and adaptability within the workforce to support economic growth and competitiveness;  • Promotion of continuous professional development and lifelong learning to ensure workers remain relevant in rapidly changing sectors. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 261. Deputy Naoise Ó Cearúil asked the Minister for Further and Higher Education, Research, Innovation and Science the criteria that will be used to prioritise institutions for capital investment under the national training fund; and if he will make a statement on the matter. [67835/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_274",
          "debateSectionId": "dbsect_274",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_274.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_261",
        "questionNumber": 261
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours.  DART+ West will provide an extension of DART services from the City Centre to M3 Parkway and Maynooth, and the construction of a new depot and city centre enhancements. Conditional planning approval was received from An Coimisiún Pleanála in July 2024.  DART+ South West will provide an extension of DART services from the City Centre to Hazelhatch and Celbridge. Planning approval was received from An Coimisiún Pleanála in November 2024.  Procurement for DART+ South West and West is progressing with pre-qualification questionnaires (PQQ) notices for Design and Build works advertised in May 2025.  Two fleet orders have been placed (185 carriages, largely battery-electric with some electric units). The first order for the purchase of 95 additional DART carriages, which compromise of 65 battery-electric carriages and 30 electric carriages, have started arriving and are currently undergoing certification and safety testing. It is intended that the new battery-electric sets will be initially deployed on the Northern Commuter Line serving Dublin to/from Drogheda from 2027.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 323. Deputy Naoise Ó Cearúil asked the Minister for Transport if any of the 185 new carriages ordered for the greater Dublin area, due to enter service from Q2 2027 onwards, will be allocated to services operating in Kildare North, specifically on the Maynooth line, Longford line, Hazelhatch–Celbridge, Sallins and Naas, and Kilcock routes; and if he will make a statement on the matter. [70987/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_336",
          "debateSectionId": "dbsect_336",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_336.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_323",
        "questionNumber": 323
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Naoise Ó Cearúil  In September, the Tánaiste's predecessor published the Future Forty report. In what way will the findings of this report shape Ireland's fiscal policy in the coming years, particularly when it comes to demographic change and global trends? I am sure the Tánaiste is aware that a quarter of the population by 2060 will be over the age of 65, the Tánaiste and myself included, believe it or not. That will have a significant impact on State finances. \n Deputy Simon Harris  That gave me an awful wake-up call. I had not thought of it like that but it is factually correct.  I thank Deputy Ó Cearúil for raising this question. Future Forty is a really important piece of work. I can say that because I had nothing to do with it. It happened before I was in the Department of Finance. Huge credit is owed to the officials in the Department of Finance, the chief economist John McCarthy and others, who worked very hard on this. We are often accused in politics, sometimes with legitimacy and sometimes not, of short-termism. Nobody can suggest there is anything short term about publishing a plan as to where Ireland will be not in five, ten or 15 years but in 40 years. That is the exact sort of big thinking and analysis one would expect a Department of Finance which has responsibility for economic policy to do. It is not a modern version of Mystic Meg; all it can do is look at various scenarios and, of course, scenarios can change depending on the policies we pursue. I say daily and will say again tonight that while it looks out to 40 years, it basically tells us there is a window of about a decade to put in place policies to mitigate against some of the challenges we may face in demographic change and slower economic growth, potentially, but also to look at the opportunities and how we can best harness them. Future Forty was published earlier this month. It explores the key drivers of Ireland’s economy and public finances over the next forty years, on a no-policy change basis which of course is not what is going to happen because we will have lots of policies during that time from this Government and future Governments. It examines the long-term economic and fiscal impacts of global megatrends and other structural shifts including climate change, demographics, housing, healthcare, digitalisation, deglobalisation and potential EU expansion. The report presents a central scenario for our population, economy and public finances but also examines over 2,000 alternative scenarios using differing assumptions. It does not identify which scenario is most likely to occur but there are clear patterns which emerge across all trends and projections. I say to everybody in public policy - the Government, Opposition, Government Department and State agencies - that this is a tool for all of us to use to inform evidence-based policy. \n Deputy Naoise Ó Cearúil  Go raibh maith again, a Thánaiste. While I said in jest we will both be retired by 2060, you never know. The main thing to bear in mind is that a quarter of the population will be at retirement age. That is going to have a significant impact on pensions and healthcare. Measures have been taken already - auto-enrolment will begin in the new year, which needs to be acknowledged. It is a crucial step to ensuring the future fiscal security of a lot of people, going into old age.  However, there will be revenue challenges, particularly when it comes to our reliance on corporate tax receipts. There could be a vulnerability in this regard so we need to consider broadening the tax base. This will be quite difficult, as we all acknowledge. If we are to take the document as a strategic one on how we are going to manage the economy, we will have to make painful decisions in the short term that will benefit society in the long term. \n Deputy Simon Harris  The Deputy is correct. Future Forty does highlight that expenditure related to demographic ageing is expected to grow substantially in the coming decades. Healthcare, long-term care and pensions are expected to take up an increasingly larger amount of the Government's budget. Mitigation of the ageing costs will depend on improving efficiencies and ultimately boosting productivity in public services, including by integrating innovative medical technologies into our health system. Encouraging healthy living can help to keep costs manageable in the long run, too. Future Forty projects that climate costs will rise rapidly due to both Iong-run climatic changes and the increased frequency of extreme weather events. Although there is considerable uncertainty about the future cost of climate change, Ireland must prepare in advance to lower adaptation costs in the future. Additionally, I point to the cost of servicing our national debt. While this might appear relatively minor at present, Future Forty points to its becoming a growing burden if deficit and debt are used to cover rising costs elsewhere. Future Forty outlines hypothetical issues. Of course, there are also positive outcomes and opportunities. The decision on automatic enrolment, as the Deputy rightly said, is one whose immediate benefit people will not see in the short term, but they absolutely will see it in the future when they retire with better pensions. \n Deputy Naoise Ó Cearúil  I thank the Tánaiste. I appreciate all that. The report contains measures we could take to achieve productivity gains. There are elements we could really tap into when it comes to digitalisation, in particular, and the likes of artificial intelligence, AI. There need to be guardrails for AI and that is why the national AI office is being established. There needs to be a proper and comprehensive examination of AI, which the Oireachtas joint committee and other bodies are doing, but we need to start considering ways to increase productivity significantly and take some of the drudgery out of administrative tasks. These could apply to the likes of waiting lists for surgeries and normal administrative tasks in various Departments. This is where we could start to see immediate and long-term economic benefits. \n Deputy Joe Neville  Deputy Ó Cearúil's reference to drudgery and repetitive tasks brought me back to my days in PricewaterhouseCoopers, where I started as an auditor. There were many repetitive tasks.  Specifically on Future Forty, the Tánaiste's predecessor as Minister, Deputy Donohoe, put a very sensible budget in place. He was very anxious to ensure we would be left on safe ground for the future. Future Forty refers to corporation tax as something we cannot necessarily rely on and it also refers to broadening the tax base. Notwithstanding the sensible approach of the previous Minister, we really do need to focus on corporation tax to ensure we do not become overly reliant on it. As Deputy Ó Cearúil alluded to, we need to ensure the tax base is widened and not narrowed, as the Opposition continually seeks despite the fact that it talks about the need to increase spending on this and that.  Then again, it never wants any taxes whatsoever to be raised. That is the dichotomy we have to deal with in this House. I just want to get the Tánaiste's views on it. \n Deputy Simon Harris  I agree with Deputy Neville on the importance of continuing to run budget surpluses and invest in our Future Ireland Funds – the Future Ireland Fund and the Infrastructure, Climate and Nature Fund – and the importance of continuing to be prudent in our spending of public money. That is why the Minister for public expenditure, Deputy Chambers, and I will bring to the Cabinet next week the medium-term fiscal framework, which will anchor our spending and tax plans not just for a year but also for the five years ahead. That is important for guarding our economy and for planning the delivery of public services that we get on with implementing the programme for Government.   I agree with Deputy Ó Cearúil on the use of technology, including AI. I am aware that the Minister for public expenditure, Deputy Chambers, is very strong on this. He has introduced a plan on digital services and the use of digital technology in the public service. Of course, there have to be guardrails and all of that. AI is not going away, as has been said. It is actually a tool that can be used for good, subject to having a proper system of safeguards in place, including in the area of speeding up assessment times. Let us consider the progress we have been able to make using technology for passports. When we read Future Forty, as the Deputy has done, we see that the use of technology to increase productivity is a key component in addressing some of the challenges we will face in the time ahead and ensuring the costs of the delivery of public services will remain manageable. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 13. Deputy Naoise Ó Cearúil asked the Tánaiste and Minister for Finance the way in which the findings of the 'Future Forty' report will shape Ireland’s fiscal policy in the coming years, with particular reference to demographic change and global trends; and if he will make a statement on the matter. [64370/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_24",
          "debateSectionId": "dbsect_24",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_24.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_13",
        "questionNumber": 13
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Future Forty: A Fiscal and Economic Outlook to 2065, published by my Department earlier this month, explores the key drivers of Ireland’s economy and public finances over the next forty years, on a no-policy change basis.  The report finds that population ageing, slowing economic growth and the cost of tackling climate change while accelerating the green transition will have considerable impacts on our public finances. The cost of health and long-term care services will rise, as will the cost of pensions, while there is a risk that Ireland will be unable to rely on exceptionally high levels corporation tax receipts in the medium-to-long term.  The report presents a central scenario for our population, economy and public finances, but also examines over 2,000 alternative scenarios using differing assumptions. Debt and deficit outcomes vary greatly across the scenarios, and while Future Forty does not identify which scenario is most likely to occur, when viewed collectively, the risks are tilted to the downside.  Steps can be taken to mitigate upward pressures on our debt levels, by controlling public finances, supporting improved productivity levels and driving efficiencies. There are existing policy measures which are enhancing our economic growth potential, including the updated National Development Plan which commits €275 billion to public capital investment in the period up to 2035.  Furthermore, the establishment of the Future Ireland Fund and Infrastructure, Climate and Nature Fund, has provided the State with two funds for saving current budgetary surpluses to help address future expenditure pressures. Actions and policies which help control and moderate spending growth, and therefore help to deliver future budgetary surpluses, will enable the State to maximise its contribution to these funds. Finally, the rollout of the pension auto-enrolment will serve as a critical aspect of managing future costs to the State by assisting the public in preparing for retirement.  In the long-term, we can manage debt by boosting sustainable growth. Future Forty shows how the next ten years are crucial before fiscal flexibility diminishes. We can do this by investing in areas which will drive future productivity gains, as well as encouraging more labour participation and favourable investment conditions to ensure capital growth continues.  Key priorities include enhancing long-run productivity growth, particularly for domestic sectors. Encouraging continued and efficient capital investment, both public and private, to address infrastructure deficits and increase the supply of housing will be critical. Taking a proactive and planned approach to digitalisation, to enhance productivity, while investing in skills to minimise potential negative impacts is also crucial. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 59. Deputy Naoise Ó Cearúil asked the Tánaiste and Minister for Finance the measures being considered to address the projected rise in national debt and potential deficit highlighted in the 'Future Forty' report; and if he will make a statement on the matter. [64371/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Naoise-Ó-Cearúil.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Naoise-Ó-Cearúil.D.2024-11-29",
          "showAs": "Naoise Ó Cearúil"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_75",
          "debateSectionId": "dbsect_75",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_75.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_59",
        "questionNumber": 59
      },
      "contextDate": "2025-12-09"
    }
  ]
}