{
  "head": {
    "counts": {
      "questionCount": 569,
      "resultCount": 569
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002. It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need. The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly. As part of the development of the General Scheme, a Regulatory Impact Assessment was prepared, and this will also be published.  These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  The Department is currently at an early stage of the legislative process. It is expected that the General Scheme will undergo pre-legislative scrutiny by the Oireachtas Committee on Disability Matters early in the New Year.  The provision of an effective and efficient Assessment of Need system continues to be a priority for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 56. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality when changes to assessment of need will come into force; and if she will make a statement on the matter. [73266/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_99",
          "debateSectionId": "dbsect_99",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_56",
        "questionNumber": 56
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002. It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need. The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly.  These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  The proposed legislative changes to the Disability Act 2005 are intended to support more effective delivery of Assessments of Need, and to provide clearer guidance and supports so that the process can be made more efficient, reduce delays and allow therapists to spend more time delivering services.  Key features of the bill are to include:  • An increased focus on the identification of a person’s needs and the services to meet those needs, rather than on the nature of their disability.  • The creation of statutory guidelines to support and enhance the decision-making capacity of HSE assessment officers, who are responsible for the production of assessment of need reports.  • A focus on the use of appropriate and proportionate clinical assessment(s) during the assessment of need process to ensure that they should only be used where required to establish the child’s needs.  In conjunction with these changes, operational measures are being introduced to not only improve access to assessments but also ensure that therapies are being delivered sooner:  • The HSE is putting in place a new autism assessment process from February 2026, which should provide faster access to an autism assessment for families than through the Assessment of Need process.  • The implementation of a Single Point of Access in 2026 by the HSE which will ensure that children are referred to the appropriate service that meets their needs as soon as possible.  The provision of an effective and efficient Assessment of Need system and the provision of services to children as early as possible continue to be priorities for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 65. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality the changes made to assessment of need; the benefits that will be brought with these changes; and if she will make a statement on the matter. [73265/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_65",
        "questionNumber": 65
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 195 and 198 together.  The credit union sector is an important supporter of housing delivery through the provision of mortgages directly to members, and investment in social housing via the Credit Union Approved Housing Body (AHB) Fund, known as the Credit Union AHB Fund.  Investment in the Credit Union AHB Fund is permitted under Central Bank regulations, introduced in March 2018. Under these regulations, over €1 billion can be invested by credit unions in the Credit Union AHB Fund.  The Credit Union AHB Fund is a fund that all credit unions can invest their members savings in. The Credit Union AHB Fund will then provide loan financing to AHBs in respect of completed social housing units.  The Minister of State has engaged with the Credit Union AHB Fund and credit union sector stakeholders to discuss the levels of investment in the fund.  I am informed that credit unions have invested €43 million in the fund as at 30 November 2025. The Credit Union AHB Fund has/will finance 175 homes in the following counties; Dublin, Cork, Wicklow and Galway.  It is important to note that both I and the Minister of State recognise that the decision to invest in the CU AHB Fund is a commercial matter for each independent credit union and their respective boards. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 195. Deputy Peter 'Chap' Cleere asked the Tánaiste and Minister for Finance if he will report on his engagement with a fund (details supplied) and sector stakeholders; and if he will make a statement on the matter.  [72574/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_209",
          "debateSectionId": "dbsect_209",
          "showAs": "Credit Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_209.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_195",
        "questionNumber": 195
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  In March 2025, the European Commission launched the SIU Strategy, which includes measures to advance the Capital Markets Union (CMU) project. The Savings and Investment Union (SIU) is the new term for the combination of the Capital Markets Union (CMU) and Banking Union. It is a key priority for this Commission’s legislative term.  From the outset, Ireland has been a strong supporter of the SIU at both Government level and also by key actors in our financial services sector. As such we will continue to actively be involved in progressing its associated measures.  In our view, we can deliver for all EU citizens most effectively through a model that is open to global capital and expertise, can exploit the benefits of existing marketplaces and infrastructures and build on the various centres of financial services excellence that already exist within the EU. As with the wider single market, competition, both from within the EU and outside our borders, will be what drives innovation and efficiency gains.  Ireland’s view is that we must take a pragmatic approach and that, in order to best advance the SIU and to truly deepen EU capital markets, we need to focus on areas where broad agreement can be reached and in a timely manner. To maintain momentum, we must work diligently and in close coordination with other Member States, the European Parliament and other stakeholders particularly to advance legislative files where progress is readily achievable.  In terms of engagements on the SIU since taking office, I have had the opportunity to attend the last ECOFIN meeting, which is a meeting of Finance Ministers from across the EU, where the recently released Market Infrastructure Package (MIP) was discussed. The MIP is a legislative package that falls under the umbrella of the SIU. At the recent Ecofin meeting I took the opportunity to have a range of meetings with other Ministerial colleagues, relevant EU Commissioners and other key EU institutional stakeholders. This file will remain a priority for my officials and I will continue to seek to find ways to advance matters in this regard. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 230. Deputy Peter 'Chap' Cleere asked the Tánaiste and Minister for Finance the details of engagements he has had since taking office in relation to the EU Savings and Investment Union; and if he will make a statement on the matter. [72573/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_242",
          "debateSectionId": "dbsect_242",
          "showAs": "EU Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_230",
        "questionNumber": 230
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I thank the Deputy for providing me with the opportunity to outline the investments that have been made under the Infrastructure Development Plan in Stephen’s Barracks Kilkenny.  There is one capital project currently ongoing in Stephens Barracks, details of which is set out below:      Project      Estimated   Cost incl. VAT     Expected Completion       New Barrack Accountant Facility    €627,405    Q1 2026       Total      €627,405            The Deputy may also wish to note that the following two projects are scheduled to be developed in the near future:  • Construction of a New Military Equipment Store, Locker Block & Ablutions Facility  • Upgrade O/Ranks Accommodation Blocks A-F  Design Teams have been appointed for the above two projects and the full determination of the complete Project Briefs are currently being carried out.  The following capital works have been completed to date since the launch of the Infrastructure Development Plan.      Year      Projects      Total Funding   (Capital and Design Team Costs)€m      2024    Stephens Barracks, Refurbishment of Block C - completion March 2024    €0.78      2022    Kilkenny underground site services    €0.73      2021    Construction of a new gymnasium at Stephens Barracks, Kilkenny    €3.7       In addition, my Department also allocates funding each year to the Defence Forces for the maintenance, repair and upkeep of its building stock. This year a devolved budget of €12.5 million was assigned by my Department to the Defence Forces for these tasks. The individual prioritisation of specific projects to be carried out is solely a matter for the Defence Forces in keeping with the delegated nature of this budget. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 303. Deputy Peter 'Chap' Cleere asked the Minister for Defence the nature of refurbishment works carried out at Stephen's Barracks, Kilkenny, in the years 2024 and to date in 2025, in tabular form; if each capital works project is completed or still ongoing at present; and the new refurbishment works that will commence during the first half of 2026 at these barracks. [73321/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_306",
          "debateSectionId": "dbsect_306",
          "showAs": "Capital Expenditure Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_306.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_303",
        "questionNumber": 303
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 346 and 347 together.  As the Deputy will be aware, the Programme for Government, Securing Ireland’s Future, includes a commitment to “consider measures, in conjunction with the Department of Finance, to encourage gym membership and active participation in sport and exercise.”  Officials in my Department considered the matter as part of the annual Tax Strategy Group process in July this year, in chapter 10 of the Income Tax, Tax Strategy Group - 25/01 paper available at:  www.gov.ie/en/department-of-finance/collections/budget-2026-tax-strategy-group-papers/  The tax code already provides for a number of fitness-based measures more generally i.e. the Cycle to Work Scheme and the Accelerated Capital Allowances scheme for Childcare facilities and Fitness Centres which encourages employers to develop childcare facilities and fitness centres onsite for their employees.  Furthermore, the private gym sector already receives tax-based public support through a reduced rate of VAT of 9 per cent on membership fees. It is estimated that this reduced rate saves private gym operators and gym members in the order of €32 million per annum.  In line with best practice, and as with all proposals for the introduction of new tax measures or the amendment of existing tax reliefs, the proposal should be assessed in accordance with the Department of Finance Tax Expenditure Guidelines. The guidelines make clear the importance that any policy proposal which involves tax expenditures should only occur in limited circumstances where there are demonstrable market failures and where a tax-based incentive is more efficient than a direct expenditure intervention.  Furthermore, decisions regarding taxation measures are made in the context of the annual Budget and Finance Bill processes, at the appropriate time, and having regard to available resources and the sound management of the public finances. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 346. Deputy Peter 'Chap' Cleere asked the Tánaiste and Minister for Finance his plans to provide tax relief for membership of gyms; and if he will make a statement on the matter. [69706/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_348",
          "debateSectionId": "dbsect_348",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_348.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_346",
        "questionNumber": 346
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 346 and 347 together.  As the Deputy will be aware, the Programme for Government, Securing Ireland’s Future, includes a commitment to “consider measures, in conjunction with the Department of Finance, to encourage gym membership and active participation in sport and exercise.”  Officials in my Department considered the matter as part of the annual Tax Strategy Group process in July this year, in chapter 10 of the Income Tax, Tax Strategy Group - 25/01 paper available at:  www.gov.ie/en/department-of-finance/collections/budget-2026-tax-strategy-group-papers/  The tax code already provides for a number of fitness-based measures more generally i.e. the Cycle to Work Scheme and the Accelerated Capital Allowances scheme for Childcare facilities and Fitness Centres which encourages employers to develop childcare facilities and fitness centres onsite for their employees.  Furthermore, the private gym sector already receives tax-based public support through a reduced rate of VAT of 9 per cent on membership fees. It is estimated that this reduced rate saves private gym operators and gym members in the order of €32 million per annum.  In line with best practice, and as with all proposals for the introduction of new tax measures or the amendment of existing tax reliefs, the proposal should be assessed in accordance with the Department of Finance Tax Expenditure Guidelines. The guidelines make clear the importance that any policy proposal which involves tax expenditures should only occur in limited circumstances where there are demonstrable market failures and where a tax-based incentive is more efficient than a direct expenditure intervention.  Furthermore, decisions regarding taxation measures are made in the context of the annual Budget and Finance Bill processes, at the appropriate time, and having regard to available resources and the sound management of the public finances. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 347. Deputy Peter 'Chap' Cleere asked the Tánaiste and Minister for Finance his plans to provide tax relief for membership of gyms; and if he will make a statement on the matter. [69707/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_348",
          "debateSectionId": "dbsect_348",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_348.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_347",
        "questionNumber": 347
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 607. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality the number of WTE social workers based at Kilkenny Children's Disability Network Team in the years of 2024 and to date in 2025, in tabular form. [73322/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_581",
          "debateSectionId": "dbsect_581",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_581.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_607",
        "questionNumber": 607
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 608. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality the number of WTE physiotherapists based at Thomastown children's disability network team in 2024 and to date in 2025, in tabular form. [73323/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_583",
          "debateSectionId": "dbsect_583",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_583.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_608",
        "questionNumber": 608
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 609. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality the number of WTE occupational therapists based at Carlow children's disability network team in 2024 and to date in 2025, in tabular form. [73324/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_584",
          "debateSectionId": "dbsect_584",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_584.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_609",
        "questionNumber": 609
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 639. Deputy Peter 'Chap' Cleere asked the Minister for Health the number of WTE senior dentists based at Shamrock Plaza primary care centre in the years of 2023, 2024 and to date in 2025, in tabular form. [73317/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_613",
          "debateSectionId": "dbsect_613",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_613.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_639",
        "questionNumber": 639
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 640. Deputy Peter 'Chap' Cleere asked the Minister for Health the number of consultant dermatologists based at St. Luke's Hospital, Kilkenny, in the years of 2024 and to date in 2025, in tabular form. [73318/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_614",
          "debateSectionId": "dbsect_614",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_614.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_640",
        "questionNumber": 640
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 641. Deputy Peter 'Chap' Cleere asked the Minister for Health the number of WTE public health nurses based at Leighlinbridge health centre in the years of 2024 and to date in 2025, in tabular form. [73319/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_615",
          "debateSectionId": "dbsect_615",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_615.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_641",
        "questionNumber": 641
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 642. Deputy Peter 'Chap' Cleere asked the Minister for Health the number of WTE consultant ophthalmologists based at University Hospital Waterford in the years of 2024 and to date in 2025, in tabular form. [73320/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_616",
          "debateSectionId": "dbsect_616",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_616.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_642",
        "questionNumber": 642
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As Minister for Defence, one of my key priorities will be to ensure that the capabilities of the Defence Forces are maintained, developed and enhanced in order that the Defence Forces can carry out all of the roles assigned to it by Government.  Unmanned Aerial Systems (UAS) or drones are deployed across the Defence Forces. These are small and medium sized systems which provide situational awareness, intelligence, surveillance, target acquisition and reconnaissance (ISTAR) capabilities for deployed personnel in training and on operations, both at home and overseas. These assets have no lethal offensive capabilities.  UAS capabilities are currently used by a number of branches within the Army such as by Ordnance Corps personnel to assist in the safe conduct of Explosive Ordnance Disposal (EOD) duties, as well as by Army Engineer personnel for activities such as Specialist Search and Clearance operations and training. The use of UAS capabilities serves to reduce risk exposure to personnel thereby increasing force protection and safety.  The Naval Service utilise UAS capabilities daily in the maritime domain for specific operations such as search and rescue, fishery inspections, damage assessments, port and offshore installation security, and maritime pollution monitoring. The Naval Service have also used UAS to support overseas operations including during Operation Pontus - the humanitarian search and rescue mission undertaken in the Mediterranean.  The Air Corps utilise UAS capabilities for operator training, photography and videography, communications, infrastructure inspections, and support to air crash investigations.  Looking forward, as the Army’s existing UAS capability is reaching its end of life, market research is being conducted to assist in the procurement of replacement and enhanced capabilities. To that end, and in compliance with EU public procurement procedures, a Prior Information Notice was published earlier this year to alert the market of the planned procurement and for market research purposes. This planned procurement remains at market research stage and no decisions have been taken on the final capability requirements for the replacement systems.  Furthermore, a specific recommendation in relation to the further development of the Defence Forces’ RPAS (Remotely Piloted Aircraft System) capabilities was made by the Commission on the Defence Forces. The timeframe for implementation of this recommendation will be outlined in the updated Detailed Implementation Plan for the Report of the Commission on the Defence Forces, which is due to be published shortly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 94. Deputy Peter 'Chap' Cleere asked the Minister for Defence the way in which the Defence Forces is developing its unmanned aerial systems capability; and if she will make a statement on the matter. [71843/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_39",
          "debateSectionId": "dbsect_39",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_39.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_94",
        "questionNumber": 94
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 57. Deputy Peter 'Chap' Cleere asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation how the new infrastructure plan will accelerate the delivery of critical infrastructure in Kilkenny and Carlow; and if he will make a statement on the matter. [70628/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_57",
        "questionNumber": 57
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, gross capital expenditure ceilings for all sectors have now been set out to 2030.  National Strategic Outcome (NSO) 7 covers the delivery of Enhanced Amenity and Heritage. Ireland’s heritage is of fundamental importance to our society, identity, well-being and economy. Investment in our heritage has the dual benefit of protecting our natural and historic built environment while also enhancing public health and well-being, as well as supporting economic development through tourism and recreation.  Key progress has been made under NSO 7, including:  • Development of a national Velodrome and Badminton Centre which will deliver Ireland’s first-ever indoor cycling track to be developed at the National Sports Campus and a 12-court state of the art badminton centre.  • Fáilte Ireland announced six new capital projects in 2025, including: Dún Aonghasa Visitor Centre in Galway which will include redevelopment with climate change exhibits and interpretation hubs, and the Bray Head Signature Discovery Point in Kerry with a transformed Signal Tower providing a viewing point of the Skelligs.  • Investment of €37 million in our National Archive which will encompass the provision of secure environmentally controlled Archival Repository. The project will convert the existing single-storey warehouse to a two-storey Archival Repository. This will accommodate not only our current volume of records but will also provide opportunities to develop additional archival storage as required into the future.  • The recently published Office of Public Works NDP Sectoral Investment Plan (2026–2030) allocates over €1.8 billion, and includes investment in heritage conservation and visitor experience enhancements to support tourism and cultural assets.  The Government is committed to reporting regularly on the delivery of the NDP. Details of more projects and programmes being delivered under NSO 7 can be found in the latest Capital Investment Tracker, which I published in May 2025. This tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million. Accompanying the tracker, the myProjectIreland interactive map provides detailed information on projects across the country, including smaller investments such as schools and cultural and sporting amenities. The map allows users to search by city, county, or eircode to view projects in their local area.  I also would like to advise the Deputy that the Project Ireland 2040 Annual and Regional Reports highlight achievements and give a detailed overview of the public investments that have been made throughout the country, including detail from across Government on the national strategic objectives. The forthcoming Project Ireland 2024 Annual and Regional Reports will provide full and up to date detail on delivery of the National Strategic Outcomes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 61. Deputy Peter 'Chap' Cleere asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an overview of the progress made to date under National Strategic Outcome (NSO) 7 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP; and if he will make a statement on the matter. [70627/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_101",
          "debateSectionId": "dbsect_101",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_101.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_61",
        "questionNumber": 61
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I understand the Deputy refers to Level 1 and Level 2 Learning Programmes at Senior Cycle. These programmes were made available to schools for introduction from September 2024 and are intended for students whose needs and abilities may prevent them from accessing some or all aspects of other senior cycle programmes. They are personalised programmes, tailored to the individual learning needs of the student.  The introduction of Level 1 and Level 2 Learning Programmes at Senior Cycle is an important development as part of the wider Senior Cycle Redevelopment programme and a significant milestone for special education in Ireland more generally.  I am aware that a number of schools - both mainstream and special schools - are now offering the Senior Cycle Level 1 and Level 2 learning programmes to their students. Level 1 and Level 2 students have access to modules in the curriculum areas of Numeracy; Communication and Literacy; and Personal Care. Additionally, a broad range of elective modules including, for example, Drama, Visual Art, Looking after my Environment, and PE, have been developed by the National Council for Curriculum and Assessment (NCCA) and are currently available for schools to offer.  10 further draft specifications for elective modules including Music, Cookery, and IT Skills, are currently undergoing public consultation until 23 January 2026. The draft specifications can be accessed via the NCCA's website.  Schools will be guided by the Senior Cycle Learning Programmes: Level 1 and Level 2 Programme Statement, as well as my Department's recently published circular.  Each module under the Learning Programmes completed by the student will be certificated by the State Examinations Commission (SEC). I am pleased to say that next summer, it is planned that these students will receive their accreditation on results day alongside their peers following Leaving Certificate Established or Leaving Certificate Applied programmes.  Preparations are underway in my Department and in the SEC to facilitate the validation of learning and the certification process for the first cohort of students following these programmes to receive their accreditation in 2026.  Work is also underway in my Department in relation to a commitment to establish a dedicated Post of Responsibility in schools which offer Senior Cycle Level 1 and Level 2 Learning Programmes and meet certain eligibility criteria as set out in the Senior Cycle Redevelopment Implementation Support Measures document published last May.  The parameters surrounding this Post of Responsibility, including agreeing the criteria that might apply, as well as a comprehensive role description, form part of the discussions of the Post-Primary Implementation Group. There will also be consultation with the school management bodies in finalising these arrangements. My Department will then communicate with schools on this during the coming school year, ahead of the introduction of the post from September 2026.  The rollout of the Senior Cycle Level 1 and Level 2 Learning Programmes is a significant milestone in delivering a quality and inclusive educational experience for all students and reflects the commitment of the government in supporting children with special educational needs to fulfil their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 117. Deputy Peter 'Chap' Cleere asked the Minister for Education and Youth the steps her Department is taking to improve supports for students with special educational needs at post-primary level. [70429/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_117",
        "questionNumber": 117
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department will publish our sectoral NDP Implementation Plan shortly. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  There are 5 core stages involved in the delivery of a school building project. The stages range from Preliminary Design right through to completion and handover Stage 2b includes obtaining all statutory approvals, preparing a set of fully detailed Tender documents, and preparing an accurate pre-tender cost plan. During the planning application, Requests for Further Information (RFI) from the Local Authority and possible third party appeals to An Bord Pleanála can considerably lengthen the process.  My Department’s Design Team Procedures set out the requirements to be followed at each stage in the process and the Department’s Planning & Building Unit employ a rigorous and structured approach to permitting a project to move from one stage to the next. This includes robust interrogation of project scope, design and cost by Department delivery teams at each stage.  The current status of all projects is set out under item number ten at the following link [ (www.gov.ie) ]. ?This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.? ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 170. Deputy Peter 'Chap' Cleere asked the Minister for Education and Youth the steps her Department is taking to assist schools stuck at stage 2b in the school building project process; and if she will make a statement on the matter. [70428/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_194",
          "debateSectionId": "dbsect_194",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_194.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_170",
        "questionNumber": 170
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Government is committed to expanding capacity in veterinary education to meet Ireland’s growing demand for veterinary professionals and to support key sectors such as agri-food, public health, and animal health services. In this context, the Veterinary Places Activation Programme (VPAP), approved in September 2024, is delivering two new veterinary schools—one at Atlantic Technological University (ATU) and one at South East Technological University (SETU).  Alongside Minister McConalogue, I was delighted to launch the ATU Veterinary School at ATU Letterkenny last week. This marks a significant milestone for the West and North West, with ATU set to welcome its first cohort of 40 veterinary medicine students in September 2026. ATU’s model will feature a full on-campus clinical training facility, ensuring high-quality, modern clinical education and strong regional engagement.  SETU is working with the regulator to finalise the programme development and will also commence its veterinary medicine programme as soon as this process is completed, enrolling 30–40 students initially. Its delivery model will use a distributed, community-based clinical training network, supported by new facilities at the Glassworks site and Teagasc Kildalton College. This approach reflects international best practice and will broaden the diversity of Ireland’s veterinary training landscape.  At full rollout, ATU and SETU together will provide 80 additional veterinary graduates annually, reducing reliance on overseas universities and strengthening Ireland’s domestic veterinary pipeline. These developments form part of a wider Government investment in healthcare and veterinary education and will contribute significantly to regional development, talent retention, and the One Health research agenda.  I would like to take this opportunity to thank both SETU and ATU and the Veterinary Council of Ireland for the ambition and commitment to delivering this expansion of veterinary medicine across Ireland. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 226. Deputy Peter 'Chap' Cleere asked the Minister for Further and Higher Education, Research, Innovation and Science to detail the planned operation of the new veterinary colleges, and what it will mean for Irish students and for regional growth and activity. [67771/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_238",
          "debateSectionId": "dbsect_238",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_238.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_226",
        "questionNumber": 226
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department is taking a coordinated approach to preparing Ireland’s workforce for the opportunities and challenges linked to artificial intelligence (AI). This includes support for higher education, further education and targeted upskilling initiatives that help learners and workers develop the digital and analytical skills needed in a rapidly evolving labour market.  The Further Education and Training (FET) sector plays an important role in providing opportunities for learners of all ages to acquire the digital, analytical, critical thinking, and leadership competencies required to keep pace with technological progress. Across the FET sector, Education and Training Boards and SOLAS are introducing AI-focused programmes and micro-qualifications under initiatives such as Skills to Advance. Examples include QQI-accredited courses like Introduction to Artificial Intelligence (Level 4) and Enhancing Productivity with AI (Level 5). In addition, eCollege offers the ICDL Artificial Intelligence course online, providing learners with a solid understanding of AI principles, usage scenarios, and workplace applications. These offerings ensure that learners can access flexible, accredited pathways to develop AI literacy and digital skills, supporting Ireland’s ambition to remain competitive in a rapidly evolving global economy.  From an upskilling and reskilling perspective, my Department is preparing Ireland’s workforce for the opportunities and challenges of AI by funding flexible, high-demand courses in Information and Communication Technologies (ICT), including specific AI courses through the Springboard+ 2025 initiative. This programme provides almost 8,000 free or highly subsidised places on 249 flexible courses, including part-time micro-credentials and full-time ICT skills conversion programmes. There are 1,450 places on 50 ICT courses, of which 395 places are on courses in AI offered across 12 higher education providers. 93% of courses are delivered in blended or online format, supporting flexible upskilling and reskilling for learners across the country.  My Department has also consulted with our key partnership forum, the National Skills Council, for their advice on how to fully unlock the potential of AI driven innovation. The National Skills Council has identified AI skills as a critical national capability and made specific recommendations around AI skills gaps.  On the 25th November, Cabinet noted my Department’s plans to progress a national online AI Skilling Platform, curated through a public e-learning environment, to be launched in the first quarter of 2026. This is a direct response to the call from the National Skills Council for “continuous upskilling of the workforce” and accessible pathways for all citizens.  In addition, to assist educators and their students respond to this swiftly evolving field, the National Academic Integrity Network (NAIN), produced Generative Artificial Intelligence (GenAI) Guidelines for Educators in September 2023. This publication aims to provide practical support and advice for educators, to assist in the design and assessment of programmes. It also enables students to have a better understanding of an ethical basis for the use of GenAI tools, building their own self-awareness and knowledge, and avoiding breaches of academic integrity. These Guidelines will be regularly reviewed and updated with evolving developments.  Quality and Qualifications Ireland (QQI) has also published its Generative Artificial Intelligence Survey Report 2025 , providing a data-rich overview of how GenAI is reshaping the Irish education landscape. The report draws on insights from more than 2,200 staff and learners across further education and training, higher education, and the English language education sector.  As the first national survey of its kind in Ireland, the report examines how GenAI is understood, used, and perceived within educational settings, and explores its anticipated impact on teaching, learning, assessment, and the workplace. QQI has developed interactive dashboards that allow users to explore the survey data in greater detail. These tools are designed to help stakeholders make informed decisions about workforce development, digital skills training, and strategic planning in response to the evolving role of GenAI.  The full report and dashboards are available here: www.qqi.ie/what-we-do/engagement-insights-and-knowledge-sharing/our-data/analysis-of-generative-ai-survey.  Furthermore, my Department is actively contributing to work across Government to progress the development of an update to the National Digital Strategy (NDS), which will include an AI component, and to develop Technology Skills of the Future , which will be the successor plan to Technology Skills 2022, Ireland’s Third ICT Skills Action Plan.  The updated NDS will outline the Government’s vision to ensure Ireland is positioned to maximise the benefits and opportunities of AI and other technologies, building on commitments in the Programme for Government. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 247. Deputy Peter 'Chap' Cleere asked the Minister for Further and Higher Education, Research, Innovation and Science the way in which his Department is preparing Ireland's workforce for the opportunities and challenges of artificial intelligence. [67772/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_260",
          "debateSectionId": "dbsect_260",
          "showAs": "Artificial Intelligence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_247",
        "questionNumber": 247
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1052. Deputy Peter 'Chap' Cleere asked the Minister for Health for an update on a health centre upgrade (details supplied); and if she will make a statement on the matter. [70102/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_875",
          "debateSectionId": "dbsect_875",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_875.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1052",
        "questionNumber": 1052
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Delivered in partnership with local authorities, it primarily targets funding at areas with populations of less than 10,000 people.  Since the launch of the scheme almost €184 million has been allocated to over 1,800 projects nationally. Of this, Carlow has been allocated funding of over €7.3 million for 68 projects, with over €6.5 million allocated to 65 projects in Kilkenny. Details of all TVRS projects funded by the Department can be found on the Department's website.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration. The scheme included three funding streams under which project applications could be made, the Building or Land Acquisition Measure (BLAM), the Main Scheme and the Project Development Measure (PDM).  The BLAM closed for applications on 2 May 2025, and local authorities have been informed of successful applications. For reasons of commercial sensitivity, details of individual projects receiving support will be released only after the conveyancing of the properties or lands in question has been completed.  The 2025 Main Scheme and PDM closed for applications at the end of July. I can confirm that applications were received from the local authorities in both Carlow and Kilkenny. The assessment process is now nearing completion, and I hope to announce the successful projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 30. Deputy Peter 'Chap' Cleere asked the Minister for Rural and Community Development and the Gaeltacht for an update on the town and village renewal scheme in Carlow and Kilkenny. [68327/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_30",
        "questionNumber": 30
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 34 and 58 together.  My Department's CLÁR programme provides funding under a number of different measures for small-scale infrastructural projects in designated rural areas. I was pleased to announce funding of €12.3 million for over 200 projects under the CLÁR programme just last week.  The Programme for Government makes a commitment to carry out a comprehensive review of the eligible CLÁR areas. The statistical analysis for this review has now been completed and I am currently considering the content of the resulting report. It is intended that any changes to be introduced as a result of the review will be implemented before the next iteration of the scheme is launched next year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 34. Deputy Peter 'Chap' Cleere asked the Minister for Rural and Community Development and the Gaeltacht if he will consider expanding the CLÁR scheme to more areas; and if he will make a statement on the matter. [68328/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_72",
          "debateSectionId": "dbsect_72",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_34",
        "questionNumber": 34
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible under section 33 of the Policing, Security and Community Safety Act 2024 for the management and administration of An Garda Síochána, which includes the distribution and stationing of Garda personnel throughout the State. The Commissioner is independent in his functions under section 34 of the Act and, as Minister, I have no role in these independent functions.  In the interest of transparency, information in relation to the allocation of Gardaí by Division, Station and rank, including for Carlow and Kilkenny, is publicly available and can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the most recent month and access the file titled “Garda Members by Division District Station 2009 to the most recent date” for a breakdown of total Garda numbers by Garda station going back to 2009. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 113. Deputy Peter 'Chap' Cleere asked the Minister for Justice, Home Affairs and Migration for an update on Garda numbers in Carlow and Kilkenny. [68329/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_137",
          "debateSectionId": "dbsect_137",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_137.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_113",
        "questionNumber": 113
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The primary purpose of vetting carried out by the Garda National Vetting Bureau (GNVB) is to ensure the safety of children and vulnerable adults. This requires a robust Garda vetting process that reassures the public, and in particular parents, that appropriate checks are conducted on people taking on positions of trust.  The Garda Vetting Review Group was established with a primary focus to deliberate and formulate recommendations to strengthen the vetting legislation in an effective manner.  The Garda Vetting Review Group was tasked with ensuring that any changes to the vetting process ensure it remains robust, efficient and effective while improving the service to customers. This group included members of the National Vetting Bureau in An Garda Síochána, officials from my Department, Tusla and other relevant stakeholders.  The Group’s primary focus has been to examine the means of strengthening the vetting legislation in a workable and effective manner, while seeking to balance this with issues that have arisen regarding the re-vetting period and the transfer of vetting across other similar activities, for example with sports teams.  While the Group has not agreed a formal report, an update on its work was submitted to me and work is being undertaken to implement a number of key recommendations, in consultation with all relevant partners.  It is my aim to ensure the vetting system is fit for purpose, robust and future-proofed to the greatest extent possible, to continue to protect our children and vulnerable adults. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 118. Deputy Peter 'Chap' Cleere asked the Minister for Justice, Home Affairs and Migration if he will consider reviewing the Garda vetting process; and if he will make a statement on the matter. [68330/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_142",
          "debateSectionId": "dbsect_142",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_118",
        "questionNumber": 118
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) is leading the development and roll-out of strategic park and ride sites nation-wide through the Park and Ride Development Office (PRDO).  The Programme for Government commits to working with local authorities and relevant agencies to develop affordable Park and Ride facilities on the outskirts of major towns and cities.  The NTA established the PRDO in February 2020. The function of the PRDO is to enable and advance the delivery of strategic Park & Ride sites in collaboration with Local Authorities and transport agencies across all regions of the State, by providing full time specialist resources on these projects.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 117. Deputy Peter 'Chap' Cleere asked the Minister for Transport if he will investigate the possibility of additional car parking spaces at Muine Bheag train station. [67714/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_117",
        "questionNumber": 117
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. My Department will be publishing it’s Sectoral NDP capital plan shortly. A focus of this plan will be, in the first instance, to maximise the capacity of the existing school estate as much as possible. Additional capacity will be provided through targeted and prioritised projects which will be delivered over the course of 2026 to 2030 which will meet the most urgent and prioritised needs while ensuring delivery that is affordable, offers value for money, and meets functional needs. It is envisaged that this plan will include a two-year rolling programme of projects proceeding to construction with the initial tranche for 2026 and 2027 period involving circa. 80 projects. There will be a strong special education dimension to these projects given the priority of Government to support children with additional needs. The publication of the sectoral NDP capital plan, and the subsequent publication of project rollout information will provide clarity for the school system on my Department’s plans for progression of projects to construction over the course of 2026 and 2027. The current status of all projects is set out under item number ten at the following link (www.gov.ie). This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 275. Deputy Peter 'Chap' Cleere asked the Minister for Education and Youth to provide details of the 80 schools that will progress to construction in 2026 and 2027; and if she will make a statement on the matter. [67770/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_253",
          "debateSectionId": "dbsect_253",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_275",
        "questionNumber": 275
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-27",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 55. Deputy Peter 'Chap' Cleere asked the Minister for Foreign Affairs and Trade her response to the EU Commission's final package of proposals for the EU-Mercosur Partnership Agreement; and if she will make a statement on the matter. [66263/25] ",
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_55",
        "questionNumber": 55,
        "answerText": "",
        "debateSection": {
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_83",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_83.xml"
            }
          },
          "debateSectionId": "dbsect_83"
        }
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Reports of the Farmers Journal investigation into the sale of hormones and antibiotics in Brazil raise important issues and merit careful examination.  We know that Brazilian beef already enters the EU market, and it is therefore important to ensure that none of the unregulated products referenced in the investigation are used in its production. While there is no evidence that this is the case, these reports reinforce the need for continued vigilance.  According to Central Statistics Office data for the last number of years, Ireland has not imported beef product in any significant quantities from Brazil. In 2024, imports from Brazil amounted to 97 tonnes of a total of 34,000 tonnes imported. Beef imports from other Mercosur countries was virtually nil.  The EU has very stringent standards, known as SPS (sanitary and phytosanitary) standards, to protect human, animal and plant health. These are amongst the highest in the world, and the European Commission has insisted that they are not negotiable. These SPS standards remain unaltered regardless of any trade agreements concluded by the EU.  The Government is very firmly of the view that these EU SPS standards must continue to be rigorously upheld for the benefit of European consumers. It is also important that the European Commission continues to engage with the Brazilian authorities to ensure that this is the case.  Throughout the EU-Mercosur negotiation process, the Minister for Foreign Affairs and Trade - who has lead responsibility for trade policy - and I have actively engaged with both the European Commission and with other Member States to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Austrian, Latvian and Polish counterparts to exchange views. Most recently, I have met with my Italian and French counterparts en marge of the November Agri-Fish Council meeting in Brussels. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_125.xml"
            }
          },
          "debateSectionId": "dbsect_125",
          "showAs": "Beef Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_125"
        },
        "questionNumber": 126,
        "date": "2025-11-27",
        "showAs": " 126. Deputy Peter 'Chap' Cleere asked the Minister for Agriculture, Food and the Marine if he is aware of the reports on Brazil’s illegal antibiotic trade; if he has concerns regarding same in relation to the import of Brazilian beef into the EU; and if he will make a statement on the matter. [66472/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_126"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 124, 132, 156, 160 and 177 together.  At the EU Nitrates Committee meeting last December, my Department advised that in accordance with the Nitrates Directive, Ireland is seeking permission to continue applying in excess of 170 kg of livestock manure Nitrogen per hectare from 2026 subject to a set of conditions that will ensure that application is scientifically justified and will continue to contribute to the achievement of the Nitrates Directive’s objectives.  Since last December Ireland has made a number of presentations to the EU Nitrates Committee and there has been very significant engagement at a European level.  The Environmental Protection Agency or EPA presented on Irish water quality at the Nitrates Committee meeting in March.  In June my Department presented on Irish agriculture in a European context, the justification for our derogation, and the changes introduced during Ireland’s current Nitrates Action Programme or NAP.  At the September meeting of the Committee my Department, along with the Department of Housing, Local Government and Heritage, presented on the background to Ireland’s next NAP and our derogation request, as well as proposed measures that are now under public consultation regarding the next NAP.  All these presentations were well received by the Committee.  In June, the Commission wrote to Ireland regarding the need to demonstrate compliance with the Habitats Directive in addition to the need to meet the objectives set under the Water Framework Directive. This change has significant implications. The Government has engaged significantly with the Commission and stakeholders in response.  As part of this, I recently welcomed Commissioner Roswall to Ireland where she witnessed our unique grass-based system and the on-going work across the agrifood sector to reduce its impact on water quality. The visit included a very positive visit to a derogation farm in Kildare. The Commissioner also met farm organisations, eNGO’s, Oireachtas members, MEP’s and officials.  Engagement is on-going with the intention of securing the necessary qualified majority vote on Ireland’s derogation at the Nitrates Committee.  A qualified majority vote requires at least 15 Member States, representing at least 65% of the EU population to support a proposal brought forward by the Commission.  The priority for this government is both to retain the nitrates derogation and to improve water quality. I remain confident regarding achievement of these twin objectives. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_123.xml"
            }
          },
          "debateSectionId": "dbsect_123",
          "showAs": "Nitrates Usage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_123"
        },
        "questionNumber": 156,
        "date": "2025-11-27",
        "showAs": " 156. Deputy Peter 'Chap' Cleere asked the Minister for Agriculture, Food and the Marine if he will report on the recent visit of Commissioner Roswall to Ireland, and on talks he had with the commissioner regarding Ireland’s Nitrates Derogation. [66471/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_156"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 7. Deputy Peter 'Chap' Cleere asked the Minister for Housing, Local Government and Heritage the key measures to increase usage of modern methods of construction under Delivering Homes, Building Communities 2025-2030; and if he will make a statement on the matter. [65637/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_35",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_35",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_35.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 7,
        "answerText": " An Cathaoirleach Gníomhach (Deputy Pádraig O'Sullivan)  Tá Ceist Uimh. 7, in ainm an Teachta Peter 'Chap' Cleere, á thogáil arís ag an Teachta Séamus McGrath. \n Deputy Kieran O'Donnell  The Deputy is keeping us busy tonight. \n Deputy Séamus McGrath  Will the Minister for Housing, Local Government and Heritage outline the key measures to increase the use of modern methods of construction under Delivering Homes, Building Communities 2025-2030 and make a statement on the matter? \n Deputy James Browne  I again thank Deputy Séamus McGrath for asking this question on behalf of Deputy Peter 'Chap' Cleere. I propose to take Questions Nos. 7, 64 and 99 together.  The new national housing plan contains a range of actions to increase skills and support modern methods of construction, building on the initiatives already in place. MMC is the term used to describe a range of compliant innovative construction alternatives to traditional construction methods. MMC has the potential to boost productivity, increase efficiency and improve sustainability in the construction sector. It has brought tangible benefits to housing delivery. Reductions in delivery timeframes of up to 40%, greater cost certainty and reduced changes during construction have offered both cost and time savings.  My Department is working closely with the Department of Enterprise, Tourism and Employment, the Department of Further and Higher Education, Research, Innovation and Science and other relevant stakeholders in progressing work to increase delivery capacity in the residential construction sector through promoting the adoption of modern methods of construction.  Key actions which are included in delivering homes, building communities to increase adoption of MMC are: the use of MMC in at least 25% of all new social and affordable homes built during the lifetime of the plan; support for the use of three-dimensional modular units through pathfinder projects in Limerick and Wexford; optimising the NSAI agrément certification process; promotion of ISIF funding opportunities for manufacturers to support new and existing factories; the delivery of at least 1,500 MMC dwellings through the local authority accelerated delivery programme; renewing the action plan to promote careers in construction and launching a new five-year action plan for apprenticeships; and doubling the overall investment of Enterprise Ireland’s build to innovate programme to drive adoption of efficient construction practices and the use of MMC.  My Department has also recently published the standardised design approaches study.  These standardised design approaches will raise awareness about the benefits and opportunities and promote adoption, of standardised housing design to facilitate MMC. \n Deputy Séamus McGrath  I welcome the strong recognition for modern methods of construction in the new housing plan. That is critically important. The construction sector is very much up for embracing MMC and the additional measures in the plan to incentivise the construction industry to take up those measures are critically important. The Cathaoirleach Gníomhach will know a development in his constituency, Longview in Ballyvolane, where the developers are very much embracing both on-site and off-site modern methods of construction and really delivering quickly in terms of the turnaround time for new houses. That is important and it was a site the Taoiseach visited recently to see first-hand the progress that has been made there. I totally agree that this has the potential to be a more environmental form of construction and increase sustainability but also provide new employment opportunities for individuals as well in the area of modern methods of construction. Furthermore, it does, of course, help us weatherproof some of the delivery in terms of construction so that it can move apace during the winter months, which is one of the key advantages of MMC. \n Deputy James Browne  I thank the Deputy for the important question on MMC. A dissemination programme is currently being developed by my Department and the Department of Further and Higher Education, Research, Innovation and Science to promote the use of these approaches in the education and construction sectors. These standardised designs build on my Department's existing design manual for quality housing, for example, for social housing and the LDA's Apartment Typology Booklet, which also include designs to promote the use of MMC for social housing and apartments. In addition, my Department's accelerated delivery programme supports the development of new social homes using MMC. The delivery of at least 1,500 new homes across a total of 36 sites and 13 local authorities has been prioritised and enabled through the use of a streamlined design and build procurement approach that facilitates MMC. Approximately 1,250 homes are being constructed using this procurement approach. The Government is committed to supporting all forms of MMC to encourage greater innovation in construction. The 2D approaches using panelised systems are quite widespread, with 3D volumetric approaches still in a more embryonic phase. \n Deputy Séamus McGrath  I strongly believe the construction sector is onboard for modern methods of construction. It recognises the advantages, cost savings and that it can deliver with greater efficiency, which is critically important. It is also important the Government is leading in this way in the provision in the plan for 25% of social and affordable units to be delivered through MMC. That message is very important. Indeed, other measures such as build to innovate by the Department of enterprise is also very important to help promote MMC. It is a sector that will continue to grow in this country. It can provide employment opportunities and use more sustainable materials as part of that, which is critically important from an environmental point of view, as well as delivering homes in a more speedy and efficient manner. \n Deputy James Browne  We will support a number of 3D volumetric pathfinder projects to further explore the potential for these innovative systems. Using MMC, Limerick City and County Council and the mayor’s office will be supported to advance the initial phase of their SMART modular housing project. In addition, Wexford County Council is being supported to commence a project to develop 22 permanent social homes utilising 3D volumetric systems. We will continue to maximise the use of 2D right across our systems due to its importance. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_7",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 126. Deputy Peter 'Chap' Cleere asked the Minister for Housing, Local Government and Heritage his assessment of home completions in the first nine months of 2025; and if he will make a statement on the matter. [65638/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_128",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_128",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_128.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 126,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 106 and 126 together.  Increasing the supply of new homes is critical to alleviating pressures in the housing market – in this regard, supply has increased significantly over the last five years, with more than 157,500 new homes delivered since the beginning of 2020.  Indeed, more than 92,000 new homes were completed in 2022, 2023 and 2024 combined, exceeding the Housing for All target for the period by around 5,200 homes alongside significant potential currently in the delivery pipeline.  New dwelling completions data are published by the Central Statistics Office (CSO) on a quarterly basis and are available on its website at: https://data.cso.ie/table/NDQ05  CSO data show some 24,325 new homes completed in the first nine months of the year, up 13% on the same period last year and the highest first three quarters completions figure since the data series began in 2011.  Encouragingly, after a very significant drop-off in apartment delivery in 2024, the figures show a 30% increase in apartments in the first three quarters of this year as compared with the same period in 2024, with more than 7,950 apartments completed. This is the highest first three quarters completions figure for apartments since the data series began.  Almost 33,000 new homes were completed in the 12-months ending Q3 2025, up 4% year-on-year and the highest rolling 12-month completions since the CSO data series began.  Government is focused on continuing to increase the national housing stock and ensuring a suitable range of housing, across tenure types, is available to all. The new housing plan Delivering Homes, Building Communities builds on the foundations laid under Housing for All and will deliver a minimum of 300,000 new homes, including record levels of new social homes, an ambitious nationwide Starter Homes Programme and the provision of additional delivery in the areas of Purpose Built Student Accommodation (PBSA) and vacant and derelict properties brought back into use, as set out in the Programme for Government. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_126",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 782. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality the number of WTE speech and language therapists employed; the number of approved WTE speech and language therapists positions; the number of children under 18 waiting to be seen; the length of time they are waiting to be seen, by county, in tabular form; and if she will make a statement on the matter. [66056/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_697",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_697",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_697.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 782,
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 782 and 783 together.  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_782",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 783. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality the number of WTE occupational therapists employed; the number of approved WTE occupational therapists positions; the number of children under 18 waiting to be seen; the length of time they are waiting to be seen, by county, in tabular form; and if she will make a statement on the matter. [66058/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_697",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_697",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_697.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 783,
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 782 and 783 together.  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_783",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 784. Deputy Peter 'Chap' Cleere asked the Minister for Children, Disability and Equality the number of occupational therapists currently employed by the HSE in the southeast region; the number of OT’s approved; and if she will make a statement on the matter. [66062/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_698",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_698",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_698.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 784,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_784",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 952. Deputy Peter 'Chap' Cleere asked the Minister for Health the number of occupational therapists currently employed by the HSE in the southeast region; the number of OT’s approved; and if she will make a statement on the matter. [66553/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_856",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_856",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_856.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 952,
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_952",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 953. Deputy Peter 'Chap' Cleere asked the Minister for Health the number of WTE occupational therapists employed; the number of approved WTE occupational therapists positions; the number of children under 18 waiting to be seen; the length of time they are waiting to be seen, by county, in tabular form; and if she will make a statement on the matter. [66554/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_857",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_857",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_857.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 953,
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_953",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 954. Deputy Peter 'Chap' Cleere asked the Minister for Health the number of WTE speech and language therapists employed; the number of approved WTE speech and language therapists positions; the number of children under 18 waiting to be seen; the length of time they are waiting to be seen, by county, in tabular form; and if she will make a statement on the matter. [66555/25] ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "debateSectionId": "dbsect_859",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_859",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_859.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "questionNumber": 954,
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_954",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_97",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_97",
          "showAs": "Sport and Recreational Development",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_97.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 66. Deputy Peter 'Chap' Cleere asked the Minister for Culture, Communications and Sport for an update on the integration of organisations (details supplied). [64540/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_66",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  I am very supportive of the process of integration which reflects much of what is already happening at club level and will further ensure parity of treatment for all players within the Gaelic Games family, which is the subject of the question.  I understand that good progress is being made on the integration process under the leadership of Mary McAleese and the Steering Group on Integration. I hope that full integration will be achieved by the stated target of 2027 and that it will deliver a unified National Governing Body for Gaelic Games that all feel welcome in.  Ultimately, however, the Gaelic Games organisations are independent and autonomous and the issue of integration is fundamentally one for the organisations themselves and their members. ",
        "questionNumber": 66,
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_99",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_99",
          "showAs": "Sport and Recreational Development",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_99.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 68. Deputy Peter 'Chap' Cleere asked the Minister for Culture, Communications and Sport the steps his Department is taking to encourage the over 60s to participate in sport. [64541/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_68",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  This Government is committed to a \"Sport for All\" approach aimed at ensuring that all persons can partake equally in sport and physical activity regardless of gender, age, disability, or social-economic status, or membership of any minority group.  Age & Opportunity is the?national?organisation that works to empower people to reach their full potential as they age. One of its goals is to facilitate opportunities for sport and physical activity for older people. To support this goal, Sport Ireland, which is the statutory body for the development of sport, allocated Age & Opportunity €630,000 in core funding in 2025.  The Age & Opportunity Active National Grant Scheme provides significant funding for sport and physical activity amongst older persons. More than than €8 million has been distributed though the scheme since its inception and this year it is providing €300,000 to support sport and physical activities run by 988 groups and organisations. The scheme, a combined initiative by Age & Opportunity and Sport Ireland, funds diverse activities nationwide including pickleball, kurling, tai chi and aqua aerobics.  Sport Ireland also allocates funding to its network of 29 Local Sports Partnerships (LSPs) operating across Ireland. These LSPs undertake a wide range of actions with the aim of increasing sport and physical activity participation levels in their local communities.  In particular, the LSPs target vulnerable and disadvantaged groups in society, including older adults. In 2025, the LSP network received €11,945,000 in core funding. LSPs deliver a suite of programmes for older adults across the country through walking programmes, exercise classes, dance classes and taster sessions for various sports  LSPs provide funding through club development grants each year to support clubs with a focus on a number of target groups, older adults being one. This funding supports clubs to develop programmes and specific participation and volunteering opportunities to engage older adults.  All 29 LSPs have a dedicated Sports Inclusion Disability Officer supporting people with disabilities to get more active. This role incorporates a lot of work with older adults engaging in programmes such as chair yoga, tea dances, and chair aerobics. ",
        "questionNumber": 68,
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_179",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_179",
          "showAs": "General Practitioner Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_179.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 159. Deputy Peter 'Chap' Cleere asked the Minister for Health to provide an update on general practitioner services in Mullinavat, County Kilkenny; and if she will make a statement on the matter. [64381/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_159",
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionNumber": 159,
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_217",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_217",
          "showAs": "Parking Provision",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_217.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 198. Deputy Peter 'Chap' Cleere asked the Minister for Health if hospital car parking charges in St. Luke’s Hospital, Kilkenny will be phased out; and if she will make a statement on the matter. [64382/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_198",
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionNumber": 198,
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "oral",
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "showAs": " 1. Deputy Peter 'Chap' Cleere asked the Taoiseach when the Cabinet Committee on water quality will next meet. [46873/25] ",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/debate/mul@/dbsect_17.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/debate/dbsect_17",
          "showAs": "Cabinet Committees",
          "debateSectionId": "dbsect_17"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_1",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 16, inclusive, together.  The Cabinet Committee on water quality oversees implementation of the programme for Government commitments in relation to the range of issues affecting Ireland’s water system. The committee last met on 30 October and the date of its next meeting has not yet been scheduled. The committee is informed by the work of the Environmental Protection Agency, EPA, which monitors and reports on water quality in Ireland. The EPA recently published its report Water Quality in Ireland 2019-2024, which shows water quality improvements in some areas but also an overall decline in waterbodies in a satisfactory ecological condition. While the overall ecological status of Ireland’s waters is significantly better than the European Union average, the downward trend is a matter of concern. The report shows that targeted actions in the agricultural sector and improvements in wastewater treatment appear to be paying dividends, with lower reported levels of nutrients in water bodies where targeted actions have been taken.  The Cabinet committee has also examined the investment programme of Uisce Éireann to improve wastewater treatment capacity and meet best practice in managing its existing infrastructure. Last week, the Minister for Housing, Local Government and Heritage published a sectoral plan for water services and water quality. This includes record investment of €12.2 billion, largely allocated to Uisce Éireann to support the delivery of the additional water services capacity required to deliver the Government's housing plan and to improve water quality. This investment will help to deliver the Government water action plan, Ireland's roadmap to protect and restore our rivers, lakes, estuaries, coastal waters and ground waters.  Last year, the Government also published Water and Agriculture: A Collaborative Approach, and this report sets out measures to address the twin objectives of improving water quality and demonstrating that a robust case exists for the maintenance of a derogation for Ireland from certain aspects of the EU nitrates directive. In October, the Minister, Deputy Browne, published a draft nitrates action programme, which will form the basis of Ireland’s ongoing discussions with the European Commission on a new derogation. The Minister has invited submissions from the public on its contents. A public consultation process on the strategic environmental assessment and appropriate assessment of the plan is also live, with submissions invited by 1 December.  European Union environmental Commissioner Roswall visited Ireland last week and met with the Minister, Deputy Heydon, as well as farmers and other stakeholders to discuss Ireland's application for a derogation and the importance of its continuation to Ireland's outdoor, grass-based livestock systems. The visit provided an opportunity for the Commissioner to visit a farm in County Kildare to see at first hand the efforts towards improving water quality and to engage with public representatives and stakeholders. Discussions with the Commission are ongoing to find an approach that facilitates the continuation of high-quality dairy and beef production by derogation farmers while ensuring sufficient protection for the quality and ecological status of our rivers, lakes and estuaries. \n An Ceann Comhairle  We have 16 speakers. They have a minute each and I ask them to be as concise as possible. I call on Deputy Cleere. \n Deputy Peter 'Chap' Cleere  Last week, we saw serious disruption for towns and villages like Thomastown, Graiguenamanagh, Inistioge and Freshford, which are currently faced with significant backlogs for the implementation of effective flood relief schemes. I acknowledge there has been extensive consultations with local communities to achieve a solution that satisfies those communities and the needs of the local environment. However, the delivery has been delayed far too long. The conversation needs to move to action. It is all about implementation and delivering effective solutions for these communities at risk.  Let me give the Taoiseach a brief example. In Graiguenamanagh, my own town, there was a major flood issue in 2016. In 2018, funding was announced. In 2020, a design team was assigned. We are now in November 2025, and we have not even gone for planning permission yet. It is anticipated that the planning process will take two years. Construction will then start at the end of 2028, with a two-year timeframe for completion. That just gives an example of the length of time these projects are taking. \n An Ceann Comhairle  The Deputy has five seconds. \n Deputy Peter 'Chap' Cleere  I understand that fish life is important, but what about the lives of Johnny and Mary, living in a house that has been flooded? The people in Freshford, Graiguenamanagh, Thomastown and Inistioge are going to bed at night from November to March wondering if their houses will be flooded come the morning. \n An Ceann Comhairle  I thank the Deputy. \n Deputy Peter 'Chap' Cleere  The injustice to these communities has gone on far too long. \n Deputy Aindrias Moynihan  Farmers are very keen to improve water quality. The recent oversubscription of environmental schemes reflects that appetite. Our grass-based system differs very much from what would be found across Europe. Family farms right across Ireland need to be able to plan for the year ahead and the nitrates derogation is very much part of the planning for the day-to-day operation of the farms. Farmers are really keen to know where they stand and they are going to need to know that for the start of the year. Retaining this derogation is vital. I very much impressed this on Commissioner Roswall during her recent visit to Ireland. She did acknowledge that progress had been made but she was also keen to see that there would be ongoing progress and improvements. Will the Minister and the Government be able to win support across EU colleagues to ensure the derogation will be retained? Additionally, farmers are also being told they are not alone in respect of improving water quality. They are keen to pull their weight and they will, but they also need to know that municipal waste inputs and Irish Water will also pull their weight. \n Deputy Paul Murphy  Two years ago, I raised with the Taoiseach a repeated problem of sewage overflowing in Dodder Valley Park beside Balrothery weir. When there is heavy rainfall, the sewage shoots out beside a residential area in a beautiful park. It is still happening. It happened again last weekend with the heavy rainfall. In March 2024, I got a reply from Uisce Éireann accepting that it was impacting the environment and posing a risk to public health through flooding. At that time, it said it was at stage 3 of a four-stage process and it would have options and costings in quarter 4 of 2024. In August 2024, I followed up on this matter. I got a response in February of this year, over six months after the promised commencement of stage 4. The company apologised for the delay and said it was concluding stage 3 and moving into stage 4. I have followed up again with the company. It is simply unacceptable that the health of residents and park users is put at risk and that the deadlines for action keep getting delayed. Does the Taoiseach agree that Irish Water, Uisce Éireann, must act? \n Deputy Ruairí Ó Murchú  I would like to use this time to remember Chloe McGee, Chloe Hipson, Dylan Commins, Shay Duffy and Alan McCluskey. Ar dheis Dé go raibh a n-anamacha dílse. We think of their families and friends. It is going to be a very difficult time over the next couple of days for communities right across counties Louth, Monaghan and Meath. I have been in O'Fiaich College and DkIT and seen huge supports for students and staff. It was the same in the Sean McDermotts club last night also. This is the level of resilience we will see. My thoughts go out to those affected by what has been an absolutely desperate tragedy. I also think of those injured. We hope for a speedy recovery. Beyond that, we think of the emergency services, whose members saw things nobody should have to see. \n An Ceann Comhairle  Go raibh maith agat. I appreciate that yesterday's proceedings overtook us and we did not get to pay our due respects. What the Deputy said goes for us all. I thank him. I call on Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Go raibh maith agat. I want to raise with the Taoiseach the situation of two households living in Lyre, Mahon Bridge, County Waterford. They live in two adjoining council-built cottages constructed in 1949. At the time, the local authority installed a water supply from an open stream flowing off the Comeragh Mountains, and that is still their only source of water 75 years later. It is untreated and coming from a roadside stream. The water runs black and is full of silt, filth and worse. Each of the men has pulled dead rats and badgers from it on occasion. The supply is so unsafe that the health authorities have warned them not to even wash their hands with it.  I have raised this directly with the Minister for housing and with Uisce Éireann. A brand new public mains runs just 500 m from the townland of Fews across from these men's homes. Connecting these homes would require just a short bore under a regional road but Uisce Éireann has refused to fund it and instead told residents to apply for a private well grant. Unfortunately, the land in the area they live in is not suitable for a private well and they have that on good authority from several professional well drillers. Will the Taoiseach please act in the interests of these two households and instruct Uisce Éireann? I will show the Taoiseach, very briefly, a bottle with a sample of water they provided me with recently. It illustrates the depth of what their public water supply is. \n An Ceann Comhairle  Deputy, we do not allow displays of such nature but I understand it is your first time. I call Deputy Barry Heneghan. \n Deputy Barry Heneghan  I have raised the issue of water quality in Dublin Bay time and time again. I am not going to just single out the north side. This is a north and south Dublin problem. We saw the rain that fell at the weekend. We have all seen the drone footage of the bay being polluted. I have swimmers whose only way of socialising is getting into that water and having the chats but the E. coli levels are not acceptable at the moment. In Dublin Bay and with the way the plumes work with the tides, the north side is affected worse when there is a high level. Some of these constituents are here today with the visual artists from Palestine who raised money for Artists Without Borders in Clontarf Castle. They are going to be swimming in that water. These are the people who need this water protected. We see in Dún Laoghaire that oysters are being brought in to treat the water. Can we get that on the north side as well? I have a mandate for that. It was on my four-pager. Oysters are great natural filters of E. coli and other contaminants. \n Deputy Rose Conway-Walsh  The EU drinking water regulations came into effect in Irish law in March 2023. \n The Taoiseach  Sorry, the which? \n Deputy Rose Conway-Walsh  The EU drinking water regulations. I raise it in the context of the ongoing intolerable situation where 500 households in Ballycroy and Inishbiggle, in County Mayo are left without water for days on end. The way to solve this is to allow some flexibility in the multi-annual water programme to enable moneys that have been returned to the Department, or are to be returned to the Department, from one scheme can be reallocated to another scheme that desperately needs it. There is a gravity-fed group scheme in Ballycroy and it is run by volunteers. What has happened is some of the volunteers have passed away so they are trying to reconfigure the volunteers in the parish to be able to apply for the necessary funding. There is a way to solve this. Mayo County Council applied for emergency funding earlier this year but was unsuccessful so we need emergency funding and some flexibility around the framework. \n Deputy Richard Boyd Barrett  I also wish to raise the issue of water quality in Dublin Bay, for the umpteenth time. Every time there is a massive downpour like the ones we had very recently, rainfall water or stormwater mixes with sewage and pours into Dublin Bay. The pumping station at the west pier in Dún Laoghaire pumps stuff out to Ringsend but Ringsend does not have the capacity. It overflows, goes into Dublin Bay and then water quality is very seriously undermined.  I was looking at a question I asked back in 2019, and it was not the first time. Even then, the Government was promising it was going to upgrade Ringsend. That was 2019 and it still has not been done. It still happens every time it rains. It is unbelievable. When is the Government finally going to make sure that the upgrade at Ringsend and the rehabilitation of our decrepit water infrastructure, which is jeopardising water quality, swimmers and health and causing all sorts of bad, adverse problems, is going to be finally addressed by this Government? \n Deputy Liam Quaide  I know the Taoiseach will reject the claim that rural Ireland is being left behind by his Government but many residents of the village of Ballyhooly in my constituency beg to differ. They have good reason to. The very basic need for a consistent supply of water to drink, bathe in or use in appliances such as dishwashers and showers has been denied to them for many years. Residents in Ballyhooly have to deal with extremely low water pressure alternating with a non-existent supply of water for prolonged periods. This has hit people with chronic illness, disability and age-related care needs the hardest. It has also severely impacted the local school and farming community. In recent months, there has been a reprieve from a full-scale outage but water pressure remains very low and there is no clear timeframe on the extent of works required to resolve the issue. Short-term fixes will no longer cut it for Ballyhooly. When are we going to see movement on this essential project that will allow the village to thrive? \n Deputy Erin McGreehan  Along with my constituency colleague, I want to pay respects to those poor five souls, the young people who lost their lives in the car accident at the weekend: Chloe McGee, Shay Duffy, Alan McCluskey, Dylan Commins and Chloe Hipson. It is a desperate loss for their families, friends, work colleagues and everybody. I only hope their families can find the strength to walk along the pain and agony that comes upon a family when they lose someone so tragically. It seems almost futile and frivolous to mention it during a discussion on water quality.  I have raised on several occasions the state of the water and rivers around Dundalk Bay. Research was published recently in a local newsletter spelling out clearly issues around repeated sewage discharge and wastewater plants operating beyond capacity, with visible waste near Blackrock and protected habitats being steadily damaged. People are seeing it, smelling it and living beside it. As the Taoiseach knows, I raise these concerns regularly and I get very dismissive responses from Irish Water. I often feel almost gaslit by them. I hope that when the Cabinet committee is working on water quality with the infrastructure Department that it will consider fast-tracking projects to make sure our water quality is up to standard. \n Deputy Peadar Tóibín  Keeping the lights and on and water in the taps is surely one of the basic responsibilities of any administration but we live in a country where that is simply not happening. For a country where it seldom stops raining, it hardly goes a week before there is a water or hosepipe ban in this country. In my county of Meath, things are out of control currently. As we speak, a burst mains causing major disruption in Navan. There are multiple outages every week in the system in Enfield. People in Trim can hardly turn the water taps on because of discoloured water or bans on water being used at certain times of the day, etc. Councillor Dave Boyne and I have had to campaign to get water trucks to bring water to other towns in the county. The Taoiseach talks about massive investment, which is welcome, but it is not making a difference on the ground because there are major problems for Irish Water to deliver on infrastructure in terms of planning, permits and tendering etc. When will those be fixed so we can get the system fixed? \n Deputy Paul Lawless  I have raised this many times previously but the water quality in Clew Bay, County Mayo is being massively damaged at the moment. Raw sewage from Newport town is collected and stored in containers. When the high tide comes in to Clew Bay, it washes raw sewage on to the shoreline. Everyone is in agreement that a water treatment plant is needed for the town and it has been in the planning process for decades. There are significant issues in relation to the Maritime Area Regulatory Authority, MARA, which is not meeting its statutory timelines, and indeed Uisce Éireann. It appears that what is happening is a letter-writing club between the two organisations, with no progress being made. I have raised this previously and I ask the Taoiseach to intervene. We cannot have critical infrastructure delayed for decades as a result. I have raised this with Uisce Éireann and MARA but it is time the Government intervened and injected some urgency into this. \n The Taoiseach  I thank all of the Deputies. A comprehensive number spoke in respect of the responsibilities of Irish Water, particularly in terms of wastewater treatment plants and flood relief schemes.  Deputy 'Chap' Cleere raised the issue of a series of flood relief schemes in his constituency. I do not know why the planning process should take two years and that is something we need to analyse further but measures will come to Government in respect of critical infrastructure in the next number of weeks. Flood relief schemes are taking too long because the urgency is very real.  Given the worsening climate, we have more frequent storms and rainfall that is heavier and comes in short bursts and that is creating huge pressure on our systems. I have been to many flooding scenes where the devastation is appalling and negatively impacts on households and businesses. We then have consequential compensation schemes and everything we try to do to alleviate the pressure but there is nothing worse than being the victim of a flooding incident. I will take a look at those schemes and talk to the Minister of State with responsibility for the OPW, Deputy Moran, to see how we can accelerate this. We are also looking at a critical infrastructure Bill and will see whether we can include wastewater and flood relief schemes.  Deputy Aindrias Moynihan raised the derogation and I fully agree with him that retaining the derogation is vital for farm families and for the food production system and the dairy industry. We need a sustainable farming industry but farmers are working with us on various water improvement schemes under the European Union framework and have being doing a lot to measure and assess this work. I have had discussions with the President of the European Commission explaining the unique position in Ireland because we have a pasture-based system that is outdoors more than indoors. Most other European systems are indoors. The Minister for agriculture, Deputy Heydon, has been working with Commissioner Roswall, who came to Ireland last week. She met farmers in Kildare and saw first-hand the measures we are taking to make farming and agriculture more sustainable. We know farmers do need to know. I take the Deputy's point in respect of other contributors to waste and I met representatives of Irish Water recently in the context of the Cabinet subcommittee meeting. Representatives from the Environmental Protection Agency were there as well. In my view, Irish Water has to get it right in respect of its own actions. It cannot contribute negatively to water quality, being a water body itself, nor can local authorities. They also certainly need to step up to the plate in protecting our waterways.  Deputy Murphy raised the issue of Balrothery estate in terms of sewerage overflow. Again, I will talk to Irish Water in respect of where that is at. We have allocated unprecedented resources to Irish Water as a result of the national development plan and we have given it multi-annual funding. Irish Water knows what its funding will be for the next five years, which should enable staff to get on, to plan and do things. There is a lot of work to be done. Our population is growing exponentially, and has grown during the past two decades. That is creating pressure on water services. What will be important as well, for those who correctly referenced wastewater treatment plants, is that we have to try to create a narrative and a consensus in society not to object to wastewater treatment plants, to their upgrade or to supply projects. An awful lot of these projects are getting snarled up in planning and being delayed for far too long. What is happening in the preparation of the schemes, stage III to stage IV, is that everybody is dotting the i's and crossing the t's because they are anticipating an objection or a judicial review so they want to make sure they can be resilient in the face of a court case being heard or a judicial review of a decision taken during the planning process. What we are getting is a very slow process in getting projects through. We will have to deal with that and the Government is determined to deal with that because we have to push ahead. Even on a small issue like apartment guidelines, and we had it earlier this afternoon during Leaders' Questions, we get public representatives judicially reviewing regulation. Then people complain about things not moving. We cannot have it our own way, every way, but that is a general comment on where we are and it is important.  Deputies Ó Murchú and McGreehan correctly articulated all of our shock and horror at the devastating accident in Louth. Five young lives were lost. They were going out for a nice evening. We are all parents and we are all afraid of something like that happening when our young people go out and so on and we all want them to come home. On this occasion, they did not come home and the impacts on the parents are beyond comprehension. It is very difficult for them. We hope the beautiful memories they had with their young children will sustain them in the time ahead. I thank the Deputies for raising this in the House.  In regard to Deputy McGuinness's contribution, I will talk to Irish Water. I cannot get involved in every single case. This relates to two houses. Surely the county council and Irish Water should knock heads together and get that issue sorted if the water mains are 500 m away.  Deputy Heneghan has left the Chamber. He has gone with the swimmers; I would say they are gone too. Deputy Boyd Barrett raised the issue of Dublin Bay as well. It is a very serious issue. E.coli levels are too high and when there is heavy rain. people cannot swim. That is not satisfactory. I am back to the issue that we need wastewater treatment plants. The whole Dublin water project is being judicially reviewed. The Arklow wastewater treatment plant was conceived at the same time as the Dublin scheme. It has opened - I opened it - and the Dublin scheme has not even gotten off the ground. There are other projects of that kind we need to get off the ground and to get going. The points were well made by Deputies Boyd Barrett and Heneghan in that regard.  In terms of the drinking water regulation and the 500 households, again it is a specific issue and I will talk to Irish Water in respect of that. \n Deputy Rose Conway-Walsh  That is not Irish Water \n The Taoiseach  Is it a group scheme? \n Deputy Rose Conway-Walsh  It is a group scheme. \n The Taoiseach  The Deputy wants flexibility in the multi-annual funding. I will talk to the Minister to see whether there is anything that can be done there or not. \n Deputy Rose Conway-Walsh  Thank you. \n The Taoiseach  There is a combination of issues in terms of the reconstitution of the group of volunteers. Deputy Boyd Barrett raised the issue that Ringsend does not have capacity. We have been engaging and have appointed----- \n Deputy Richard Boyd Barrett  It has been going on for years. \n The Taoiseach  I know and we have allocated billions of euro now so hopefully we can get it done.  Deputy Quaide raised the issue of Balyhooly and the basic quality of water. I have spoken to Irish Water representatives about the Cork situation more generally in terms of water quality issues and they are working on that.  Deputy McGreehan again raised the issue of habitats and Dundalk Bay. Again, I asked Irish Water to engage with public representatives. All State agencies should engage with public representatives in a respectful and engaging way and should give proper responses. The State funds these agencies. In many ways they are created as agencies to get things done but that should not absolve the agencies then of their responsibilities to communicate to democratically elected Deputies and Senators or indeed councillors on the local authorities as well. I will have a look at what the story is in Dundalk Bay.  Deputy Tóibín raised the issue of Trim again in terms of keeping the taps on and water quality. Again, it relates to wider issues. They had the plan, we have now funded the plan, and the issue now is getting things done as quickly as we can.  Deputy Lawless raised Clew Bay and Newport. Again, it is about getting the infrastructure in place as quickly as we can. I will relay all of those to Irish Water for a response. \n An Ceann Comhairle  I thank the Taoiseach. We will move to the next questions, which is the grouping of Question Nos. 17 to 31, inclusive, to ask the Taoiseach for a report on the work of the shared island unit. We have 17 minutes and 14 seconds left. ",
        "questionNumber": 1
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "showAs": " 365. Deputy Peter 'Chap' Cleere asked the Minister for Health the reason income limits for persons aged over 70 applying for a full medical card have not been revised in recent budgets; if she accepts that the current income thresholds are no longer reflective of the significant rises in the cost of living, energy, insurance, inflation and healthcare expenses; and if she will outline any plans to review these limits to ensure a fairer and more realistic assessment for older people, who are disproportionately affected by these increases as they often live on fixed or modest retirement incomes, with limited capacity to supplement their income. [64324/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_246.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_246",
          "showAs": "Medical Cards",
          "debateSectionId": "dbsect_246"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_365",
        "answerText": " Minister for Health  Eligibility for a Medical Card is primarily based on a financial assessment which is conducted by the HSE in accordance with the Health Act 1970 (as amended). The HSE assesses each medical card application on a qualifying financial threshold. This is the amount of money that an individual can earn a week and still qualify for a card. It is specific to the individual’s own financial circumstances.  Persons aged 69 and under are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after tax and the deduction of PRSI and the Universal Social Charge. Certain expenses are also taken into account. Examples of allowable expenses include rent, mortgage, certain insurance costs, childcare, maintenance, nursing home net costs  which help to increase the amount a person can earn and still qualify for a medical card. Detailed guidelines are available at: Assessment for a medical card - HSE.ie.  Persons aged 70 or older are assessed under medical card income thresholds which are based on gross income. The weekly gross medical card income thresholds for people aged 70 and over are currently €550 per week for a single person and €1050 for a couple. However, it should be noted that those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Furthermore, the Deputy may be aware that, since 2015, every individual aged 70 and over has automatic eligibility for a GP visit card.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card - in particular, to take full account of difficult circumstances in the case of applicants who may be in excess of the income guidelines. In such circumstances, the HSE may exercise discretion and grant a medical card, for example:  • Discretionary medical cards issued to patients with significant medical expenses but who do not satisfy the means test.  • Emergency medical cards are issued to patients that are terminally ill, or are seriously ill, and in urgent need of medical care that they cannot afford.  To ensure the medical card system is responsive and sensitive to people's needs, my Department keeps medical card issues under review and any changes are considered in the context of any potential broader implications for Government policy, the annual budgetary estimates process and legislative requirements arising.   ",
        "questionNumber": 365
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 115,
        "showAs": " 115. Deputy Peter 'Chap' Cleere asked the Minister for Transport for an update on works on N24/N25, and on State investment in the project. [63290/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_115",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_73",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_73",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of these projects.  Noting the above position, I have referred your question to TII for a direct reply regarding the N25 Waterford to Glenmore project and the projects on the N24. Please advise my private office if you do not receive a reply within 10 working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 157,
        "showAs": " 157. Deputy Peter 'Chap' Cleere asked the Minister for Transport for an update on the upgrade of the Kilkenny ring road; and if he will make a statement on the matter. [63291/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Peter 'Chap' Cleere",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_157",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_116",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_116",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any new road projects that seek State funding are assessed by the Department on a case-by-case basis. All projects proposed by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  In line with Government requirements Kilkenny County Council produced a Strategic Assessment Report (SAR) for the Kilkenny Northern Ring Road Extension and a draft was forwarded to the Department in January 2023. The Department reviewed the SAR and returned its comments and observations to Kilkenny County Council for consideration.  Since then, both the Public Spending Code and the Department’s Transport Appraisal Framework (TAF) guidance have been updated - the Department continues to liaise with the Council regarding new requirements under the new infrastructure Guidelines and the TAF including the preparation of a Project Outline Document (POD) and business case incorporating the work already undertaken at the SAR stage.  In 2024, the Department provided funding for an updated POD, which has been submitted to the Department by Kilkenny County Council, and while this process was underway funding was also allocated for Traffic/Junction Analysis in the Butts Green area of the City to further assess and understand traffic patterns in the city.  Following a review of the POD by the Department, €200,000 has been allocated to the Kilkenny Northern Transport Project (formerly Kilkenny Northern Ring Road Extension Project) in 2025 to allow Kilkenny County Council to progress the project to the Options Stage. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Balanced regional development remains a Government priority. My Department and its agencies contribute to this agenda in several ways, including through nine Regional Enterprise Plans (REPs). These are bottom-up plans developed and led by regional stakeholders, which focus on collaborative initiatives to strengthen the enterprise ecosystem in each region.  My Department oversees implementation of the REPs at the national level. The most recent meeting of the REP National Oversight Group took place in June 2025 where implementation across all REPs was discussed. The next meeting of the REP National Oversight Group will take place on 26 November.  Each of the nine REPs is led by a Steering Committee which includes representatives from the enterprise agencies, local authorities, Regional Assemblies, higher education institutes and industry, who work collaboratively to drive implementation of the REP. Each REP includes a actions under a number of strategic objectives relevant to each region.  As mentioned in responses to previous parliamentary questions, in consultation with stakeholders, the current plans were extended for one year to the end of 2025 to allow for further implementation of current objectives and actions, as well as consideration of the future of the REPs.  The Programme for Government commits to publishing and resourcing new Regional Enterprise Plans and ensuring detailed consultation with all relevant stakeholders. My Department is working to deliver on this commitment.  In Q1 2025, my Department appointed Indecon to conduct an independent review of the Regional Enterprise Plan initiative and the final report has been delivered. The report findings are being examined by my Department, and consideration is being given to the next steps, to learn from the current plans and improve our future approach. Once we have decided on how best to take things forward, we will be communicating to all relevant stakeholders.  Work is also underway on a new regional enterprise policy statement which will map out the regional enterprise policy landscape and facilitate better alignment of the REPs with the activities of other regional stakeholders.  Following publication of the policy statement in 2026, I expect the formal consultation process for the development of the next set of Regional Enterprise Plans to get underway, with the aim of publishing new plans in 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_36",
        "debateSection": {
          "debateSectionId": "dbsect_67",
          "showAs": "Enterprise Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_67",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_67.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 36,
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 36. Deputy Peter 'Chap' Cleere asked the Minister for Enterprise, Tourism and Employment if there will be a new Southeast Regional Enterprise Plan; and if he will make a statement on the matter. [62042/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  Regional Development is a key focus of our Programme for Government and is central to the work of my Department and our enterprise development agencies. In this regard, regional development is one of four key strategic objectives of the IDA 2025–2029 strategy, \"Adapt Intelligently\" with a commitment to secure 550 foreign direct investment (FDI) projects outside Dublin - 55% of all planned investments. Additionally, the overarching goal is to create 75,000 new jobs nationwide and generate a projected €250 billion in economic impact with the IDA having set ambitious targets for every region in Ireland.  The South-East has a significant ecosystem of well-established companies across Technology, Life Sciences, International Financial Services, Engineering & Industrial Technologies, which are complemented by research centres that help win new business and assist existing client companies with transformation. The FDI performance in the region has been strong over the past five years with employment among IDA clients increasing by 15%. To support the South-East region, IDA Ireland operates an office in the city of Waterford, working closely with local stakeholders, including City and County Councils, to attract new investment across the region which includes Carlow, Kilkenny, Wexford and Waterford.  As the Deputy is aware, a robust property and infrastructure ecosystem can be the key differentiator in winning FDI projects. The availability of suitable property and strategic sites is a critical component of the regional value proposition and to the winning of investments into the regions from both new name clients and from the existing client base.  IDA, through its Regional Property Programme aims to address regional market failure through investment in land, buildings and essential infrastructure in regional locations as required by current and prospective clients of IDA as well as those of Enterprise Ireland and the Local Enterprise Offices.  IDA Ireland also continues to maintain a focus on land-banks and strategic sites to future proof the ability of the property portfolio to support the project pipeline, and on that basis actively engages with local authorities including Kilkenny and Carlow County Councils, consultants, agents, utility providers and with the private sector in the South-East region in the marketing of appropriate and cost-effective property solutions.  In Kilkenny, IDA Ireland has a Business & Technology Park in Loughboy, an Industrial Estate in Purcellsinch and a Strategic Site in Belview. In Carlow the IDA has lands in Carlow and Bagnelstown. As the Deputy will know, IDA has made a significant investment in Carlow during their last strategy, 2021-2024, with the completion of an ABS - or Advanced Business Solution - in the business park, which is actively being marketed.  There continues to be good interest in companies visiting both Carlow and Kilkenny. There has been a consistent increase in visits since 2022. Details of site visits to Carlow and Kilkenny up to the first half of 2025 are shown in the table below:     -    To end Q2 2025    2024    2023    2022    2021      Carlow    2    6    5    3    4      Kilkenny    3    8    10    3    6     I should point out that site visits are one measure only of a company’s interest in a particular location and may not necessarily be a true measure of the overall level of foreign direct investment (FDI) activity in a region or county. For example, almost 70% of FDI won by IDA Ireland comes from its existing client base, rather than new companies and potential clients usually visit more than one county and may return to a location more than once.  With a clear focus on regional development, a strong pipeline of investment, and collaborative local partnerships, IDA Ireland is positioning Kilkenny and Carlow and the wider the South-East Region as a competitive and attractive destination for global investors, however, ultimately, individual companies determine where to locate their investments rather than the IDA. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_59",
        "debateSection": {
          "debateSectionId": "dbsect_91",
          "showAs": "Enterprise Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_91",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_91.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 59,
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 59. Deputy Peter 'Chap' Cleere asked the Minister for Enterprise, Tourism and Employment for an update on IDA activity in Kilkenny and Carlow; and if he will make a statement on the matter. [62043/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht (Deputy Dara Calleary)  In Budget 2026, it was announced that Working Family Payment will become a qualifying payment for Fuel Allowance from March 2026. As of the end of October 2025, there are 665 people in Carlow and 871 in Kilkenny who are receiving Working Family Payment and are not living in a household where a Fuel Allowance is in payment. These recipients will potentially become eligible to receive Fuel Allowance in 2026, provided they fulfill the conditions for the payment.  It was also announced that from September 2026, people who move from Disability Allowance or Blind Person's Pension to take up work will be able to keep their Fuel Allowance for 5 years. As of the end of October 2025, there were 1,309 persons in Carlow and 1,616 persons in Kilkenny receiving Fuel Allowance on either Disability Allowance or Blind Person's Pension who could potentially benefit from this. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_125",
        "debateSection": {
          "debateSectionId": "dbsect_147",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_147",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_147.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 125,
        "by": {
          "memberCode": "Peter-'Chap'-Cleere.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-'Chap'-Cleere.D.2024-11-29",
          "showAs": "Peter 'Chap' Cleere"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 125. Deputy Peter 'Chap' Cleere asked the Minister for Social Protection the number of persons in Counties Carlow and Kilkenny that will benefit from the changes in criteria for the fuel allowance announced in Budget 2026; and if he will make a statement on the matter. [62025/25] "
      }
    }
  ]
}