[
  {
    "Id":23132,
    "Url":"lobbying.ie\/return\/23132\/cootehill-chamber-of-commerce",
    "Lobbyist Name":"Cootehill Chamber of Commerce",
    "Date Published":"28\/03\/2018 14:57",
    "Period":"1 Sep, 2017 to 31 Dec, 2017",
    "Relevant Matter":"Matters involving public funds",
    "Public Policy Area":"Community",
    "Specific Details":"Photos of damage to show repairs needed  to support Provision of Funds to repair local Playground, Cootehill Co. Cavan",
    "DPOs Lobbied":"Paddy McDonald|Councillor|Cavan County Council::Clifford Kelly|Councillor|Cavan County Council::Sarah O'Reilly|Councillor|Cavan County Council",
    "Subject Matter":"Photos of damage to show repairs needed  to support Provision of Funds to repair local Playground, Cootehill Co. Cavan",
    "Intended Results":"Repairs required to be carried out on Playground at Cootehill by Cavan Co. Co.",
    "Lobbying Activities":"|Email|2-5",
    "Person primarily responsible for lobbying on this activity":"Richard Conlon, Secretary, Cootehill Chamber of Commerce",
    "Any DPOs or Former DPOs who carried out lobbying activities":"No",
    "Current or Former DPOs":null,
    "Was this a grassroots campaign?":false,
    "Grassroots directive":null,
    "Was this lobbying done on behalf of a client?":"FALSE",
    "Client(s)":null,
    "MemberCode":"Sarah-O'Reilly.S.2025-01-29"
  },
  {
    "Id":35668,
    "Url":"lobbying.ie\/return\/35668\/cavan-chamber-of-commerce",
    "Lobbyist Name":"Cavan Chamber of Commerce",
    "Date Published":"18\/01\/2019 10:23",
    "Period":"1 Sep, 2018 to 31 Dec, 2018",
    "Relevant Matter":"Matters involving public funds",
    "Public Policy Area":"Local Government",
    "Specific Details":"Wrote to all the local councilors requesting that rates for 2019 be frozen at 2018 levels until the uncertainties of Brexit and the rates revaluation on the Cavan and national economy are understood and implemented.",
    "DPOs Lobbied":"Madeleine Argue|Councillor|Cavan County Council::Damien Brady|Councillor|Cavan County Council::John Paul Feeley|Councillor|Cavan County Council::Peter McVitty|Councillor|Cavan County Council::Sean Smith|Councillor|Cavan County Council::Paddy Smith|Councillor|Cavan County Council::Noel Connell|Councillor|Cavan County Council::Paddy O'Reilly|Councillor|Cavan County Council::Philip Brady|Councillor|Cavan County Council::Shane P O'Reilly|Councillor|Cavan County Council::Winston J. Bennett|Councillor|Cavan County Council::Carmel Brady|Councillor|Cavan County Council::Clifford Kelly|Councillor|Cavan County Council::Fergal Curtin|Councillor|Cavan County Council::Paddy McDonald|Councillor|Cavan County Council::Sarah O’Reilly|Councillor|Cavan County Council::Val Smith|Councillor|Cavan County Council::Daniel Downey|Councillor|Cavan County Council",
    "Subject Matter":"Wrote to all the local councilors requesting that rates for 2019 be frozen at 2018 levels until the uncertainties of Brexit and the rates revaluation on the Cavan and national economy are understood and implemented.",
    "Intended Results":"Rates for 2019 for Cavan town be frozen at 2018 levels",
    "Lobbying Activities":"A letter was written to all the local councilors requesting that rates for 2019 be frozen at 2018 levels until the uncertainties of Brexit and the rates revaluation on the Cavan and national economy are understood and implemented.|Letter|1",
    "Person primarily responsible for lobbying on this activity":"Richard Daly Secretary Cavan Chamber",
    "Any DPOs or Former DPOs who carried out lobbying activities":"No",
    "Current or Former DPOs":null,
    "Was this a grassroots campaign?":false,
    "Grassroots directive":null,
    "Was this lobbying done on behalf of a client?":"FALSE",
    "Client(s)":null,
    "MemberCode":"Sarah-O'Reilly.S.2025-01-29"
  },
  {
    "Id":63017,
    "Url":"lobbying.ie\/return\/63017\/retailers-against-smuggling",
    "Lobbyist Name":"Retailers Against Smuggling",
    "Date Published":"21\/09\/2020 17:14",
    "Period":"1 May, 2020 to 31 Aug, 2020",
    "Relevant Matter":"Public policy or programme",
    "Public Policy Area":"Finance",
    "Specific Details":"Correspondence with Cavan County Council Joint Policing Committee members in follow-up to a meeting with Retailers Against Smuggling",
    "DPOs Lobbied":"Sarah O’Reilly|Councillor|Cavan County Council::Shane P O'Reilly|Councillor|Cavan County Council::Clifford Kelly|Councillor|Cavan County Council::Fergal Curtin|Councillor|Cavan County Council::John Paul Feeley|Councillor|Cavan County Council::Winston J. Bennett|Councillor|Cavan County Council::Carmel Brady|Councillor|Cavan County Council::Peter McVitty|Councillor|Cavan County Council::Paddy Smith|Councillor|Cavan County Council::Madeleine Argue|Councillor|Cavan County Council::Damien Brady|Councillor|Cavan County Council::Noel Connell|Councillor|Cavan County Council::Paddy McDonald|Councillor|Cavan County Council",
    "Subject Matter":"Correspondence with Cavan County Council Joint Policing Committee members in follow-up to a meeting with Retailers Against Smuggling",
    "Intended Results":"Provide follow-up information to JPC on the impacts of smuggling and illicit trade on both retailers and their communities.",
    "Lobbying Activities":"|Email|11-20",
    "Person primarily responsible for lobbying on this activity":"Benny Gilsenan",
    "Any DPOs or Former DPOs who carried out lobbying activities":"No",
    "Current or Former DPOs":null,
    "Was this a grassroots campaign?":false,
    "Grassroots directive":null,
    "Was this lobbying done on behalf of a client?":"FALSE",
    "Client(s)":null,
    "MemberCode":"Sarah-O'Reilly.S.2025-01-29"
  },
  {
    "Id":63073,
    "Url":"lobbying.ie\/return\/63073\/the-presbyterian-church-in-ireland",
    "Lobbyist Name":"The Presbyterian Church in Ireland",
    "Date Published":"21\/09\/2020 08:54",
    "Period":"1 May, 2020 to 31 Aug, 2020",
    "Relevant Matter":"Matters involving public funds",
    "Public Policy Area":"Community",
    "Specific Details":"CLÁR (Ceantair Laga Árd-Riachtanais) funding application",
    "DPOs Lobbied":"Clifford Kelly|Councillor|Cavan County Council::Aiden Fitzpatrick|Councillor|Cavan County Council::Carmel Brady|Councillor|Cavan County Council::Paddy McDonald|Councillor|Cavan County Council::Sarah O’Reilly|Councillor|Cavan County Council::Val Smith|Councillor|Cavan County Council",
    "Subject Matter":"CLÁR (Ceantair Laga Árd-Riachtanais) funding application",
    "Intended Results":"To highlight the need in the local area and seek advice regarding the application. The application was unsuccessful and a councillor suggested another fund which may be more appropriate to our needs. However the congregational committee has decided not to proceed.",
    "Lobbying Activities":"6 initial emails to local councillors|Email|6-10::Phone calls or text messages  - replies from 3 councillors|Phone call|2-5::2 councillors met Rev Daryl Edwards on site to view the project\n\n1 councillor visited independently|Meeting|2-5",
    "Person primarily responsible for lobbying on this activity":"Rev Daryl Edwards on the direction of the Congregational Committee of Kilmount Presbyterian Church",
    "Any DPOs or Former DPOs who carried out lobbying activities":"No",
    "Current or Former DPOs":null,
    "Was this a grassroots campaign?":false,
    "Grassroots directive":null,
    "Was this lobbying done on behalf of a client?":"FALSE",
    "Client(s)":null,
    "MemberCode":"Sarah-O'Reilly.S.2025-01-29"
  },
  {
    "Id":109239,
    "Url":"lobbying.ie\/return\/109239\/the-irish-farmers-association---ifa",
    "Lobbyist Name":"The Irish Farmers' Association - IFA",
    "Date Published":"18\/05\/2024 22:00",
    "Period":"1 Jan, 2024 to 30 Apr, 2024",
    "Relevant Matter":"Public policy or programme",
    "Public Policy Area":"Agriculture",
    "Specific Details":"Cavan County Council - Enough is Enough Campaign",
    "DPOs Lobbied":"Aiden Fitzpatrick|Councillor|Cavan County Council::Áine Smith|Councillor|Cavan County Council::Brendan Fay|Councillor|Cavan County Council::Carmel Brady|Councillor|Cavan County Council::Clifford Kelly|Councillor|Cavan County Council::Craig Lovett|Councillor|Cavan County Council::John Paul Feeley|Councillor|Cavan County Council::Madeleine Argue|Councillor|Cavan County Council::Paddy McDonald|Councillor|Cavan County Council::Patricia Walsh|Councillor|Cavan County Council::Peter McVitty|Councillor|Cavan County Council::Philip Brady|Councillor|Cavan County Council::Sarah O'Reilly|Councillor|Cavan County Council::Sean Smith|Councillor|Cavan County Council::Shane P O'Reilly|Councillor|Cavan County Council::TP O'Reilly|Councillor|Cavan County Council::Trevor Smith|Councillor|Cavan County Council::Val Smith|Councillor|Cavan County Council::Winston J. Bennett|Councillor|Cavan County Council",
    "Subject Matter":"Cavan County Council - Enough is Enough Campaign",
    "Intended Results":"To voice farmers' anger and frustration at the ever-increasing administrative burden being placed on them which has had a major impact on farm family incomes.::These frustrations have broadened into anger with European and National lawmakers over the massive increase in regulations relating to Agriculture. The EU, the Irish Government and local Government are devising policies far from the farm gate with little or no consideration of the direct impact on farmers.::The following are some of the key issues that are contributing to growing frustration and anger with the political system::1. The transformation of the Common Agricultural Policy (CAP) away from supporting food production towards actually reducing farm output. The Common Agricultural Policy (CAP) funding is being redirected to environmental schemes – the EU is effectively implementing new environmental regulations such as the “eco-schemes” on the cheap by redirecting existing funding instead of allocating additional funds.::2. The failure of the EU to properly compensate farmers under the Common Agricultural Policy (CAP). In 2014, Ireland received €1.16bn in Pillar one funding from EU – that figure is effectively the same today, 10 years on, despite huge inflation in farmers' cost of production in the interim. Farmers are being asked to do much more to receive a lot less funds in real terms.::3. The proposed Mercusor trade deal being pushed by the European Commission has the capacity to devastate, in particular, the Irish beef sector. Europe is placing a massive amount of additional regulations on European farmers but, at the same time, is seeking to increase food imports from South America produced under much lower environmental rules with a higher carbon footprint.::4. Overly complicated schemes which have been poorly implemented by the Irish Department of Agriculture. This has contributed to widespread delays in payments, most notably the Agri-Climate Rural Environment Scheme (ACRES) scheme. Following a meeting between the Minister and IFA President Francie Gorman last week on foot of the Feb 1st protests, the Minister agreed to make an interim payment to all farmers.::However, this will only partly resolve the payments mess created by his own department. In addition, there are farmers still waiting to get into the scheme.::5. There has also been a complete systems failure on farm investment grant aid Targeted Agricultural Modernisation Scheme (TAMS) scheme. No approvals of note were granted under the scheme in 2023.::6. Farm schemes are now so complicated that agri consultants are threatening strike action as the feel they can no longer administrate these schemes designed by the Department of Agriculture effectively.::7. Reductions to the Nitrates derogation from 250kg organic N to 220kg organic N imposed by the European Commission with absolutely no flexibility offered. Furthermore, the Commission continue to threaten to remove it altogether in 2026.::8. The Nature Restoration Law which places further restrictions on farmers, particularly on designated lands with no compensation.::9. The Industrial Emissions Directive and the Commission's farcical handling of it. Their initial proposals would have seen c. 50% of Irish dairy farmers requiring an Environmental Protection Agency (EPA) license just to farm.::The current revised proposal excludes bovines but will still see a huge amount of additional pig and poultry farmers now requiring an Environmental Protection Agency (EPA license). The Commission's approach to classify farms under an “industrial” directive encapsulates their current lack of regard for farming.::10. The lack of flexibility being shown to tillage farmers within new regulations. No flexibility currently being offered to farmers who are struggling to meet the stipulated “3-crop rule” due to very difficult autumn weather conditions which massively limited autumn plantings.::11. Agricultural emissions which are not being measured fairly. There must be an accurate measurement of greenhouse gas emissions and carbon removals at farm level. It is imperative that any measurement of emissions and removals is based on research that reflects Irish conditions.::On-farm sequestration and biogenic methane from livestock, along with emissions and removals from Ireland's unique mineral and peat soils, must be based on peer reviewed trials in Ireland. On-farm measures such as anaerobic digestion and rooftop solar should count towards reducing emissions from the agricultural sector.::12. The shambolic management of Ireland's forestry policy which has led to farmers losing complete confidence in the forestry sector compounded by the refusal of the Department of Agriculture, Food, and the Marine (DAFM) to provide appropriate recompense for farmers impacted by Ash Dieback. The total amount of land planted for forestry in 2023 was 1,650ha, corresponding to the lowest annual planting rate since 1946.::To ask Cavan County Council to do their utmost to highlight the issues raised and seek a fundamental reset of how farm policy is devised and implemented both at the EU and in Ireland.::To ask that Cavan County Council approve the following resolution::Cavan County Council resolves to write to the President of the EU Commission, the Taoiseach and the Minister for Agriculture advising them that the Council has passed the following resolution. Cavan County Council supports the IFA ‘enough is enough' campaign.::The Council recognises the significant contribution that farming, and the Agri-sector makes to the Irish and local economy. The Council acknowledges the income challenge on Irish farmers arising from the significant increases in the cost of doing business, regulatory costs and cuts in Basic Income support for farmers.::The Council calls on the Government to introduce no further regulations on farmers or any measures that may increase costs on farms without full negotiation and agreement with the Irish Farmers Association (IFA). The Council calls on the European Union and the Irish Government to provide additional stand-alone funding, separate to the Common Agricultural Policy (CAP), to support farmers to undertake climate and biodiversity measures.",
    "Lobbying Activities":"|Event \/ Reception|1::|Social Media|2-5::|Email|2-5::|Informal communication|6-10",
    "Person primarily responsible for lobbying on this activity":"Maurice Brady IFA Cavan County Chair",
    "Any DPOs or Former DPOs who carried out lobbying activities":"No",
    "Current or Former DPOs":null,
    "Was this a grassroots campaign?":false,
    "Grassroots directive":"To protest outside local County Council offices and lobby local Councillors on why farmers are saying Enough is Enough\".\"",
    "Was this lobbying done on behalf of a client?":"FALSE",
    "Client(s)":null,
    "MemberCode":"Sarah-O'Reilly.S.2025-01-29"
  }
]